[{"blogurl": "http://thestatsblog.wordpress.com", "blogroll": ["http://thestatsblog.wordpress.com"], "title": ""}, {"content": ["Big data might be finding all sorts of patterns, but for basketball fans, it’s a matter of what makes the ball go in the hoop . Systems developed to track missiles are now being used to track basketballs (and their players). SportUV Systems has cameras hanging from NBA arenas, and they are recording everyone’s every move. Basketball teams are starting to sign on to using the data collected to improve their games. \n While it is standard to keep track of a basketball player’s shooting average, everyone knows that circumstance plays a huge role. Big data can bring in conditional probability. What is the shooting average of Kevin Durant when his has a defender 3 feet away? SportVU can tell you. And it can also tell you the likelihood he makes a shot given many other circumstantial pieces of information, like who passed him the ball and how many minutes he’s been playing. \n The results are limited by a number of factors. The biggest is lack of data; without data on past performance, no future performance can be predicted. This why SportVU wants to increase its base – currently only 10 of the 30 MBA teams are inputting data. The second relates to something more philosophical: determinism versus random error.  While certainly these players have incredible skills, when matched up to each other, their statistical differences recorded as past behavior may only be part of the story. Small amounts of randomness could influence the game more than we know – and it simply cannot be predicted with all the data in the world."], "link": "http://thestatsblog.wordpress.com/2012/06/22/statistical-basketball-by-stats-director-of-research-rebecca-goldin-ph-d/", "bloglinks": {}, "links": {"http://www.fastcodesign.com/": 1, "http://feeds.wordpress.com/": 7}, "blogtitle": ""}, {"content": ["Sleep and eating aren’t just connected in the brain. \n The L.A. Times headlined something most of us have experienced personally: Sleep well, or face the possibility of eating poorly. But the “news” in the news story was that someone used an fMRI to measure brain patterns of people while deciding what they would like to eat. As the L.A. Times put it, “The study is looking at the neural systems of the brain to see how they affect the decisions made.“ \n The problem is that the neural systems may not “affect” the decisions made, but rather “reflect” the decisions made. Or, actually, the neural patterns may reflect how a tired versus a non-tired person thinks about food, regardless of which food they choose. From a detailed report on the abstract , one can see that the fMRI research suggested that, among tired people choosing foods, the frontal lobes (long associated with reasoning) reflected differences between people who had slept and those who hadn’t, but the regions traditionally associated with “reward reactivity” did not. \n What does it all mean? It could be, as the L.A. Times suggested, that the brain’s functioning is impaired, leading us to make bad decisions. It could also be that sleep deprivation leads to poorer functioning of this region of the brain, but there could be other physical explanations for the desires of people to eat less healthy food when tired other than our failure “to integrate all the different signals that help us normally make wise choices about what we should eat,” (as the lead author, Stephanie Greer, a graduate student at UC Berkeley, put it). These could be changes in our energy needs, which result in specific regions of the brain reacting to those needs. \n None of this changes the well-known result that sleeping less leads to eating more, and eating less healthily. It does change how the study (which was on how the brain structure might reflect this fact) is reported in the press."], "link": "http://thestatsblog.wordpress.com/2012/06/13/sleep-food-and-your-brain-by-rebecca-goldin-ph-d-stats-director-of-research/", "bloglinks": {}, "links": {"http://www.aasmnet.org/": 1, "http://www.latimes.com/": 1, "http://www.webmd.com/": 1, "http://feeds.wordpress.com/": 7}, "blogtitle": ""}, {"content": ["Getting science right: A response to The Atlantic Monthly \n By Cindy Merrick, STATS Intern, Ph.D. Candidate \n Last week we took The Atlantic and other media outlets to task for their shabby reporting on an NIH study about a link between coffee and longevity. In a pugilistic response , The Atlantic ’s Rebecca Greenfield fired back at the criticism, describing the science news cycle by saying “for every study that comes out, a host of media outlets will report to one extreme, and then some smart guy or girl will come along and prove everyone wrong.” She has examples of this apparent truism, including another story The Atlantic screwed up, and generously gives links to other news agencies that also missed the mark on this and other stories. \n Apart from the implication that science writing, apparently, doesn’t require a “smart guy or girl” to produce correctly the first time, Greenfield tells us that if they get it wrong, don’t worry! “We inevitably find someone…who digs into the research.” Then they’ll report on that too. Parsing her words, one must conclude that as long as a story is reported on, it doesn’t need to be right. The editing and revision processes are to take place after the story comes out. \n Greenfield adds gravity to her argument by reminding us that “science is complicated.” To her this means that reporters have to rely on other web sites ( Science Daily and EurekAlert ) to “understand what a 60 page write-up means for non-science people,” and for press releases to “put the findings into nice digestible little sound-bites.” For every other kind of news, this would be the journalist’s job. And, not to nit-pick, but the NIH’s study about coffee and longevity was 14 pages, not 60. (Actually, six of the pages were data tables, and two pages listed references. Would it have killed someone to check?) \n Greenfield’s appalling denial of responsibility undermines the very essence of journalism:  to get the facts and report them accurately. The first time."], "link": "http://thestatsblog.wordpress.com/2012/05/29/getting-science-right-a-response-to-the-atlantic-monthly/", "bloglinks": {}, "links": {"http://www.nejm.org/": 1, "http://www.theatlanticwire.com/": 1, "http://feeds.wordpress.com/": 7, "http://www.sciencedaily.com/": 1, "http://www.eurekalert.org/": 1}, "blogtitle": ""}, {"content": ["In an interview with Handelsblatt , the German business journal, Harvard professor of economics Amartya Sen says that there has been a “democratic failure” in the EU. \n “An economic policy has to be ultimately something that people understand, appreciate and support. That’s what democracy is all about. The old idea of “no taxation without representation” is not there in Europe at the moment.” \n He goes on to say that the views of the electorate in southern European countries such as Greece, Portugal, and Spain have counted for less than those of \n “the bankers, the rating agencies and the financial institutions.  One result of European monetary integration, without a political integration, is that the population of many of these countries has no voice. Economics is de-linked from the political base. That I think is a mistake and it goes completely against the big European movement that began in the 40s and fostered the idea of a democratic, united Europe.” \n Certainly Sen is right to note that that there is a “democratic failure” in the EU.  This problem, more commonly referred to as a “democratic deficit,” is an enduring one in European politics. \n In 2005, within three days of each other, the electorates of both France and the Netherlands soundly rejected the Maastricht Treaty, which had been signed in 1992 with the hope that it would “transfer sovereignty to Brussels,” in the words of one Dutch supporter of the EU .  What made these particular rejections sting was that France and the Netherlands were two of the original six members of the European Economic Community, the forerunner to the E.U. \n However, the double rejection of Maastricht had no effect upon the functioning of the E.U., since the operative attitude of leaders in Brussels is to recognize the outcomes of democratic votes only when they are the “correct” ones.  Indeed, most of the decisions to ratify various E.U. agreements have been made, not by voters in individual countries, but by parliaments, with little or no consultation of the people whose lives would be affected by the loss of sovereignty E.U. membership implies. \n Indeed, in 2008, the voters of Ireland, perhaps inspired by those of France and the Netherlands, rejected another piece of E.U. legislation, the Lisbon Treaty.   After that defeat the government of Ireland obtained a number of political concessions from the E.U., including the right to have an Irish representative on the European Commission and agreements on taxation and social issues.  In return the government held another referendum the following year, and the Treaty passed.  However, the impression remains that the Irish and E.U. elites did not like the first result, so they allowed the electorate to try again, until they got it right. \n Amartya Sen is correct to state that there has been a “democratic failure” in the E.U. and that it is largely the result of the lack of the political integration that would allow greater economic harmony throughout the Eurozone.  One of the main causes of the current crisis in Europe is that economies as different as those of Germany and Greece are lashed together, preventing a country with severe economic problems such as Greece to devalue its currency, restructure its debt, and begin the long struggle to restore its economy. \n Only a true political union on the Continent would have allowed a harmonization of monetary, tax, interest-rate, and labor policies to prevent the simmering crises in Greece, Portugal, and Spain.  But European leaders knew that they would have had to make such a union transparent to voters, who see themselves as Germans, Greeks, and Spaniards, not as “Europeans,” and they knew that they could never win such votes throughout the E.U.  Thus, they attempted to impose a de facto political integration by stealth, but the failure of that path has been obvious for many months."], "link": "http://thestatsblog.wordpress.com/2012/04/30/amartya-sen-and-the-e-u-democratic-failure-by-david-macneil-one-of-the-contributors-to-the-soon-to-be-launched-econostats-a-joint-project-between-stats-and-gmu/", "bloglinks": {}, "links": {"http://economicsintelligence.com/": 1, "http://www.rte.ie/": 1, "http://feeds.wordpress.com/": 7, "http://www.rnw.nl/": 1}, "blogtitle": ""}, {"content": ["Data released earlier this year by the World Bank indicate that for the first time the number of people living in extreme poverty declined in every region of the developing world.  Every three years the Bank examines economic progress in 130 developing countries as measured by spending power, and the most recent figures are for the period 2005-2008.  Never before has extreme poverty been reduced in all of the regions of the developing world simultaneously.  In 2008 22% of the world’s population, or 1.29 billion people, lived below the poverty line, a significant decline from the 52% in 1981 or the 43% in 1990 that did so.  As the leader of the team that compiled the data notes, \n     “[t]he developing world has made remarkable progress in fighting extreme      poverty, and it has proved resilient to recent economic shocks and rising food and oil prices,” \n To more accurately compare the cost of living across cultures, the World Bank used purchasing-power parity (PPP) as its yardstick, which measures the cost of a basket of goods from country to country.  Other methods of comparison can distort the actual cost of goods to consumers.  For example, comparisons based on exchange rates do not account for local differences in price that are affected by factors such as domestic political decisions. \n Perhaps the best known example of PPP is the “Big Mac Index,” published every year by The Economist , which determines the prices of a McDonald’s Big Mac in a variety of countries throughout the world and then compares them to the average American price.  In its 2012 rankings , the magazine determined that Switzerland has the most overvalued burger (it costs $6.81, as compared with the American price of $4.20), while India – which for cultural reasons does not use beef in its burgers, but prefers chicken in its Maharaja Mac – is the most undervalued, costing a mere $1.62.  As The Economist notes, PPP holds that over time the exchange rate of currencies ought to adjust to equal the cost of goods in different countries. \n A few important caveats need to be kept in mind.  First, the figures in the World Bank report only go up to 2008.  As it points out, data after 2008 from poorer countries is either hard to find or not comparable with previous estimates, but some preliminary data from 2010 do suggest that 2010 rates of extreme poverty are less than half those of 1990, which would mean that the Millennium Development Goal set by the United Nations in 2000 of cutting in half the worldwide poverty rate by 2015 has already been achieved.  This result is even more remarkable given that the worldwide financial crisis reached its full force that year. \n It is also important to note that the extreme poverty rate as measured by the Bank is defined as $1.25 a day per person, hardly a large sum of money by developed countries’ standards. \n Finally, a substantial portion of the improvement in East Asia since 1981 is due to economic changes in China and roughly coincides with the introduction of market-based reforms. \n Nevertheless, as Steve Chapman points out at Reason , the progress that has been made has been due to the dismantling of command economies in favor of free-market solutions. \n “Over the past two decades, poorer nations have dismantled command-and-control methods and given markets greater latitude. Economic growth, not redistribution, has been the surest cure for poverty, and economic freedom has been the key that unlocked the riddle of economic growth.”"], "link": "http://thestatsblog.wordpress.com/2012/04/30/world-bank-reports-decline-of-poverty-in-developing-nations-by-david-macneil-one-of-the-contributors-to-the-soon-to-be-launched-econostats-a-joint-project-between-stats-and-gmu/", "bloglinks": {}, "links": {"http://www.undp.org/": 1, "http://feeds.wordpress.com/": 7, "http://www.economist.com/": 1, "http://econ.worldbank.org/": 1, "http://reason.com/": 1}, "blogtitle": ""}, {"content": ["In unveiling its employment data for March , the Bureau of Labor Statistics noted that 120,000 nonfarm jobs were added to the economy that month, with losses in retail jobs and construction offset by gains in manufacturing and food service and drinking places.  As delighted as we are that more people are employed in bars across America, there are reasons to be less than enthusiastic about these numbers.  Gains of 200,000 for the month had been anticipated, based on the numbers for the past half-year. \n In a sober assessment of the report , Gary Burtless of the Brookings Institution suggested that these numbers are the bellwether of a slowing jobs picture in the coming months. \n            “In sum, the March 2012 employment report shows little progress toward reaching full employment. The unemployment rate fell because fewer jobless workers were actively seeking a job, not because more Americans found one. The employer survey showed payroll gains of 120,000, but this is only slightly faster than the rate of job gain needed to keep up with the growth in the working-age population. After six months of robust job gains, a mediocre report in March may signal the start of slower improvements in the next few months.” \n Likewise, Rea Hederman, Jr., of The Heritage Foundation, noting that there was a slight decrease in the unemployment rate from 8.3 to 8.2 percent, said that even this “reflected ill fortune, because it was due entirely to a marked shift of workers leaving the labor force instead of finding new jobs.” \n The implications of these disappointing results are clear for the Obama administration.  In January of 2009 the administration’s economic team predicted that unemployment would peak at 8% in the third quarter of 2009 and decrease thereafter under the influence of the President’s stimulus package.  In fact, as Republicans regularly remind the public, unemployment has not fallen below 8% for the entire time the President has been in office. \n The general election is only seven months away, and, now that Mitt Romney is the presumptive Republican nominee, he will be able to use the persistently high unemployment rate for the past three years as a powerful argument for political change."], "link": "http://thestatsblog.wordpress.com/2012/04/30/jobs-jobs-jobs-by-david-macneil-one-of-the-contributors-to-the-soon-to-be-launched-econostats-a-joint-project-between-stats-and-gmu/", "bloglinks": {}, "links": {"http://www.bls.gov/": 1, "http://www.heritage.org/": 1, "http://feeds.wordpress.com/": 7, "http://www.brookings.edu/": 1}, "blogtitle": ""}, {"content": ["In a recently released report , the Brookings Institution examined the economic recovery of America’s 100 largest metropolitan areas during the last quarter of 2011, the latest for which figures are available.  The news is, as they say, a mixed bag.  Let’s start with the good news: \n \n By December, 2011, the unemployment rate was lower in 93 out of 100 major metropolitan areas than it had been a year earlier.   The unemployment rate was higher in six areas (Augusta, Chicago, Honolulu, Jackson, New York, and Raleigh) and was the same in one (Omaha). \n \n \n High-tech and auto-manufacturing centers have experienced particularly strong recoveries from the recession that began in 2007.   Among the 20 metropolitan areas recording the strongest growth are those with information technology (Austin, Boise, Ogden, Portland [OR], Provo, San Jose) or biotechnology (Worcester) industries, as well as those that specialize in the manufacture of automobiles, auto parts, and related materials (Detroit, Grand Rapids, Toledo, Youngstown). \n \n \n Seventy out of 100 of the largest metropolitan areas showed growth in both jobs and output.   Most of the remaining thirty, however, lost jobs but increased output. \n \n \n Of 100 metropolitan areas, 24 gained jobs in all four quarters of last year, including those in the Great Lakes region, in the Southwest, and in places with high-tech industries. \n \n \n But there’s bad news, too: \n \n By December, 2011, the unemployment rate remained over 6 percent in all but 11 of 100 metropolitan areas.   The 11 winners were:  Omaha, Madison, Provo, Honolulu, Salt Lake City, Minneapolis, Washington, Oklahoma City, Boston, Ogden, and Des Moines.  Thirteen areas had unemployment rates between 10 and 15 percent, while three cities in California — Fresno, Modesto, and Stockton – had rates over 15 percent. \n \n \n Seventy-six of 100 metropolitan regions lost more jobs in the 16 quarters after the recession of 2007 than in the 16 quarters after previous recessions.   In comparison, 16 quarters after the beginning of the 1981-82 recession, employment in the 100 largest metropolitan areas had grown by 8 percent. \n \n \n Only one out of four metropolitan areas gained back more than half the jobs they lost.   The report compared the number of jobs these areas had at their peak between 2004 and 2009 and compared it to the number they lost once the recession began.  Only 6 regained all of the jobs they lost, and 4 of those (Austin, El Paso, Houston, McAllen) were in Texas (the other two were Pittsburgh and Worcester). \n \n \n The recovery in manufacturing jobs slowed in Q4 of 2001.   Throughout major metropolitan areas, the growth of manufacturing jobs decreased from 0.7 percent in Q2 to 0.2 in Q3, finally dropping to 0.02 in Q4.  Ominously, while 72 out of 100 metropolitan areas had experienced manufacturing job growth during the first quarter of 2011, by the fourth quarter that number was only 46, a loss of over a third. \n \n An important subtext of the analysis is the role that government funds play in the recovery in various areas.  As the report indicates, places with high-tech and automobile industries tended to do better than others, but these are industries most likely to receive federal grant funding (for high-tech firms) or TARP payments (General Motors and Chrysler together received $79 billion from the TARP fund). \n Also, the report notes that economic recovery has generally been strongest where growth in government jobs, including military jobs, has been greatest, while the loss of government jobs has coincided with weak recoveries.  Even the most indispensable government jobs must be paid for through taxation, and the dollars that are spent on these cannot be invested in new private-sector jobs, cannot be used to start new businesses, and cannot be saved.  Is the dependence of the recovery upon tax dollars removed from the private economy a good long-term investment for the American taxpayer?"], "link": "http://thestatsblog.wordpress.com/2012/04/30/winners-and-losers-in-the-economic-recovery-by-david-macneil-one-of-the-contributors-to-the-soon-to-be-launched-econostats-a-joint-project-between-stats-and-gmu/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://www.grcity.us/": 1}, "blogtitle": ""}, {"content": ["The recent failure of Sen. Kent Conrad (D-N. Dak.), Chairman of the Senate Budget Committee, to persuade Majority Leader Harry Reid (D-Nev.) to allow a vote on the Committee’s most recent budget proposal reflects a growing problem nationwide.  As Politico notes , the “Democratic-led Senate hasn’t passed a budget blueprint since April 2009,” and Reid did not want to do so now in particular because of election-year pressures. \n Similarly, last year the majority-Democrat legislature of California submitted a last-minute budget that Governor Jerry Brown, also a Democrat, promptly vetoed.  In the words of the state’s Controller , because many items in the budget were “miscalculated, miscounted or unfinished,” it would be sent back for reworking, and legislators would forfeit their pay until it was balanced. \n Then, just last month, the Washington state legislature failed to pass a budget , when Republicans and breakaway Democrats refused to support a move to delay a $340 million payment to school districts by a day to push it into the next fiscal year, thereby protecting education funding without a general tax increase.  On the other hand, the Senate Republicans and their Democratic allies want to skip a $133 million payment to two underfunded pension plans, which Chris Gregoire, the Democratic governor, likened to refusing to pay a bill. \n Of all the problems with legislatures, from the U.S. Congress to state assemblies, that find it apparently impossible to pass budgets on time, perhaps the most insidious is the refusal of the guilty parties to take their oath of office seriously.  If there is an imbalance between what they would like to spend and the money available to spend, or between what has been promised and what can be delivered, then their constituents expect them to make the difficult decisions and take responsibility for their actions.  The day comes when it is not possible to kick the can down the road any longer. \n One group that seeks to remedy this situation is No Labels, a non-partisan group attempting to reform the way Congress does business.  It has advanced proposals such as requiring members of the House and Senate to remain in Washington for three weeks a month and forbidding them from taking any pledges other than their oath of office.  Recently the Senate Homeland Security and Governmental Affairs Committee took up the No Budget, No Pay Act, an initiative of the organization, which stipulates that if Congress does not fulfill its fundamental responsibility and pass a budget, its members should not get paid. \n As George Voinovich, the former Republican senator and governor of Ohio, and Evan Bayh, the former Democratic senator and governor of Indiana, both members of No Labels, have noted ,  “[i]t has been more than 1,000 days since Congress last passed a budget on time, and well over a decade since it did so with all appropriations bills.”  This is a refreshing, bipartisan response to an ongoing political disgrace."], "link": "http://thestatsblog.wordpress.com/2012/04/30/no-labels-no-budget-no-pay-by-david-macneil-one-of-the-contributors-to-the-soon-to-be-launched-econostats-a-joint-project-between-stats-and-gmu/", "bloglinks": {}, "links": {"http://www.politico.com/": 1, "http://www.thenewstribune.com/": 1, "http://feeds.wordpress.com/": 7, "http://www.cleveland.com/": 1, "http://www.reuters.com/": 1}, "blogtitle": ""}, {"content": ["In an intriguing working paper from University of Maryland’s Robert H. Smith School of Business, it was found that cell phone use may be associated with becoming less socially minded and less likely to engage in prosocial behavior. \n The study, which involved separate sets of college students in their early twenties, found that after a short period of cell phone use, the participants were less inclined to volunteer for a community service activity compared to the control group. The Atlantic reports that the cell phone users were also less motivated to solve word problems, even though they knew coming up with the answer would translate into a monetary donation to charity. \n To explain this phenomenon, study author and marketing professor Rosellina Ferraro says : “The cell phone directly evokes feelings of connectivity to others, thereby fulfilling the basic human need to belong.” Meaning once the need to connect with others is met; our desire to feel empathy or engage is behavior that would help others is reduced. \n These findings appear in the paper, The Effect of Mobile Phone Use on Prosocial Behavior."], "link": "http://thestatsblog.wordpress.com/2012/02/27/do-cell-phones-make-us-less-prosocial/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://blog.sfgate.com/": 1, "http://www.umd.edu/": 1, "http://www.theatlantic.com/": 1}, "blogtitle": ""}, {"content": ["A survey of almost 1,891 physicians across the country finds that for some doctors, honesty is not always the best policy. \n Approximately one third of participating physicians reported they did not completely agree that they should disclose medical errors to patients (20% of whom admitting they were afraid of being sued for malpractice).  TIME Healthland reports that 40 percent felt they did not need to disclose financial ties to drug or device companies. \n In the past year, 55 percent of doctors said they had been more positive about a patient’s prognosis than warranted. Ten percent reported telling patients something that was not true. \n Dr. Lisa Lezzioni, a professor of medicine at Harvard Medical School and the study’s lead author says : \n “The finding that 55 percent had described a prognosis in a more positive manner than was warranted is pretty significant…They may not want to worry patients, or there may be cultural reasons why it feels inappropriate.” \n According to The Huffington Post , the study notes that not enough training, insecurity over the accuracy of a prognosis, and lack of time may also play a role. \n This study is published in the journal Health Affairs ."], "link": "http://thestatsblog.wordpress.com/2012/02/10/doctors-diagnose-their-flaws/", "bloglinks": {}, "links": {"http://healthland.time.com/": 1, "http://www.healthaffairs.org/": 1, "http://feeds.wordpress.com/": 7, "http://content.healthaffairs.org/": 1, "http://www.huffingtonpost.com/": 2}, "blogtitle": ""}]