[{"blogurl": "http://www.2physics.com\n", "blogroll": [], "title": "2Physics"}, {"content": ["Left to right: Kobi E. Kraus, Oded Zilberberg, Yoav Lahini, Zohar Ringel and Mor Verbin\n\n\nAuthors: \nYaacov E. Kraus1, Yoav Lahini2,3, Zohar Ringel1, Mor Verbin2, Oded Zilberberg1\n\nAffiliation:\n1Dept. of Condensed Matter Physics, Weizmann Institute of Science, Israel \n2Dept. of Physics of Complex Systems, Weizmann Institute of Science, Israel \n3Department of physics, Massachusetts Institute"], "link": "http://www.2physics.com/feeds/8983499682779802653/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Ben Feldman (left) and Amir Yacoby (right)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAuthors: Ben Feldman and Amir Yacoby \n\nAffiliation: Department of Physics, Harvard University, USA\n\n\nGraphene, a two-dimensional sheet of carbon that is one atom thick, has attracted considerable interest due to its unique and potentially useful physical properties. Like other two-dimensional materials, application of a perpendicular"], "link": "http://www.2physics.com/feeds/1679270835442543653/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Dagomir Kaszlikowski\n\n\nAuthor: Dagomir Kaszlikowski \n\nAffiliation: Centre for Quantum Technologies, Department of Physics, National University of Singapore, Singapore\n\n\nRecently there has been a fundamental change in our understanding of how biological systems operate; new research revealed that quantum phenomena could play an essential part in biological processes. Understanding the"], "link": "http://www.2physics.com/feeds/5420899157757310968/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Serge Haroche (left) and David J. Wineland (right)\n\n\n\n\n\n\n\n\n\n\nThe 2012 Nobel Prize in Physics has been awarded to Serge Haroche (Collège de France and Ecole Normale Supérieure, Paris, France) and David J. Wineland (National Institute of Standards and Technology (NIST) and University of Colorado Boulder, CO, USA) \"for ground-breaking experimental methods that enable measuring and manipulation of"], "link": "http://www.2physics.com/feeds/4995667636241431165/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["From left to right:\nAndrei Andryieuski, Dmitry Chigrin, Andrei Lavrinenko\n\n\n\n\n\n\n\n\nAuthor: Andrei Andryieuski \nAffiliation: DTU Fotonik, Technical University of Denmark, Denmark\n\n\nAndrei Andryieuski and Andrei Lavrinenko, the researchers from the Metamaterials group at Technical University of Denmark (DTU) -- in collaboration with Dmitry Chigrin from the University of Wuppertal (BUW) -- made"], "link": "http://www.2physics.com/feeds/6176808555342757290/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Tomoyuki Morimae (left) and Keisuke Fujii (right) \n\n\n\n\n\n\n\n\n\n\nAuthors: Tomoyuki Morimae1 and Keisuke Fujii2 \n\nAffiliation:\n1Department of Physics, Imperial College, London, UK\n2Graduate School of Engineering Science, Osaka University, Japan\n\nA first generation quantum computer, which must be an integration of extremely high technologies, will be used in a ``cloud computing\" style since only"], "link": "http://www.2physics.com/feeds/4021815417773277515/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Jun Ye [photo courtesy: JILA/University of Colorado, USA]\n\n\nNo more than only 2 parts in 10,000 trillion -- that's the new world record set for the frequency variation by the most stable laser as reported in an advance on-line publication in Nature Photonics [1]. The laser is developed and tested by an international collaboration of scientists at NIST/JILA in Boulder, Colorado, USA and a group"], "link": "http://www.2physics.com/feeds/8314171671426589047/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Three of the authors of the paper in Physical Review Letters [3]: (from left to right) Marco Bellini, Constantina Polycarpou, and Alessandro Zavatta\n\nAuthor: Marco Bellini \n\nAffiliation: Istituto Nazionale di Ottica (INO) – CNR, Florence and \nEuropean Laboratory for Non-linear Spectroscopy (LENS), Florence, Italy\n\n\nLink to \"Highly Nonlinear and Quantum Optics Group\" at INO >> \n\nSimilar to"], "link": "http://www.2physics.com/feeds/439921842151971912/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Felix Ritort \n\n\nAuthor: Felix Ritort \n\nAffiliation: Small Biosystems Lab, Departament de Fisica Fonamental, Facultat de Fisica, Universitat de Barcelona, Spain.\n\n\nThe second law of thermodynamics pervades the natural world. Using a non-specialized jargon we may say that systems (and the universe as a whole) tend to become unstructured and disordered by the sole action of the naturally"], "link": "http://www.2physics.com/feeds/2391881843619280158/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Christof Weitenberg\n\nAuthor: Christof Weitenberg \nAffiliation: Laboratoire Kastler Brossel, Ecole Normale Supérieure, UPMC, CNRS, Paris, France. \n\nLink to the Research Group on 'Bose-Einstein Condensates' >>\n\nIn our daily life experience, flow is always accompanied by friction. But in quantum physics, some materials can form a superfluid, in which the friction vanishes completely. This flow"], "link": "http://www.2physics.com/feeds/3448812275435939121/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["The authors in their laboratory in Stockholm last week. From left to right: Johan Ahrens, Adán Cabello, Piotr Badziag, Mohamed Bourennane.\n\n\nAuthors: Johan Ahrens1, Piotr Badziag1, Adán Cabello1,2 and Mohamed Bourennane1\n\n\nAffiliation: \n1Physics Department, Stockholm University, Sweden\n2Departamento de Fı´sica Aplicada II, Universidad de Sevilla, Spain\n\nThe concept of “dimension” is ubiquitous"], "link": "http://www.2physics.com/feeds/5867533070769064528/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Group leaders: Antonio Acin (left) and Juan Pérez Torres (right)\n\n\nAuthors: Martin Hendrych1, Rodrigo Gallego1, Michal Mičuda1,2, Nicolas Brunner3, Antonio Acín1,4, Juan P. Torres1,5\n\n\nAffiliations:\n1ICFO-Institut de Ciencies Fotoniques, Barcelona, Spain\n2Department of Optics, Palacký University, Czech Republic\n3H.H. Wills Physics Laboratory, University of Bristol, UK\n4ICREA-Institució"], "link": "http://www.2physics.com/feeds/5907430076223319663/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Hosang Yoon (left) and Donhee Ham (right)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAuthors: Hosang Yoon and Donhee Ham \nAffiliation:\nSchool of Engineering and Applied Sciences, Harvard University, USA\n\nLink to Donhee Ham Research Group >> \n\nNegative index metamaterials have been celebrated due to their unusual ability to manipulate electromagnetic waves, such as bending light in the ‘wrong’ direction [1] and focusing"], "link": "http://www.2physics.com/feeds/679622566775836870/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Michael Crommie [Photo by Roy Kaltschmidt, Courtesy: Lawrence Berkeley National Laboratory]\n\n Perhaps no other material is generating as much excitement in the electronics world as graphene, sheets of pure carbon just one atom thick through which electrons can race at nearly the speed of light – 100 times faster than they move through silicon. Superthin, superstrong, superflexible and"], "link": "http://www.2physics.com/feeds/8559781543452346032/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Steve Rolston [Image courtesy: University of Maryland, USA] \n\nA new experiment conducted at the Joint Quantum Institute (JQI, operated jointly by the National Institute of Standards and Technology in Gaithersburg, MD and the University of Maryland in College Park, USA) examines the relationship between quantum coherence, an important aspect of certain materials kept at low temperature, and the"], "link": "http://www.2physics.com/feeds/2549345944780797127/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Group Leaders: (From Left to Right) Javier Garcia de Abajo, Rainer Hillenbrand, Frank Koppens\n\n\n\n\n \n\n\n\n\n\n\n\nAuthors: Jianing Chen1,2, Michela Badioli3, Pablo Alonso-González1, Susokin Thongrattanasiri4, Florian Huth1,5, Johann Osmond3, Marko Spasenović3, Alba Centeno6, Amaia Pesquera6, Philippe Godignon7, Amaia Zurutuza6, Nicolas Camara8, Javier García de Abajo4, Rainer Hillenbrand1,9, Frank"], "link": "http://www.2physics.com/feeds/5432649130533966236/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["(From Left to Right) Zhe Fei, Aleksandr S. Rodin, Michael M. Fogler, Dimitri N. Basov \n\n\nAuthors: \nZhe Fei1, Aleksandr S. Rodin2, Michael M. Fogler1, Dimitri N. Basov1,\n\nAffiliation:\n1Department of Physics, University of California, San Diego, USA \n2Physics Department of Boston University, Boston, USA \n\nPlasmonics is an emerging field, stemming from electronics and nanophotonics. At"], "link": "http://www.2physics.com/feeds/3060311843692802739/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Claus Kiefer (left) and Manuel Krämer (right) \n\n[Every year (since 1949) the Gravity Research Foundation honors best submitted essays in the field of Gravity. This year's prize goes to Claus Kiefer and Manuel Krämer for their essay \"Can Effects of Quantum Gravity Be Observed in the Cosmic Microwave Background?\". The five award-winning essays will be published in a special issue of the"], "link": "http://www.2physics.com/feeds/8843391298520432869/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Adilson E. Motter (Left) and Zachary G. Nicolaou (Right)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAuthors: Zachary G. Nicolaou1,2 and Adilson E. Motter1\nAffiliation:\n1Department of Physics and Astronomy, Northwestern University, USA\n2Department of Physics, California Institute of Technology, USA\n\n\nConventional materials deform along the direction of the applied force in such a way that they expand when the force is"], "link": "http://www.2physics.com/feeds/3351233940830644618/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Sébastien Guenneau (left) and Claude Amra (right) \n\n\n\n\n\n\n\n\n\n\n\n\n\nAuthors: Sebastien Guenneau and Claude Amra\n\nAffiliation: Institut Fresnel, Centre National Recherche Scientifique, Aix-Marseille University \nand Ecole Centrale Marseille, France\n\n In 2006, two papers -- published in the same issue of 'Science' -- revolutionized the world of classical optics with the concept of transformation"], "link": "http://www.2physics.com/feeds/4270025293100083184/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Author: Vera Smolyaninova \n\nAffiliation: Dept. of Physics Astronomy and Geosciences, Towson University, MD, USA\n\n\nEver since the first experimental demonstrations in the microwave and visible ranges\n[1,2], invisibility cloaks have stimulated progress in the fields of metamaterials and\ntransformation optics. Very recently, Farhat and co-workers [3] suggested that arrays of invisibility cloaks"], "link": "http://www.2physics.com/feeds/1678400714416864859/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Rutger van Haasteren\n\n[Rutger van Haasteren is the recipient of the 2011 GWIC (Gravitational Wave International Committee) Thesis Prize for his PhD thesis “Gravitational Wave detection and data analysis for Pulsar Timing Arrays” (PDF). -- 2Physics.com]\n\nAuthor: Rutger van Haasteren \n\nAffiliation: \nCurrently at Albert-Einstein-Institute (Max-Plack Institute for Gravitational Physics) in"], "link": "http://www.2physics.com/feeds/2182132808957230906/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Gururaj V. Naik (left) and Alexandra Boltasseva (right)\n\n\n\n\n\n\n\n\n\n\n\nAuthors: Gururaj V. Naik and Alexandra Boltasseva \n\nAffiliation: School of Electrical and Computer Engineering and Birck Nanotechnology Center, Purdue University, USA\n\nEngineering the flow of light at the nanoscale is enabled by plasmonics and metamaterials. Research in metamaterials has progressed rapidly in the past decade,"], "link": "http://www.2physics.com/feeds/4443524748312650351/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Author: Roger Colbeck \n\nAffiliation: Institute for Theoretical Physics, ETH Zurich, Switzerland\n\n\nAre there fundamentally random processes in Nature? 150 years ago,\nscientists with a classical world-view would have likely answered in\nthe negative: the laws of classical mechanics state that if one knew\nall the physical properties of every particle at some particular\ninstant in time, then, in"], "link": "http://www.2physics.com/feeds/1844347274310197643/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}, {"content": ["Authors: Vincent Mourik1, Kun Zuo1, Sergey Frolov1, Sébastien Plissard2, Erik Bakkers1,2, Leo Kouwenhoven1\n\nAffiliation:\n1Kavli Institute of Nanoscience, Delft University of Technology, Netherlands.\n2Dept of Applied Physics, Eindhoven University of Technology, Netherlands.\n\n\nParticle Predictors:\nPaul Dirac was the very first particle predictor. In 1927, Dirac developed a formula that"], "link": "http://www.2physics.com/feeds/6655986468227104047/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "2Physics"}]