[{"blogurl": "http://threesixty360.wordpress.com\n", "blogroll": [], "title": "360"}, {"content": ["A few days ago while in a yarn shop I ran into one of our alumni from a few years ago.  Seeing her was fantastic, but the icing on the cake (S orry.  Sort of. ) was that she had gotten married last summer to a biochem major, and they designed their own wedding cake.  She sent me a couple photos the next day of what is perhaps the coolest wedding cake I’ve ever seen: \n  \n Here’s a detail: \n Hey, I can answer that question!  I’m not as sure about the next one, though. \n  \n Congratulations (and Happy Anniversary!) to Emily and Glen — I can think of no better way to start a marriage. \n Props to the photographer, Hilary Argentieri, for taking such clear picture! \n \n Oddly, this isn’t even our first math wedding post (see this mathy proposal ) although it’s the very first one involving cake. \n \n Edited 9/19 to add :  Apparently this came from xkcd — I think that makes me like it all the more."], "link": "http://threesixty360.wordpress.com/2012/09/19/wedding-cake-win/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://threesixty360.wordpress.com/": 4}, "blogtitle": "360"}, {"content": ["Zero degree (Celsius) is cold.  But you know what’s really cold?  Negative zero.  At least according to the sign that our colleague Nicole saw in Canada."], "link": "http://threesixty360.wordpress.com/2012/03/18/negative-zero/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://threesixty360.wordpress.com/": 1}, "blogtitle": "360"}, {"content": ["While the Muppet version of Bohemian Rhapsody is still my favorite, this might be a close runner up:"], "link": "http://threesixty360.wordpress.com/2012/03/16/calculus-rhapsody/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.youtube.com/": 1, "http://threesixty360.wordpress.com/": 1}, "blogtitle": "360"}, {"content": ["In an unfortunately tribute to Pi Day and the importance of mathematics, there was an article in the New York Times yesterday (March 13, 2012) illustrating that the people who need to measure parts don’t always know how: \n “The employee responsible for finding a replacement part for a tower crane that ultimately collapsed on the Upper East Side in 2008, killing two workers, testified on Tuesday about his own difficulty with the basic math of measuring key components. Tibor Varganyi, whose formal education ended in the ninth grade in Hungary, struggled how to measure the distance between the roughly 30 bolt holes around a piece of the turntable assembly. He decided to use a ruler.” \n The article (“Worker Tells Court He Lacked Math to Measure Crane Part” by Russ Buettner) goes on to explain how the measurements didn’t match up with expectations, so he switched to a protractor, which also didn’t work.  This particular replacement part was never used, and the article is primarily about the prosecution’s argument that the company wasn’t worried about the lack of expertise or safety, instead focusing on profits, but the description is still worrisome. \n That’s depressing.  We’d better recover by looking back at some old Pi Day Sudokus ."], "link": "http://threesixty360.wordpress.com/2012/03/14/math-mistakes-and-misplaced-measuring/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.nytimes.com/": 1, "http://threesixty360.wordpress.com/": 2}, "blogtitle": "360"}, {"content": ["As you’ll know if  you’ve been on Google in the past twelve or so hours, today is Jim Henson’s 75th birthday, and in his honor we share with you a rousing rendition of the How Many Game, hosted by the wonderful Guy Smiley! \n  \n Follow up question:  should they have won with the sheep? \n \n According to the Muppet Wiki , Guy Smiley’s enthusiasm was rough on Jim Henson’s voicebox, so his portions were rerecorded so that it could be played over and over without Mr. Henson having to keep repeating his dialogue.   The Muppet Wiki also says that there were two two-headed monsters:  the one in the clip above was designed by Jim Henson, but a second , who was on Fanfare and the Mike Douglas Show rather than Sesame Street, was performed by Jim Henson."], "link": "http://threesixty360.wordpress.com/2011/09/24/happy-birthday-jim/", "bloglinks": {}, "links": {"http://muppet.wikia.com/": 3, "http://feeds.wordpress.com/": 1, "http://threesixty360.wordpress.com/": 1}, "blogtitle": "360"}, {"content": ["Let’s start with ultimate  (yes, that seems a bit backwards – stay with me.), as in “last”.  The next-to-last, then, is penultimate , easily one of my favorite words.  But there’s more!  The next-to-next-to-last is the antepenultimate .  Need another?  The -last is the preantepenultimate , a completely real word that Chrome’s built-in dictionary has never seen (it suggests “prearrangement”). \n Why am I telling you all this?  I mean, besides the sheer ridiculousness/awesomeness of a word for the fourth-to-last item in a list?  I needed an excuse to post this video:"], "link": "http://threesixty360.wordpress.com/2011/09/20/how-many-before-the-end/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://threesixty360.wordpress.com/": 1}, "blogtitle": "360"}, {"content": ["From a recent Nature Valley ad in the London Metro newspaper: \n  \n Perhaps the second bar is twice as delicious as the first. \n Via Language Log .  Photo from Spiderham ."], "link": "http://threesixty360.wordpress.com/2011/08/24/granola-fail/", "bloglinks": {}, "links": {"http://yfrog.com/": 1, "http://feeds.wordpress.com/": 1, "http://threesixty360.wordpress.com/": 1, "http://languagelog.upenn.edu/": 1}, "blogtitle": "360"}, {"content": ["The folk from Glee paid unintended homage to the title of this week’s episode (“A Night of Neglect”) by showing Mr. Schuester forgetting his basic math skills.  Actually that’s not entirely true; he does math in his head correctly as he explains his plan to use salt-water taffy to earn money to go to Nationals in New York: \n When I was a student here we paid for our entire trip to Nationals selling this….  So, to make $5000 at 25 cents apiece, we need to sell 20,000 pieces of taffy. \n So far, so good.  But wait, what’s that equation in the background? \n  \n Poor Will…he didn’t even notice that the equation wasn’t quite right (and neither did the four members of the Academic Decathalon team).  But don’t worry, we understand how busy this time of year is, what with all the projects and end of the year assignments coming due.  So shall we just fix that up for you? \n  \n There, all better.   Now you can go concentrate on raising that money.  Just be sure to have someone else in charge of the ledger."], "link": "http://threesixty360.wordpress.com/2011/04/22/math-neglect-on-glee/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://threesixty360.wordpress.com/": 2}, "blogtitle": "360"}, {"content": ["For no reason that I can think of, I decided to see how much Wolfram Alpha knew about probability, so I typed “ probability of a full house ” into the search box and got the following: \n I thought that was pretty cool, especially since it includes the derivations, so I asked a few more questions, such as “ probability of at least 2 red cards in a 5 card hand “: \n Odd that it will count the numerator but not the (easier) denominator .  At this point, I thought I’d try a standard probability question ( balls in an urn ) that might be harder to parse because of the additional statements: “ probability of drawing a blue ball from an urn contaiing 5 blue balls and 7 red balls “.  However, I missed the ‘n’ key when typing “containing” and got the following: \n So, yeah, OK, Wolfram Alpha doesn’t provide “adult” content (why the quotes?), and I’m pretty sure I know what it’s reading as “adult”, but c’mon.  Note that fixing the typo doesn’t alleviate the problem, but it does cause Alpha to hiccup and request more computing time.  With variations on the wording, I’ve also had it return a picture of a blue ball along with the HTML code to generate it.  Nice."], "link": "http://threesixty360.wordpress.com/2011/04/19/alphas-curious-filter/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.wolframalpha.com/": 4, "http://threesixty360.wordpress.com/": 3, "http://en.wikipedia.org/": 1}, "blogtitle": "360"}, {"content": ["Godzilla is a well-known mind-reader, and in honor of final exams, which are coming up sooner than seems possible, he’d like to demonstrate his powers.  Even over the internet, because his powers are MIGHTY.  Like him. \n Start with 3-digit number that is not a palindrome (so 360 is OK, but 363 is not).    Then reverse the digits, and subtract the smaller number from the larger.  You get a NEW AND IMPROVED number.  So if you do start with 360, your NEW AND IMPROVED number will be 297 (which is 360 minus 063). \n Treating your NEW AND IMPROVED number as a 3-digit number, reverse the digits.   This means that if your NEW AND IMPROVED number appeared to only have two digits, or even one, then you have to tack on one or two leading zeros that you include in the reversal. \n Now add your NEW AND IMPROVED number to its reverse.  Godzilla will now tell you the sum, even over all the miles and electrons that separate you from this friendly beast….. \n \n  \n Poor 1089 doesn’t look like it’s having a very good day.  But he’ll be the star of the show if you do this trick yourself, with super mindreading powers passed along by the Big Lizard himself. \n If you want to avoid the whole “leading zero” thing, you can insist that the first and third digits of your starting number are at least two digits apart, which sounds unduly complicated, or that the digits are all increasing [or all decreasing], which sounds slick.  It’s not really necessary, though. \n \n Hat tip to Michaela Stone and Michelle Zajac from Alfred University:  they didn’t invent this trick, but they did share it in a talk at the MAA Seaway Conference at Naz earlier this month."], "link": "http://threesixty360.wordpress.com/2011/04/12/more-math-mindreading/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://threesixty360.wordpress.com/": 2}, "blogtitle": "360"}]