[{"blogurl": "http://stataccess.blogspot.com\n", "blogroll": [], "title": "Access to Statistics"}, {"content": ["Dwg 2012-oct-07 - european commission open data and public sector information from Alf Fyhrlund"], "link": "http://stataccess.blogspot.com/feeds/8362956180513649407/comments/default", "bloglinks": {}, "links": {"http://www.slideshare.net/": 2}, "blogtitle": "Access to Statistics"}, {"content": ["http://market.android.com/search?q=pname:eurostat.ec.europa.eu.country.profils The Eurostat Country Profiles application gives mobile access to the main statistical data for the EU and its Member States, the euro area, EFTA countries, EU candidate countries and a few other countries. The update function allows the downloading of the freshest data from the Eurostat data server. For more information and other data see also Eurostat's website at  http://ec.europa.eu/eurostat ."], "link": "http://stataccess.blogspot.com/feeds/7912598122651459282/comments/default", "bloglinks": {}, "links": {"http://ec.europa.eu/": 1, "http://www.blogger.com/": 1, "https://play.google.com/": 1, "http://market.android.com/": 1}, "blogtitle": "Access to Statistics"}, {"content": ["From PARIS21: Big Data, Big Time: Statistical Capacity Development 2.0 | paris21.org  date:  17 October 2012 There is an ever increasing demand by policy makers, academics, civil society and business for data on all aspects of society, economy and life. Against this background, the recent phenomenon of an emergence of “big data” including data from official and non-official sources such as call logs, mobile-banking transactions, polling results, online user-generated content, satellite images, etc. should be very welcome. But, there is an emerging concern that big data might also lead to very important negative consequences such as the publishing of data of bad quality and without any accountability mechanism, a possibly confusion of the public by showing different data depending on the sources and most importantly on under-mining if not crowding out the statistical capacity at country level, in particular in developing countries. In this context, PARIS21 has organised a lunch-time seminar to address how development practioners can maximize the opportunities and minimize the risks coming from the big data movement for building statistical capacities in developing countries.  The seminar, which was attended by around 50 participants, took place on the 17th of October in the framework of the 4th OECD World Forum on Statistics, Knowledge and Policy in New Delhi, India which started on the 16th of October and will last till the 19th. It was a lively debate discussing issues around data production – public versus private ; data quality – good or bad and the need for institutional frameworks that define the role of each action in the statistical landscape. The debate was moderated by Johannes JÜTTING, Manager of PARIS21 Secretariat, with a panel composed of Mohamed TAAMOUTI, Director of the Moroccan Statistics Office and Robert MANCHIN, Managing Director of The Gallup Organisation Europe. For more information on the 4th OECD World Forum on Statistics, Knowledge and Policy click here"], "link": "http://stataccess.blogspot.com/feeds/5810738261552427592/comments/default", "bloglinks": {}, "links": {"http://www.paris21.org/": 1, "http://www.oecd.org/": 1}, "blogtitle": "Access to Statistics"}, {"content": ["Open data is the theme for this year’s Cathie Marsh Memorial Lecture | RSSeNews : October 18, 2012 News The government’s open data initiative will be under the spotlight in the 2012 Cathie Marsh Memorial Lecture at the Royal Statistical Society on 13 November, 2012.  The lecture this year features three expert speakers in this area: Iain Bell, deputy director, public sector and household at the Office for National Statistics; Simon Briscoe, special advisor (statistics) to the Public Administration Select Committee and deputy chair of the UK Data Service; and Peter Elias, professor at the Institute for Employment Research at the University of Warwick. Read more...."], "link": "http://stataccess.blogspot.com/feeds/3310840778642426289/comments/default", "bloglinks": {}, "links": {"http://www.org.uk/": 2}, "blogtitle": "Access to Statistics"}, {"content": ["From: http://www.panopticon.com/webinar/50 Webinars > Panopticon 6: Revolutionary advanced data visualization system  Panopticon 6 is the latest generation of our advanced data visualization software suite. It is the next level in real-time visual data analysis and offers a huge range of functionality and deployment options.  In this webinar , Panopticon's Chief Architect Ludvig Sandman demonstrates the new mobile capabilities of the platform and explain how to use Panopticon 6 to embed our in-memory OLAP and visualization functions into your own enterprise applications. Panopticon 6 incorporates: Ability to visualize data from true real-time streaming sources, including message queues, CEP engines and tick databases Ability to federate data from multiple sources and combine them in a single visualization or in multi-visualization dashboards Ability to fully embed our StreamCube OLAP in-memory data model and our data visualizations into third party applications HTML5 and Java view clients for delivery of fully interactive dashboards to any desktop or mobile device Specialized Smartphone visualization functions Native connectors for Active MQ, Apache Qpid and Progress Sonic MQ message buses Native connectors for StreamBase, OneTick CEP, SAP Sybase ESP, and Oracle CEP engines Native connectors for in-memory data management systems like SAP HANA Native connectors for high performance columnar tick databases, including SAP Sybase IQ, Kx Kdb+, OneTick, and Thomson Reuters Velocity Analytics ODBC sources Files including Microsoft Excel, CSV, SVG, and XML Sophisticated offline reporting capabilities"], "link": "http://stataccess.blogspot.com/feeds/4695645052167816895/comments/default", "bloglinks": {}, "links": {"http://www.panopticon.com/": 2, "http://panopticon.com/": 1}, "blogtitle": "Access to Statistics"}, {"content": ["From: Blog about Stats ~ All about Dissemination of (Official) Statistics http://blogstats.wordpress.com/2012/10/15/imaodbc-2012-and-the-winner-is/ Posted by Armin Grossenbacher  in 023 Semantic Web , 037 Open data initiatives , IMAODBC The Bo Sundgren Award of the International Marketing and Output Database Conference IMAODBC 2012 in Pruhonice near Prag goes to Alain Nadeau from the Swiss Federal Statistical Office FSO . In his contribution Alain showed how the renovation of the FSO website can go together with a more open data-oriented publishing. This by separating the three layers of the application.  One of the databases in the data layer is planned to be in the linked open data format, the 5star format described by Tim Berners-Lee. A prototype is under way and first experiences will show up beginning 2013. Read more...."], "link": "http://stataccess.blogspot.com/feeds/7564251113130686726/comments/default", "bloglinks": {}, "links": {"http://blogstats.wordpress.com/": 8, "http://www.admin.ch/": 1}, "blogtitle": "Access to Statistics"}, {"content": ["From: http://www.bbc.com/future/story/20121008-winning-formula-for-nobel-prizes  http://www.bbc.com/future/story/20121008-winning-formula-for-nobel-prizes"], "link": "http://stataccess.blogspot.com/feeds/8708522132100836929/comments/default", "bloglinks": {}, "links": {"http://www.blogger.com/": 1, "http://www.bbc.com/": 1}, "blogtitle": "Access to Statistics"}, {"content": ["From: AolGovernment  Big Data Reaches The Hill: A Guide To Making It More Actionable  By Brand Niemann Published:  October 10, 2012  Read more.... ------------------------------------------------------------ ---------------------------------------------------------------------  What Congress should do to help big data  Allow access to confidential data such as the Census data centers Allow sharing between statistical agencies Have a chief data dfficer that promotes a federal data science community of data scientists and statisticians The federal government should first focus on the value of big data  Hadoop projects are costing 50 times more than expected DHS failed fast with a big data in the cloud project, but quickly and at less cost Semantic Medline on the Cray Graph Computer in an example of a federal data science team project with value The federal government should foster real innovation with government data  Encourage private industry to add value to government data Consider having the federal government's chief statistician be the chief data officer Empower the government's data scientists and statisticians to analyze big data and statistical data  Read more...."], "link": "http://stataccess.blogspot.com/feeds/3482092207284794238/comments/default", "bloglinks": {}, "links": {"http://gov.aol.com/": 5, "http://gov.aol.com/blog": 1}, "blogtitle": "Access to Statistics"}, {"content": ["From: http://uk.fm.dk/publications/2012/good-basic-data-for-everyone/   Public authorities in Denmark register various core information about individuals, businesses, real properties, buildings, addresses, and more. This information, called basic data, is re-used throughout the public sector. Re-use of high-quality data is an essential basis for public authorities to perform their tasks properly and efficiently across units, administrations and sectors. Basic data is an important contribution to modernising the public sector. The public and businesses are provided a better and more efficient service, when data that has already been recorded is shared across institutions and is included directly in case processing. Furthermore, employees in the public sector will be less burdened by repetitive and routine tasks, and this, in turn, will release more resources for increased welfare in e.g. the healthcare and education sectors. However, open and homogenous re-use of basic data also has great value for the private sector, partly because businesses use this data in their internal processes and, partly, because the information contained in public-sector data can be exploited for entirely new products and solutions, in particular digital ones. In short, basic data freely available to the private sector is a potential driver for innovation, growth and job creation. Read \"Good basic data for everyone - a driver for growth and efficiency here [2.967 KB]"], "link": "http://stataccess.blogspot.com/feeds/6623908814882457533/comments/default", "bloglinks": {}, "links": {"http://uk.fm.dk/": 3}, "blogtitle": "Access to Statistics"}, {"content": ["Tibco Spotfire, already popular for finding the proverbial needle in the haystack, now works smarter with the biggest haystacks. By Doug Henschen  InformationWeek September 25, 2012 02:14 PM   Big Data Talent War: 10 Analytics Job Trends (click image for larger view and for slideshow) Tibco Spotfire handles data visualization, analytic dashboards and applications, and forward-looking predictive analysis. Spotfire 5.0, a significant upgrade announced on Tuesday, is designed to do all of the above at big-data scale. Tibco Spotfire is already a popular product for finding the proverbial needles in the haystack, but customers are telling Tibco that the haystacks are getting bigger. Oil and gas operations, for example, are gathering more information from well sensors. Manufacturers are grabbing more production data off of shop floors. And marketers are gathering more customer analysis and segmentation information through click streams and social networks. As the data stacks up, the nature of the analysis changes, according to Steve Farr, a Tibco Spotfire senior product marketing manager. \"It's tempting to think you can identify the important trends in a small subset of the data, but big data analytics is about considering all of the data so you also see the exceptions and outliers,\" Farr told InformationWeek. \"It's in the outliers that you find fraud, risk, and the things that are growing wrong.\" You can also find latent patterns in that bigger picture that reveal opportunities. Read more...."], "link": "http://stataccess.blogspot.com/feeds/4276938670519500495/comments/default", "bloglinks": {}, "links": {"http://www.informationweek.com/": 5}, "blogtitle": "Access to Statistics"}, {"content": ["By Xavier Badosa on Sep 25, 2012 Opening contribution to the Task force for the strategic project on the development and use of common ESS tools and services for dissemination. Eurostat, Luxembourg, 20 September 2012   Links and Widgets: the Fabric of the Web from Xavier Badosa"], "link": "http://stataccess.blogspot.com/feeds/8059412157860895967/comments/default", "bloglinks": {}, "links": {"http://www.slideshare.net/": 3}, "blogtitle": "Access to Statistics"}, {"content": ["Published on Sep 18, 2012 by Xavier Badosa In March 2012, I was invited to talk at the OECD Statistical Information System Collaboration Community (SIS-CC) Workshop in Paris. This presentation was included in the session: \"Data Machine-Readability in support of open data strategies\". See the accompanying slides at: http://www.slideshare.net/badosa/standards-for-statistical-data-dissemination-a-wish-list-12025046"], "link": "http://stataccess.blogspot.com/feeds/6414951104842253445/comments/default", "bloglinks": {}, "links": {"http://www.slideshare.net/": 1}, "blogtitle": "Access to Statistics"}, {"content": ["From: http://www.ncomva.se/newsletter/NComVA%20Nyhetsbrev%203%202012%20Sep%20English.pdf   The US business analytics company QlikView (former Swedish company) has selected NComVA as a strategic technology partner for professional interactive data visualization with integrated storytelling. The first integrated product QlikXplorer has been announced on the QlikMarket. NComVA provides QlikView users with advanced interactive statistical and business multivariate visualization as “extensions” seamless integrated into QlikView using our latest HTML5/JS visualization components.  The combination of QlikView innovative business intelligence and NComVA world-leading interactive data visualization will provide the foundation for a strong partnership for the emerging visual business analytics market. Read also in this blog post which highlights the importance of storytelling and the status it has in NComVA products. QlikView: http://www.qlikview.com QlikMarket, NComVA extension: http://market.qlikview.com/ncomva-qlikxplorer-extension.html"], "link": "http://stataccess.blogspot.com/feeds/2931943282076788067/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.qlikview.com/": 1, "http://community.qlikview.com/blog": 2, "http://www.ncomva.se/": 1, "http://market.qlikview.com/": 1}, "blogtitle": "Access to Statistics"}, {"content": ["From: http://apdu.org/wp-content/uploads/2012/06/Horrigan_-_BIG_Data_and_OFFICIAL_Statistics.pdf  Statistics . ▫ What are big data ? ▫ How big data are already being used. ▫ The future of using big data by statistical agencies ...  Big Data and Official Statistics . 3 ..."], "link": "http://stataccess.blogspot.com/feeds/8486526627619203961/comments/default", "bloglinks": {}, "links": {"http://apdu.org/": 2}, "blogtitle": "Access to Statistics"}, {"content": ["NYT: Data-Driven Discovery Is Tech'   John Hersey  By STEVE LOHR Published: September 09, 2012 TECHNOLOGY tends to cascade into the marketplace in waves. Think of personal computers in the 1980s, the Internet in the 1990s and smartphones in the last five years. Computing may be on the cusp of another such wave. This one, many researchers and entrepreneurs say, will be based on smarter machines and software that will automate more tasks and help people make better decisions in business, science and government. And the technological building blocks, both hardware and software, are falling into place, stirring optimism. More....."], "link": "http://stataccess.blogspot.com/feeds/3089137684605073635/comments/default", "bloglinks": {}, "links": {"http://mobile.nytimes.com/": 2}, "blogtitle": "Access to Statistics"}, {"content": ["Published: August 29, 2012 in Knowledge@Wharton    hare on facebook  Share on twitter  Share on email More Sharing Services   In the last few decades, statisticians and computer scientists have produced a dazzling arsenal of extremely powerful tools to help managers translate data into business decisions.  Having access to a wide array of versatile solutions is not ordinarily considered a problem in the world of business. But the rise of \"big data\" has also brought along with it the explosion of mathematical models made possible by today's low-cost computing and storage platforms. Ironically, this poses a number of substantial challenges to managers trying to making sense of ever-growing quantities of information. More...."], "link": "http://stataccess.blogspot.com/feeds/1310927793879024607/comments/default", "bloglinks": {}, "links": {"http://knowledge.upenn.edu/": 3}, "blogtitle": "Access to Statistics"}, {"content": ["From: www.statisticsauthority.gov.uk/.../open-data-and-the-gss.pdf The GSS is committed to increasing the amount of data released in open and re-usable formats in production of its statistical outputs. This is in line with the UK Government’s policy, as set out in the Open Data White Paper. Principle 8 of the Code of Practice for Official Statistics states that producers of official statistics should ensure that they are disseminated in forms that enable and encourage analysis and reuse. Producers should release datasets and reference databases, supported by documentation, in formats that are convenient to users. Principle 5 of the Code of Practice states that official statistics should not reveal the identity of an individual or organisation, or any private information relating to them, taking into account other relevant sources of information. Arrangements for confidentiality protection must be sufficient to protect the privacy of individual information, but not so restrictive as to limit unduly the practical utility of official statistics."], "link": "http://stataccess.blogspot.com/feeds/1050982785383677628/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.google.com/": 1}, "blogtitle": "Access to Statistics"}, {"content": ["From: http://www.census.gov/mobile/ Our users are not only changing how they want our statistics, they’re changing how they access them. To increase and improve access to our statistics, the Census Bureau is providing mobile apps that deliver information when and where you need it.   America’s Economy Take the pulse of the U.S. Economy straight from your phone. The America’s Economy app provides real-time updates for 16 key economic indicators released from the U.S. Census Bureau, Bureau of Labor Statistics, and Bureau of Economic Analysis. Key economic measures on employment, manufacturing, international trade, retail sales, and residential construction and sales allow those who follow the U.S. economy to be the first to see whether the indicator has gone up or down since the previous report, and trends over time.     Download Phone Version  Download Tablet Version Key Features Quick overview of indicators measuring the U.S. economy Detailed page for each indicator with trend data Share indicators on Facebook, Twitter and via email View release schedules for indicators Set up notifications and custom views Indicators Advance Monthly Retail Sales Advance Report Durable Goods Business Inventories Construction Spending Homeownership Rate International Trade Manufacturers’ Goods Monthly Wholesale New Residential Construction New Residential Sales Personal Income QFR–Manufacturing QFR–Retail Trade Quarterly Services Survey Real Gross Domestic Product Unemployment Rate   More....."], "link": "http://stataccess.blogspot.com/feeds/9131959131037554048/comments/default", "bloglinks": {}, "links": {"http://www.blogger.com/": 1, "https://play.google.com/": 3, "http://www.census.gov/": 2}, "blogtitle": "Access to Statistics"}, {"content": ["From: http://www.informationisbeautifulawards.com/  Home About Blog The Longlist The Shortlist Take a challenge Beloved Sponsors An example:  WHEN DOES CRIME HAPPEN? Trulia Data Visualisation Data Visualisation Shortlist http://trends.truliablog.com/vis/when-crime  < Previous in category Next in category >"], "link": "http://stataccess.blogspot.com/feeds/1749251949194919853/comments/default", "bloglinks": {}, "links": {"http://www.informationisbeautifulawards.com/": 16, "http://www.informationisbeautifulawards.com/blog": 1, "http://s.informationisbeautifulawards.com/blog": 1, "http://trends.truliablog.com/": 1}, "blogtitle": "Access to Statistics"}, {"content": ["August 21, 2012 The winners of the 2012 awards for statistical excellence in journalism have been announced, with journalists at the Financial Times, the BBC and The Guardian all recognised for their work.  The awards, now in their sixth year, are made in three categories – print, broadcast and online – and recognise work first published or broadcast in the preceding calendar year. More...."], "link": "http://stataccess.blogspot.com/feeds/5136089203197859937/comments/default", "bloglinks": {}, "links": {"http://www.org.uk/": 3}, "blogtitle": "Access to Statistics"}, {"content": ["Eurozone   By: Eurasia Review   August 16, 2012 ( CORDIS ) — The increasing use of ICT for business, leisure and public services is leading to the accumulation of mountains of structured and in many cases unstructured data. But this so-called ‘big data’ should be seen as an opportunity not a problem. EU research and efforts to promote open data are helping to make sense and good use of this resource. ‘Open data’ is the idea that certain data should be freely available to everyone to use and republish as they wish, without restrictions from copyright, patents or other mechanisms of control. Inspired by the open source software (non-proprietary) and open access (academic publishing) movements, open data is broadly taken to mean the liberal movement, use, re-use or electronic distribution of data. An important part of this ‘big data’ movement is the use for the wider benefit of society of the non-personal information that citizens share with their governments and public services. Open government data is a tremendous resource that has yet to be fully tapped. ‘Government collects a vast quantity of high-quality data as part of its ordinary working activities. If this data is made open, it can have huge potential benefits,’ notes the Open Government Data (OGD) website, run by the Open Government Working Group. Read more...."], "link": "http://stataccess.blogspot.com/feeds/7651514570003799467/comments/default", "bloglinks": {}, "links": {"http://www.eurasiareview.com/": 2, "https://lh4.googleusercontent.com/": 1, "http://cordis.europa.eu/": 1}, "blogtitle": "Access to Statistics"}, {"content": ["Check Out How HITECH Programs Are Helping From: http://dashboard.healthit.gov/ Are you interested in better understanding health IT and the transformative changes that electronic health/medical records are having in our nation's health care system? The Health IT Dashboard presents key information and data to enable collaborative monitoring of the impact of federal policies, programs, and research activities related to health IT. Return to this web site regularly to explore and download new datasets and statistics as they become available.   ONC Dashboard Overview    The ONC Overview Dashboard includes summary information about all of ONC's HITECH grant programs, including their location, funding amount, and contact information. With the Health IT Dashboard, you can: Generate maps of ONC's planned obligations by state and program (data does not include sub recipients or contracts servicing ONC grants). Learn how ONC's HITECH programs work together to create momentum in EHR adoption and health information exchange activity. Download a full list of ONC HITECH program grantees for your own purposes"], "link": "http://stataccess.blogspot.com/feeds/8879767991777032657/comments/default", "bloglinks": {}, "links": {"http://dashboard.healthit.gov/": 2}, "blogtitle": "Access to Statistics"}, {"content": ["July 24, 2012 to Statistics by Nathan Yau If you want to learn visualization, you should learn data. To learn data, you should learn statistics. Where to begin? The free analysis courses offered on Coursera, by Johns Hopkins professors is probably a good place to start. Currently available: Computing for Data Analysis with biostatistics professor Roger D. Peng and Data Analysis with Jeff Leek, also a biostatistics professor."], "link": "http://stataccess.blogspot.com/feeds/7900989144461908481/comments/default", "bloglinks": {}, "links": {"https://www.coursera.org/": 2, "http://flowingdata.com/": 2}, "blogtitle": "Access to Statistics"}, {"content": ["ScienceDaily (July 16, 2012) — Interpreting the results of statistical surveys, e.g., Transparency Internation­al's corruption indices, is not always a simple matter. As Dr. Heiko Paulheim of the Knowledge Engineering Group at the TU Darmstadt's Computer Sciences Dept. put it, \"Although methods that will unearth explanations for statistics are available, they are confined to utilizing data contained in the statistics involved. Further, background information will not be taken into account. That is what led us to the idea of applying data-mining methods that we had been studying here to the semantic web in order to obtain further, background infor­ma­tion that will allow us to learn more from statistics.\" The \"Explain-a-LOD\" tool that Paulheim developed accesses linked open data (LOD), i.e., enormous compilations of publicly available, semantically linked data accessible on the Internet, and, from that data, automatically formulates hypo­theses regarding the interpretation of arbitrary types of statistics. To start off, the statistics to be interpreted are read into Explain-a-LOD. Explain-a-LOD then automatically searches the pools of linked open data for associated records and adds them to the initial set. Paulheim explained that, \"If, for example, the country \"Germany\" is listed in the corruption-index data, LOD‑records that contain information on Germany will be identified and further attributes, such as its population, its membership in the EU and OECD, or the total number of companies domiciled there, generated. Attributes that are unlikely to yield useful hypotheses will be automatically deleted in order to reduce the volumes of such enriched statistics.  Read more........ Further information: http://www.ke.tu-darmstadt.de/resources/explain-a-lod   Explain-a-LOD helps to interpret statistics, like for example the corruption perceptions index by Transparency International. (Credit: Diagram: Transparency International)"], "link": "http://stataccess.blogspot.com/feeds/4082376055944977914/comments/default", "bloglinks": {}, "links": {"http://www.tu-darmstadt.de/": 1, "http://www.sciencedaily.com/": 3}, "blogtitle": "Access to Statistics"}, {"content": ["‘Big Data’ event now available to view  July 10, 2012  News  No comments   Print PDF  The Big Data Opportunity event , chaired last week (3 July 2012) by RSS executive director Hetan Shah and featuring cabinet minister Francis Maude , is now available to view on YouTube. The event was hosted by think tank Policy Exchange , following the publication of its report on how the government could make better use of big data in the public sector. Francis Maude gave a speech about the government’s vision for Big Data and how it could boost efficiency and improve public service delivery. In his speech, Maude said that an estimated £37billion a year was lost across the public sector ‘through debt, fraud and error – in a large part because of our failure to share data effectively’. He confirmed that the government was to adopt world wide web inventor Tim Berners-Lee’s ’5 Star Scheme’ for assessing the usability of the data as well as appointing a privacy expert, ‘to make sure we bring in the latest expertise on privacy measures.’ Maude’s speech was followed by speeches from James Petter , UK managing director of EMC – the event’s sponsor – and Chris Yiu , head of digital government at Policy Exchange. The speeches were followed by a Q&A discussion chaired by Hetan Shah. Shah said ‘This event shows there are real opportunities which can come from the open data agenda, but that there are a number of key issues including privacy, data quality and the capability of civil servants which need to be addressed.’        Share    Big Data , EMC , Francis Maude , Hetan Shah , Policy Exchange , privacy"], "link": "http://stataccess.blogspot.com/feeds/3486486569632936389/comments/default", "bloglinks": {}, "links": {"http://www.w3.org/": 1, "http://uk.emc.com/": 2, "http://www.org.uk/": 12, "http://www.printfriendly.com/": 1, "http://www.gov.uk/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Access to Statistics"}]