[{"blogurl": "http://almostsure.wordpress.com\n", "blogroll": [], "title": "Almost Sure"}, {"content": ["In this post I’ll give a proof of Rao’s decomposition for quasimartingales. That is, every quasimartingale decomposes as the sum of a submartingale and a supermartingale. Equivalently, every quasimartingale is a difference of two submartingales, or alternatively, of two supermartingales. This was originally proven by Rao (Quasi-martingales, 1969), and is an important result in the [...]"], "link": "http://almostsure.wordpress.com/2012/06/18/raos-quasimartingale-decomposition/", "bloglinks": {}, "links": {}, "blogtitle": "Almost Sure"}, {"content": ["Quasimartingales are a natural generalization of martingales, submartingales and supermartingales. They were first introduced by Fisk in order to extend the Doob-Meyer decomposition to a larger class of processes, showing that continuous quasimartingales can be decomposed into martingale and finite variation terms (Quasi-martingales, 1965). This was later extended to right-continuous processes by Orey (F-Processes, 1967). [...]"], "link": "http://almostsure.wordpress.com/2012/04/12/quasimartingales/", "bloglinks": {}, "links": {}, "blogtitle": "Almost Sure"}, {"content": ["The Doob-Meyer decomposition was a very important result, historically, in the development of stochastic calculus. This theorem states that every cadlag submartingale uniquely decomposes as the sum of a local martingale and an increasing predictable process. For one thing, if X is a square-integrable martingale then Jensen’s inequality implies that is a submartingale, so the [...]"], "link": "http://almostsure.wordpress.com/2011/12/30/the-doob-meyer-decomposition/", "bloglinks": {}, "links": {}, "blogtitle": "Almost Sure"}, {"content": ["A counting process, X, is defined to be an adapted stochastic process starting from zero which is piecewise constant and right-continuous with jumps of size 1. That is, letting be the first time at which , then By the debut theorem, are stopping times. So, X is an increasing integer valued process counting the arrivals [...]"], "link": "http://almostsure.wordpress.com/2011/12/27/compensators-of-counting-processes/", "bloglinks": {}, "links": {}, "blogtitle": "Almost Sure"}, {"content": ["The previous post introduced the concept of the compensator of a process, which is known to exist for all locally integrable semimartingales. In this post, I’ll just look at the very special case of compensators of processes consisting of a single jump of unit size. Definition 1 Let be a stopping time. The compensator of [...]"], "link": "http://almostsure.wordpress.com/2011/12/20/compensators-of-stopping-times/", "bloglinks": {}, "links": {}, "blogtitle": "Almost Sure"}, {"content": ["A very common technique when looking at general stochastic processes is to break them down into separate martingale and drift terms. This is easiest to describe in the discrete time situation. So, suppose that is a stochastic process adapted to the discrete-time filtered probability space . If X is integrable, then it is possible to [...]"], "link": "http://almostsure.wordpress.com/2011/11/22/compensators/", "bloglinks": {}, "links": {}, "blogtitle": "Almost Sure"}, {"content": ["For stochastic processes in discrete time, the Doob decomposition uniquely decomposes any integrable process into the sum of a martingale and a predictable process. If is an integrable process adapted to a filtration then we write . Here, M is a martingale, so that , and A is predictable with . By saying that A [...]"], "link": "http://almostsure.wordpress.com/2011/10/03/special-semimartingales/", "bloglinks": {}, "links": {}, "blogtitle": "Almost Sure"}, {"content": ["By definition, an FV process is a cadlag adapted stochastic process which almost surely has finite variation over finite time intervals. These are always semimartingales, because the stochastic integral for bounded integrands can be constructed by taking the Lebesgue-Stieltjes integral along sample paths. Also, from the previous post on continuous semimartingales, we know that the [...]"], "link": "http://almostsure.wordpress.com/2011/07/18/predictable-fv-processes/", "bloglinks": {}, "links": {}, "blogtitle": "Almost Sure"}, {"content": ["Although this post is under the heading of `the general theory of semimartingales’ it is not, strictly speaking, about semimartingales at all. Instead, I will be concerned with a characterization of predictable stopping times. The reason for including this now is twofold. First, the results are too advanced to have been proven in the earlier [...]"], "link": "http://almostsure.wordpress.com/2011/05/26/predictable-stopping-times-2/", "bloglinks": {}, "links": {}, "blogtitle": "Almost Sure"}, {"content": ["A stochastic process is a semimartingale if and only if it can be decomposed as the sum of a local martingale and an FV process. This is stated by the Bichteler-Dellacherie theorem or, alternatively, is often taken as the definition of a semimartingale. For continuous semimartingales, which are the subject of this post, things simplify [...]"], "link": "http://almostsure.wordpress.com/2011/05/03/continuous-semimartingales/", "bloglinks": {}, "links": {}, "blogtitle": "Almost Sure"}]