[{"blogurl": "http://tm.durusau.net\n", "blogroll": [], "title": "Another Word For It"}, {"content": ["Coming soon on JAXenter: videos from JAX London by Elliot Bentley. \n From the post: \n Can you believe it’s only been two weeks since JAX London? We’re already planning for the next one at JAX Towers (yes, really). \n Yet if you’re already getting nostalgic, never fear – JAXenter is on hand to help you relive those glorious yet fleeting days, and give a taste of what you may have missed. \n For a start, we’ve got videos of almost every session in the main room, including keynotes from Doug Cutting, Patrick Debois, Steve Poole and Martijn Verburg & Kirk Pepperdine, which we’ll be releasing gradually onto the site over the coming weeks. Slides for the rest of JAX London’s sessions are already freely available on SlideShare . \n Pepperdine and Verburg, “Java and the Machine,” remark: \n There’s no such thing as a process as far as the hardware is concerned. \n A riff I need to steal to say: \n There’s no such thing as semantics as far as the hardware is concerned. \n We attribute semantics to data for input, we attribute semantics to processing of data by hardware, we attribute semantics to computational results. \n I didn’t see a place for hardware in that statement. Do you?"], "link": "http://tm.durusau.net/?p=32618", "bloglinks": {}, "links": {"http://www.slideshare.net/": 1, "http://jaxenter.com/": 1}, "blogtitle": "Another Word For It"}, {"content": ["One To Watch: Apache Crunch by Chris Mayer. \n From the post: \n Over the past few years, the Apache Software Foundation has become the hub for big data-focused projects. An array of companies have recognised the worth of housing their latest innovative projects at the ASF, with Apache Hadoop and Apache Cassandra two shining examples. \n Amongst the number of projects arriving in the Apache Incubator was Apache Crunch. Crunch is a Java library created to eliminate the tedium of writing a MapReduce pipeline. It aims to take hold of the entire process, making writing, testing, and running MapReduce pipelines more efficient and “even fun” (if this Cloudera blog post is to be believed).\n \n That’s a tall order, to make MapReduce pipelines “even fun.” On the other hand, remarkable things have emerged from Apache for decades now. \n A project to definitely keep in sight."], "link": "http://tm.durusau.net/?p=32614", "bloglinks": {}, "links": {"http://jaxenter.com/": 1, "http://blog.cloudera.com/blog": 1}, "blogtitle": "Another Word For It"}, {"content": ["Artificial Intelligence – Fall 2012 – CMU by Emma Brunskill and Ariel Procaccia . \n From the course overview: \n \n Topics: \n This course is about the theory and practice of Artificial Intelligence. We will study modern techniques for computers to represent task-relevant information and make intelligent (i.e. satisfying or optimal) decisions towards the achievement of goals. The search and problem solving methods are applicable throughout a large range of industrial, civil, medical, financial, robotic, and information systems. We will investigate questions about AI systems such as: how to represent knowledge, how to effectively generate appropriate sequences of actions and how to search among alternatives to find optimal or near-optimal solutions. We will also explore how to deal with uncertainty in the world, how to learn from experience, and how to learn decision rules from data. We expect that by the end of the course students will have a thorough understanding of the algorithmic foundations of AI, how probability and AI are closely interrelated, and how automated agents learn. We also expect students to acquire a strong appreciation of the big-picture aspects of developing fully autonomous intelligent agents. Other lectures will introduce additional aspects of AI, including unsupervised and on-line learning, autonomous robotics, and economic/game-theoretic decision making. \n Learning Objectives \n By the end of the course, students should be able to: \n \n Identify the type of an AI problem (search, inference, decision making under uncertainty, game theory, etc). \n Formulate the problem as a particular type. (Example: define a state space for a search problem) \n Compare the difficulty of different versions of AI problems, in terms of computational complexity and the efficiency of existing algorithms. \n Implement, evaluate and compare the performance of various AI algorithms. Evaluation could include empirical demonstration or theoretical proofs. \n \n Textbook: \n It is helpful, but not required, to have Artificial Intelligence: A Modern Approach / Russel and Norvig. \n Judging from the materials on the website, this is a very good course."], "link": "http://tm.durusau.net/?p=32608", "bloglinks": {}, "links": {"http://www.cmu.edu/": 1, "http://aima.berkeley.edu/": 1, "http://dblp.uni-trier.de/": 2}, "blogtitle": "Another Word For It"}, {"content": ["Building apps with rail data by Jamie Andrews. \n From the post: \n Recently we ran a hack day Off the Rails to take the best rail data and see what can be built with it. I remain stunned at the range and quality of the output, particularly because of the complexity of the subject matter, and the fact that a lot of the developers hadn’t built any train-related software before. \n So check out all of the impressive, useful and fun train hacks, and marvel at what can be done when data is opened and great minds work together… \n The hacks really are impressive so I will just list the titles and hope that induces you to visit Jamie’s post: \n Hack #1 – Trainspot.in… FourSquare for trains \nHack #2 – Journey planner maps with lines that follow the tracks \nHack #3 – Scenic railways \nHack #4 – Realtime Dutch trains \nHack #5 – ChooChooTune \nHack #6 – Realtimetrains \nHack #7 – Follow the rails \nHack #8 – [cycling in the UK] \nHack #9 – [I'll meet you half-way?] \nHack #10 – [train delays, most delayed] \n (No titles given for 8-10 so I made up titles.)"], "link": "http://tm.durusau.net/?p=32601", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://loco2.com/blog": 1}, "blogtitle": "Another Word For It"}, {"content": ["MongoSV 2012 \n From the webpage: \n \nDecember 4th Santa Clara, CA \n MongoSV is an annual one-day conference in Silicon Valley, CA, dedicated to the open source, non-relational database MongoDB. \n There are five (5) tracks, morning and afternoon sessions, a final session followed by a conference party from 5:30 PM to 8 PM. \n Any summary is going to miss something of interest for someone. Take the time to review the schedule. \n While you are there, register for the conference as well. A unique annual opportunity to mix-n-meet with MongoDB enthusiasts!"], "link": "http://tm.durusau.net/?p=32597", "bloglinks": {}, "links": {"http://www.10gen.com/": 1}, "blogtitle": "Another Word For It"}, {"content": ["Make your own buckyball by John D. Cook. \n From the post: \n This weekend a couple of my daughters and I put together a buckyball from a Zometool kit. The shape is named for Buckminster Fuller of geodesic dome fame. Two years after Fuller’s death, scientists discovered that the shape appears naturally in the form of a C60 molecule, named Buckminsterfullerene in his honor. In geometric lingo, the shape is a truncated icosahedron. It’s also the shape of many soccer balls. \n Don’t be embarrassed to use these at the office. \n According to the PR, Roger Penrose does."], "link": "http://tm.durusau.net/?p=32593", "bloglinks": {}, "links": {"http://www.johndcook.com/blog": 1, "http://en.wikipedia.org/": 2, "http://zometool.com/": 1}, "blogtitle": "Another Word For It"}, {"content": ["Wikidata \n From the webpage: \n Wikidata is a free knowledge base that can be read and edited by humans and machines alike. It is for data what Wikimedia Commons is for media files: it centralizes access and management of structured data, such as interwiki references and statistical information. Wikidata contains data in all languages for which there are Wikimedia projects. \n Not fully operational but still quite interesting. \n Particularly the re-use of information aspects. \n Re-use of data being one advantage commonly found in topic maps."], "link": "http://tm.durusau.net/?p=32589", "bloglinks": {}, "links": {"http://www.wikidata.org/": 1, "http://en.wikipedia.org/": 1, "http://commons.wikimedia.org/": 1}, "blogtitle": "Another Word For It"}, {"content": ["Webinar: MongoDB and Fractal Tree Indexes by Tim Callaghan. \n From the post: \n \nThis webinar covers the basics of B-trees and Fractal Tree Indexes, the benchmarks we’ve run so far , and the development road map going forward. \n Date: November 13th \nTime: 2 PM EST / 11 AM PST \n REGISTER TODAY \n \n If you aren’t familiar with Fractal Tree Indexes and MongoDB, this is your opportunity to catch up!"], "link": "http://tm.durusau.net/?p=32586", "bloglinks": {}, "links": {"http://www.odbms.org/": 1, "http://www.tokutek.com/": 2}, "blogtitle": "Another Word For It"}, {"content": ["LEARN programming by visualizing code execution \n From the webpage: \n Online Python Tutor is a free educational tool that helps students overcome a fundamental barrier to learning programming: understanding what happens as the computer executes each line of a program’s source code. Using this tool, a teacher or student can write a Python program directly in the web browser and visualize what the computer is doing step-by-step as it executes the program. \n Of immediate significance for anyone learning or teaching Python. \n Longer range, something similar for merging data from different sources could be useful as well. \n At its simplest, representing the percentage of information from particular sources by color, for the map or items in the map. Illustrating, “what if we take away X,” as a source type analysis. \n I first saw this at Christophe Lalanne’s A bag of tweets / October 2012 ."], "link": "http://tm.durusau.net/?p=32578", "bloglinks": {}, "links": {"http://www.python.org/": 1, "http://pythontutor.com/": 2, "http://aliquote.org/": 1}, "blogtitle": "Another Word For It"}, {"content": ["MDM: It’s Not about One Version of the Truth by Michele Goetz. \n From the post: \n Here is why I am not a fan of the “single source of truth” mantra. A person is not one-dimensional; they can be a parent, a friend, a colleague and each has different motivations and requirements depending on the environment. A product is as much about the physical aspect as it is the pricing, message, and sales channel it is sold through. Or, it is also faceted by the fact that it is put together from various products and parts from partners. In no way is a master entity unique or has a consistency depending on what is important about the entity in a given situation. What MDM provides are definitions and instructions on the right data to use in the right engagement. Context is a key value of MDM. \n When organizations have implemented MDM to create a golden record and single source of truth, domain models are extremely rigid and defined only within a single engagement model for a process or reporting. The challenge is the master entity is global in nature when it should have been localized. This model does not allow enough points of relationship to create the dimensions needed to extend beyond the initial scope. If you want to now extend, you need to rebuild your MDM model. This is essentially starting over or you ignore and build a layer of redundancy and introduce more complexity and management. \n The line: \n The challenge is the master entity is global in nature when it should have been localized. \n stopped me cold. \n What if I said: \n “The challenge is a subject proxy is global in nature when it should have been localized.” \n Would your reaction be the same? \n Shouldn’t subject identity always be local? \n Or perhaps better, have you ever experienced a subject identification that wasn’t local? \n We may talk about a universal notion of subject but even so we are using a localized definition of universal subject. \n If a subject proxy is a container for local identifications, thought to be identifications of the same subject, need we be concerned if it doesn’t claim to be a universal representative for some subject? Or is it sufficient that it is a faithful representative of one or more identifications, thought by some collector to identify the same subject? \n I am leaning towards the latter because it jettisons the doubtful baggage of universality. \n That is a subject may have more than one collection of local identifications (such collections being subject proxies), none of which is the universal representative for that subject. \n Even if we think another collection represents the same subject, merging those collections is a question of your requirements. \n You may not want to collect Twitter comments in Hindi about Glee . \n Your topic map, your requirements, your call. \n PS: You need to read Michele’s original post to discover what could entice management to fund an MDM project. Interoperability of data isn’t it."], "link": "http://tm.durusau.net/?p=32571", "bloglinks": {}, "links": {"http://en.wikipedia.org/": 3, "http://www.information-management.com/blog": 1}, "blogtitle": "Another Word For It"}]