[{"blogurl": "http://www.arsmathematica.net\n", "blogroll": [], "title": "Ars Mathematica"}, {"content": ["Nate Eldridge has written a program, Mathgen , to randomly generate a nonsense math paper. (It’s based on an older program, SCIgen, that generates random computer science papers.) While they don’t make any sense, the Mathgen papers capture the typical style of mathematical writing pretty well. The main quirk that gives it away is that a real math paper would repeat terminology, Mathgen creates new mathematical terms every sentence. (This an inevitable consequence that the algorithm used is context-free.) \n Apparently it doesn’t give it away for everyone, though. A Mathgen-generated paper was submitted to a journal, Advances in Pure Mathematics , where it was accepted with revisions . I’ve never heard of this journal, so I would assume that it’s like the mathematical version of a vanity publisher that makes money from publication fees. But what’s amazing is that the paper was peer reviewed! The suggested revisions are of the form “please make this make sense”, but still, out there somewhere there’s a person who read this paper, and tried to make constructive comments. Who was this person?"], "link": "http://www.arsmathematica.net/archives/2012/10/23/mathgen/", "bloglinks": {}, "links": {"http://thatsmathematics.com/blog": 1, "http://thatsmathematics.com/": 1}, "blogtitle": "Ars Mathematica"}, {"content": ["As probably most of you have heard, Shinichi Mochizuki has announced a proof of the abc conjecture . At some point I decided to stop posting about announcements of solutions to famous unsolved problems, after several high-profile retractions. This time, it’s been long enough to wonder if the proof will hold up. The papers are of daunting technical complexity, so it sounds like it will be some time before we hear the verdict. \n PolyMath has the definitive round-up of links on the abc conjecture and Mochizuki’s work, including this nice expository article from the Notices."], "link": "http://www.arsmathematica.net/archives/2012/10/08/abc-conjecture/", "bloglinks": {}, "links": {"http://michaelnielsen.org/": 1, "http://www.ams.org/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Ars Mathematica"}, {"content": ["I find typing rules in theoretical computer science hard to read, and I just realized that it’s for a completely trivial reason: I subconsiously read “:” as having lower precedence than ⊨ and “,”, which is completely wrong, so I have to concentrate to group everything the right way. \n The only reason I can think of for this is that way back when I learned Pascal, which allows declarations like “ x, y : integer”, which is somewhat like “:” being higher precedence than “:”."], "link": "http://www.arsmathematica.net/archives/2012/09/22/reading-typing-declarations/", "bloglinks": {}, "links": {"http://en.wikipedia.org/": 1}, "blogtitle": "Ars Mathematica"}, {"content": ["This article from the New York Times has a startling statistic: sales of the print edition of the Encyclopedia Britannica have dropped from 120,000 in 1990 to 12,000 today. (The article says 8,000, but a later article says the whole print run of 12,000 sold out.) I knew that Wikipedia had seriously hurt the sales of encyclopedias, but I had no idea it was on the order of 90%. \n When I was a kid, I had the Funk & Wagnalls encyclopedia. (They sold it at the supermarket, one letter at a time.) I remember vividly reading the article on algebra, where it had a big table of axioms, like “the commutative axiom,” and “the associative axiom.” I was fascinated to find out that someone had isolated a list of properties of numbers, and that these properties had names."], "link": "http://www.arsmathematica.net/archives/2012/09/20/end-of-printed-brittanica/", "bloglinks": {}, "links": {"http://mediadecoder.nytimes.com/": 2}, "blogtitle": "Ars Mathematica"}, {"content": ["David Li’s Gaussian copula formula has been called the formula that killed Wall Street, because of how it was used in pricing mortgage-backed securities. \n Sociologists Donald McKenzie and Taylor Spears have a new paper on the history of the Gaussian copula model, based on detailed interviews with quants before and after the crisis. They find that the limitations of the Li model were well understood by financial modelers on Wall Street, and that none of them took the model as literally true. The formula became widely used for institutional reasons outside of the quant community — for example, once the industry had a standard model, then the model could be used in evaluating profit and loss. This is further evidence for the thesis that mathematics is only dangerous when it falls into the wrong hands. \n Cathy O’Neal highlights the parts of the paper that address the questions of institutional politics and blame."], "link": "http://www.arsmathematica.net/archives/2012/06/30/wall-street-killer-formula-exonerated/", "bloglinks": {}, "links": {"http://mathbabe.org/": 1, "http://www.ac.uk/": 1, "http://www.arsmathematica.net/": 1}, "blogtitle": "Ars Mathematica"}, {"content": ["With all of its benefits, there are many difficulties of life that are unique to civilization: traffic, taxes, pollution. Thanks to blogging, I’ve experienced a new one: having your WordPress site hacked. The hosting company shut down the site because it was receiving unusual traffic. Upon further investigation, it turned out the site had been hacked. (Presumably the traffic was from the site being made part of a botnet.) It should now be fixed."], "link": "http://www.arsmathematica.net/archives/2012/05/31/perils-of-modern-living-blogging-edition/", "bloglinks": {}, "links": {}, "blogtitle": "Ars Mathematica"}, {"content": ["I had a question that I was going to ask on Math Overflow, but after some research I managed to find the answer. \n Finite simple groups have a complete classification. I was wondering if there were any weakenings of the axioms of group that also allowed a complete classification of the simple objects. (Here, I mean no nontrivial quotients.) Surprisingly, there’s a classification for semigroups. In the theory of semigropus the term “Simple& is used for a weaker notion. Semigroups with no nontrivial quotients are known as “congruence-free”. The classification of finite congruence-free semigroups splits into two cases: for semigroups with a zero (an element 0 such that 0x = 0 ) there’s an explicit construction, while a congruence-free semigroup without a zero must be a simple group. \n Another direction to generalize is weaken the form of associativity. The most-studied weakening is the Moufang property, which includes the octonions as a non-trivial example. Here, the complete classification is also known: a finite simple Moufang loop is either a group or a Paige loop, which is a non-associative construction closely related to the octonions, but defined over a finite field. It’s interesting that in this case, the one non-associative family resembles simple groups of Lie type, in that it’s parameterized by the finite fields. This classification relies non-trivially on the classification of simple groups, in that the explicit classification is used to rule out any other non-associative examples. \n The paper Octonions, simple Moufang loops and triality by Gábor Nagy and Petr Vojtechovský, explains Moufang loops, and how the classification of non-associative Moufang Loops reduces to a question about finite simple groups."], "link": "http://www.arsmathematica.net/archives/2012/04/25/classification-of-finite-simple-semigroups-and-moufang-loops/", "bloglinks": {}, "links": {"http://en.wikipedia.org/": 2, "http://www.quasigroups.eu/": 1}, "blogtitle": "Ars Mathematica"}, {"content": ["I’ve been trying to learn about stacks, something that is much easier in the Internet age. The Stacks Project is a collaborative textbook that introduces the subject from the ground up, including all of the machinery necessary. The book is already up to 3000(!) pages."], "link": "http://www.arsmathematica.net/archives/2012/03/20/stacks-project/", "bloglinks": {}, "links": {"http://www.columbia.edu/": 1}, "blogtitle": "Ars Mathematica"}, {"content": ["Doing a search for the definition of geometric logic , I have discovered that it’s mentioned in the movie The Caine Mutiny , by the notorious character of Captain Queeg: \n \nAhh, but the strawberries that’s… that’s where I had them. They laughed at me and made jokes but I proved beyond the shadow of a doubt and with… geometric logic… that a duplicate key to the wardroom icebox DID exist, and I’d have produced that key if they hadn’t of pulled the Caine out of action.\n \n The upside of the technique is that it allows you to deduce the existence of real-world objects such as keys. The downside is that it drives you insane. \n (More on the context of the quote here .)"], "link": "http://www.arsmathematica.net/archives/2012/02/20/geometric-logic-at-sea/", "bloglinks": {}, "links": {"http://www.whysanity.net/": 1, "http://ncatlab.org/": 1, "http://www.sheilaomalley.com/": 1}, "blogtitle": "Ars Mathematica"}, {"content": ["MathJax doesn’t work with RSS readers, so when I have some more time I will look into using a plug-in instead. Until then, sorry for filling up your RSS feed with dollar signs. \n Theo Raedschelders has written a nice sketch of Herstein’s commutativity theorem for rings. It is a generalization of Wedderburn’s theorem that a finite division ring must be a field. The theorem states that if for every pair of elements $a$ and $b$ there exists an $n > 1$ (which can depend on $a$ and $b$) such that \n$$ \n(ab – ba)^n = ab – ba, \n$$ \nthen the ring is commutative. What’s surprising about the proof is its indirectness. The proof requires essentially all of Nathan Jacobson’s structure theory for rings. \n PlanetMath has a nice summary of known conditions that imply commutativity."], "link": "http://www.arsmathematica.net/archives/2012/02/17/commutativity-theorems-for-rings/", "bloglinks": {}, "links": {"http://www.noncommutative.org/": 1, "http://planetmath.org/": 1}, "blogtitle": "Ars Mathematica"}]