[{"blogurl": "http://www.ask-cato.com\n", "blogroll": [], "title": "Ask Cato"}, {"content": ["Studies of drugs, biologics or devices that are intended for use in pediatric populations fall under far more stringent guidelines than those intended for use in adults.  The issues with pediatric studies range from informed consent concerns to stricter risk-to-benefit … Continue reading → The post Considerations for the Assessment of Pain in Non-Verbal and Pediatric Subjects appeared first on Ask Cato ."], "link": "http://feedproxy.google.com/~r/AskCato/~3/1OkZI6wFjAw/", "bloglinks": {}, "links": {"http://www.ask-cato.com": 1, "http://www.ask-cato.com/": 2}, "blogtitle": "Ask Cato"}, {"content": ["On 25 September 2012, three lots of steroid injections intended to treat pain were recalled by the pharmaceutical compounding company New England Compounding Center (NECC) in Framingham, MA, because of fungal contamination.  By Thursday, 11 October 2012, 12 people had … Continue reading → The post Meningitis Tragedy Leads to Calls for Increased FDA Oversight appeared first on Ask Cato ."], "link": "http://feedproxy.google.com/~r/AskCato/~3/TcN2NKK_tYM/", "bloglinks": {}, "links": {"http://www.ask-cato.com": 1, "http://www.ask-cato.com/": 2}, "blogtitle": "Ask Cato"}, {"content": ["On 26 September 2012, a notice was published in the Federal Register that the Department of Health and Human Services was transferring responsibility to the FDA for ensuring that clinical trial data is appropriately submitted to Clinical Trial Registry and … Continue reading → The post Clinical Trial Reporting appeared first on Ask Cato ."], "link": "http://feedproxy.google.com/~r/AskCato/~3/LHL8MDkI5uw/", "bloglinks": {}, "links": {"http://www.ask-cato.com": 1, "http://www.ask-cato.com/": 2}, "blogtitle": "Ask Cato"}, {"content": ["There were only a few guidances released by FDA in September 2012: Guidance for Industry: ANDAs: Stability Testing of Drug Substances and Products Final Guidance for Industry: Pre-Storage Leukocyte Reduction of Whole Blood and Blood Components Intended for Transfusion Complicated … Continue reading → The post New FDA Guidances from September 2012 appeared first on Ask Cato ."], "link": "http://feedproxy.google.com/~r/AskCato/~3/aVddsHy6ptk/", "bloglinks": {}, "links": {"http://www.ask-cato.com": 1, "http://www.ask-cato.com/": 2}, "blogtitle": "Ask Cato"}, {"content": ["The FDA is looking to mandate electronic submissions in the next few years. At the same time, they and other regulators are looking to upgrade the eCTD standard. Why would the FDA mandate electronic submissions and change the standard at … Continue reading → The post Updated: Free Educational Webinar – Regulatory Electronic Submissions: eCTD v4 Background and Drivers appeared first on Ask Cato ."], "link": "http://feedproxy.google.com/~r/AskCato/~3/cx5iq3Vl64E/", "bloglinks": {}, "links": {"http://www.ask-cato.com": 1, "http://www.ask-cato.com/": 2}, "blogtitle": "Ask Cato"}, {"content": ["The recently passed FDA Safety and Innovation Act makes major changes to the de novo reclassification process for medical devices.  Namely, the new law mandates that a manufacturer can simply submit a request to the FDA for de novo classification … Continue reading → The post De novo device reclassification: What have you done for me lately? appeared first on Ask Cato ."], "link": "http://feedproxy.google.com/~r/AskCato/~3/8Bufg-aB6LY/", "bloglinks": {}, "links": {"http://www.ask-cato.com": 1, "http://www.ask-cato.com/": 2}, "blogtitle": "Ask Cato"}, {"content": ["It’s been a slow summer at FDA, with only four new guidances issued in the month of August 2012: Draft Guidance for Industry: Self-Identification of Generic Drug Facilities, Sites, and Organizations Draft Guidance for Industry: Self-Identification of Generic Drug Facilities, … Continue reading → The post New Guidances Released by FDA in August 2012 appeared first on Ask Cato ."], "link": "http://feedproxy.google.com/~r/AskCato/~3/VS2lhbQ79uY/", "bloglinks": {}, "links": {"http://www.ask-cato.com": 1, "http://www.ask-cato.com/": 2}, "blogtitle": "Ask Cato"}, {"content": ["The 06 August 2012 announcement by researchers from Boston’s Brigham and Women’s Hospital reporting the identification of a blood biomarker that could lead to earlier diagnoses and perhaps an actual treatment for amyotrophic lateral sclerosis (ALS), or Lou Gehrig’s disease, … Continue reading → The post Biomarkers: Where are We Today? appeared first on Ask Cato ."], "link": "http://feedproxy.google.com/~r/AskCato/~3/JrkNdnXdrJk/", "bloglinks": {}, "links": {"http://www.ask-cato.com": 1, "http://www.ask-cato.com/": 2}, "blogtitle": "Ask Cato"}, {"content": ["On 09 July 2012, the Food and Drug Administration Safety and Innovation Act (FDASIA, otherwise known as PDUFA V) was signed into law.  In a 4-part weekly series, we are covering the major changes in FDASIA as follows: Part 1: … Continue reading → The post FDASIA, Part 4: Drug Supply Chain, Drug Shortages, and Other Provisions appeared first on Ask Cato ."], "link": "http://feedproxy.google.com/~r/AskCato/~3/0g9MNI7hD4M/", "bloglinks": {}, "links": {"http://www.ask-cato.com": 1, "http://www.ask-cato.com/": 2}, "blogtitle": "Ask Cato"}, {"content": ["On 09 July 2012, the Food and Drug Administration Safety and Innovation Act (FDASIA, otherwise known as PDUFA V) was signed into law.  In a 4-part weekly series, we are covering the major changes in FDASIA as follows: Part 1: … Continue reading → The post FDASIA, Part 3: Generating Antibiotic Incentives Now (GAIN) and Drug Approval and Patient Access Changes appeared first on Ask Cato ."], "link": "http://feedproxy.google.com/~r/AskCato/~3/2D7Yp0l7zrc/", "bloglinks": {}, "links": {"http://www.ask-cato.com": 1, "http://www.ask-cato.com/": 2}, "blogtitle": "Ask Cato"}]