[{"blogurl": "http://www.badscience.net\n", "blogroll": [], "title": "Bad Science"}, {"content": ["This morning at 11:30, Dr Sarah Wollaston MP will ask questions in parliament about the ongoing scandal of missing trial data. This is widely recognised as a problem by academics and doctors, but governments, regulators, and journalists have neglected the problem, while industry simply denies it. Watch the questions live here or watch it later here. [...]"], "link": "http://www.badscience.net/2012/10/questions-in-parliament-and-a-briefing-note-on-missing-trials/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["One thing in Bad Pharma has shocked readers more than anything else: the way that vitally important information about trials is withheld from doctors and patients, not just by drug companies, but also by government bodies such NICE and the European Medicines Agency (the body that approves and regulates medicines for the UK). As we [...]"], "link": "http://www.badscience.net/2012/10/great-article-in-trials-on-why-regulators-should-stop-withholding-trial-info-from-doctors-and-patients/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["I did this talk at TEDglobal last year. It’s just hit a million views, and I realised I’ve never posted it online here. Hope you like it! www.ted.com/talks/ben_goldacre_battling_bad_science.html"], "link": "http://www.badscience.net/2012/10/i-did-this-talk-at-tedglobal-last-year-its-quite-fast/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["Briefly: today, several people have asked for my response to this story in the Guardian, celebrating GSK’s promise for more transparency on their trial data.It is always good to hear a drug company making promises, and I hope that GSK will stick by the commitments they have made today. But we should judge drug companies by [...]"], "link": "http://www.badscience.net/2012/10/gsk-have-promised-should-we-trust-them/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["My book Bad Pharma documents serious ongoing problems in the pharmaceutical industry. In particular, I show how vitally important information from clinical trials is still being withheld from doctors and patients, right now, today; and that patients experience avoidable suffering and death as a consequence. There is no nicer way to express that reality, and [...]"], "link": "http://www.badscience.net/2012/10/the-abpi-claims-that-all-the-problems-in-my-book-are-historical-this-claim-is-simply-untrue/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["I did a new talk at TED about drug companies hiding the results of clinical trials, it went up today. This is a huge, ongoing problem, and it results in patients suffering and dying unnecessarily. So I’m really pleased that TED were able to give the story a platform. Video after the click:    That said, [...]"], "link": "http://www.badscience.net/2012/09/i-did-a-talk-at-ted-about-drug-companies-and-hidden-data/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["My new book Bad Pharma is out today. It describes how drug companies harm patients, around the world, by distorting evidence on an industrial scale. More  than that, it shows how doctors, academics, and regulators have all failed to fix these problems. Bad practices have been perpetuated, because the public have not understood the true [...]"], "link": "http://www.badscience.net/2012/09/heres-the-intro-to-my-new-book/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["it is a thing of beauty and power. My advice is to buy one right now, before they all get seized and pulped. In paperback here: amzn.to/N1QJTD And Kindle here: amzn.to/Uhr0p4 Woo!  "], "link": "http://www.badscience.net/2012/09/holy-crap-i-just-touched-my-new-book/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["I’ve spent a lot of time arguing that government should be more evidence based, and that wherever possible, we should do randomised trials to find out which policy intervention works best. We often have no idea whether the things we do in government actually work or not, and achieve their stated goals. This is a [...]"], "link": "http://www.badscience.net/2012/06/heres-a-cabinet-office-paper-i-co-authored-about-randomised-trials-of-government-policies/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["I forgot to post this column up last year. It’s a fun one: the Department for Communities and Local Government have produced a truly farcical piece of evidence, and promoted it very hard, claiming it as good stats. I noticed the column was missing today, because Private Eye have published on the same report in [...]"], "link": "http://www.badscience.net/2012/04/is-this-the-worst-government-statistic-ever-created/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["James Ball sent me the data for the Russian election vote counts this morning and asked me to test whether it deviates from Benford’s law, a test that can give a hint at whether numbers are the product of fraud. Posted below is my analysis, and also a check for last digit preference, which is [...]"], "link": "http://www.badscience.net/2012/03/is-there-statistical-evidence-of-fraud-in-the-russian-election-data/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["Here’s an interesting problem with data analysis in general, and so, by extension, data journalism: you have to be careful about assuming that the numbers you’ve got access to… really do reflect the underlying phenomena you’re trying to investigate. Today’s Guardian has a story, “Antidepressant use in England soars“. It’s much more overstated in the [...]"], "link": "http://www.badscience.net/2011/12/this-guardian-story-is-dodgy-traps-in-data-journalism/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["Briefly: I thought this was a pricing error, but it turns out it’s deliberate, so… My book is £2.49 on Kindle for the next week or so. When it’s this cheap you might as well use it to test the Kindle app on your phone (I’m a massive Kindle dork, it helps me get more [...]"], "link": "http://www.badscience.net/2011/11/bad-science-is-2-49-on-kindle-for-the-next-week/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["Ben Goldacre, The Guardian, Saturday 22 October 2011 This week Baroness Susan Greenfield, Professor of pharmacology at Oxford, apparently announced that computer games are causing dementia in children. This would be very concerning scientific information: but it comes to us from the opening of a new wing at an expensive boarding school, not an academic [...]"], "link": "http://www.badscience.net/2011/11/why-wont-professor-greenfield-publish-this-theory-in-a-scientific-journal/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["Hi, just to say, there’s a great piece in this month’s .net magazine about www.nerdydaytrips.com, the crowd-sourced dorky-days-out Why-Don’t-You project I built with Applecado, Aaron Rudd, and Jo Brodie. Snippet: Tanya Combrinck: Tell us about your ideal kind of day trip. Ben Goldacre: I’m not really interested in guide book stuff, I’m interested in stuff [...]"], "link": "http://www.badscience.net/2011/10/great-piece-in-net-magazine-about-nerdydaytrips-com/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["People often ask if there’s one good book that is accessible to all, about how evidence based medicine works. The answer is undoubtedly “Testing Treatments“. I name-check it to death in Bad Science, I learnt a huge amount from it, and it’s just come out in a new edition. You can (generously!) download the full [...]"], "link": "http://www.badscience.net/2011/10/new-edition-of-testing-treatments-best-lay-text-on-evidence-based-medicine/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["Ben Goldacre, The Guardian, Saturday 10th September 2011 We all like to laugh at quacks when they misuse basic statistics. But what if academics, en masse, deploy errors that are equally foolish? This week Sander Nieuwenhuis and colleagues publish a mighty torpedo in the journal Nature Neuroscience. They’ve identified one direct, stark statistical error that [...]"], "link": "http://www.badscience.net/2011/10/what-if-academics-were-as-dumb-as-quacks-with-statistics/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["As well as being here I’m also there: here’s a quick round-up of recent posts from my other blog where I post scatty, brief scribbles in between bouts of real work, they’re in the sidebar on the right too.: - - How accurate is turnitin? And a brief scribble on plagiarism - This man’s reasoning [...]"], "link": "http://www.badscience.net/2011/09/my-other-blog/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["Ben Goldacre, The Guardian, Saturday 24 September 2011 Last week the Daily Mail and the Today programme took some bait from Aric Sigman, an author of popular sciencey books about the merits of traditional values. “Sending babies and toddlers to daycare could do untold damage to the development of their brains and their future health,” [...]"], "link": "http://www.badscience.net/2011/09/cherry-picking-is-bad-at-least-warn-us-when-you-do-it/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}, {"content": ["Ben Goldacre, The Guardian, Saturday 17 September 2011 This week we might bust an entire nation for handing over dodgy economic statistics. But first: why would they bother? Well, it turns out that whole countries have an interest in distorting their accounts, just like companies and individuals. If you’re an Euro member like Greece, for [...]"], "link": "http://www.badscience.net/2011/09/benfords-law-using-stats-to-bust-an-entire-nation-for-naughtiness/", "bloglinks": {}, "links": {}, "blogtitle": "Bad Science"}]