[{"blogurl": "http://www.bestinfographics.co.uk\n", "blogroll": [], "title": "Best Infographics"}, {"content": ["This is one of the coolest infographics we’ve seen for a while! Love the interactive scrolling effect and the simple way it portrays information. \n \n It would have been easy for the designer to create a static infographic with the same style and information, but the interactive element elevates it to something much more likely to go viral and get the message out. Not only that, but by engaging with the graphic, I feel like I am more likely to remember the data. Great piece. \n From Unruly Media , via AdWeek ."], "link": "http://www.bestinfographics.co.uk/london-olympics-infographics-follow-up/?utm_source=rss&utm_medium=rss&utm_campaign=london-olympics-infographics-follow-up", "bloglinks": {}, "links": {"http://www.adweek.com/": 1, "http://viralvideochart.unrulymedia.com/": 1}, "blogtitle": "Best Infographics"}, {"content": ["As the Olympics draw nearer, the world’s attention is focused on Britain and the upcoming games. Infographics have popped up left and right, ranging from sports statistics to costs, venues and how Londoners can avoid the stress of the games. We start with a related travel infographic and move on to a venue guide, history of the three London games and a look at the controversial cost of the games: \n This infographic travel guide from dealchecker.co.uk is an innovative way to display travel tips, and includes recommendations for the World Alternative Games and the village of Much Wenlock, where the modern Olympics were born… good recommendations for those who want to avoid London this summer. \n \n This useful map visualisation showcases Olympic venues around London and the UK – perfect for those of us going to the games or following along on TV. \n  \n Below is a lovely infographic from an aiport parking company (interesting…) comparing the 2012 London Olympics to the other London games in 1948 and 1908.  Interesting to think about how the world has changed in the interim. \n  \n Finally, Confused.com bring us a financial look at the games , from the ballooning budget to consumer spending and potential legacy."], "link": "http://www.bestinfographics.co.uk/london-olympics-infographics/?utm_source=rss&utm_medium=rss&utm_campaign=london-olympics-infographics", "bloglinks": {}, "links": {"http://www.co.uk/blog": 2, "http://city.visualinformation.info/": 1, "http://www.graphicnews.com/": 1, "http://blog.co.uk/": 1, "http://www.visualinformation.info/": 2, "http://www.co.uk/": 1, "http://i.imgur.com/": 1}, "blogtitle": "Best Infographics"}, {"content": ["These cool infographics may not be “infographics” in the strictest sense of the word (open for debate of course), but these simple and creative data visualizations from LEGO display information in a unique way, and are great pieces of design – see if you can guess which characters are displayed in these wonderful ads! \n \n \n \n \n Ads by the Jung von Matt agency, all images from Apartment Therapy ."], "link": "http://www.bestinfographics.co.uk/minimalist-lego-ads/?utm_source=rss&utm_medium=rss&utm_campaign=minimalist-lego-ads", "bloglinks": {}, "links": {"http://www.apartmenttherapy.com/": 1, "http://www.jvm.com/": 1}, "blogtitle": "Best Infographics"}, {"content": ["Have you ever wondered what kind of people make Android applications? Well wonder no more! This new infographic from StartApp explores everything from the companies Android developers work for to the music they listen to and everything in between. \n \n Source: StartApp"], "link": "http://www.bestinfographics.co.uk/following-the-white-rabbit-infographic/?utm_source=rss&utm_medium=rss&utm_campaign=following-the-white-rabbit-infographic", "bloglinks": {}, "links": {"http://www.startapp.com/": 2}, "blogtitle": "Best Infographics"}, {"content": ["This new infographic from Bit9 explains the real life issues with securing a company’s technology and intellectual property. Read through the infographic to find out who you should be looking out for and how to best protect yourself. \n \n Source: Bit9"], "link": "http://www.bestinfographics.co.uk/cyber-security-infographic/?utm_source=rss&utm_medium=rss&utm_campaign=cyber-security-infographic", "bloglinks": {}, "links": {"http://www.bit9.com/": 2}, "blogtitle": "Best Infographics"}, {"content": ["The heart is a sensitive organ, and once it goes out on you, it’s hard to bring it back. AED.com ’s latest infographic tells the truth about sudden cardiac arrest, exploring what it is, why it happens, and what you can do to prevent it. \n \n Source: AED.com"], "link": "http://www.bestinfographics.co.uk/what-you-dont-know-will-kill-you-infographic/?utm_source=rss&utm_medium=rss&utm_campaign=what-you-dont-know-will-kill-you-infographic", "bloglinks": {}, "links": {"http://AED.com": 1, "http://www.aed.com/": 1}, "blogtitle": "Best Infographics"}, {"content": ["You’ve probably heard of some popular brain hacks that are supposed to make your life easier and more efficient. One’s like only needing two hours of sleep, or ones that are supposed to keep you energized all day. This new infographic from Become Career takes it to a new level by focusing on the issues we really need to hack: the seven deadly sins. \n \n Source: Become Career"], "link": "http://www.bestinfographics.co.uk/brain-hack-the-seven-deadly-sins-infographic/?utm_source=rss&utm_medium=rss&utm_campaign=brain-hack-the-seven-deadly-sins-infographic", "bloglinks": {}, "links": {"http://www.becomecareer.com/": 2}, "blogtitle": "Best Infographics"}, {"content": ["Late night poker watchers and weekly players will greatly appreciate this. Casino.org’s latest infographic compares and contrasts each method of playing, whether you go old fashioned or play through your online avatar. \n  \n Source: Casino.org"], "link": "http://www.bestinfographics.co.uk/poker-wild-west-vs-online-infographic/?utm_source=rss&utm_medium=rss&utm_campaign=poker-wild-west-vs-online-infographic", "bloglinks": {}, "links": {"http://www.casino.org/": 2, "http://www.casino.org/blog": 1}, "blogtitle": "Best Infographics"}, {"content": ["Bring-Your-Own-Device (BYOD) is the one topic that has remained top of mind for everyone in IT this year. For some it equals freedom, for some it is a nightmare waiting to happen. This new infographic from Xigo explores the numbers behind BYOD and how best to manage it. \n \n Source: Xigo"], "link": "http://www.bestinfographics.co.uk/the-real-cost-of-byod-infographic/?utm_source=rss&utm_medium=rss&utm_campaign=the-real-cost-of-byod-infographic", "bloglinks": {}, "links": {"http://www.xigo.com/": 2}, "blogtitle": "Best Infographics"}, {"content": ["There had been a rise in companies and organizations that utilize crowdsourcing and top reasons why your business needs crowd power."], "link": "http://www.bestinfographics.co.uk/the-rise-in-crowd-powered-business-infographic/?utm_source=rss&utm_medium=rss&utm_campaign=the-rise-in-crowd-powered-business-infographic", "bloglinks": {}, "links": {"http://DesignContest.com/": 1}, "blogtitle": "Best Infographics"}]