[{"blogurl": "http://blog.fejes.ca\n", "blogroll": [], "title": "blog.fejes.ca"}, {"content": ["There’s been a lot of drama in my life in the past year, but now I’m pretty much just focussed on getting out of Denmark and starting over.  Thankfully, it’s only another 37 days.  I think I can make it. \n In the meantime, if you’re in Denmark and need anything, I’m selling lamps, a tv, a vacuum cleaner, some furniture and a couple other items. \n You can find my ad (in Danish) here:  http://www.dba.dk/flytte-salg-lamper-tv/id-87182028/"], "link": "http://blog.fejes.ca/?p=2263", "bloglinks": {}, "links": {"http://www.dba.dk/": 1}, "blogtitle": "blog.fejes.ca"}, {"content": ["I’m going to hold off writing anything for a while, until I know what my immediate future holds for me, but I don’t mind sharing a bit of information:  There’s an open position for an assistant professor at the University of Calgary in Bioinformatics. \n The posting was sent to me, and for a brief moment, I actually considered applying.  Then I remembered that my family isn’t really interested in living in Calgary, and that I probably wouldn’t be too happy as an academic.  eh, fleeting fantasy. \n Anyhow, for anyone who is in the field, and who might be interested in applying, here’s the PDF:  https://www.ucalgary.ca/bmb/files/bmb/UofC-BMB-BioInformaticsPosition.pdf \n A brief excerpt from the description: \n The successful candidate will join a multidisciplinary and inter-Faculty team of bioinformaticians,geneticists and molecular biologists studying model organisms to human disease. The positionprovides 75% of time protected for research, and will include expectations to contribute to teaching and graduate student supervision. This is an excellent opportunity to develop a vigorous and independent externally-funded research program within a dynamic and collaborative environment. A competitive salary and an attractive start-up package are available. The candidate will be expected to apply for extramural support from national/provincial agencies to sustain their research program."], "link": "http://blog.fejes.ca/?p=2260", "bloglinks": {}, "links": {"https://www.ucalgary.ca/": 1}, "blogtitle": "blog.fejes.ca"}, {"content": ["I’m sure, if you read my blog, that you’ve noticed a conspicuous absence of posts lately.  There were two main reasons for the “gap”. \n The first is that I haven’t been blogging about bioinformatics because I didn’t want to blur my work with my blog.  It’s a challenging line to walk, and maintaining it requires a lot of late evenings, which have lately been sucked up by my daughter.  Only in the past week has that time started to be available again. (Thank goodness my daughter is sleeping well, finally!) \n The second is that my family has been making some big decisions.  The biggest of the bunch is that we’ll be returning to North America.  Denmark hasn’t worked out for us, and this is really the only logical decision we could make.  Our original timeline was for three years in Denmark, but we’ll be cutting it down to one year. \n Yes, that does mean I’m officially looking for a new job for the start of 2013, either in Vancouver or San Francisco – the two places that my family would be happiest.  If anyone knows of a company looking to hire a bioinformatician with experience in Next-gen sequencing in either of those cities, please let me know!  As I’ve discussed with my employer, I’ll be working in Denmark until the end of the year, but will be available in January. \n For the moment, I’m making arrangements to do a post-doc, but I’m not sure that’s really a step forward for my career. \n As for why things haven’t worked out here, I think it’s a combination of a lot of factors, but most obvious is that Denmark is really a hard country to find your way in.  The language is challenging, and with a young child, we haven’t been able to dedicate the time to the intensive language classes that are available, and we also haven’t been able to really find a social network that comes close to replacing the ones we’d left behind in Canada.  With our closest family members being a minimum of 18 hours away by plane, this just isn’t working well for us given that we have a young child. \n Of course, there are other factors, ranging from the trivial (and silly) to complex, which include (in no particular order): \n \n Accessibility (it’s much harder to get around in Denmark with a young child, compared to North America, particularly since Canadians can not get a driver’s licence here) \n Availability (We’re forced to order from UK or further away to buy many of the products we need/want for our child because they’re just not available in Denmark.) \n Comfort issues (Denmark doesn’t believe in bathtubs, for instance, and I haven’t had a shower in Denmark that didn’t involve either frozen toes or scalding blasts of hot water since arriving), \n Pets health (still haven’t found a replacement food for the cat after searching for half a year) \n Community (Everything shuts down on Sundays, which is devastating when you’re living in a “small” town and only have a handful of friends.) \n \n All in all, however, I think these are simply things we take for granted in North America, and  a year in Denmark has been an expensive education in recognizing how differently Europeans and North Americans see the world. \n Thus, I’ll be returning to North America with a lot more life experience and hoping that someone out there will want to put it to good use."], "link": "http://blog.fejes.ca/?p=2250", "bloglinks": {}, "links": {}, "blogtitle": "blog.fejes.ca"}, {"content": ["Just came across this article on parental leave in Sweden.  After experiencing the Danish version, I figured I’d just post this to contrast how one Scandinavian country differs from another:   For Paternity Leave, Sweden Asks if Two Months is Enough ."], "link": "http://blog.fejes.ca/?p=2247", "bloglinks": {}, "links": {"http://online.wsj.com/": 1}, "blogtitle": "blog.fejes.ca"}, {"content": ["A friend of mine asked me to distribute this.  It’s been a while since I’ve posted anything bioinformatics related, but if you’re looking for a bioinformatics post doc position in a beautiful location, this one sounds pretty good.  Yes, I used my danish keyboard to obfuscate the email address… shouldn’t be too hard to figure out, for those who aspire to be post docs. (-; \n ——– \n Garmire Group (starting 09/01/2012 or later) \n University of Hawaii Cancer Research Center \n Job description: Located on the beautiful sea shore of Honolulu, Hawaii, overlooking the Pacific Ocean, the University of Hawaii Cancer Center (UHCC) is one of only 66 research organizations in the country designated by the National Cancer Institute. Its mission is to focus on key cancers that impact the multi-ethic population of Hawaii, as well as worldwide. Home to some of the nation’s leading cancer experts, UHCC is ambitiously recruiting more new talents to work collaboratively towards international excellence: developing new strategies for discovery, driving findings into clinical practice and delivering the optimal outcome when a patient is faced with the prospect of treatment and recovery. \n Projects available in the bioinformatics/genomics group, include but are not limited to (1) Integrative analysis with next-generation sequence etc. to decipher the regulatory role of microRNAs genome-wide. (2) microRNA biomarker discovery in various cancers using next-generation sequence data, microarray data, and survival data etc. (3) GWAS study of DNA methylation given different nutritional statuses. (4) Characterization and comparative genomics of long-intergenic non-coding RNAs with next-generation sequencing data etc. (5) developing sensitive structural variation detection algorithm(s) in targeted deep sequencing technology applied to cancer samples. \n Requirements: \n \n PhD degree in bioinformatics, bioengineering, biostatistics, (bio)physics, electrical engineering, or computer science. \n Strong independent research capabilities with high profile, first-author publications \n Experience with high-throughput data processing using next generation sequencing, microarray etc. \n Proficient with Linux/Unix environment \n Advanced experience in two or more programming languages: perl, R, matlab, C, C++, Java \n Familiar with machine learning and data mining methods \n Experience with collaborations with experimental biologists \n Experience with high-performance computing is a plus \n \n Salaries are competitive depending on qualification and experience. If interested, please send your CV and contact information of three references to lgarmire åt gmail døt com"], "link": "http://blog.fejes.ca/?p=2237", "bloglinks": {}, "links": {}, "blogtitle": "blog.fejes.ca"}, {"content": ["I thought I’d share two pictures from the other day.  They’re far from good, as I took them on my phone, but they’re interesting.  We’d been having on and off rain, some of which has been positively torrential. \n \n \n Both pictures were taken from my balcony – and you can see the rain coming. \n I can’t say that I’m enjoying the Danish summer, really.  It’s either cold, rainy or both, for the most part.  In defence of Danish summers, though, I’ve been told that this is the coldest one in the past 20 years, so that might explain my rather unenthusiastic attitude.  Frankly, the best part of it is that only every 2nd day is windy."], "link": "http://blog.fejes.ca/?p=2234", "bloglinks": {}, "links": {}, "blogtitle": "blog.fejes.ca"}, {"content": ["Walking the dog this morning, I remembered another subject I wanted to blog about: Accessibility.  It’s something that the Danes appear to be absolutely incompetent about.  I haven’t figured out if it’s because they genuinely don’t realize that it’s an issue, or if they just don’t care. \n \n You’re probably wondering why there’s a picture of my dog on a random sidewalk in this post.  Well, the dog’s in the picture just because I figured it would be an even more boring picture without the dog… but if you can get past that, this picture is relevant for a number of reasons. \n The first reason is that it shows a typical danish sidewalk, composed of blocks of concrete, with a line of cobblestones down the center.  This particular example of sidewalk is relatively new, and looks pretty flat, but overall, most sidewalks aren’t.  The concrete has sharp lips everywhere, the cobblestones stick up and are tripping hazards, and the shoulders are often uneven.  For anyone with difficulties walking, these sidewalks are probably a serious challenge to navigate.  Even worse, many of the walking areas of the city are composed entirely of (highly irregular) cobblestones – which is probably impossible for wheelchair bound people. \n Personally, I really notice it with the pram/stroller/baby buggy, as it’s just about impossible to walk some of the streets.  But, I opted to buy a small stroller, while most Danes buy $1000 strollers with off-road, all-terrain wheels with proper suspensions. \n The second reason why that picture is important is that I have seen someone in a wheelchair try to navigate the corner at the end of the block, where the concrete blocks disappear and switch entirely to cobblestone.  Unfortunately, the small wheels at the front of the chair got stuck in the cobblestones…  Three times.  It was horribly unpleasant to watch, particularly knowing that it will probably happen at every intersection. \n The third reason is that the picture is important is that it also shows some construction.  The entire street and sidewalk at the end of the block was ripped up last week, and has since been redone in it’s entirety.  Previously, cars were able to cross the intersection where the red signs are, but that’s now been altered, forcing cars to turn right at the cross road.  Incidentally, this road is one of the main roads in Aarhus – the inner ring road. \n That has my final two points relevant to this topic: both of which speak volumes about how the Danes perceive their environment: \n I can no longer cross the intersection here with the stroller, meaning I have to walk around to the nearest lights.  That may have been their intention, but considering that there’s a Netto right across the street, this intersection sees a *lot* of foot traffic, some of which has moved along to the new intersection where there are lights.  However, with the new right turn in place, cars are now doing U-turns in batches at the next intersection, which has made crossing there much less safe as well.  Overall, they’ve done very little to improve the safety. \n And the final point – they’ve done nothing to improve accessibility, despite completely tearing up the intersection and the sidewalks.  They haven’t bothered to lower curbs for wheelchairs or to improve the intersection for non-foot traffic.  Instead of an accessible curb, they put in a 20cm wide gob of asphalt as a mini-ramp, which I can assure you is impossible to use with a stroller, because the angle is so steep anyhow.  I can guarantee that if a stroller can’t get up some of these curbs, someone in a wheelchair will struggle just as badly. \n So, it seems to me that accessibility is just not even on the radar in Aarhus. It’s a shame – it’s a pretty town, and I’ve even discovered that cruise ships dock here, but they’re making life difficult for their own citizens and throwing away tourism dollars as people with young children or disabilities will struggle to navigate the streets.  What a shame."], "link": "http://blog.fejes.ca/?p=2228", "bloglinks": {}, "links": {}, "blogtitle": "blog.fejes.ca"}, {"content": ["One of the more interesting things about living in a foreign country is that you have an opportunity to gain a new perspective on your environment.  Living outside your comfort zone either drives you nuts, or into a completely new way of looking at things.  That is, you adapt or you run. \n In the first few months, you spend so much of your time just trying to get your bearings that you don’t really see past the challenges.  Learning a new language, figuring out how the bank works, dealing with the little details of life.  All of that occupies all of your brain power. \n Somewhere along the line, you start to see past the frustrations and start to get into a routine.  You know what to buy at the store, how to take the bus and maybe know a few of the customs – what to say and what not to say to your colleagues. \n Eventually, you start to gain an understanding of the people… well, maybe not, but you get a sense of what’s important to them – and you can contrast that with what’s important to you: finally, a sense of perspective. \n Most curiously, after all this time, what I find interesting, at this phase of insight, is that Danes don’t share the same sense of progress as North Americans.  The goal of “getting ahead” just doesn’t seem to be a driving force.  In Canada, we spend a lot of time saving up for retirement, planning our future, looking for ways to get ahead in our respective careers and all that jazz.  In Denmark, people are happy with where they are, they look for a comfortable job, a nice (ridiculously expensive) car, and probably 3 kids. \n Most likely it’s because income equality is so flat – you’re not going to make a whole lot more by climbing the corporate ladder (unless you’re really high up in the company, I suspect). \n And there’s nothing wrong with that – it’s just different. It leads to a workforce that works well together – and has surprisingly few of the “office politics” you see in North America.  Teams really ARE teams.  But when discussing the future, it’s very likely that Danes just don’t understand what it is that’s driving the foreigners. Truly, a case of “lost in translation”. \n Then there’s the whole Jante law (http://en.wikipedia.org/wiki/Law_of_Jante) thing, which factors into it… but that’s another discussion for another day. \n Anyhow, I’m sure there are many further insights coming.  Being able to work out the local newspaper – and slowly understanding a bit of what my colleagues are saying is helping out a lot in understanding Danes…  but it’s a slow, frustrating process.  A few more months, and maybe I’ll finally understand what makes people here tick."], "link": "http://blog.fejes.ca/?p=2225", "bloglinks": {}, "links": {}, "blogtitle": "blog.fejes.ca"}, {"content": ["One of those little things you take for granted in Canada: You can use ATMs to do most of your banking.  Apparently, in Denmark (at least, at my bank), ATMs are for withdrawals only.  I had to go into the bank and tell them that I couldn’t figure out how to do a deposit.  The response: \n “No, of course not.  You can’t do deposits on an ATM.  It is a something we are working on and should have in place soon!” \n It’s been a LONG time since I’ve had to go up to the counter to put money into my account.  In fact, the last time was when I was around 10 years old, after the bank had written several letters to me telling me to stop putting coins into the ATM. (Oh, the things we do as children.) \n Visiting the bank, yesterday, I felt just like I had just come back from collecting money from the people on my paper route – minus the fact I didn’t have to tell them how many coins were in the envelope."], "link": "http://blog.fejes.ca/?p=2220", "bloglinks": {}, "links": {}, "blogtitle": "blog.fejes.ca"}, {"content": ["I’ve finally found something that Danes do vastly better than Canadians: dentistry.  We went to have our teeth cleaned and a routine checkup at the dentist today and, despite fearing the worst, were entirely surprised by the whole deal.  The checkup was faster, the cleaning was less painful, and the Dentist was quite friendly.  (Actually, I really like our Canadian Dentist too, but that’s beside the point.)  Surprisingly, the checkup here was cheaper than we would have paid in Canada. (Although in Canada, dentistry is usually covered by an extended insurance plan and so the net result would be that it’s almost free…. but I’m talking about the total cost of the visit.) \n At any rate, an experience that I completely expected to be a disaster turned out for the better – which is pretty awesome.  I could use a few more experiences like that!"], "link": "http://blog.fejes.ca/?p=2218", "bloglinks": {}, "links": {}, "blogtitle": "blog.fejes.ca"}]