[{"blogurl": "http://blogstats.wordpress.com\n", "blogroll": [], "title": "Blog about Stats"}, {"content": ["Some speak of animated Gif’s revival ( Mashable dedicates a whole page to animated Gifs), others are still horrified … \n Click me if I do not dance \n But there are cool ones, worth to survive. This one telling a story at the supermarket we all know: \n  Source: http://i.imgur.com/yU7bA.gif , \n Or the so-called Cinemagraphs,  sometimes surprising the viewer: \n  \n Statistics are not top clients of visualizations via animated gifs. But there are discussions to test these to avoid problems in displaying Flash or SVG. \n NB: Header from http://cinemagraphs.com/nyfw / \n Filed under: 031 Data visualization"], "link": "http://blogstats.wordpress.com/2012/10/20/25-years-of-animated-gifs/", "bloglinks": {}, "links": {"http://mashable.com/": 1, "http://feeds.wordpress.com/": 1, "http://cinemagraphs.com/": 2, "http://i.imgur.com/": 2, "http://blogstats.wordpress.com/": 3}, "blogtitle": "Blog about Stats"}, {"content": ["The Bo Sundgren Award of the International Marketing and Output Database Conference IMAODBC 2012 in Pruhonice near Prag goes to Alain Nadeau  from the  Swiss Federal Statistical Office FSO . \n In his contribution Alain showed how the renovation of the FSO website can go together with a more open data-oriented publishing. This by separating the three layers of the application. \n  \n One of the databases in the data layer is planned to be in the linked open data format, the 5star format described by Tim Berners-Lee. A prototype is under way and first experiences will show up beginning 2013. \n  \n . \n Semantic Web, RDF and APIs \n This is one, ambitious RDF-based way providing open data. It’s not the only one because data can also be offered i.e. via specific APIs. Such an API has been developped at FSO. It uses data from PX-Cubes and displays HTML-tables  (for the moment only internal access to the API). \n . \n The presentation \n See the full presentation here . \n  \n Filed under: 023 Semantic Web , 037 Open data initiatives , IMAODBC Tagged: API , Bo Sundgren Award , Linked open data , PX-Cube"], "link": "http://blogstats.wordpress.com/2012/10/15/imaodbc-2012-and-the-winner-is/", "bloglinks": {}, "links": {"http://blogstats.wordpress.com/": 10, "http://feeds.wordpress.com/": 1, "http://www.admin.ch/": 1, "https://www.box.com/": 2}, "blogtitle": "Blog about Stats"}, {"content": ["Curious about abbreviations? Here’s (a new) one: Linked Open Government Statistical Data LOGSD. \n LOGSD are statistical data official statistics agencies provide in a LOD format for reuse. And such reuse may combine (mash up) statistical LOD with other sources in the LOD Cloud . \n For example: ONS \n The Office of National Statistics  ONS and others in UK are very active in this field . So for better accessing geographical metadata which are essential in presenting statistics: \n ‘The solution is to use  data.gov.uk  as a single access point for discovery of geographic data, and to link from there to a geoportal (that is currently in development) where users could download the geographic products online. This goes most of the way to delivering the tools that users need to work with statistical data but there is also an opportunity to go further and provide geographic data as linked data, using the  GSS codes  that uniquely identify each geography to link the attributes from the different geographic products. Now, instead of a 9 character GSS identifier, each geography is given a URI that allows it to not only be uniquely identified but also makes it available online. We therefore end up with identifiers such as  http://statistics.data.gov.uk/id/statistical-geography/E05008305  that only require users to change the GSS code at the end to get to the geographic information that they need.’ http://data.gov.uk/blog/update-from-ons-on-data-interoperability-0 \n Explain-a-LOD \n And here an example how LOD and statistical (not yet LOGSD) data could work together. It’s an experimental proof of concept using data from Mercer quality of living survey and Transparency International, enriching these data with more information from DBpedia and calculating correlations that lead to hypotheses about the data. \n Heiko Paulheim from Technische Universität Darmstadt made this interesting experiment which illustrates how linking data works. Abstract of Paulheim’s study “ Generating Possible Interpretations for Statistics from Linked Open Data’  : \n Statistics are very present in our daily lives. Every day, new statistics are published, showing the perceived quality of living in different cities, the corruption index of different countries, and so on. Interpreting those statistics, on the other hand, is a difficult task. Often, statistics collect only very few attributes, and it is difficult to come up with hypotheses that explain, e.g., why the perceived quality of living in one city is higher than in another. In this paper, we introduce Explain-a-LOD, an approach which uses data from Linked Open Data for generating hypotheses that explain statistics. We show an implemented prototype and compare different approaches for generating hypotheses by analyzing the perceived quality of those hypotheses in a user study.’ \n  \n Filed under: 023 Semantic Web , 037 Open data initiatives , 09 Stat.Office / Organization , United Kingdom Tagged: Linked open data , linked open government data , LOD"], "link": "http://blogstats.wordpress.com/2012/09/17/logsd/", "bloglinks": {}, "links": {"http://data.gov.uk/blog": 1, "http://statistics.gov.uk/": 1, "http://data.gov.uk/": 2, "http://blogstats.wordpress.com/": 8, "http://richard.cyganiak.de/": 1, "http://www.gov.uk/": 1, "http://feeds.wordpress.com/": 1, "http://www.tu-darmstadt.de/": 1}, "blogtitle": "Blog about Stats"}, {"content": ["What’s the impact of Social Media? The answer lies in the different strategies of the two candidates for the US Presidency. An interesting infographic! \n Source:  http://www.ethority.de/weblog/2012/09/03/social-media-duell-romney-vs-obama/ \n  \n Filed under: 020 Social Web 2.0 Tagged: social media , USA"], "link": "http://blogstats.wordpress.com/2012/09/11/social-media-strategies/", "bloglinks": {}, "links": {"http://blogstats.wordpress.com/": 3, "http://feeds.wordpress.com/": 1, "http://www.ethority.de/": 2}, "blogtitle": "Blog about Stats"}, {"content": ["London based WWW Foundation has a mission: \n ‘We seek to establish the open Web as a global public good and a basic right, ensuring that everyone can access and use it freely. \n The World Wide Web Foundation was established in 2009 by Web inventor Sir Tim Berners-Lee to tackle the fundamental obstacles to realizing his vision of an open Web available, usable, and valuable for everyone. \n The Web is the most powerful tool for communication in the history of humanity, creating the potential for all people to participate in building a more peaceful and equitable world. \n However, only a small minority of people – mainly urban, male, and affluent – are part of the Web’s global conversation. Despite the recent surge in mobile internet access, nearly two-thirds of the world’s people (mostly in the developing world) are still not connected at all. And once connected, what people are able to do on and with the Web is increasingly threatened by government controls, as well as by certain commercial practices.’ \n Web Index \n And WWW Foundation studies the impact of the Web now yearly with the means of the so-called Web Index ‘: ‘The Web Index is the world’s first multi-dimensional measure of the Web’s use, utility and impact on people and nations’. \n And Sweden is top! \n Methodology:  What about Webfoundation’s Survey, Q1 to Q9? \n And: How to measure the progression of APPs and their role in everyone’s access to free online information? \n   \n Filed under: 01 New on the Web , 030 User orientation Tagged: Berners-Lee , Web Index , WWW Foundation"], "link": "http://blogstats.wordpress.com/2012/09/06/www-foundation-what-are-they-doing/", "bloglinks": {}, "links": {"http://blogstats.wordpress.com/": 5, "http://feeds.wordpress.com/": 1, "http://www.webfoundation.org/": 1, "http://thewebindex.org/": 2}, "blogtitle": "Blog about Stats"}, {"content": ["Diagrams, maps, infographs allow fast insights in sometimes complex data. \n There are myriads of visualisation sites .. and some aggregators to be mentioned. Here are some of my favourites (yours?): \n  \n World Bank’s visualisations specialize in poverty: \n  \n . \n Every week owni.fr \n gives fascinating examples of visualisations, in French and other languages: \n    \n  \n   \n . \n And not to forget Pinterest \n where The Next Web curates an infographic selection: \n  \n . \n And this: blogstats published 205 visualisation posts since September 17, 2006, \n mostly focused on statistics (no guarantee that all the links still work . \n  \n   \n Filed under: 031 Data visualization , 071 Hint Tagged: visualization"], "link": "http://blogstats.wordpress.com/2012/09/02/the-visualisation-universe/", "bloglinks": {}, "links": {"http://www.torre.nl/": 2, "http://feeds.wordpress.com/": 1, "http://pinterest.com/": 1, "http://worldbank.tumblr.com/": 1, "http://owni.fr/": 2, "http://blogstats.wordpress.com/": 6}, "blogtitle": "Blog about Stats"}, {"content": ["Not sure everybody has seen this already, but I guess the Australian Census Bureau has clearly shown that it can’t get any sexier than this with regard to the Census: \n \n Seriously I am all for Edward Tufte but Dataviz has the Wow Factor and although this is a PR clip I am tempted to believe that real people were indeed flushed with excitement when looking at these projections. \n And for all the the sceptical people out there, have a look at the Census Explorer to interactively compare data from the 2011 Australian Census. \n I am envious. \n Filed under: 01 New on the Web , 031 Data visualization , 04 Marketing , Australia Tagged: video , youtube"], "link": "http://blogstats.wordpress.com/2012/08/19/the-wow-factor/", "bloglinks": {}, "links": {"http://www.com.au/": 1, "http://feeds.wordpress.com/": 1, "http://blogstats.wordpress.com/": 6}, "blogtitle": "Blog about Stats"}, {"content": ["‘The International Year of Statistics (“Statistics2013″) is a worldwide celebration and recognition of the contributions of statistical science. Through the combined energies of organizations worldwide, Statistics2013 will promote the importance of Statistics to the broader scientific community, business and government data users, the media, policy makers, employers, students, and the general public. \n The goals of Statistics2013 include: \n \n increasing public awareness of the power and impact of Statistics on all aspects of society; \n nurturing Statistics as a profession, especially among young people; and \n promoting creativity and development in the sciences of Probability and Statistics.’ \n \n The International Year of Statistics Steering Committee \n Richard Emsley, University of Manchester, International Biometric Society representative \n Adam Jakubowski, Nicolaus Copernicus University, ISI/Bernoulli Society representative \n Denise Lievesley, Kings College London, Royal Statistical Society representative \n David Madigan, Columbia University, Institute of Mathematical Statistics representative \n Vijay Nair, University of Michigan, International Statistical Institute representative \n Sastry Pantula, North Carolina State University, American Statistical Association representative \n Ada van Krimpen, International Statistical Institute \n Ron Wasserstein, American Statistical Association \n http://statistics2013.org/ \n Filed under: 09 Stat.Office / Organization Tagged: Interrnational Year of Statistics"], "link": "http://blogstats.wordpress.com/2012/08/16/statistics-in-focus-2/", "bloglinks": {}, "links": {"http://statistics2013.org/": 2, "http://blogstats.wordpress.com/": 2, "http://feeds.wordpress.com/": 1}, "blogtitle": "Blog about Stats"}, {"content": ["The more Apps emerge in their specific stores (or silos like Apples App Store, Google Play etc) the more the discussion about the role of Apps gets intensified. Are Apps the beginning of the end of the (idea of the) Web where information flows freely (really)? \n ‘The essential property of the World Wide Web is its universality. The power of a hypertext link is that “anything can link to anything.” Web technology, therefore, must not discriminate between the scribbled draft and the polished performance, between commercial and academic information, or among cultures, languages, media and so on.’ \nThis is the statement given in one of the most cited articles in Scientific American May 2001: ‘The Semantic Web. A new form of Web content that is meaningful to computers will unleash a revolution of new possibilities’ by TIM BERNERS-LEE, JAMES HENDLER and ORA LASSILA \n For institutions having a mission to disseminating content (and official statistics do so) the above question is of vital interest! \n Love Thy Data \n Ore Lassila from Nokia and W3C focuses on this topic in a presentation he gave at a conference in Helsinki, Finland 10-14.6.2012 ( CIDOC2012 – Enriching Cultural Heritage) \n From the abstract of this presentation   ‘Love Thy  Data  (or: Apps Considered Harmful)’ \n ‘When it comes to information systems for end users,  current fascination is with  ”apps”. … we argue that entire  idea of an “app” is broken, and  not something we should aspire to. Apps tend to “lock” data away from other systems to  use, and by doing so contribute to the fragmentation of the overall information space. Instead, we should understand that apps come and go,  but data has longevity and should be the focus of our attention. Most importantly, we should keep in mind that sharing data can lead  to serendipitous reuse.’ \n Lassila doesn’t stop here and does more than propagating the Classic Web as standard against Apps. He goes a step further and makes the Semantic Web the standard for open data: \n ‘The Semantic Web is seen as a set of technologies that can address the above problems and  lead us towards a future where  we don’t isolate individual sets of data from others  (and from other uses). Considering the richness of human culture, and particularly the cultural differences between different communities and domains of discourse, Semantic  Web is probably our best bet in achieving broad reuse of data.’ \n Key messages \n Here are the most important slides of his presentation: \n  \n . \n  \n . \n  \n . \n . \n By the way: Here’s the Article from Scientific American \n  \n http://www.scientificamerican.com/article.cfm?id=the-semantic-web \n The Semantic Web. A new form of Web content that is meaningful to computers will unleash a revolution of new possibilities’ by TIM BERNERS-LEE, JAMES HENDLER and ORA LASSILA \n or Google it \n Filed under: 023 Semantic Web , 037 Open data initiatives Tagged: App , Lassila"], "link": "http://blogstats.wordpress.com/2012/08/13/to-app-or-not-to-app/", "bloglinks": {}, "links": {"http://www.cidoc2012.fi": 1, "http://blogstats.wordpress.com/": 9, "http://www.cidoc2012.fi/": 2, "http://feeds.wordpress.com/": 1, "http://www.scientificamerican.com/": 1}, "blogtitle": "Blog about Stats"}, {"content": ["The OECD Statistics Directorate released the “Model Survey Questionnaire on Measuring Trust in Official Statistics”. The OECD Newsletter July 2012 explains all the details (www.oecd.org/ \ndataoecd/10/15/50021100.pdf). \n The model describing which elements determine trust in statistics is  the following: \n  \n The questionnaire to measure trust in official statistics is split into 6 modules \n  \n \n \n Filed under: 09 Stat.Office / Organization Tagged: survey"], "link": "http://blogstats.wordpress.com/2012/08/10/statistics-in-focus-1/", "bloglinks": {}, "links": {"http://blogstats.wordpress.com/": 4, "http://feeds.wordpress.com/": 1, "http://www.oecd.org/": 3}, "blogtitle": "Blog about Stats"}]