[{"blogurl": "http://botthoughts.wordpress.com\n", "blogroll": [], "title": "Bot Thoughts"}, {"content": ["I figured out a decent way to run knitr reports on different data sets easily. For my example instead of loading a new data set in each report I just use a different random number seed and print out some data. You’ll need the brew and knitr packages installed. \n First you’ll need to generate your generic template report using ‘brew’ syntax. I have the following saved in a file called “template.Rnw”. Typically brew files are stored with a .brew file extension but that was causing RStudio to freak out and I didn’t get the nice knitr syntax highlighting so I went with a .Rnw extension. \n \n\\documentclass{article}\n\\begin{document}\n\n<<loadingchunk, echo=FALSE>>=\n\n## For our example the only thing I'm changing is\n## the seed used\nset.seed(<%= x %>)\nmydata <- rnorm(5)\n@\n\nBlah blah blah.\n\nLet's look at our data using a seed of <%= x %>\n\n<<printingchunk>>=\nprint(mydata)\n@\n\n\\end{document}\n \n Notice that this is the report I want to generate for different data sets. In my case the different data sets are created with different input seeds but this could very easily be different file names directing to different data sets to load. My template assumes that the input will be stored in “x”. After running brew on this file anything between <% %> will be replaced with what is contained in the actual R object. So if I have an number stored in x then that is what will end up being the seed for the random number generator after calling brew(“template.Rnw”). \n In a separate file I have the following: \n \n# Load the necessary packages\nlibrary(brew)\nlibrary(tools)\nlibrary(knitr)\n\n# Function to write report\n# Note that since I used \"x\" in my template I need to use\n# \"x\" as my input in create.report.\ncreate.report <- function(x, prepend = \"MyFile_\"){\n rnw.file <- paste0(prepend, x, \".Rnw\")\n # This generates the actual rnw file for different seeds\n brew('template.Rnw', rnw.file)\n knit(rnw.file)\n latex.file <- paste0(prepend, x, \".tex\")\n texi2pdf(latex.file, clean = TRUE, quiet = TRUE)\n out.file <- paste0(prepend, x, \".pdf\")\n return(out.file)\n}\n\n# This is the input that will change in each report\nseeds <- c(42, 314159, 642)\n# This is us generating the reports!\nresults <- sapply(seeds, create.report)\n \n If you have both files in the working directory and run the second file you should end up with a pdf for each of the 3 seeds we used as input. \n Like I mentioned you could easily replace the seeds with different data set names to do something more useful."], "link": "http://botthoughts.wordpress.com/2012/05/17/generating-reports-for-different-data-sets-using-brew-and-knitr/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7}, "blogtitle": "Bot Thoughts"}]