[{"blogurl": "http://bps-msc.blogspot.com\n", "blogroll": [], "title": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["ASSESS: SPSS/R training day Friday 2nd November 2012 Alcuin Research Resource Centre University of York, York  Beginning with R: comparing groups (half-day) parallel workshop  An introduction to statistical modeling in R  (half-day) parallel workshop Friday 2nd November 2012 10 am to 12-45 pm   Chi-square tests and logistic regressions in SPSS (half-day) parallel workshop  Survival analysis with healthcare applications using SPSS (half-day) parallel workshop Friday 2nd November 2012 1-50pm to 4-30pm   Tutorial session: Health applications in SPSS  Friday 2nd November 2012 10am to 12-35pm   Tutorial session: First steps in data analysis using R  Friday 2nd November 2012 1-50pm to 4-10pm   ASSESS is an independent user led group for SPSS and R, computer packages for analysing and presenting data. Recent ASSESS workshop topics include SPSS/R syntax, SPSS macros, Logistic regression and Hospital Episode Statistics.  Two sets of two half-day parallel workshops and two tutorial sessions are provisionally planned to be held at the Alcuin Research Resource Centre, University of York, on Friday 2nd November 2012. The R workshops and a tutorial session on ‘Health Applications in SPSS’ will run in parallel from 10am to (approx) 12-45pm and two SPSS workshops and tutorials on ‘First steps in data analysis using R’, from 1-50pm to (approx) 4-30pm. Each delegate may, therefore, attend a morning workshop or tutorial session and/or an afternoon workshop or tutorial session.  Workshop topics and other details including booking forms are at http://www.spssusers.co.uk/Events/2012/confprog.html  The workshops and tutorials will be taught in an interactive hands-on workshop-style format, with frequent examples. A full set of notes and example files will be given to all workshop attenders. There will also be handouts at the tutorial sessions.  Simon White of the MRC Biostatistics Unit in Cambridge, who will lead the ‘Beginning with R:Comparing Groups’ workshop, looks at applications of statistics to public health issues and teaches R to non-statisticians.  Thom Baguley of Nottingham Trent University will lead ‘An Introduction to Statistical Modeling in R’. Thom has twenty years of teaching and research experience and is the author of ‘Serious Statistics’.  Angie Wade is a senior lecturer in biostatistics at University College London and will lead the ‘Chi-squares and logistic regressions in SPSS’ workshop.  David Culliford, who will lead the ‘Survival Analysis with Healthcare Applications using SPSS’ workshop, teaches on statistical issues surrounding research design and researches osteoarthritis at the University of Southampton.  The ‘Beginning with R:Comparing Groups’ workshop assumes no previous experience using R and will introduce basic concepts and structures used in R together with simple plotting and group comparison procedures. ‘An Introduction to Statistical Modeling in R' is a workshop building on a basic knowledge of R showing how to perform a range of statistical analyses in R including AN(C)OVA, regression, meta-analysis and bootstrapping. The SPSS workshops assume a working knowledge of SPSS and an awareness of basic statistical concepts. The ‘Chi-square tests and logistic regressions in SPSS’ workshop will introduce analyses of categoric data. The ‘Survival analysis with Healthcare Applications using SPSS’ workshop introduces commonly used elementary techniques analysing time-to-event data.  The booking fee includes a coffee break mid-workshop but not overnight accommodation. A buffet lunch is available and is included for those attending both a morning AND an afternoon event. Further details will be sent to delegates upon receipt of booking forms.  Come along to: * obtain training in using SPSS and R from experienced tutors who are fellow users * learn about statistical methods used for data analysis in R and SPSS * exchange ideas with other SPSS users * plan for an even better user group and suggest events for 2013  The venue for both the workshops and users' meeting is the Alcuin Research Resource Centre (ARRC) on York University campus located in Heslington, 2 miles to the south-east of the city centre. It takes 10-15 minutes in a taxi from the railway station. The Number 4 bus runs regularly to the University from York railway station (see http://www.yorkshiretravel.net/). Parking at the University is very difficult. Location details are at http://www.york.ac.uk/np/maps/. Accommodation is bookable via tourist information on (01904) 621756 or (01904) 554455.  PROVISIONAL PROGRAMMES FOR THE TUTORIAL SESSIONS**  Tutorials: Health Applications in SPSS (10am to 12-45pm)  * Practical tips in using SPSS syntax with Health Applications by Vikki O’Neill, MRC Biostatistics Unit, Cambridge  * Comparing linked maternity data sets to check data quality in SPSS by Preeti Datta-Nemdharry, City University, London  * Analysing 3-D Spatial ECGs in SPSS by Gilbert MacKenzie, University of Limerick  * Driving evidence-based decision-making in Healthcare with predictive analytics. A webinar specially recorded by a representative of SPSS  Tutorials: First steps in data analysis using R (1-50pm to 4-10pm)  * Getting your data into R by Simon White, University of Cambridge  * Graphics with R by Simon White, University of Cambridge  * Correlation and Regression in R by Gilbert MacKenzie, University of Limerick  * Repeated measures in 'R' using multi-level models by Tom Dunn, Nottingham Trent University  *Planning for 2013 events  Registration and coffee begins at 9-30am for the ‘Health applications in SPSS’ tutorials’. Registration begins at 1-30pm for the ‘First steps in data analysis using R’ tutorials. Morning coffee and afternoon tea are included in the registration fee. Lunch is included if attending BOTH a morning and afternoon event otherwise is available on request. A timetable will be e-mailed to delegates in advance."], "link": "http://bps-msc.blogspot.com/feeds/8677815385873149758/comments/default", "bloglinks": {}, "links": {"http://www.co.uk/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["Workshop on Testing Theories of Choice Behavior   18-20 July 2012, Berlin   The goal of this workshop is to bring together scholars interested in intertemporal choice, risky choice, game theory, and methods for theory testing in the decision sciences. Junior scientists are especially encouraged to attend and can register for free.   Invited Speakers include Daniel Cavagnaro, Andreas Gloeckner, John Hey, Konstantinos Katsikopoulos, Jonathan Leland, Graham Loomes, Daniel Read, Joerg Rieskamp, Ariel Rubinstein, and E.J. Wagenmakers.   Please register before 30 June 2012 at http://www.choiceworkshop.org/ and indicate whether you would like to present a poster.   This workshop is funded by the Alexander von Humboldt Foundation, with additional support from the U.S. National Science Foundation and the Max Planck Society. The meeting will be hosted by the Max Planck Institute for Human Development, Berlin.   Organizers:   Michel Regenwetter, University of Illinois at Urbana-Champaign ( regenwet@illinois.edu ) Jeffrey R. Stevens, University of Nebraska and Max Planck Institute for Human Development ( jeffrey.r.stevens@googlemail.com )"], "link": "http://bps-msc.blogspot.com/feeds/1876622539717740033/comments/default", "bloglinks": {}, "links": {"http://www.choiceworkshop.org/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["The next meeting of the European Mathematical Psychology Group (EMPG 2012) will be held at  University of Navarra  (Pamplona, Spain) from August 29 to August 31, 2012.  The Web site of the conference will be available on March 25, 2012 at  https://sites.google.com/site/empg2012/ .  Important dates   Abstract submission opens: March 25, 2012 Abstract submission closes: June 3, 2012 Notification of acceptance: June 17, 2012 Early registration deadline: July 15, 2012 Start of conference: August 29, 2012 End of conference: August 31, 2012"], "link": "http://bps-msc.blogspot.com/feeds/3322134955013283988/comments/default", "bloglinks": {}, "links": {"http://www.unav.es/": 1, "https://sites.google.com/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["The Wiley-Blackwell Psychology Spotlight app has just been launched. The Psychology Spotlight is available for download from the iTunes store, at no charge . The app features all 11 BPS journals (including the British Journal of Mathematical and Statistical Psychology), and provides a new way to promote your research to psychologists, raising your journal’s profile and encouraging article usage.     Download now –  http://itunes.apple.com/en/app/id503789655?mt=8  Be one of the first to enjoy this essential tool, with the following community features at your fingertips, anywhere, anytime:  Latest information on key psychology conferences and latest conference tweets ;  Free  Frommer’s travel guides to major conference locations;  Latest @WBPsychology Tweets;  Latest abstracts  from world-leading psychology journals , including the ability to ‘follow’ your favorite publications;  Free sample and special issues , including access to full text articles;  Excerpts from the latest psychology books, textbooks and major reference works;  Latest videocasts, podcasts and video abstracts from leading psychology researchers and practitioners;  Publishing workshops from leading editors, researchers and practitioners;  Latest news from key psychology blogs and digests ;  Customizable search tools connected to Wiley Online Library, YouTube, Google Syllabi and Google Scholar;  Bookmark any content you see, create a personalized reading list, share content via Facebook and Twitter and add your own RSS feeds, allowing you to keep track of your favorite sources.   Psychology Spotlight is available for iPhone, iPad, and iPod Touch. We encourage you to share Psychology Spotlight with your fellow researchers, practitioners, friends, and colleagues, enabling them to instantly read all the latest research and developments in psychology. Please encourage users to rate the app in the iTunes store and/or send feedback to psychologyspotlight@wiley.com ."], "link": "http://bps-msc.blogspot.com/feeds/517279842571769859/comments/default", "bloglinks": {}, "links": {"http://itunes.apple.com/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": [], "link": "http://bps-msc.blogspot.com/feeds/5320913880060280194/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 1, "http://www.org.uk/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["Annual Scientific Meeting & AGM  3 rd December 2011  BPS Offices, 30 Tabernacle Street, London, EC2A 4UE   Attendance free  Coffee from 10.30am, Meeting begins at 11am (AGM at 3.30pm)      Keynote Speaker:   Prof Zoltan Dienes:  Using Bayes to make the most of null results.    Registration  To register for this free event, please email name, institution, contact details to the Secretary of the Maths, Stats & Computing Section: Dr Collette Corry cv.corry_at_ulster.ac.uk   Call for papers  The closing date for submissions is Wednesday 26 th November 2011  Presentations on both theoretical and substantive applications are welcome in the area of Mathematics, Statistics or Computing in Psychology. We welcome submissions from postgraduate students. Abstracts should be submitted (no more than 200 words) with your name, institution and contact details to: Dr Collette Corry, cv.corry_at_ulster.ac.uk"], "link": "http://bps-msc.blogspot.com/feeds/974697253356068038/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["The Mathematical, Statistical and Computing Psychology Section is pleased to invite considerations for the 2011 Ranald Macdonald Postgraduate Research Award. Deadline for applications 30th March 2012 This will be awarded to the best UK Postgraduate thesis/dissertation/project (MSc, MRes, MPhil, Professional Doctorate, DPhil or PhD) using mathematics or statistics in a novel way to investigate an aspect of Psychology. The work and qualification upon which the award is assessed must have been awarded between 1st August 2010 and 31st December 2011. The award consists of £150 and expenses up to £200 to attend the section's Annual Scientific Meeting in the following year (2012 for the 2011 award). As a condition of accepting the award, the winner will be expected to present on their winning work at that meeting (scheduled for December 2012) and to join the section if they are not already a member. Details about eligibility and the (simple) application process can be found below or by contacting the Section Secretary Dr Collette Corry.    cv.corry _at_ ulster.ac.uk    Please note the deadline for submissions will be 30th March 2012 at 5pm.  How to apply:   Please send the following to the section secretary Collette Corry via email to:    cv.corry_at_ulster.ac.uk   1. Your full contact details including Name, Institution, Degree Title and Date the qualification was awarded, Address, Email, Telephone number and the Name (s) of Supervisors 2. The extended abstract from your thesis, which outlines the findings of your work 3. A supporting statement from one of your supervisory team outlining the importance and contribution of your thesis and suitability for the award (no more than 300 words) and listing any peer-reviewed publications associated with the work. Procedure: Your application will be considered by a panel of Mathematical, Statistical and Computing Section Committee members, and the panel’s decision will be final. One or more submissions will be short-listed and their authors may be invited to submit the complete thesis to the panel for final consideration via PDF. The panel reserves the right not to short-list any candidates if the panel does not deem the quality of submissions to be sufficiently high. From time to time the panel may also seek the views of expert reviewers on the quality of a submission prior to short-listing or to making an award. The panel may, in exceptional circumstances, make a split award between two equally deserving candidates. Criteria for making the award: Emphasis will be placed on the following criteria: - use of novel mathematics or statistics - reference to substantive issues in psychology or related disciplines - clarity of exposition of the mathematical or statistical concepts - potential or actual contribution to the field, via peer-reviewed publication"], "link": "http://bps-msc.blogspot.com/feeds/3524958265297679393/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["The BJMSP archives going back to the first issue (Volume 1 Part 1 in 1947) are now online for subscribers (including BPS members). It began life as the The British Journal of Psychology (Statistical Section) , but became known as the British Journal of Statistical Psychology. Although it changed to the British Journal of Mathematical and Statistical Psychology in 1964 the focus was on mathematical contributions to psychology in its broadest sense (including statistics) rather than narrowly on statistics, though factor analysis dominated in the early years. This was probably partly because of the founding editors (Burt and Thomson) and partly because of the importance of factor analysis at the time.  The first editorial by Burt and Thomson is free to all readers here ."], "link": "http://bps-msc.blogspot.com/feeds/3142950730035146522/comments/default", "bloglinks": {}, "links": {"http://onlinelibrary.wiley.com/": 2}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["A new award - The Jon Rasbash prize for Quantitative Social Science - has been established to commemorate the contributions to quantitative social science of Jon Rasbash, who was Professor of Computational Statistics and Director of the Centre for Multilevel Modelling at the University of Bristol. Jon was principally known for his development of multilevel methodology and its software implementation and for his research on studying social relationships within families.   The £500 prize recognizes early career achievement in the development and/ or application of advanced quantitative methods in any social science discipline. Applicants should be UK residents and in the first 10 years of their research career (including periods of postgraduate study).   The prize will be awarded on the basis of a research paper published in a peer-reviewed journal in 2010 or 2011. The applicant should be the sole or lead author of the paper. Submissions by 1 December 2011.   Further details: http://www.bristol.ac.uk/cmm/research/rasbash-prize.html"], "link": "http://bps-msc.blogspot.com/feeds/2438076812035396572/comments/default", "bloglinks": {}, "links": {"http://www.ac.uk/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["For your information:  Senior Biostatistician (click on title for job description)   Fixed term until June 2012, with possible extension  Growing Up in New Zealand: A longitudinal research study of kiwi children and their families   Growing Up in New Zealand is an exciting and ground breaking longitudinal study that is following approximately 7000 children from before they were born until they are adults, in the context of their families. It aims to understand the developmental environment, life experiences and aspirations of these children and families and will provide evidence to help build effective policy, programmes and initiatives to improve outcomes for all of New Zealand’s children.  The families involved in the study reflect the cultural diversity of New Zealand, our evolving society, environment and identity.  Further details about the study can be seen on our website   http://www.growingup.co.nz    We are seeking an enthusiastic and highly experienced Senior Biostatistician to lead our biostatistics team and work with our multi-disciplinary research team. You will have expertise in the epidemiological and lifecourse principles of longitudinal research design and data analysis. You will be able to contribute to ensuring the robust design, management, analysis and interpretation of our large complex data sets.   You will possess a PhD or higher degree in Statistics, Biostatistics or relevant disciplines and have expertise working with one or more statistical software packages including SAS.  Some of the key aspects of this role are to develop and execute analysis plans, support the research team to ensure data collection enables robust analysis, to lead and manage the biostatistics team including peer review and quality check of their work, to undertake analysis and interpretation of data and to support the preparation of reports and scientific papers.   Growing Up in New Zealand is led by the University of Auckland within UniServices, the largest research and development company in Australasia and a wholly owned company of The University of Auckland.   The position is a full-time position for a fixed term ending on 30 June 2012 in the first instance, with possibility for extension beyond this.   Please email or phone Florence Falconer for further information:  f.falconer@auckland.ac.nz  +64 (9) 373 7599 begin_of_the_skype_highlighting      +64 (9) 373 7599   end_of_the_skype_highlighting ext. 84451.  If you wish to apply please email your CV and a cover letter to Florence at  f.falconer@auckland.ac.nz"], "link": "http://bps-msc.blogspot.com/feeds/1405401248466542516/comments/default", "bloglinks": {}, "links": {"https://docs.google.com/": 1, "http://www.co.nz/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["Readers of the blog may be interested that The Journal of Experimental Psychopathology (Volume 2, Issue 2) has a special issue on Advances in Statistical Methods for Clinical and Experimental Psychopathology Data .  It is edited by Andy Field and Eric Woody:     ·    Tracing the Interpersonal Web of Psychopathology: Dyadic Data Analysis Methods for Clinical Researchers Pamela Sadler, Nicole Ethier, Erik Woody  ·    How to Conduct and Statistically Analyze Case-Based Time Series Studies, One Patient at a Time Michael R Nash, Jeffery J Borckardt, Amineh Abbas, Erin GrayD  ·    Performing Taxometric Analysis to Distinguish Categorical and Dimensional Variables John Ruscio, Ayelet Meron Ruscio, Lauren M Carney  ·    Best Practices for Using Median Splits, Artificial Categorization, and their Continuous Alternatives Jamie DeCoster, Marcello Gallucci, Anne-Marie R Iselin  ·    An SEM Perspective on Evaluating Mediation: What Every Clinical Researcher Needs to Know Erik Woody  ·    Using Bootstrap Estimation and the Plug-In Principle for Clinical Psychology Data Daniel B Wright, Kamala London, Andy P Field  ·    A Primer on Using Multilevel Models in Clinical and Experimental Psychopathology Research Andy P Field, Daniel B Wright  ·    A Primer on Meta-Analysis in Clinical Psychology Scott A Baldwin, William R Shadish"], "link": "http://bps-msc.blogspot.com/feeds/3711204098471224243/comments/default", "bloglinks": {}, "links": {"http://jep.textrum.com/": 9}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["The next meeting of the European Mathematical Psychology Group (EMPG 2011) will be held in Paris, from August 29 to August 31, 2011. The Web site of the conference is now available at the following address: http://www.infres.enst.fr/~hudry/EMPG/ You will find there the way to register and to submit a communication, as well as other details about the organization. All communications dealing with any subject related to mathematical psychology are welcome. The main features of EMPG 2011 are the following: * Dates : 29-30 August 2011 * Place : Telecom ParisTech, Paris, France * No fees. * Proceedings: - a special issue of Electronic Notes in Discrete Mathematics (ENDM) will be devoted to the meeting - we are studying the possibility to publish full papers in a special issue of Mathematics and Social Sciences * Important dates: - May 15, 2011: deadline for the reception of abstracts (1 page, sent to Olivier Hudry (hudry at enstr.fr) - June 15, 2011: notification of acceptance of the communication - August 19, 2011: deadline for registration - August 29-31, 2011: 2011 EMPG meeting - September 30, 2011: deadline for submitting a contribution to the special issue of ENDM"], "link": "http://bps-msc.blogspot.com/feeds/6093788108083827826/comments/default", "bloglinks": {}, "links": {"http://www.enst.fr/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["Annual Scientific Meeting 2011 abstracts and link s Music and amusis - an experience sampling study Diana Omigie, Goldsmith’s University (London) Congenital amusia (CA) is a developmental disorder characterized by deficits in melody perception and production. Empirical research into this condition has the potential to throw light on questions like how the brain processes music and why music listening can bring such pleasure to its listeners. However recent work has focused mainly on the perceptual abilities of people with C.A. and there has been little research into whether and how the observed perceptual deficits affect their appreciation of music in every day life. Assessing the degree with which amusics willingly engage with music in everyday life is a useful way of inferring how they feel about it and consequently evaluating the relationship between music perception and appreciation. We used hierarchical cluster analysis to evaluate the experience s ampling data collected from a total of 34 participants (17 amusics and 17 matched controls) and then observed how amusics were distributed over the resulting analysis solution. We found that at least 60 percent of amusics demonstrated a listening profile that was clearly distinct from that of controls. These amusics showed little evidence of wanting to engage with music in their everyday life. However the remaining amusics who fell into the cluster that mainly contained controls showed evidence of normal music appreciation; choosing to listen regularly and reporting obtaining pleasure from it. This research is important as it reveals contrasting attitudes towards music within the condition known as Congenital amusia. The reasons why appreciation may arise in the absence of normal perception are explored and further analysis is carried out to try to explain why the two groups of amusics show such different attitudes to music.   Research methods achievement predicted by stress, social class, and locus of control, but not dyscalculia  John Barry, City University (London) Negative attitudes towards learning research methods (RM) are associated with poor grades and dropout. The present cross-sectional internet survey explored preferences for learning RM and factors associated with RM grades. Psychology students ( N = 134) from high school to postgraduate level reported that more interaction with their teacher would improve grades. Those with most RM difficulty also wanted: practical work, visual teaching aids, more interesting textbooks, humour in teaching, smaller seminar groups, and more seminars. Using ordinal regression, the significant predictors of better RM grades relative to grades for other modules were: lower stress ( p < .001), more advantaged social background ( p < .005), and internal locus of control ( p < .013). The effect of motivation was mediated by stress. Dyscalculia was not associated with RM grade. These findings have implications for ways to improve the teaching of research methods to psychology students.   Multiple hypothesis testing when hypotheses are related logically using Shaffer’s R test: A hierarchical step down procedure with a step up test at each step  Andrew Rutherford, Keele University Hochberg’s (1988) presented a powerful test based on Simes’ (1986) inequality. Rom (1990) later improved this test by defining and calculating exact p-values. Later, Hochberg and Rom (1995) described how to apply their tests when hypotheses were related logically, as described by Shaffer (1986). However, as Hochberg and Rom’s (1995) account is not easily understood by sophisticated statistical mathematicians, it presents real problems for most other scientists. This may explain the lack of application of this important work. In response to my request for worked examples, Juliet Shaffer provided valuable insights into multiple hypothesis testing and Dror Rom delivered a new short-cut method to test logically related hypotheses, which he named Shaffer’s R test. The background and application of Shaffer’s R test will be described.   Exploring what is hidden: The power of Latent Class Analysis in uncovering barriers to engagement in the arts  Glenn A. Williams, Nottingham Trent University Latent class analysis is a powerful technique that enables researchers to glean insights into ‘hidden’ psychological experiences. It has been used in a variety of domains, such as with attempts: to understand psychosis as measured along a continuum of symptom expression; to identify features of computer games that are integral to the gaming experience; and to assess the characteristics of a range of trauma and suicidal behaviour typologies. The technique is grounded in the psychometric approach and item response theory and is a versatile method to dealing with nominal data in a deep and psychologically grounded way. This presentation will involve discussion of the key principles and practices when undertaking a latent class analysis. To illustrate the art and science of latent class analysis, a case example will draw on the nuances of data obtained from a general population survey of over 4,300 respondents and will model a set of various class solutions to unearth the barriers to engagement in the arts that could be present within a community.   Towards a rational use of mathematics in the psychology of reasoning Andy Fugard, University of Salzburg Logic is the mathematics of reasoning. Traditionally, logic in the psychology of reasoning was taken to mean classical logic and most non-mathematicians received a diagnosis of illogical. However, there are many logics, including probability logics. For so-called \"basic\" conditionals such as \"If the card shows a square, then it's red\", most people's degree of belief is given by a conditional probability, P(red|square), a justifiably rational interpretation. However, a significant minority treat an \"if\" as an \"and\" (conjunction), which is less easy to justify. Previously we found that, given a long series of trials, many of those initially showing a conjunction interpretation spontaneously shift to a conditional probability. In this talk I will present evidence that automatic stimulus-oriented processes are responsible for the conjunctions and inhibitory function is required for a shift. In another experiment we tested the effect of different expressions of identical (from the perspective of probability theory) conditionals, e.g., for conditionals concerning four cards numbered 1 to 4: \"If the card shows a 2, then it shows a 2 or a 4\" versus \"If the card shows a 2, then it shows an even number\". For the former type of conditional, most participants' degree of belief was 0, versus 1 for the latter type of conditional. A theory of relevant deduction, originally developed for classical logic, explains these two interpretations. These results illustrate the utility, and limitations, of logic for guiding theorizing and designing experiments about how non-mathematicians reason.  Adaptive design for model discrimination Maarten Speekenbrink, University College London Psychology is rich in formal models of learning, categorization and decision-making, to name but a few areas. While competing models differ in their substantive assumptions, they often make highly similar predictions. For this reason, model comparison based on empirical data is often inconclusive. Optimizing the design of an experiment for model discrimination is difficult, especially when individual participants differ widely in terms of model parameters. To resolve this problem, we present a method to design experiments adaptively whilst running them, at each trial choosing the stimulus which is expected to minimize the entropy of the posterior probability distribution over a set of competing models. We show the advantages of adaptive design in simulation study. We then present data from an experiment in which the method was applied to discriminate between competing models of category learning, including an exemplar model (the Generalized Context Model) and a decision bound model."], "link": "http://bps-msc.blogspot.com/feeds/1262362301565637954/comments/default", "bloglinks": {}, "links": {"https://docs.google.com/": 2}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["Wiley-Blackwell is proud to publish the British Journal of Mathematical and Statistical Psychology on behalf of The British Psychological Society .       Download the first issue of 2011         Testing overall and moderator effects in random effects meta-regression  Hilde M. Huizenga, Ingmar Visser and Conor V. Dolan  Correcting an analysis of variance for clustering  Larry V. Hedges and Christopher H. Rhoads  Evaluation of convergent and discriminant validity with multitrait–multimethod correlations  Tenko Raykov  Decision making on ambiguous stimuli such as prosody by subjects suffering from paranoid schizophrenia, alcohol dependence, and without psychiatric diagnosis  Karol Fabia´nczyk  Bayesian estimation of semiparametric nonlinear dynamic factor analysis models using the Dirichlet process prior  Sy-Miin Chow, Niansheng Tang, Ying Yuan, Xinyuan Song and Hongtu Zhu  Ridge structural equation modelling with correlation matrices for ordinal and continuous data  Ke-Hai Yuan, Ruilin Wu and Peter M. Bentler  The linear mixed model and the hierarchical Ornstein–Uhlenbeck model: Some equivalences and differences  Zita Oravecz and Francis Tuerlinckx  Expert tutorial  Binary recursive partitioning: Background, methods, and application to psychology  Edgar C. Merkle and Victoria A. Shaffer  Statistical software review  R you ready for R?: The CRAN Psychometrics Task View  Ali Ünlü and Takuya Yanagida              About British Journal of Mathematical and Statistical Psychology                                  Edited by : Thom Baguley  Impact Factor : 0.83  ISI Journal Citation Report © Ranking 2009 : 7/11 (Psychology, Mathematical); 50/80 (Mathematics Interdisciplinary Applications); 56/100 (Statistics and Probability); 67/74 (Psychology, Experimental) The British Journal of Mathematical and Statistical Psychology publishes articles relating to areas of psychology which have a greater mathematical or statistical aspect of their argument than is usually acceptable to other journals including:  mathematical psychology statistics psychometrics decision making psychophysics classification relevant areas of mathematics, computing and computer software  These include articles that address substantitive psychological issues or that develop and extend techniques useful to psychologists. New models for psychological processes, new approaches to existing data, critiques of existing models and improved algorithms for estimating the parameters of a model are examples of articles which may be favoured.  For specific submission requirements, please view the Author Guidelines .  Early View : Articles now appear on Early View before the paper version is published – Click here to see the Early View articles currently available online;        BPS Blackwell       For the complete range of Blackwell BPS books, please go to: www.wiley.com/go/bps       About The British Psychological Society        The British Psychological Society is the representative body for psychology and psychologists in the UK.  The Journals of the British Psychological Society form an essential part of the Society's mission to advance and disseminate psychological knowledge. With a publishing history spanning over 100 years, our journals portfolio is at the forefront of the psychology community with international contributions and readership.  For more information or to join the Society, please visit www.bps.org.uk"], "link": "http://bps-msc.blogspot.com/feeds/5218400565351278268/comments/default", "bloglinks": {}, "links": {"http://www.wileyblackwell.com/": 1, "http://onlinelibrary.wiley.com/": 17, "http://www.org.uk/": 3, "http://www.editorialmanager.com/": 1, "http://ordering.wiley.com/": 1, "http://www.wiley.com/": 2}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["Slides from all three of the 2010 CPD workshops (held in Nottingham on 13th December) are now available:   R: An introduction for psychologists  (Thom Baguley & Danny Kaye, Nottingham Trent University)    Linear mixed models using R  (Andy Fugard, Salzburg University)   An introduction to PsychoPy (Jonathan Peirce)"], "link": "http://bps-msc.blogspot.com/feeds/9125292232139506190/comments/default", "bloglinks": {}, "links": {"https://docs.google.com/": 1, "http://psychologicalstatistics.blogspot.com/": 1, "http://www.psychopy.org/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["Here are some specific details about the sessions and directions to NTU, City Campus. ______________________________________________________________ Day 1 BPS Maths, Stats and Computing Section CPD workshop Timing: Monday December 13th 2010 9.00-9.30 Registration and coffee. 930-12.30 Morning workshop starts (either PsychoPy or R) 12.30-2.00 Lunch 2.00-5.00 Afternoon workshop ends (Linear mixed models in R) Note: Lunch is provided as part of the workshop. Contacts: Professor Thom Baguley Thomas.BaguleyATntuDOTacDOTuk Dr Gillian Smith Gillian.SmithATntuDOTacDOTuk Dr Danny Kaye Danny.KayeATntuDOTacDOTuk Emails : We would like to create an email list to share with other delegates and the session leaders. If you wish to be included please email me (Thomas.BaguleyATntuDOTacDOTuk) requesting this (we are not permitted to circulate the list without permission). Travel directions By public transport. The easiest way to get to Nottingham Trent University, City Campus (Campus Map) is by train and tram. Trams go direct from Nottingham train station to Nottingham Trent University every few minutes throughout the day. An all day tram ticket will cost about £3.00 (buy a ticket from the conductor on the tram; he or she will be able to provide change, from £10 or less). The Nottingham Trent University tram stop is just outside the Chaucer building main reception (on the same side of the street). The Division of Psychology is based on the 4th floor of the Chaucer Building. The registration desk for the workshop will be at the Psychology entrance (also on the 4th floor!). Please feel free to ask the security personnel on the front desk for assistance if you require. By car. The easiest method is park and ride. Either travel to East Midlands Parkway (train station) and park your car and take the train to Nottingham, followed by tram (as above). You can buy a combined train and parking ticket. Or travel to The Forest Park and Ride, park your car and take the tram (as above; except you’ll be coming in from the other direction and will need to cross the road to get to the Chaucer building). Parking is free. Parking in central Nottingham. Parking in central Nottingham is expensive – probably around £15-20 per day (but there are usually plenty of places in the Trinity Square or Victoria Centre car parks). The one-way system is also very difficult to navigate unless you are familiar with the city. We may be able to organize one or two visitors parking spaces at the Gill Street car park (see tram stop map above), but this is still not recommended (as getting through the one-way system in rush hour morning traffic is difficult unless you know the roads well). There is also a guide to getting to NTU here Monday evening: The organizers and session leaders plan to have an informal drink and a meal after the workshop. Delegates are warmly invited to join us. We will meet in the Chaucer Building foyer at 6.30pm (to allow a short break after the session). You are warmly invited to attend. ____________________________________________________________________ Day 2 BPS Maths, Stats and Computing Section Annual Scientific Meeting Directions: Are as above, however, the Annual Scientific Meeting will be held in the Newton Building (this building is further up Goldsmith Street on the other side of the street from the Chaucer Building). Please see here for details (Campus Map) Registration Will be between 9-9.30 in the foyer of Newton Building. There will be signs, around the building, and feel free to ask the security on the front desk (main entrance is on Goldsmith Street) should you require any assistance. If you have not already, please email Gillian.SmithATntuDOTacDOTuk to let us know you are planning to attend day two. It is a free event.  We look forward to welcoming you to NTU"], "link": "http://bps-msc.blogspot.com/feeds/6008622108547827673/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["BPS Mathematical, Statistical and Computing Section Annual Scientific Meeting Programme 14th December 2010    Time    9.30am- 9.45am  Welcome    9.45am- 10.15am  Dr Glenn A. Williams, Nottingham Trent University Exploring what is hidden: The power of Latent Class Analysis in uncovering barriers to engagement in the arts   10.15am-10.55am  Ranald Macdonald Prize winner: Dr Colette Corry, University of Ulster Title TBC   Morning tea break 10.55-11.20   11.20am-11.50am  Dr Maarten Speekenbrink, University College London Adaptive design for model discrimination   11.50am-12.30pm  Keynote speaker: Dr Michael Brammer, Institute of Psychiatry, London Lies, damned lie and fMRI: issues and challenges in the analysis of fMRI data   12.30pm-1.00pm  Dr Andrew Rutherford, Keele University Multiple hypothesis testing when hypotheses are related logically using Shaffer’s R test: A hierarchical step down procedure with a step up test at each step    1.00pm-1.45pm Lunch   1.45pm-2.15pm  John Barry, City University (London) Research methods achievement predicted by stress, social class, and locus of control, but not dyscalculia.   2.15pm-2.45pm  Diana Omigie, Goldsmith’s University (London) Music and amusis- an experience sampling study   2.45pm-3.15pm  Dr Andy Fugard, University of Salzburg Towards a rational use of mathematics in the psychology of reasoning   3.15pm-3.30pm Afternoon tea break   3.30pm AGM"], "link": "http://bps-msc.blogspot.com/feeds/399319290446661400/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["Places are still available for the Introduction to R, Linear mixed models in R and PsychoPy sessions. Only a few days left to register ... Registration link N.B. This is for the workshop only. The scientific meeting on the following day is free to attend and registration will be open until a couple of days before (this enables us to track the numbers and move to a larger lecture theatre if required)."], "link": "http://bps-msc.blogspot.com/feeds/5598978386169759939/comments/default", "bloglinks": {}, "links": {"http://tinyurl.com/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["November's issue of The Psychologist incorrectly indicates the venue as London. The Workshop and Scientific meeting are most definitely in Nottingham!"], "link": "http://bps-msc.blogspot.com/feeds/4147181041133543112/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["http://unstats.un.org/unsd/wsd/"], "link": "http://bps-msc.blogspot.com/feeds/3133226452440255686/comments/default", "bloglinks": {}, "links": {"http://unstats.un.org/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["Day 1  : 13 th December 2010   CPD statistics and computing workshops      Parallel Sessions       Morning     Afternoon       R: An introduction for psychologists (Thom Baguley & Danny Kaye,  Nottingham Trent)   An introduction to PsychoPy (Jonathan Peirce, Nottingham)     Bayesian data analysis: An  introduction for psychologists (Mark Andrews, Nottingham  Trent)  Linear mixed models using R ( Andy  Fugard, Salzburg)          Registration for the workshops is now open . Places are limited. Discounted rates are available for MSC section members and current students. For full details are available here .       Day 2  : 14 th December 2010   Annual Scientific Meeting and AGM   We hope you will join us for this free event. The Scientific Meeting will commence at 9.30 am and will feature papers applying mathematics, statistics or computing to Psychology . Please note that you do not have to be a section or BPS member to present a paper or to attend.    Calls for Papers and Posters   Submissions are invited for the Annual Scientific Meeting. Presentations on both theoretical and substantive applications are welcome, in the area of Mathematics, Statistics or Computing in Psychology. We are particularly keen to welcome submissions from postgraduate students. Abstracts should be submitted as attachment with your name, institution and contact details by 15 th November and sent via email to Dr Gillian Smith (Gillian dot Smith at ntu.ac.uk) .  Annual scientific meeting registration  To register for Annual Scientific Meeting, please email name, institution and contact details and to the Section Secretary Dr Gillian Smith (Gillian dot Smith at ntu.ac.uk)."], "link": "http://bps-msc.blogspot.com/feeds/1653035388461778401/comments/default", "bloglinks": {}, "links": {"http://tinyurl.com/": 2}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["The Mathematical, Statistical  and   Computing Psychology Section is pleased to invite papers for their   Annual Scientific Meeting  at Nottingham Trent University  13th & 14th December 2010   Papers can be on any novel aspect of Mathematics, Statistics or Computing applied to Psychology (broadly defined),  and   we are particularly keen to encourage submissions from Psychology Postgraduates or from researchers in disciplines that overlap with mathematical and statistical psychology.*    Please submit abstracts to the Section Secretary Gillian Smith gillian.w.smith@gmail.com along with name, contact details and affiliation by 28th November 2010    Directions  and   further details about the event will be on the MSCS blog soon  http://bps-msc.blogspot.com/  For any queries please contact gillian.w.smith@gmail.com    Please note that Day 1 (13th) will comprise of professional development workshops, on the following topics R: An introduction for psychologists ( Thom Baguley & Danny Kaye ), Bayesian data analysis: An introduction for psychologists ( Mark Andrews ), Linear mixed models using R ( Andy Fugard ) and An introduction to PsychoPy ( Jonathan Peirce ). Day 2 of the conference will comprise of the Section AGM, keynote, postgraduate prize winner and delegates papers.   * Note that you do not have to be a member of the BPS or the section to present a paper."], "link": "http://bps-msc.blogspot.com/feeds/12706842688399778/comments/default", "bloglinks": {}, "links": {"http://bps-msc.blogspot.com/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["The Mathematical, Statistical and Computing Psychology Section is pleased to invite considerations for the Ranald Macdonald Postgraduate Research Award. Deadline for applications 15th October 2010 This will be awarded to the best Postgraduate thesis (MSc, MRes, MPhil, Professional Doctorate, DPhil or PhD) using mathematics or statistics in a novel way to investigate an aspect of Psychology (submitted and passed within 1st August 2009-31st July 2010 inclusive).  The prize consists of £150.00 and expenses up to £200 to attend the section's annual conference this year at Nottingham Trent University. As a condition of accepting the prize, the winner will be expected to present an aspect of their winning work at this years Annual conference (dates below). Further details on eligibility and the simple application process can be found below or by contacting the Section Secretary Gillian Smith gillian.smith@ntu.ac.uk Please note the deadline for submissions will be 15th October 2010 at 5pm.  How to apply: Please send the following to the section secretary Gillian Smith via email to gillian.smith@ntu.ac.uk 1. Your full contact details including Name, Institution, Degree Title and Date Qualification was awarded, Address, Email, Telephone number and the Name (s) of Supervisors 2. The extended abstract from your thesis, which outlines the findings of your work 3. A supporting statement from one of your supervisory team outlining the importance and contribution of your thesis and suitability for the award (no more than 300 words) Procedure: Your application will be considered by a panel of Mathematical, Statistical and Computing Section Committee members, and the panel’s decision will be final. One or more submissions will be short-listed and their authors may be invited to submit the complete thesis to the panel for final consideration via PDF. The panel reserves the right not to short-list any candidates if the panel does not deem the quality of submissions to be sufficiently high. From time to time the panel may also seek the views of expert reviewers on the quality of a submission prior to short-listing or to making an award. The panel may, in exceptional circumstances, make a split award between two equally deserving candidates. Criteria for making the award: Emphasis will be placed on the following criteria: - use of novel mathematics or statistics - reference to substantive issues in psychology or related disciplines - clarity of exposition of the mathematical or statistical concepts - potential or actual contribution to the field, via peer-reviewed publication"], "link": "http://bps-msc.blogspot.com/feeds/3280359244165054079/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["The provisional dates for the BPS Mathematics, Statistics and Computing section Annual Scientific Meeting are now available. The meeting will be held at Nottingham Trent University on the 14 December 2010. The meeting will be combined with an CPD workshop on the 13th December (also at NTU). The workshop will be aimed at early career researchers and as of writing four half-day workshops have been scheduled. The planned workshop sessions are:  R: An introduction for psychologists ( Thom Baguley & Danny Kaye )  Bayesian data analysis: An introduction for psychologists ( Mark Andrews )  Linear mixed models using R ( Andy Fugard )  An introduction to PsychoPy ( Jonathan Peirce ) Further details - including registration info - on both the Annual Scientific Meeting and the workshop are to follow."], "link": "http://bps-msc.blogspot.com/feeds/396012669132724364/comments/default", "bloglinks": {}, "links": {"http://www.andyfugard.info/": 1, "http://www.ac.uk/": 1, "http://danny-kaye.co.uk/": 1, "http://nottinghamtrent.academia.edu/": 1, "http://www.mjandrews.net/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}, {"content": ["You can now follow BJMSP and other BPS journals on academia.edu ."], "link": "http://bps-msc.blogspot.com/feeds/7470949377936112868/comments/default", "bloglinks": {}, "links": {"http://journals.academia.edu/": 1}, "blogtitle": "BPS Mathematics, Statistics & Computing Section"}]