[{"blogurl": "http://brainwindows.wordpress.com\n", "blogroll": [], "title": "Brain Windows"}, {"content": ["The field of connectomics would greatly benefit from a genetically-encoded stain for specific proteins that works intracellularly.  This could be used to provide positive contrast for axon tracts or to identify if a synapse is excitatory, inhibitory, or neuromodulatory. Horseradish peroxidase (HRP) is a classic approach to EM staining but does not work in reducing environments, such as inside cells.  Several groups (Ting, Looger) have tried to engineer away the di-sulfide bonds of HRP, to allow it to work intracellularly, but all have failed to maintain activity after removing these bonds. An alternative approach, miniSOG , from the Tsien lab, is a genetically-encoded tag that can stain via singlet oxygen generation, but requires light to activate it. In Nature Biotechnology, Alice Ting’s group reports APEX , a perioxidase that works intracellularly, which they then engineered to monomerize and improve staining performance. This tool could find extensive use in connectomics of complex brain tissues. \n  \n \n Filed under: circuit mapping , connectomics , Electron Microscopy , neuroanatomy Tagged: connectomics , em stain"], "link": "http://brainwindows.wordpress.com/2012/10/25/genetically-encoded-intracellular-em-stain-for-connectomics/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.plosbiology.org/": 1, "http://en.wikipedia.org/": 1, "http://brainwindows.wordpress.com/": 7, "http://dx.doi.org/": 1}, "blogtitle": "Brain Windows"}, {"content": ["By twitter request , click-thru for the original resolution of a fellow Janelian’s Nikon Small World 4th place prize winner. Ryan Williamson composed the image. \n  Drosophila melanogaster visual system halfway through pupal development, showing retina (gold), photoreceptor axons (blue), and brain (green) (1500x) \n Filed under: Imaging Tagged: drosophila , Imaging , rentia"], "link": "http://brainwindows.wordpress.com/2012/10/24/drosophila-visual-system/", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.nikonsmallworld.com/": 1, "http://brainwindows.wordpress.com/": 5}, "blogtitle": "Brain Windows"}, {"content": ["The paper on G-CaMP5 has been published. \n Optimization of a GCaMP Calcium Indicator for Neural Activity Imaging \n Genetically encoded calcium indicators (GECIs) are powerful tools for systems neuroscience. Recent efforts in protein engineering have significantly increased the performance of GECIs. The state-of-the art single-wavelength GECI, GCaMP3, has been deployed in a number of model organisms and can reliably detect three or more action potentials in short bursts in several systems  in vivo . Through protein structure determination, targeted mutagenesis, high-throughput screening, and a battery of  in vitro  assays, we have increased the dynamic range of GCaMP3 by severalfold, creating a family of “GCaMP5” sensors. We tested GCaMP5s in several systems: cultured neurons and astrocytes, mouse retina, and  in vivo  in  Caenorhabditis chemosensory neurons,  Drosophila  larval neuromuscular junction and adult antennal lobe, zebrafish retina and tectum, and mouse visual cortex. Signal-to-noise ratio was improved by at least 2- to 3-fold. In the visual cortex, two GCaMP5 variants detected twice as many visual stimulus-responsive cells as GCaMP3. By combining  in vivo imaging with electrophysiology we show that GCaMP5 fluorescence provides a more reliable measure of neuronal activity than its predecessor GCaMP3. GCaMP5 allows more sensitive detection of neural activity  in vivo  and may find widespread applications for cellular imaging in general. \n  \n This is the best fully-characterized GECI available, but publication of the paper was repeatedly delayed. Why? Because reviewers viewed it as ‘too incremental’ of an upgrade, and not worth publishing in a prominent journal (no, I’m not talking Nature or Science level) when the plasmids are already available. \n A friendly suggestion for authors and future GCaMP6+ reviewers : You can’t have it both ways. If you want access to the best molecular tools before publication (GCaMP5 has been available for over a YEAR), you cannot turn around and say its not worth publishing because you already have the plasmid. Multiple post-docs spent years of their lives developing and carefully testing this tool. They deserve a quality publication for their efforts. Furthermore, the rigorous performance data collected NEEDS to be available to current and future users. Finally, there is no doubt that this will be a highly cited and viewed paper in whatever journal were to publish it. Our GCaMP3 paper already has 182 citations in less than 3 years, this may do even better. \n Filed under: Uncategorized Tagged: calcium imaging , GCaMP , GECI , in vivo"], "link": "http://brainwindows.wordpress.com/2012/10/03/g-camp5-paper-is-finally-published/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.nih.gov/": 1, "http://www.jneurosci.org/": 1, "http://brainwindows.wordpress.com/": 6}, "blogtitle": "Brain Windows"}, {"content": ["At SfN, a block of three posters by myself, Simon Peron and Daniel O’Connor will showcase three ways to approach the problem of touch coding. \n My work on whisker force measurements, and single cell and silicon probe based cortical recordings during active objection localization : \n \n \n \n Program#/Poster#: \n 677.18/KK18 \n \n \n Presentation Title: \n Encoding whisking-related variables in the mouse barrel cortex during object localization \n \n \n Location: \n Hall F-J \n \n \n Presentation time: \n Tuesday, Oct 16, 2012, 2:00 PM – 3:00 PM \n \n \n Authors: \n *S. A. HIRES , D. O’CONNOR, D. GUTNISKY, K. SVOBODA; \nJanelia Farm Res. Campus, ASHBURN, VA \n \n \n \n Simon Peron’s work on recording a complete representation of touch using in-vivo imaging with new G-CaMP variants during a similar behavior : \n \n \n \n Program#/Poster#: \n 677.12/KK12 \n \n \n Presentation Title: \n Towards imaging complete representations of whisker touch in the mouse barrel cortex \n \n \n Location: \n Hall F-J \n \n \n Presentation time: \n Tuesday, Oct 16, 2012, 4:00 PM – 5:00 PM \n \n \n Authors: \n *S. P. PERON 1 , V. IYER 2 , Z. GUO 2 , T.-W. CHEN 2 , D. KIM 2 , D. HUBER 3 , K. SVOBODA 2 ; \n \n \n \n Daniel O’Connor’s work on constructing synthetic perception of touch and object localization via cortical cell-type specific optogenetic stimulation during behavior : \n \n \n \n Program#/Poster#: \n 677.06/KK6 \n \n \n Presentation Title: \n Neural coding for object location revealed using synthetic touch \n \n \n Location: \n Hall F-J \n \n \n Presentation time: \n Tuesday, Oct 16, 2012, 2:00 PM – 3:00 PM \n \n \n Authors: \n *D. H. O’CONNOR 1 , S. A. HIRES 1 , Z. GUO 1 , Q.-Q. SUN 2 , D. HUBER 1 , K. SVOBODA 1 ; \n \n \n \n This is a must-see session for people interested in touch coding, the whisker system, in-vivo cortical imaging, or synthetic perception via optogenetics. \n I hope to see you there. \n Filed under: brain imaging , Calcium , circuit mapping , in vivo , Multiphoton , Neuronal Control , optogenetics"], "link": "http://brainwindows.wordpress.com/2012/09/20/three-ways-of-looking-at-touch-coding/", "bloglinks": {}, "links": {"http://www.abstractsonline.com/": 3, "http://feeds.wordpress.com/": 1, "http://brainwindows.wordpress.com/": 7}, "blogtitle": "Brain Windows"}, {"content": ["The first public presentation of data on candidates for GCaMP6 will be presented here.  This is obviously a big deal for brain imaging. \n Reliable detection of single action potentials and synaptic calcium signals using improved genetically-encoded calcium indicators \n *T.-W. CHEN, J. YU, R. A. KERR, V. JAYARAMAN, L. L. LOOGER, K. SVOBODA, D. S. KIM \n FFF77 / 927.08Oct 17 – 4:00pm/5:00pm \n \n \n and here \n \n Engineering next generation GCaMP calcium indicators using neuron-based screening \n T.-W. CHEN, T. J. WARDILL, J. P. HASSEMAN, G. TSEGAYE, B. F. FOSQUE, E. R. SCHREITER, B. E. KIMMEL, R. A. KERR, V. JAYARAMAN, K. SVOBODA, L. L. LOOGER, *D. S. KIM \n DDD38 / 207.14Oct 14 – 9:00am/10:00am \n \n Filed under: Uncategorized"], "link": "http://brainwindows.wordpress.com/2012/09/20/gcamp6-candidates/", "bloglinks": {}, "links": {"http://www.abstractsonline.com/": 2, "http://feeds.wordpress.com/": 1, "http://brainwindows.wordpress.com/": 1}, "blogtitle": "Brain Windows"}, {"content": ["It’s been pretty quiet around here lately and will likely continue that way for some time. BrainWindows is not dead, just resting. Experiments, paper writing, new baby, etc. However, if you still need a fix of BrainWindows analysis, please follow me, @AndrewHires , on Twitter. If you don’t have a Twitter account, get one! It’s the easiest way to get published in the Library of Congress . I’ll be honing the analysis to fit into 140 character snippets. There will also be a much broader range of topics. Hopefully we can continue a quality scientific discourse publicly, in near-real time. \n Filed under: Uncategorized"], "link": "http://brainwindows.wordpress.com/2012/03/29/where-to-get-new-brainwindows-content/", "bloglinks": {}, "links": {"http://www.loc.gov/": 1, "https://twitter.com/": 1, "http://feeds.wordpress.com/": 1, "http://brainwindows.wordpress.com/": 1}, "blogtitle": "Brain Windows"}, {"content": ["GCaMP3 is now officially old skool.  GCaMP5 is available at addgene. \n Plasmid 31788 : pCMV-GCaMP5G, a.k.a. GCaMP3-T302L R303P D380Y \n Dimmer baseline F, higher dF/F, picks up significantly more activity in vivo  cortex.  Still not holy grail level, but getting closer. \n Filed under: Calcium"], "link": "http://brainwindows.wordpress.com/2011/11/15/gcamp5-is-out/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.addgene.org/": 1, "http://brainwindows.wordpress.com/": 1}, "blogtitle": "Brain Windows"}, {"content": ["Wednesday morning, I’m giving the first public presentation of my current work on sensory coding in the barrel cortex. The big picture question is, How does the cortex translate sensory input into perception and recognition of objects and their position? \n  \n To study this cortical function, we used a methodology with 3 critical components \n 1 – Goal-directed discrimination task \n The activity of an awake cortex is profoundly different in character from an anesthetized cortex.  There is also gathering evidence that the activity of sensory cortex when attending to and using its sensory input to perform a discrimiation is quite diffent from periods of inattention.  We use a goal-directed discrimination task to enforce attention and to ensure the recorded activity is relevant to the fundamental function of the area. \n 2 – High speed neural recording techniques \n Spikes are the words in the language of cortex. We must record them with high fidelity and temporal precision.  We can then use correlation of neural activity to sensory input to try to understand what the cells are saying. \n 3 – Precise measurement of sensory input \n If we are to use correlational techniques to describe the language of cortex, we must match the millisecond precision of cortical communication with millisecond precision in measuring the exact sensory input. \n Within the rodent, no study has yet combined all three components, goal directed discrimination behavior, millisecond precision neuronal recordings and millisecond precision sensory input recordings. \n Anyway, if you want to hear more, try to get up in time to make it to the conference by 8:45AM. \n \n \n \n Program#/Poster#: \n 750.04 \n \n \n Presentation Title: \n Encoding of vibrissal sensory input and task-related variables in the mouse barrel cortex during whisker-based object localization \n \n \n Location: \n 152B \n \n \n Presentation time: \n Wednesday, Nov 16, 2011, 8:45 AM – 9:00 AM \n \n \n \n Filed under: Uncategorized"], "link": "http://brainwindows.wordpress.com/2011/11/15/cortical-encoding-of-somatosensory-input/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://brainwindows.wordpress.com/": 2}, "blogtitle": "Brain Windows"}, {"content": ["Guoping Feng’s group has released what looks to be a very useful set of BAC transgenic Channelrhodopsin mice .  The four lines specifically express YFP-tagged ChR2 in GABAergic, cholinergic, serotonergic and parvalbumin-expressing neurons. \nThey are well characterized and available from Jackson labs. \n  \n Filed under: Uncategorized"], "link": "http://brainwindows.wordpress.com/2011/08/19/useful-chr2-mouse-lines/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://brainwindows.wordpress.com/": 2, "http://dx.doi.org/": 1}, "blogtitle": "Brain Windows"}, {"content": ["This one is for the aficionados. Here is a little review of four classic single-unit physiology papers investigating the response properties and information flow from whisker through thalamus and into cortex.  It’s quite interesting comparing this data taken from sedated or anesthetized rats to my own in awake, behaving animals. That’s a story for another time and publication venue though \n\n Filed under: electrophysiology , in vivo Tagged: barrel cortex , single unit physiology"], "link": "http://brainwindows.wordpress.com/2011/04/29/journal-club-classic-single-unit-physiology-in-barrel-cortex/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://brainwindows.wordpress.com/": 4}, "blogtitle": "Brain Windows"}]