[{"blogurl": "http://brainstat.blogspot.com\n", "blogroll": [], "title": "brain + map + statistics"}, {"content": ["While accurate sulcal identification can be a challenge even for expert neuroanatomists, there are sulci that are to some degree more consistent, and for which anatomical correspondence can be established across subjects. These are the larger primary sulci. The localization of these sulci allows us to generate a spatial distribution or probabilistic map which can be used to label candidate sulci. A graph that maps the structural relationships between sulci can also be constructed and unlabeled sulci (or the more variable secondary and tertiary sulci) can be identified against this reference. These two ideas, the use of the probabilistic atlas and the graph, have been incorporated into automated and semi-automated labeling methods in various ways. In this post I will present the basic idea behind the use of the spatial distribution model. The use of a probabilistic atlas Probabilistic maps compute the probability for each tissue class at every voxel location using a large database of segmented and labeled anatomical structures. Evans et al. [3] coined the name Statistical Probabilistic Anatomical Maps or SPAM for these models. Paul Thompson has a nice description of these SPAM models and the Brainvisa website has a nice visualization of a sulcal atlas which is reproduced below:   A straightforward implementation of the probabilistic atlas paradigm can be seen in Le Goualher et al. [1] [2]. SPAM models give the probability for each sulcal class so that at any given location, unlabeled sulci are assigned the most probable label for that location. In other words, to label a new sulcus : Let:    be a sulcal label Compute:   where p is the probability from a SPAM atlas Assign:    The use of a point distribution model A different spatial distribution model is used by Lohmann et al. [4]. A point distribution model introduced by Cootes et al. [5] computes the shape of sulcal basins across a training set. Any unlabelled sulcus can be expressed as a linear combination of the eigenvalues generated from the PCA of this shape covariance matrix; an optimization over the linear function gives the best label.  Spatial distribution models give spatial bounds but this is not adequate to discriminate between the sulci in a local region. They are usually combined with graphs which model connections between sulci thus giving local structural context. In the combined strategy, the spatial information is used to supply spatial priors [6], localization constraints or to narrow the search space in an optimization or graph matching process [7]. I will write about the use of graph models in my next post.  References 1) Georges Le Goualher, D. Louis Collins and Christian Barillot, Alan C. Evans, \"Automatic Identification of Cortical Sulci Using a 3D Probabilistic Atlas,\" In MICCAI, 1998, pp. 509-518. 2) Georges Le Goualher, E. Procyk, D.L. Collins, R. Venugopal, Christian Barillot, \"Automated Extraction and Variability Analysis of Sulcal Neuroanatomy,\" IEEE Trans. Med. Imag., 18(3), 1999, pp. 206-217. 3) A. C. Evans, D. L. Collins, P. Neelin, M. Kamber, S. Marrett, \"Three-dimensional correlative imaging: Applications in human brain mapping,\" Advances in Functional NeuroImaging: Technical Foundations,(ed. R. Thatcher and M. Hallett and T. Zeffiro and E. John and M. Huerta) Academic Press, 1994, pp. 145-162. 4) Gabrielle Lohmann and Y. von Cramon, \"Automatic labeling of the human cortical surface using sulcal basins,\" IEEE Trans. Med. Imag., 4, 2000, pp. 179-188. 5) Timothy F. Cootes, Christopher J. Taylor, David H. Cooper, Jim Graham, \"Active Shape Models-Their Training and Application,\" Computer Vision and Image Understanding, 61(1), 1995, pp. 38-59. 6) M. Perrot, D. Rivière, J.-F. Mangin, \"Identifying cortical sulci from localizations, shape and local organization,\" ISBI, 2008, pp. 420-423. 7) Yang, F & Kruggel, F., \"A graph matching approach for labeling brain sulci using location, orientation, and shape,\" Neurocomputing, 2009, pp. 179-190. Posts on Sulcal Labeling 1) Why we label sulci  2) Why is sulcal labeling difficult ? 3) The use of a spatial distribution model in labeling sulci"], "link": "http://brainstat.blogspot.com/feeds/5798940938786472685/comments/default", "bloglinks": {}, "links": {"http://www.codecogs.com/": 4, "http://lnao.lixium.fr/": 2, "http://brainstat.blogspot.com/": 4, "http://www.ucla.edu/": 2}, "blogtitle": "brain + map + statistics"}, {"content": ["This is a follow-up to an earlier post Why we label sulci . There will be two or three more posts; taken altogether, they will describe the sulcal labeling problem.  The labeling of sulci is a challenging problem. This is because, cortical sulci are highly variable. Sulci vary not just across individuals but even between the hemispheres of a single brain [1]. It might be useful when looking for ways to address this variability to classify this variation as follows: Variation in physical features Sulci vary in shape, in scale and in their placement (i.e. position and orientation) The figure below illustrates how the variability can make feature selection difficult.   The boxplot shows the length distribution for 18 subjects. The 10 types or classes of sulci shown cannot be identified solely on a length measurement. This poses a problem for feature selection and classification. Figure credit: Meena Mani   Variation in branching 19th century illustrations such as those from Horsley [2], trace the wide variations along a sulcal fold. A whole nomenclature has developed since then to account for the branch variations possible along a single sulcus. (An example from the Ono atlas is illustrative--see figure below). For this reason, there is no gold standard in sulcal labeling; one neuroanatomist may disagree with another.  The figure to the left shows the pattern variations for a single sulcus (the posterior end of the superior frontal sulcus). Types A, B, C, D, are possible variations for this sulcus (for the 25 postmortem brains examined, 4 variations were found). The pattern in the two hemispheres of a single subject may differ; the left may be Type B and the right may be Type C. The lengths of the small segments and the connections they make to other sulci may also vary. Reproduced from Ono et al. [1].  Variation in number Sulci may be continuous (present as one uninterrupted segment) in some individuals, fragmented (exist as multiple segments) in others and altogether absent in yet others. The larger primary sulci which start forming early in fetal development are the most consistent; the secondary and tertiary sulci are not always expressed. References 1) Ono, M., Kubic, S. & Abernathy, C. (1892) \"Atlas of the Cerebral Sulci\", (Thieme, New York). 2) Horsley, V. (1892) \"On the topographical relations of the cranium and surface of the cerebrum\", In \"Contribution to the surface anatomy of the cerebral hemispheres\", pp.306-355, (Royal Irish Academy).  Posts on Sulcal Labeling 1) Why we label sulci  2) Why is sulcal labeling difficult ? 3) The use of a spatial distribution model in labeling sulci"], "link": "http://brainstat.blogspot.com/feeds/246249738895176578/comments/default", "bloglinks": {}, "links": {"http://brainstat.blogspot.com/": 4, "http://2.blogspot.com/": 1, "http://1.blogspot.com/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["The goal of medical imaging is to present the data in a useful format and in a very interesting TEDx talk Anders Ynnerman demonstrates cool new applications in medical visualization that will be possible in the near future. Graphics processors have become substantially faster in the last ten years. We can now put together** the gigabytes (terabytes if extended to the time domain) of MRI and CT data generated when scanning a single subject and create 3D (or 4D) images from which relevant information can be selectively extracted. This opens up new and very interesting possibilities. One such application is the virtual autopsy where with ipad-style interactions one can look at cadavers in hard-to-maneuver angles or selectively view metal to, for instance, identify the extent of knife stab injuries or locate bullet shards. Ynnerman also suggests touch-sensitive haptic applications: a surgeon can literally touch the data--a beating heart for example--pre-surgery.  It's really a great 17 minute talk--here's the link.  **(Aside from fast GPUs, there are other ways in which people are hoping to handle the explosion of data from these medical scans. The use of oompressive sensing algorithms is one but the more general idea is to reduce the data before, during or after the scan.)"], "link": "http://brainstat.blogspot.com/feeds/3658237833568197887/comments/default", "bloglinks": {}, "links": {"http://www.youtube.com/": 1, "http://webstaff.liu.se/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["One approach to shape analysis (after Kendall) uses a fixed number of points to define a shape. The points may describe an object boundary or an interior morphology such as the veins on a leaf. They may be selected randomly; alternatively they may be landmarks--i.e. points of significance. A set of points, so selected, constitutes a shape summary and the original shape data, that had been extracted from the raw image, is discarded. One problem with representing a shape in this way is that it introduces a source of variability. Different shapes can be reconstructed with the same set of points. This is especially true if the number of points selected for that particular shape are few. There are, of course, other approaches to shape analysis that do not involve selecting points (at least not at this stage of shape representation). Deformable templates is one such methodology and its use is quite common in medical image analysis. The shape could also be represented by a continuous function (see for example Younes et al. [1]). But these methods are also computationally expensive. Reference 1) Younes, Laurent; Michor, Peter W.; Shah, Jayant; Mumford, David. A metric on shape space with explicit geodesics. Atti Accad. Naz. Lincei Cl. Sci. Fis. Mat. Natur. Rend. Lincei (9) Mat. Appl. 19 (2008), no. 1, 25--57."], "link": "http://brainstat.blogspot.com/feeds/6241878048669300627/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "brain + map + statistics"}, {"content": ["I listened to a very interesting talk recently (via GoogleTech Talks--if the link is broken, search for Breakthroughs in Imaging Neurovascular diseases such as Multiple Sclerosis ... ). Mark Haacke, the speaker, had some years ago developed Susceptibility Weighted Imaging (SWI)--an MR modality that uses the phase information in a signal to image iron deposits in the brain. His talk is interesting because there is a story, a narrative, built around this endeavour and his efforts to find important clinical applications. Indeed, he has linked his research to Paolo Zamboni's work with multiple sclerosis (MS). (There is a Facebook group advocating a Nobel prize for Zamboni so a significant impact is projected.) For those of us in research it is always rewarding to witness--even from afar--the full lifecycle of an idea or concept. Haacke shows how he develops the method (it is really just another case of using parts of the signal that were being filtered out as noise); verifies (with Xray fluorescence--XRF) that what they are looking at is iron; looks for and finds iron deposits in the veins and brain tissue of patients with MS and other neurological diseases (which suggests that excess iron is a biomarker for these kinds of conditions); makes a case for the quantitative analysis of the venous system (the other half of the better explored arterial system); identifies new imaging applications such as the previously unseen microbleeds in patients with traumatic brain injury (TBI); presents temporal data to show the build-up of iron and finally links this aggregation with Zamboni's hypothesis that the narrowing or stenosis of veins (such as the internal jugular vein--IJV) that drain out of the brain, creates a reflux which subsequently results in the accumulation of iron. It remains to be seen if multiple sclerosis and other neurodegenerative diseases have a vascular origin but at the very least, the evidence--presented in various ways in this talk--shows a strong cause. Haacke ends by listing specific ways in which \"technical people\" can get involved. He suggests ways to quantify blood flow, develop biomarkers, track patients, develop databases and develop new sponsership models to fund all this work. It's a very complete talk in this sense and the right way to invite people with different kinds of expertise in. The talk is pitched at a general audience but there is enough detail so that someone like me, who works in medical imaging and with MS datasets, can also benefit. I'm a street kid; there've been no mentors. And talks like this give a perspective I haven't been able to get anywhere else. But more pampered academics can also benefit. I've been reading a paper where the author dabbles in a whole lot of esoteric math but is unable to construct a biomarker that appeals to common sense. Well, having perspective is one way to compensate for a lack of common sense."], "link": "http://brainstat.blogspot.com/feeds/8153812527630362212/comments/default", "bloglinks": {}, "links": {"http://www.youtube.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["The cortical surface is characterized by alternating ridges and furrows. The sulci ( singular sulcus ), as the Latin suggests, are the fissures or grooves; they serve as counterpoint to the raised gyri (see the figure; some of the primary sulci are highligted in color). The sulci, in a sense, exist because they do not exist. Their utility derives from this fact as demonstrated by the following:  1) In neurosurgery they function as channels which give a surgeon access to parts of the brain even deep within the subcortex. As M.G. Yaşargil, a noted neurosurgeon, writes in the foreword to the Ono atlas [1]: \"any point within the cranium can be reached by following the corridors of the sulci.\" Tissue damage from incisions is thus minimized. 2) They also serve as orienting landmarks in neurosurgery. The major sulci, in addition, partition important functional areas of the brain. This information reinforces their usefulness as landmarks. The central sulcus, for instance, demarcates the sensory-motor cortex. The sylvian fissure, one of the most identifiable cortical features, is the locus of language cortex. Both these sulci are important reference points in a variety of contexts and applications. 3) The sulcal grooves are filled with cerebrospinal fluid (CSF) which make them easy to identify in T1-weighted images (where CSF is dark in contrast to the brighter gray/white matter.) To be useful in the neurosurgical applications described, we first need to identify and label the sulci. There are other applications that would also benefit from a reliable labeling scheme. Internal changes in the brain, either due to aging or pathology, for instance, alter the cortical surface. Labeling is the first step in a systematic study that allows us to quantify these changes for the differential diagnosis of disease. Reference 1) Ono, M., Kubic, S. & Abernathy, C. (1990) \"Atlas of the Cerebral Sulci\", (Thieme, New York).  Posts on Sulcal Labeling 1) Why we label sulci  2) Why is sulcal labeling difficult ? 3) The use of a spatial distribution model in labeling sulci"], "link": "http://brainstat.blogspot.com/feeds/2257201469026049233/comments/default", "bloglinks": {}, "links": {"http://brainstat.blogspot.com/": 3, "http://1.blogspot.com/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["My thesis defense was yesterday. So now I have a degree certificate in French in addition to certificates in English and Latin. At Takshashila, which Panini and Chanakya both attended, the certification would have been a Sanskrit title--acharya perhaps. At Nalanda, which resembeled a public university far more, it may have been in Pali or some other Prakrit. These were the oldest universities in the world by, as Amartya Sen puts it , \"a long margin\". A round of acknowldegement: I'd have to credit the disembodied collective of knowledge that is the internet as coauthor."], "link": "http://brainstat.blogspot.com/feeds/2182229304396454792/comments/default", "bloglinks": {}, "links": {"http://intranet.irisa.fr/": 1, "http://www.thehindu.com/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["There are about a hundred sulci in the human brain and over a hundred billion white matter fibers. These two anatomical structures differ in many respects but they share a common geometric description: they are both open continuous curves. To study how the physical attributes of open curves can be used to advantage in the many varied quantitative applications of white matter fibers and sulci, we begin by considering the open curve. The brain imaging landscape from this window has its own particular challenges, open problems and possibilities. The view offers the following: Related to the representation The choice of representation restricts our analysis to sulci, white matter fibers and the veins and arteries of the vascular system in the brain. These are the three anatomical structures that can be modeled by open curves in 3D. An open curve is one of the simplest ways to mathematically represent an individual sulcus or white mater fiber tract. An (open) surface, which may also be used, is more difficult to model and implement. The closed curve is a third option, but it is also a mathematically more complex representation. Anatomical structures are not easy abstractions of geometrical primitives. Were this the case, a closed curve representation of a square or circle would be the right choice. The details of the mathematical modeling aside, for the purposes of analysis (of sulci or white matter fibers), an open curve is the more useful representation. In the case of sulci, the fact that they are highly variable in shape and structure also means that there is no additional information in a surface representation. The bottom curve (the section of the sulcus closest to the inner cortex) is the most stable part of a sulcus and this is what we use in our analysis. For white matter fiber analysis too, a curve model enables us to analyze individual tracts and there are benefits to this analysis over a volume-based one. An open curve may be represented in a Euclidean or Riemannian space. In a Euclidean space, a spline (a parameterized curve defined piecewise by polynomials) can easily approximate shapes of complex curves. The L2 distance we compute between two such curves can be used for clustering or other classification tasks. The main advantage with this approach is the ease of implementation and the fact that existing methods from machine learning and statistics can be readily incorporated into the analysis. In a Riemannian analysis, the open curve can be represented in different ways. In the model I use, the open curve is represented as a point in the space of continuous functions.This space of functions is infinite dimensional and nonlinear and advanced methods such as those from functional analysis, differential geometry and group theory are needed to represent and analyze curves. The advantage of a Riemannian representation is that we can use the intrinsic (Riemannian) geometry of the space to compute distances between two points (curves). Open curves are essentially nonlinear structures. The space of open curves is also nonlinear. Linear measurements in such spaces are not well-defined and the results may not be consistent. Related to the geometrical analysis The open curve is a geometric structure and we use it in analysis in this context. Geometrical analysis in medical imaging is most commonly a shape study although the term itself covers other possibilities. We use a mathematical model for open curves that allows us to incorporate shape, orientation, scale and position, the physical features associated with the curve. We expect to be able to apply this mathematical model to new kinds of problems or to reinterpret old ones. (I have done some work on a new study design which I will be publishing shortly. It is essentially a study of morphological changes, but my tools enable me to study the problem in a new way.) White matter DTI fibers bundles have a well-defined shape and structure which is determined by the regions they connect and the constraints of the surrounding anatomy. Sulci, on the other hand, are not easily interpreted in a geometrical study. This is due to the variability which we can also interpret as a problem of selecting a feature that is unique to a class of sulci. The possibility of shape analysis has been explored before. It is my view that sulcal variability, as it relates to identication and labeling, is better addressed by a graph pattern matching paradigm."], "link": "http://brainstat.blogspot.com/feeds/5880534848907283298/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "brain + map + statistics"}, {"content": ["A Wall Street Journal blog article headline states: India is benign for radiologists.  It turns out that: ... reading such images relies heavily on what the two economists call “tacit knowledge.” Pattern-recognition software, which could make the work routine, doesn’t work very well in identifying malignancies and other problems, The paper the blog refers to, was of course, talking about clinical diagnosis but one step removed from this is medical image analysis. Studies usually require databases (some very large) of subjects/cohorts who fit a common description. We might be quite far from full automatic diagnosis, but tasks can be broken down and piecemeal solutions can cetainly be outsourced. (I've been tempted more than once to go this route with the data I use or would use if only I could process them all.) Suppose we want to build a database of twin brains or multiple sclerosis brains or whatever. Some of the tasks that are routine and could be outsourced are: registering the brains to a common template, segmenting specific sections of anatomy, representing the data in a certain way (in a representation space). Now with close supervision someone with basic training could easily do this. So the problem might be that there are not enough people who can supervise such work. And the people who can have not thought of setting up shop in India. Big pharma is interested in such studies so it could be a lucrative outsourcing venture if someone could put it all together."], "link": "http://brainstat.blogspot.com/feeds/666854232676098590/comments/default", "bloglinks": {}, "links": {"http://blogs.wsj.com/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["The difficult problem in white matter fiber analysis (obtained from DTI or HARDI sources) is to efficiently handle the large volume of fibers. This may be achieved by clustering the fibers, by clustering using approximations such as the Nyström method , by sampling from the data in a fiber bundle or computing representative means as suggested here. Volume-based methods side-step this issue by treating a white matter structure as a single anatomical unit. With tract-based analysis, however, processing individual fibers is usually a requirement. Tractography and clustering algorithms have made this possible. Improvements are needed but it is my view that making the pre-processing pipeline more efficient is an engineering effort. While tedious processing is a disadvantage, tract-based methods offer the potential to study local parameters along a tract. This is important in the study of white matter disease and, at this juncture, it is here that the maximum contributions to the medical community can be made. References C. Fowlkes, S. Belongie, F. Chung, J. Malik. \"Spectral Grouping Using the Nyström Method\", TPAMI. 26 (2) p.214-225."], "link": "http://brainstat.blogspot.com/feeds/2381708869994137776/comments/default", "bloglinks": {}, "links": {"http://brainstat.blogspot.com/": 2, "http://www.berkeley.edu/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["A key concept in medical image analysis is the idea of a mean template, i.e., a statistical average around which deviations can be assessed. In the context of white matter fiber analysis, we seek to represent an anatomically defined fiber bundle with a mean and variance that describes its essential characteristics. This mean is of interest for practical reasons that go beyond atlas construction. From my hard-won experience working with DTI fibers, these are 3 reasons we need to compute means: 1.There are a large number of fibers involved in white matter fiber analysis. The corpus callosum has over 300 million fibers alone, the whole brain, 100 billion! fibers--source: Mori's atlas . The tractography output which is some fraction of this can still be several thousand fibers. Due to this large volume, a practical first step in any study, and one that is advocated by me, is to compute a representative mean of a fiber bundle. 2. The tractography output is subject to error. Noise, imperfections in the image and the presence of regions of low anisotropy due to fiber crossings all contribute to this. In order to make the streamline output more robust we can average over the fiber bundle. This strategy is also useful when a representative bundle is sought and there are discontinuities and other fiber damage due to disease. 3. To facilitate statistical analysis for population studies where the underlying problem is one of assigning membership to a group. Means may be computed for the following situations: i)for a group of fibers within a fiber bundle ii) for an intra- or inter-subject collection of fibers from many bundles iii)for an intra- or inter-subject collection of means of fiber bundles The computation of statistical summaries is usually part of any framework for white matter fiber analysis. Some of these frameworks are listed in my previous post on Mathematical frameworks."], "link": "http://brainstat.blogspot.com/feeds/1402865363606813713/comments/default", "bloglinks": {}, "links": {"http://www.amazon.com/": 1, "http://brainstat.blogspot.com/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["This is a standalone post. It is also part of the Quantitative white matter fiber analysis series posted here . There are three steps in tract-based data analysis: pre-processing, modeling and statistical analysis . The pre-processing may involve registration, tractography segmentation or clustering and the information contained in these results is often incorporated into the data analysis model. Fractional anisotropy (FA) is one such artifact and the analysis of FA profiles along tracts is usually included in most studies. The quantitative frameworks use both simple ideas such as the alignment of fibers for statistical analysis and more advanced mathematical concepts such as currents or techniques in Riemannian geometry. These methods for tract-based analysis are listed below: 1) Fiber-tract oriented statistics This model by Corouge et al.[1] is a prototype for computing statistics along a fiber bundle. The core idea was to give a compact description of the geometry and diffusion properties of a fiber bundle along its length profile. Corresponding points for a set of fibers are aligned and averages of DTI indices along the cross-section are computed. This can be done with linear or nonlinear Riemannian spaces. This basic idea has also been extended to a population atlas where information contained in tractography results [2] or registration results [3] are evaluated along a tract-based coordinate system. 2) Statistical modeling and EM clustering of white matter fiber bundles Individual fibers are parameterized and aligned with the goal of performing tract-oriented analysis over a population. A statistical model of pre-segmented fiber bundles is then calculated which serves as a prior for mixture model clustering. The Expectation-Maximization algorithm is used to infer membership probabilities and cluster parameters. Atlas guided clustering gives anatomically meaningful bundles. This is work by Maddah et al. [4]. 3) Statistical model of white matter fiber bundles based on currents This is a flexible framework where fiber bundles (a collection of curves) are modeled as currents. The space of currents is a vector space equipped with an inner product and norm which defines the distance between two bundles. This is a global distance that does not use point-wise correspondences [5]. Durrleman et al. give a statistical model for a fiber bundle atlas and it variability in a population. 4) Comprehensive Riemannian Framework In this framework, Mani et al. [6] use various combinations of shape, scale, orientation and position, the physical features associated with white matter fibers, to define Riemannian feature spaces. This is useful since applications have different objectives and often need different sets of tools and metrics for optimal results. For each joint manifold, a (geodesic) distance metric that quantifies differences between fibers as well as tools for computing statistical summaries of samples are defined. Correspondences between fibers are implicitly established during these pairwise comparisons. The framework may be extended to accomodate features such as scalar diffusion indices. 5) Statistical mapping of medial models of white matter tracts Yushkevich et al. [7] use a different geometric model by giving major fiber tracts a medial representation. While this is strictly not a tract-based model, it is included here because local statistics of tensor-based features can be computed. Bibliography: 1) Isabelle Corouge, P.Thomas Fletcher, Sarang Joshi, Sylvain Gouttard, Guido Gerig, \"Fiber Tract-Oriented Statistics for Quantitative Diffusion Tensor MRI Analysis,\" Medical Image Analysis 10 (2006), pp. 786-798. 2) Lauren J. O'Donnell, Carl-Fredrik Westin and Alexandra J. Golby. \"Tract-Based Morphometry for White Matter Group Analysis,\" NeuroImage. Volume 45, Issue 3, (2009), pp. 832-844. 3) Casey B. Goodlett, P. Thomas Fletcher, John H. Gilmore, and Guido Gerig. \"Group Analysis of DTI Fiber Tract Statistics with Application to Neurodevelopment,\" NeuroImage. (2009), 45(1 Suppl): S133–S142. 4) Maddah M., Grimson W.E.L., Warﬁeld S.K. \"Statistical Modeling and EM Clustering of White Matter Fiber Tracts\", Proceedings of the 3rd IEEE International Symposium on Biomedical Imaging. (2006);1, pp. 53-56. 5) M. Vaillant and J. Glaunès, \"Surface matching via Currents\" , Proceedings of Information Processing in Medical Imaging, Lecture Notes in Computer Science vol. 3565, Springer (2005), pp. 381–392. 6)Meena Mani, Sebastian Kurtek, Christian Barillot, Anuj Srivastava. \"A Comprehensive Riemannian Framework for the Analysis of White Matter Fiber Tracts,\" In ISBI'2010, pp. 1101-1104. 7) Yushkevich P.A., Zhang H., Simon T.J., Gee J.C., \"Structure-specific statistical mapping of white matter tracts,\" (2008) NeuroImage, 41 (2), pp. 448-461."], "link": "http://brainstat.blogspot.com/feeds/1560715972656673720/comments/default", "bloglinks": {}, "links": {"https://www.irisa.fr/": 1, "http://brainstat.blogspot.com/": 1, "http://www.nih.gov/": 2, "http://ieeexplore.ieee.org/": 1, "http://portal.acm.org/": 1, "http://www.springerlink.com/": 1, "http://www.sciencedirect.com/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["Part III: Quantitative tract-based analysis This is the third post in this three part series. Parts I and II are here and here . It is useful to classify white matter data analysis in the three decades that followed the introduction of the first MRI scans as volume-based or tract-based . The preprocessing path flows and possibilities for data interpretation differ in these two approaches. Volume-based Anatomical structures or regions of interest are treated as volumes and quantitative information is smoothed or averaged in such a way that the local variation in individual tracts is not preserved. The white matter structures are usually segmented by thresholding FA maps though fiber tracts have also been used. Group-wise registration for population studies may be done at the voxel level or across individual volumes. A voxel-based coordinate system is used in the first case and a structure-based coordinate system in the second. Tract-based The emphasis is on fiber tracts and parameters that vary along a fiber or anatomically defined bundle. Diffusion indices such as FA and physical descriptors such as shape are typically studied to assess fiber integrity or changes due to disease. Tract-based image analysis was made possible only after the first tractography algorithms were introduced. In 1999, Mori et al. ushered in tract-based image analysis by reconstructing fiber pathways in a rat brain. Improvements to the basic tractography algorithm and work in clustering paved the way for data analysis. These three stages of what is a developing field are summarized below. I) Tractography Tractography or fiber tracking, as the name suggests, is a way to follow the direction of the local white matter diffusion from voxel to voxel. For DTI, the simplest algorithms follow the direction of the principal diffusion tensor eigenvector in a deterministic fashion. The reconstruction process, which includes curvature thresholds and other termination criteria, generates a tract or streamline. More sophisticated approaches include interpolations for smoother pathways, the use of anatomical and topological constraints to guide the tracking and ways to deal with the uncertainty at each voxel due to noise and registration errors. Streamline tractography is also used in conjunction with high angular resolution (HARDI) methods. II) Clustering The mass of DTI fibers rendered was not immediately available for analysis. To organize and pare them down into meaningful fiber tracts, clustering was used and this led to a study of these methods. III) Mathematical Frameworks (Due to the length of this post, I will cover the data analysis frameworks in my next post. ) Bibliography Mori, S., Crain, B. J., Chacko, V. P. and Van Zijl, P. C. M. (1999), Three-dimensional tracking of axonal projections in the brain by magnetic resonance imaging. Annals of Neurology, 45:265–269."], "link": "http://brainstat.blogspot.com/feeds/6640100423232417822/comments/default", "bloglinks": {}, "links": {"http://brainstat.blogspot.com/": 3, "http://onlinelibrary.wiley.com/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["Part II: Imaging This is the second of three parts. Parts I and III are here and here . With the advent of soft tissue imaging technology--computed tomography (CT) in 1972 and magnetic resonance imaging (MRI) in 1977--it was possible to examine living brains. In 1982, physicians saw multiple sclerosis (MS) lesions for the first time in a live patient. Since then, clinicians have increasingly relied on brain scans for diagnosis and treatment. With this in vivo technology, disease progression in patients could be tracked by physicians and researchers, either individually, or as part of a longitudinal study of cohorts. This has led to a better understanding of white matter degenerative disease and has improved treatment options. The MR signal can be assessed in different ways and the 1990s saw the emergence of two important MRI modalities. The first, Seiji Ogawa's 1990 proposal to use contrasts in blood oxygen response to map changes in brain activity, led to the development of functional magnetic resonance imaging (fMRI). The ability to view the brain in real time was a big step forward; it enabled us to study brain function and is responsible for the widespread use of fMRI among clinical neurologists, behavioral scientists, neuroscientists and others. Diffusion tensor magnetic resonance imaging (DTI) was the second important MRI modality introduced. Water constitutes a big part of living tissue--white matter is 72% water--and the physical flow of fluid is described by a diffusion process. In 1994, Peter Basser , James Matiello and Denis Le Bihan, in a landmark paper, proposed a tensor model for diffusion where the flow of water was described by the magnitude and direction of the principal eigenvector at each image voxel. White matter fibers are inherently anisotropic and the first applications of DTI were studies of neural connectivity where fibers were tracked from end to end. Since the resolution of DTI is at the cellular level, it was also possible to detect disease--through indices such as fractional anisotropy (FA)--before it appeared in conventional MRI scans. Normal appearing white matter (NAWM) in MS is one example where compromised integrity manifests through lower FA values. A second-order tensor model is adequate for DTI reproductions of coherent fiber tracks but in cases where fibers meet or cross, only one of these directions is retained. DTI tractography of callosal fibers, where the lateral projections are attenuated, is illustrative of this limitation. To overcome this shortcoming, high angular resolution diffusion imaging (HARDI) images acquired in several spatially uniform directions has been used. An orientation distribution function (ODF) that can model multiple maxima representing the different fiber directions replaces the simple tensor model at each voxel. HARDI datasets offer better resolution for important DTI applications such as connectivity studies and preoperative investigations."], "link": "http://brainstat.blogspot.com/feeds/4069411406597137818/comments/default", "bloglinks": {}, "links": {"http://brainstat.blogspot.com/": 2, "http://en.wikipedia.org/": 1, "http://neuroscience.nih.gov/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["Part I: Histological investigation This is the first post in a three part series. Parts II and III are here and here . The modern scientific study of white matter has its roots in the 19th century when links were being established between mental dysfunction and neuroanatomy. Correlations made between postmortem abnormalities in the brains of mental patients and clinical evaluations while they were living led to important discoveries. The identification of the arcuate fasciculus as a language pathway that connected the two language centers, the Broca and Wernicke regions, is one famous example. In that case, Carl Wernicke , who was developing language network models, made the association between lesions in the arcuate fasciculus and the various aphasias he had observed. The impetus from these investigations crossed over to other developments. Theodor Meynert , the reputed neuroanatomist, had classified prominent white matter tracts or fasciculi, as they were known, based on the kinds of connections they made. Burdach and Déjérine published postmortem atlases, and both prominently included white matter dissections. New techniques for histopathological analysis were introduced. Notable among these was Camilio Golgi's staining method and Santiago Ramón y Cajal's use of it in his histolgical studies of nerve fibers. Quantitative white matter fiber analysis benefited from these cumulative efforts which made studies in fiber thinning, demyelination and microstuctural damage possible. Today, postmortem dissections still give the most precise quantitative assessments. Note of appreciation: This write-up was compiled based partly on Marco Catani's--I have pointed him out before--voluminous publications. He writes exceedingly well on the subject of language networks and related themes."], "link": "http://brainstat.blogspot.com/feeds/7117393570489963636/comments/default", "bloglinks": {}, "links": {"http://brainstat.blogspot.com/": 3, "http://en.wikipedia.org/": 8}, "blogtitle": "brain + map + statistics"}, {"content": ["Artful artichokes, showy 'shrooms, seeds cantilevered in cantaloupe. Fractal flows, and more at this MRI show."], "link": "http://brainstat.blogspot.com/feeds/6458300190267772954/comments/default", "bloglinks": {}, "links": {"http://insideinsides.blogspot.com/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["These are some notes on the Karcher mean. I will be updating this post hopefully in the coming weeks. In a Euclidean space, for a set of k points, x_1, x_2 ... x_k, the sample mean is:  In a nonlinear manifold, a simple summation is no longer possible. We can, however, make an extrinsic computation by embedding the manifold in a vector space, computing the Euclidean mean and projecting the result back into the manifold. A disadvantage of this approach is that the mean computed depends on the choice of embedding. A second possibility is an intrinsic computation, i.e., one where we use intrinsic manifold computations to compute the mean. To compute an intrinsic mean within a manifold, M , we use the concept of the mean as the centroid of a density . This idea was put forward by Fréchet to calculate means in a Riemanniann manifold. The computation involved a minimization but the existence and uniqueness of the resulting mean could not be guaranteed (see Pennec's 1999 NSIP paper for details). Karcher's proposal that a local instead of a global mean be used (see Karcher's 1977 paper), led to a practical implementation. We shall henceforth refer to this local mean as the Karcher Mean. (To be updated ...)  Karcher Mean references I found helpful Ricardo Ferreira et al. have a paper entitled Newton Method for Riemannian centroid computation in naturally reductive homogeneous spaces which has implementation details such as the intrinsic manifold computations for well known manifolds such as the sphere, the special orthogonal group, SO(n), and the space of positive definite matrices. Bibliography 1) M. Fréchet, \"Les elements aléatoires de nature quelconque dans un espace distancié,\" Annales de l'Institut Henri Poincaré, Vol. 10, (1948) pp. 215-310. 2) X. Pennec, “Probabilities and statistics on Riemannian manifolds: Basic tools for geometric measurements,” in Proc. NSIP'99, Vol. 1, (1999), pp. 194–198. 3) H. Karcher, Riemannian center of mass and mollifier smoothing. Commun. Pure and Appl. Math. 30 (1977), pp. 509–541."], "link": "http://brainstat.blogspot.com/feeds/7683845220388878701/comments/default", "bloglinks": {}, "links": {"http://www.codecogs.com/": 1, "http://users.utl.pt/": 2}, "blogtitle": "brain + map + statistics"}, {"content": ["The corpus callosum (CC), with over 300 million fibers, is the largest white matter fiber bundle in the human brain. (It is easily identifiable in conventional MRI scans.) Topographically, it is centered along the midsagittal plane with radiations that extend to the prefrontal and frontal cortex in the anterior brain, the sensory-motor cortex in the middle and the parietal, temporal and occipital lobes in the posterior half of the brain. This large and heterogeneous collection of fibers is responsible for interhemispheric communication. Michael Gazzaniga, a neuroscientist at Dartmouth College, has being studying the nature of this left brain- right brain communication for over 30 years. Here he explains some of his fascinating findings to Alan Alda, former hawkeye, now host of Scientific American Frontiers. And this is one of Gazzaniga's papers. (A similar account of the mysterious workings of the brain first got me interested in brain imaging. The book in question was V.S. Ramachandran's Phantoms in the Brain .) Because of the important role it plays, the CC is the focus of many studies. Some are concerned with changes in the shape, size or structure of the CC. These changes may occur due to aging or degenerative disease. On one end of the spectrum, work is being done to provide tools to measure and monitor these changes. At the other end are the clinical studies. An example of a clinical study might be one that links the different stages of the disease or aging process with physical alterations."], "link": "http://brainstat.blogspot.com/feeds/3472544078112244033/comments/default", "bloglinks": {}, "links": {"http://projects.upenn.edu/": 1, "http://www.youtube.com/": 1, "http://www.amazon.com/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["Shape, scale, orientation and position, the physical features associated with white matter fibers, can, either individually or in combination, be used to define feature spaces designed for specific end-applications. Such a treatment is useful since the quantitative analysis of white matter fibers has diverse applications, each with a different focus and objective. In recent work, we describe a Riemannian framework in which various combinations of these features are considered. (This was presented at the ISBI 2010 conference. The slides are here , a version of the paper here .) The framework also provides tools for computing statistical summaries of curves which enables us to perform a full statistical analysis. In the context of DTI fibers, a mean and variance that describes the essential characteristics of the fiber bundle can be used to represent a set of fibers. We can then proceed to tasks of statistical inference such as parameter estimation and hypothesis testing. I am currently using the tools and metrics defined within this mathematical framework to show how morphological changes due to disease progression can be studied. Shape distances in tandem with distances defined within other manifolds like the shape+orientation manifold give us very encouraging results."], "link": "http://brainstat.blogspot.com/feeds/1441566535422805876/comments/default", "bloglinks": {}, "links": {"https://www.irisa.fr/": 2}, "blogtitle": "brain + map + statistics"}, {"content": ["Partha Niyogi's very lucid talk entitled Geometric Methods and Manifold Learning includes a brief and very basic introduction to differential geometry(starts at t=40:49) which I found helpful. This was part of the Machine Learning Workshop I attended at the University of Chicago last June (MLSS'09). There were several other talks and tutorials of note. I especially enjoyed Emmanuel Candes' talk on sparse signal recovery. The talks are available at the videolectures website ."], "link": "http://brainstat.blogspot.com/feeds/4824723719050864809/comments/default", "bloglinks": {}, "links": {"http://videolectures.net/": 2}, "blogtitle": "brain + map + statistics"}, {"content": ["There is a beautiful song in the 1961 Hindi movie Kabuliwalah that I thought was a fitting tribute to Tagore on his sesquicentennial. Tagore's original story was perhaps less sentimental but just as deeply touching. A hundred years ago, Kabuliwallahs plied the streets of North India. With tales to tell and wares to sell, they, as outsiders seemed to have captured the Indian imagination. Here is Dharmendra , a man of many disguises, doing his Kabuliwalah impersonation in the Bond-style masala movie Jugnu. India has had a complex relationship with the Afghans. Tagore's sympathetic portrayal of a man from Kabul should be seen in the context of the dark shadow of history. Yes, Tagore was a great humanist and an early feminist too."], "link": "http://brainstat.blogspot.com/feeds/3416400022458951577/comments/default", "bloglinks": {}, "links": {"http://satyamshot.wordpress.com/": 1, "http://brainstat.blogspot.com/": 1, "http://www.youtube.com/": 3, "http://www.filmigeek.net/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["Grigory Perelman once again spurns a hefty honorarium. I love his style, I share his disgust."], "link": "http://brainstat.blogspot.com/feeds/4986299385831940878/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "brain + map + statistics"}, {"content": ["I'll be in Rotterdam in mid-April to present our paper entitled A Comprehensive Riemannian Framework for the Analysis of White Matter Fiber Tracts at the ISBI conference. This is the abstract: A quantitative analysis of white matter fibers is based on different physical features (shape, scale, orientation and position) of the fibers, depending on the specific application. Due to the different properties of these features, one usually designs different metrics and spaces to treat them individually. We propose a comprehensive Riemannian framework that allows for a joint analysis of these features in a consistent manner. For each feature combination, we provide a formula for the distance, i.e. quantification of differences between fibers and a formula for geodesics, i.e. optimal deformations of fibers into each other. We illustrate this framework in the context of clustering fiber tracts from the corpus callosum and study the results from different combinations of features. This is work I did with Anuj Srivastava and his student Sebastian Kurtek."], "link": "http://brainstat.blogspot.com/feeds/4705514667300841587/comments/default", "bloglinks": {}, "links": {"http://stat.fsu.edu/": 1, "http://www.biomedicalimaging.org/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["Dense Delhi fog followed me to Gwalior, Jhansi, Orchha --everywhere it seems, even France. I spent most of the first week of the new year in and out of airports and railway stations. But this post is not about the long journey back to Rennes. India Unbound , Gurucharan Das' personal account of the socio-economic history of post-independence India is a compelling read. The story of a Punjabi family with roots on the other side of the Radcliffe divide and their middle class aspirations annotate discussions on economic policy. What could be dry chapters on Nehru, Shastri and the never-ending Gandhi line are brought to life with vignettes that have a \"I was there\" ring of authenticity. It is this story telling that makes this book different from others. It is as easy to read as a well-researched work of fiction in the style of Amitav Ghosh."], "link": "http://brainstat.blogspot.com/feeds/5066452270622863697/comments/default", "bloglinks": {}, "links": {"http://www.amazon.com/": 1, "http://en.wikipedia.org/": 2, "http://gurcharandas.blogspot.com/": 1}, "blogtitle": "brain + map + statistics"}, {"content": ["Dharam, you absolutely eclipse Cary Grant, Clark Gable and other non-competition. Happy Birthday and thank you for 50 years of great footage ."], "link": "http://brainstat.blogspot.com/feeds/2625346832194879466/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.youtube.com/": 3}, "blogtitle": "brain + map + statistics"}]