[{"blogurl": "http://rbaltman.wordpress.com\n", "blogroll": [], "title": "Building confidence."}, {"content": ["I am posting my translational bioinformatics annual review 2012 slides and also bibliographies for the final 100 and then final 25 papers I presented yesterday at the AMIA TBI Summit .   Thanks to all who helped out with this, but as always I take full responsibility for missing important work.  I don’t think I highlighted anything undeserving, but who knows!"], "link": "http://rbaltman.wordpress.com/2012/03/22/translational-bioinformatics-2012-year-in-review/", "bloglinks": {}, "links": {"http://www.amia.org/": 1, "http://feeds.wordpress.com/": 7, "http://dl.dropbox.com/": 3}, "blogtitle": "Building confidence."}, {"content": ["I gave my annual “Year in Review” talk to the AMIA Translational Bioinformatics Summit yesterday.  It covers papers from approximately Feb 2010 to Feb 2011. So it is really a review for 2010, but I deliver it in 2011, so thus the naming.  We have made great progress and so it was hard to choose papers to highlight.  The slides are here .  I have also posted the slides from previous years ."], "link": "http://rbaltman.wordpress.com/2011/03/10/translational-bioinformatics-2011-year-in-review/", "bloglinks": {}, "links": {"http://jointsummits2011.amia.org/": 1, "http://rbaltman.wordpress.com/": 1, "http://feeds.wordpress.com/": 7, "http://dl.dropbox.com/": 1}, "blogtitle": "Building confidence."}, {"content": ["As you may know, I review the field of translational bioinformatics each year in an attempt to highlight key papers and trends from the year.   I present this review at the AMIA Summit on Translational Bioinformatics .  I review papers published in the period from January 2010 through February 2011.   I am now accepting nominations for excellent papers that deserve highlighting, you can send your own work, but nominations of other people’s work is even more compelling. \n I define “translational bioinformatics” fairly broadly as any informatics work developing or applying methods that link basic molecular, genetic, and cellular data to clinical concepts such as drugs, diseases, symptoms and patients. \n If you would like to get a sense for the papers I have highlighted in the past, you can see them on a previous post to this blog . \n I would like your nominations (add them as comment here, or email me) by February 15, so that I can narrow things down to the final list.  As always, I will make the list available as the slides from my talk at the AMIA TB summit, as well as an endnote library. \n Thanks and Happy New Year!"], "link": "http://rbaltman.wordpress.com/2011/01/06/call-for-great-papers-in-translational-bioinformatics/", "bloglinks": {}, "links": {"http://jointsummits2011.amia.org/": 1, "http://rbaltman.wordpress.com/": 1, "http://feeds.wordpress.com/": 7}, "blogtitle": "Building confidence."}, {"content": ["I have asked one of my students who is acting as a Teaching Assistant for a new course on personalized genomics at Stanford to comment on the recent Government Accounting Office testimony on Direct-to-Consumer Testing. \n Konrad writes: \n On July 22, 2010, the Government Accountability Office (GAO) released a testimony on Direct To Consumer (DTC) Genetic Testing companies. In the testimony, the GAO sent DNA from 5 anonymous donors to 4 anonymous DTC companies. At times, the results were astonishing, such as claims made by some of the companies taking advantage of ill-informed customers to sell custom supplements “based” on genetic test results. However, the testimony also revealed a fundamental disconnect in communication between science, medicine, and the public: a disconnect that has always existed, but is now being brought to the public eye, as recent technologies have begun to bridge the gap between scientists and consumers. \n To preface, it is of course outrageous that anyone interpret a DTC genetic test as a diagnostic test (at least in their current form). Analysis of a personal genome is not a medical test. For the bulk of genetic markers, having a “high risk” allele for a disease is not even close to a diagnosis of the disease. It is simply an indicator that on average, in the particular population chosen by a research study (which are often small populations or populations selected to be enriched for a particular disease), individuals with that particular allele had a higher incidence of the disease in question than individuals without the allele (i.e. the “high risk” allele has a higher odds for the disease than the other). The companies then translate into a overall disease risk, which adjusts the prior probability of getting the disease by this odds ratio. Depending on which studies and genes/alleles a company takes into consideration, this risk may be vary considerably. In any case, the report provides a final probability of getting a disease, which may or may not actually be the same as the actual outcome. Just as an individual can get lung cancer without smoking, one can get diabetes even with a below average risk. \n This is not to say all the calculations of the disease risk interpretations of all these companies are flawless (we haven’t verified the math and studies in all these companies), but the fact remains that there are legitimate scientific differences on how to interpret the data. While no particular method is outright “wrong,” there are better and worse ways to analyze results of genetic tests and competition among DTC companies for the highest quality interpretations should become increasingly important. Of course, it is objectively difficult to measure which interpretation is “best,” but this will change as more data become available both in predictive claims and possibilities for validation. \n According to the testimony, the Department of Health and Human Services’ Secretary’s Advisory Committee on Genetics, Health, and Society notes that “[practitioners] cannot keep up with the pace of genetic tests and are not adequately prepared to use test information to treat patients appropriately.” While this may be true at present, this need not stop information from genetic tests from entering the clinic. A general practitioner may not be able to keep up with the latest advances in neurosurgery, but that’s where the specialist system thrives. In any case, just as clinicians are expected to demonstrate a basic level of competence in immunology in medical school, genetics must be treated the same way. Here at Stanford, a pilot project was launched to teach medical students about the field of genetic testing in an interactive classroom setting with state-of-the-art methods for analysis of personal genotypes. \n Deceptive marketing, including “personalized supplements” (allegedly with celebrity endorsements) and drugs that may “repair damaged DNA” (allegedly called “epigenetics”), to say nothing of surreptitious testing and scientifically nonsensical claims, are inexcusable and irresponsible practices for any company, not limited to this particular market. However, the delicate matter of genetic testing and its use as a clinical guidance tool is a concept that must be explored further. The GAO uses the phrase “misleading test results”: it should be noted that while the current implementation of the reporting of test results may be in certain ways misleading, the framework of genetic testing is not in itself misleading. Proper interpretation is based in the same mathematical and biological context as much of today’s medicine. There is great potential for the use of genetic tests in the clinic, so long as results are carefully interpreted. While this was often limited to geneticists in the past, we hope that this can be soon accomplished by physicians and the public."], "link": "http://rbaltman.wordpress.com/2010/07/25/guest-blog-konrad-karczewski/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://med.stanford.edu/": 1, "http://www.gao.gov/": 1, "http://konradjkarczewski.com/": 1}, "blogtitle": "Building confidence."}, {"content": ["I am very pleased that Stanford medical school (disclaimer:  I work for Stanford) is offering a class on personalized genomics.  A cool but controversial (some say potentially dangerous) feature of this course is offering the option to students to get part of their genome measured (1 million SNPs).  The course is introducing the concepts of genomics to the students and giving them a preview of how genomics may impact medical practice in the future.  At the same time it is important to ensure that the students understand that the tests as they exist today are not likely to be the ones used in clinical practice.  The tests will need clear medical guidelines for interpretation, and we will need to decide if genetic tests are done “as needed” or “once at birth” or something in between.  The recent coverage is in SF Chronicle and USA Today .   It is critical that the next generation of physicians understand what is coming."], "link": "http://rbaltman.wordpress.com/2010/07/13/stanford-personal-genome-class-in-news/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://www.sfgate.com/": 1, "http://www.usatoday.com/": 1}, "blogtitle": "Building confidence."}, {"content": ["I am very pleased that my colleagues at Stanford have decided to offer a class on personal genomics to the medical students.  The class is elective, and getting your 1 million SNPs tested is optional.  If you want your own SNPs, you have to pay $99 (it’s sounds like a copay, why not also give them the experience of our whacky medical finance system while we are at it?  They are going to learn a ton in this course!).  If you don’t do your own genotypes, they have a standard reference genome for you to do the homeworks.  The class is lead by my colleague Stuart Kim and an enterprising MD/PhD student, Keyan Salari , who really fueled the effort to offer the course.  This course was not easy to get going.  There was significant and legitimate concerns among the faculty about the prudence of doing this.  There was an entertaining and informative email debate during which we fleshed out the issues.  We also watched the response to the proposal to genotype incoming Berkeley undergraduates (I’m also a fan of that).   The Stanford Dean’s office has released an announcement discussing the course and the decision process and safeguards that have been put in place.  Outstanding. \n I am honored to be participating in the class as a lecturer on–you guessed it– Pharmacogenomics .  The students have all heard my standard talk as part of their basic genetics curriculum, so we will do some advanced stuff in this class.  I think that we will have them assess the genetics of response to some drugs based on very solid pharmacogenomics evidence:   statins , clopidogrel and warfarin .  I will have them all compute the ideal dose of warfarin from the genome they are working with based on the dosing equation we published last year (or maybe the modified one we published this year ) that uses genetics.   Then, for fun and to get them really thinking, we will assess the genetics of response to other drugs where the evidence is published but not as firm.  This is going to be the more common situation for using genetics in pharmacology, and they need to start understanding how to take imperfect evidence and fold it into their medical decision making about prescribing.  I haven’t decided which drugs to cover there, but our recent paper analyzing Steve Quake’s genome offered some interesting inferences on more than 100 drugs, so I will pick some that may be relevant to young physicians. \n Anyway, this is great, and I am proud that we are trying to push the agenda of bringing personal genomics to medical training.   Someday, I hope this is a mandatory part of pharmacology or genetics or both, but I’ll take an elective at this point."], "link": "http://rbaltman.wordpress.com/2010/06/09/stanford-offers-cool-class-to-med-students-analyze-your-or-someones-genome/", "bloglinks": {}, "links": {"http://rbaltman.wordpress.com/": 1, "http://feeds.wordpress.com/": 7, "http://med.stanford.edu/": 1, "http://www.pharmgkb.org/": 4, "http://www.nih.gov/": 3, "https://med.stanford.edu/": 1, "http://payvand.com/": 1}, "blogtitle": "Building confidence."}, {"content": ["UC Berkeley recently announced that they will offer incoming freshman free genotyping at three genetic loci for folate , alcohol and lactose .  This is part of a tradition at Cal to engage entering students with some shared intellectual activity (the “On the same page” program).  I believe it is absolutely critical that we immediately start educating students about genetics, and the use of genetic tests in making decisions in life.  I think that direct engagement with personal data is one very effective way to make all the issues crystal clear.  This should be optional and there should be adequate safeguards, but this should not stop us from getting started in educating the general population about the promise and pitfalls of genetics.   Thus,  I think that this is great and that Cal (a traditional rival of Stanford, thus the title of this post) deserves credit for bringing genetics to the consciousness of our next generation of leaders.   Some have voiced concerns , and these can be handled with reasonable precautions.  I am particularly amused by the concern that knowledge of genetics might induce poor behavior with respect to alcohol consumption.  While this is certainly a theoretical possibility, it is my impression that students are already making poor decisions about alcohol consumption at such a rate that knowledge of genetics is unlikely to affect this trend appreciably.  In fact, anything that gets the pros/cons of alcohol consumption into the discussion while students are sober is probably a good thing.   We have featured alcohol genetics on a site to help high school biology students can see genetics in action .    So, at least in the NARROW ARENA OF PROVIDING GENETIC INFORMATION SO STUDENTS CAN LEARN…Go Cal!"], "link": "http://rbaltman.wordpress.com/2010/05/21/i-cant-believe-im-saying-this-go-cal/", "bloglinks": {}, "links": {"http://www.dnatwist.org/": 1, "http://ls.berkeley.edu/": 1, "http://feeds.wordpress.com/": 7, "http://www.pharmgkb.org/": 3, "http://www.nih.gov/": 1, "http://www.mercurynews.com/": 1}, "blogtitle": "Building confidence."}, {"content": ["I have some comments about this recent ruling on my other blog ."], "link": "http://rbaltman.wordpress.com/2010/03/30/myriad-patent-case/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://web.mac.com/": 1}, "blogtitle": "Building confidence."}, {"content": ["I presented my review of the year in translational bioinformatics at the AMIA Summit on Translational Bioinformatics .   It is highly biased and subject to all the problems of one person trying to do something like this, but I have made a PDF of the slides available here .  These are papers published since January 2009 to present.   I apologize for important papers that I have missed, and thanks to those who provided advice.   As I have mentioned previously, you can also see the 2008 version and the 2009 version ."], "link": "http://rbaltman.wordpress.com/2010/03/15/year-in-review-2009-translational-bioinformatics/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://dl.dropbox.com/": 3, "http://summit2010.amia.org/": 1}, "blogtitle": "Building confidence."}, {"content": ["I discuss it on my PharmGKBlog ."], "link": "http://rbaltman.wordpress.com/2009/12/09/nice-report-by-pricewaterhousecoopers/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://web.mac.com/": 1}, "blogtitle": "Building confidence."}]