[{"blogurl": "http://teachingcollegemath.com\n", "blogroll": [], "title": "Busynessgirl"}, {"content": ["The single most important tool I’ve found for improving Digital Literacy is Wolfram Alpha.  At your fingertips, whether on your phone, tablet, or laptop, you have access to all the world’s readily available data.  All you have to do is ask.  The best thing I can do to improve data literacy is to teach students (and other adults I know) to question the facts they are being quoted as gospel.  Here are a bunch of searches I’ve done recently to verify or refute data someone has told me in conversation. \n \n Salary for a doctor \n Unemployment in Utah \n Federal deficit \n Calories in a Frappacino vs a Latte \n Crime rate in New York vs Detroit \n Facebook Report (to generate a report of all your Facebook data) \n \n  \n While my top choice for digital literacy is Wolfram Alpha, there are some other resources that are great for understanding, interpreting, and visualizing data.  Here are a few: \n \n \n Gapminder (the software used by Hans Rosling in his many, many TED Talks) \n Worldmapper (territories are scaled/resized according to the subject of interest) \n Measure of America  (look at interactive maps and data about Social Science in the U.S.) \n Human Development Reports (explore public data from the United Nations using a variety of visualizations) \n Visual.ly (create your own infographic around a set of data) \n Many Eyes (from IBM, create a visualization around your data) \n Google Trends (explore how a search term has fared over time) \n Google Correlate (find searches that correlate with real world data) \n Google Fusion Tables (fuse two sets of data together and visualize) \n \n There are also a few sites that do a fantastic job of creating and sharing data visualizations: \n \n \n Information is Beautiful \n Flowing Data \n History Shots \n Edward Tufte \n The Guardian Datablog \n \n \n \n \n\n Possibly Related Posts: \n \n Future of Working \n Mindmap for Studying Social Media \n Tears of Joy: Canvas Analytics is ON \n Google Hangout + TED Talks = CONNECT \n Web Tools to Enhance Learning"], "link": "http://feedproxy.google.com/~r/TeachingCollegeMath/~3/B65Heom5gVQ/", "bloglinks": {}, "links": {"http://www.informationisbeautiful.net/": 1, "http://www.addtoany.com/": 1, "http://www.gapminder.org/": 1, "http://historyshots.com/": 1, "http://flowingdata.com/": 1, "http://www.wolframalpha.com/": 6, "http://hdr.undp.org/": 1, "http://www.measureofamerica.org/": 1, "http://www.worldmapper.org/": 1, "http://www.edwardtufte.com/": 1, "http://create.visual.ly/": 1, "http://www.co.uk/": 1, "http://busynessgirl.com/": 6, "http://www.google.com/": 3, "http://www-958.ibm.com/": 1}, "blogtitle": "Busynessgirl"}, {"content": ["I feel like I’ve been in life free-fall all summer.  I didn’t begin the summer intending to quit teaching, change jobs, and move 1000 miles away, but that’s what I did, and it still catches me off-guard sometimes. \n  \n It’s amazing how rooted your brain can become in patterns of behavior.  I keep having these momentary lapses of memory, especially when I travel.  I’ll wake up in a strange hotel room and my brain will begin searching for the “teaching tasks” I have to do (paper grading, class prep, test writing), and then all of a sudden I will have this realization that I have a new job, live in a new state, and am no longer teaching classes.  It’s a strange mental shift every time it happens.  It leaves me with this uneasy pit in my stomach.  I left a pretty safe predictable job for one with a much higher degree of uncertainty, where I’m still feeling out my job duties and I rarely know what to expect to be assigned next. I suspect this feeling of uncertainty will pass with time, but for now, it’s a strange way to wake up in the morning. \n I always worried that I would miss teaching if I left, but so far that hasn’t happened.  Perhaps it’s because my job keeps me pretty busy. Like teaching, there is an endless list of things I could be accomplishing, so I’m never bored. \n I’ve been trying to understand work-life balance as it pertains to my new position.  As an educator, there was no work-life balance during the semester.  If you weren’t teaching, you were either planning to teach, grading papers, or doing a post-mortem on something you taught and trying to figure out how to make it better the next time around.  I worked from the moment I woke up till the time I dropped into bed exhausted, 7 days a week, week after week. \n There seems to be a little space for the possibility of a life outside of work now that I’m not teaching.  Email slows to a trickle (if any) on the weekend.  There’s a definite lull in work activity after 6pm every day as people go home to their families and spend time with them.  This has been the strangest thing to get used to. Students communicated indiscriminately throughout the week – no time was sacred and responses were always expected and expected quickly.  How strange it is to turn off email on a Saturday and not worry about an angry student escalating their problem to an administrator while you enjoy a day off. \n\n Possibly Related Posts: \n \n New Chapter: Life Reboot \n Self Evaluation: List of Fives \n Powerless (aka Life Without Internet, Round 3) \n Year in Review 2010 \n What is a Doctorate? Well, I am here.."], "link": "http://feedproxy.google.com/~r/TeachingCollegeMath/~3/2ZUOhDTA3Bs/", "bloglinks": {}, "links": {"http://www.addtoany.com/": 1, "http://busynessgirl.com/": 6}, "blogtitle": "Busynessgirl"}, {"content": ["I’m in the process of setting up a new computer (yes, the rumors are true … I’m using a MacBook Pro now).  Now I have a work gmail account and a personal gmail account, so I’m setting up my new computer with Chrome synced to my work Gmail.  This means I’m revisiting my “must-have” Chrome browser extensions and looking around to see if I’m missing anything awesome. \n  Chrome Extensions live in the address bar at the top of the Chrome Browser. \n Consider this a major update to the list of Chrome Extensions I compiled in 2010 .  Here are a few of my recent favorites that might be useful to you: \n Reading and Writing \n RSS Subscription Extension :  If a website has an RSS feed and you’re NOT subscribed via Google Reader, the RSS icon will appear in the address window. Click on it and subscribe to the RSS for new content. \n Lazarus Form Recovery : You know how the browser inevitably crashes when you’re writing a paragraph of text in a conference proposal?  Lazarus autosaves all the text you enter in form fields.  When the browser crashes, you’ll recover that text. \n Thesaurus Extension : Highlight a word with your cursor, right-click (Mac: CMD-click or 2-finger tap) on the word, choose the thesaurus option. \n  To delete an extension, turn one off, or change the settings, go to the Chrome “wrench” in the upper right-hand corner, then “Tools”, then “Extensions.” Click on image to enlarge. \n Video Extensions \n Turn Off the Lights : When there is video content on a page, you’ll see the ToTL icon turn black. Click it and the rest of the screen will fade out so that you can watch the video without distraction. \n QuietTube : Send viewers to a Youtube video without all the ads and other video suggestions. This is fantastic for instructors that want to strip off all the video suggestions and the advertisements (well, most of them). \n Bookmarking and Sharing \n Mindomo Bookmarks : When you visit a webpage that you’d like to add to your mindmaps, click Mindomo Bookmarks to import the URL and site description to your Mindomo Account (you need to set up or link to an existing Mindomo account to do this – make sure you manually set up an account, don’t use the auto-setup from Gmail or Facebook).  When you go to Mindomo, you can quickly move those links to the appropriate mindmap branches. \n bitly Bookmarks : I have to say that I used to like this extension a lot.  It used to be that in one click, you could send a URL and site description to your Twitter account.  Now it takes 4 clicks to do the same thing, and you can’t add hashtags to the end of a tweet anymore.  Hashtags will appear before the URL.  So any functionality that depends on the hashtag on the end of a Tweet will no longer work.  I’m replacing this one with Hootsuite, but it still might be useful for you if you’re also looking for a Bookmark manager. \n Hootsuite Hootlet :  Quickly share with any/all of your social media sites. Schedule messages for later. \n Readability :  View any article in an easy-to-read font of your choice, in the width of your choice, without all the ads and other crap on webpages. \n Send from Gmail : Click the icon to send the website URL and description to someone using your Gmail account. \n Miscellaneous \n AdBlock : Block most advertisements on webpages.  Note: You will sometimes have to turn this off to get a website to load properly. \n StayFocusd : Increase your productivity by enforcing self-imposed rules about how much time you can spend on a given website (like, ahem, Facebook). \n Designing or Editing a website? \n WhatFont : Just hover over the text on a webpage and a tool tip pops up to tell you what the font is. \n Color Picker : An eyedropper tool that tells you what the color you’re looking at on a webpage is. \n To make this list more dynamic (and easy to find in the future), I’ll house a permanent collection of great Chrome extensions under the Resources Tab: Chrome Extensions from now on. \n\n Possibly Related Posts: \n \n The Evolution of the Illustrated Prezis \n Self Evaluation: List of Fives \n Triple Click \n Turning Ideas into Action \n TEDxMuskegon: A Recipe for Free Range Learning"], "link": "http://feedproxy.google.com/~r/TeachingCollegeMath/~3/mqdUiQlASiY/", "bloglinks": {}, "links": {"https://chrome.google.com/": 13, "http://quietube.com/": 1, "http://www.addtoany.com/": 1, "http://busynessgirl.com/": 9}, "blogtitle": "Busynessgirl"}, {"content": ["I have this sneaky trick I use to tell which students watch online videos and which don’t.  I hide “secret codes” in the videos (like the programmer’s Easter Eggs).  When a student finds one of my “Easter Egg codes” they can submit it for 1 point towards participation.  Sometimes the codes are numbers I generate at random (Ex: 40234) and sometimes it’s a word, phrase, or story (my cat is chasing a fly in front of my computer). \n I don’t tell the students where the codes are. I don’t tell them HOW I’ve shared the code or what kind of code it is.  Some videos have codes, and many don’t.  Because of the random distribution of codes in videos, and my “loose” way of collecting them for points, I can always add or remove videos with codes, and it won’t affect the overall point system. \n  Here's an example of a video code inserted as a callout bubble. Click on image to enlarge. \n Let me explain. Students are not required to watch particular videos and there are two other ways to earn participation points.  Participation for each unit is counted out of 10 points, but 5 extra credit points may also be earned.  Thus, there is a cap on the total number of points I will count. \n Participation points can be earned by: \n \n Participating in a live online chat. (2 points) \n Posting something substantive in a Discussion. (1 point) \n Turning in a video code. (1 point) \n \n Here are various ways that I hide the codes in videos: \n \n In callout bubbles I add post-recording and pre-production \n On calculator screens (sneaky, huh?) \n In something I say out loud \n In something I write on the journaling screen \n In something I say and write on the journaling screen \n In the text of a math equation \n Underlining a particular word or phrase on the screen from a lesson \n An action to take (call my office phone and sing the quotient rule to me) \n \n Collecting the codes is the real trick.  Some years I’ve used a Google Spreadsheet or Doc for the collection.  This year, I’m using the comment field of the Canvas Graded Discussions.  I set up one Discussion for each unit, worth 10 points.  When a student participates in an online chat, I go to the gradebook for this Discussion and add a comment “Chat 7/9/12 = 2 points” for that student.  When the student submits a video code, I go to the gradebook for this Discussion and add the comment “Video Code 40234 = 1 point”.  Then when I go to grade the assignment, I see not only all the students’ discussion posts, but also all their collected codes and chat points (see image). \n  Canvas Discussions grading screen with comments. Click on image to enlarge. \n It’s really interesting to see which students find and submit the codes and which students never submit a single code. This helps me to track the progression of students through a particular unit.  Pessimistically, it helps me to “catch” those students who claim they are watching videos when, in fact they aren’t.  But optimistically, I can also tell who consistently watches all the videos by seeing their collected codes pile up.  While I haven’t always enjoyed keeping lists of students and codes, the “Easter Egg” method has worked well over the years to keep track of video-watching as a way to participate in online courses. \n\n Possibly Related Posts: \n \n New Chapter: Life Reboot \n Online Office Hours in Instructure Canvas \n Mobile Phone Cameras in Teaching and Learning \n Tears of Joy: Canvas Analytics is ON \n Google Hangout + TED Talks = CONNECT"], "link": "http://feedproxy.google.com/~r/TeachingCollegeMath/~3/oDjfwGffT0g/", "bloglinks": {}, "links": {"http://www.addtoany.com/": 1, "http://busynessgirl.com/": 7}, "blogtitle": "Busynessgirl"}, {"content": ["For the last year, I’ve felt this yearning to do something different. I’ve been a full-time faculty member for a decade now, teaching many of the same courses semester after semester after semester after … yeah, well, you get it. \n A series of conferences and events in the last 6 months has made me realize that my “alignment” between my passions and my job was off.  I attended the UpToAllOfUs un-conference in February, and felt a strong pull to do something different, something more amazing.  I attended the TEDxSummit in April, and coming back to work was like a rude awakening after being in a liquid network of ideas for 5 days. And then I attended the LAK conference and really just felt unsettled about how I was spending my time. \n Since I began blogging in 2007, I’ve learned about so many things in my free time: education technology, the scholarship of teaching and learning, social media, data visualizations, professional development for faculty, higher education, leadership, learning analytics, eLearning strategies, game design, writing, speaking, technology for productivity, mobile apps, and … well, probably a lot of things that aren’t coming to mind right now.  In this decade I’ve finished a Ph.D., made a name for myself as a futurist, and connected with instructors, innovators, and futurists around the world. \n Now, the time has come to shed one identity (math faculty) and take on a new one.  It’s actually an identity I’ve been donning in my “free” time for a while now, I’m just shifting the focus to it full-time now. \n I have accepted a position as the Director of Learning and Research  at Instructure (they build the Canvas learning platform), in Sandy, Utah.   The position will give me a chance to grow professionally, to use all the skills I’ve learned in the last five years, to work with some really amazing, talented, and energetic people,  and (bonus) I get to move back to the mountains. \n  The view from the Instructure building. \n Why Instructure? After all my complaining (for years) about the state of the LMS market, I began using Canvas in May and fell head-over-heels in love with it. It is, by far, the best learning platform I’ve ever seen, and Instructure is innovating like mad. I have always said I’d know the right job when I saw it, and this is it!  I want, more than anything, to help Instructure  to build and spread the best learning platform the world has ever seen, and I am super-excited to get started. \n \n \n\n Possibly Related Posts: \n \n Momentary Lapse of Memory \n Video Code Easter Eggs \n Online Office Hours in Instructure Canvas \n Tears of Joy: Canvas Analytics is ON \n Blackboard to Canvas: Finding Missing Files Quickly"], "link": "http://feedproxy.google.com/~r/TeachingCollegeMath/~3/RUYuzn0MexM/", "bloglinks": {}, "links": {"http://www.addtoany.com/": 1, "http://busynessgirl.com/": 8, "http://www.instructure.com/": 1}, "blogtitle": "Busynessgirl"}, {"content": ["I have been incredibly happy with the online office hours that I’ve been holding in Canvas this semester (see previous post on SAVI tools in Canvas here ).  Day after day, students are showing up for office hours to ask their own questions, hear other students’ questions, and just kind of hang out while they work on problems.  It’s lovely to SEE my online students regularly and I feel a much greater connection to this summer’s students than from any prior semester. \n  \n I’m quite sure that the difference is the ease of use of the Canvas Chat tool.  There are no logins, no scheduled sessions, and there is no separate software to install.  To get into the online office hour, the student (and the instructor) simply has to click on Chat.  To share camera and/or audio, they click “Start Broadcasting” and follow the prompts.  It really does not get much easier than that. \n  Images of Instructor and Student Guides for Online Office Hours in Canvas. Click on image to enlarge. Follow links in blog post for actual documents. \n To make it easier for other instructors to implement the practice of online office hours, I wrote two guides: \n \n Instructor Guide: Online Office Hours in Canvas Chat \n Student Guide: Online Office Hours in Canvas Chat \n \n The instructor guide contains tips on: \n \n Webcams: Should you require or not? \n Scheduling sessions: When and how? \n Syllabus considerations \n User Limit to Chat \n Sharing a YouTube video, with an interactive whiteboard, or a screenshot \n Sharing a document through the link to a Canvas page \n Taking attendance \n Students with low bandwidth \n Troubleshooting technical problems \n Reducing the “echo” effect that commonly plagues SAVI tools \n \n If you’re going to share these with colleagues or students (which is fine), please share through the hyperlink so that if I update the documents in the future, you’ll always have the current version.  Hope these are helpful to you! \n\n Possibly Related Posts: \n \n Video Code Easter Eggs \n New Chapter: Life Reboot \n Mobile Phone Cameras in Teaching and Learning \n Tears of Joy: Canvas Analytics is ON \n Google Hangout + TED Talks = CONNECT"], "link": "http://feedproxy.google.com/~r/TeachingCollegeMath/~3/8aM4_6uXej8/", "bloglinks": {}, "links": {"http://www.addtoany.com/": 1, "http://busynessgirl.com/": 10}, "blogtitle": "Busynessgirl"}, {"content": ["Many people have asked about how we do the illustrations for the Prezi presentations I build, so I thought I’d write a little about the process we go through. I say “we” because the presentations are mine, but I couldn’t do them without the help of an incredibly talented illustrator, Mat Moore. \n We’ve worked together on illustrating books and presentations for three years now, and I’m pretty sure that Mat can now read my mind. Our process now goes something like this. \n I call Mat and say “I need a new illustration, as detailed as possible (translation: I’m paying top dollar – make it awesome!), on the Future of Working. Because a lot of what I’m talking about will be related to digital and virtual work, it would be cool if the illustration was a corporate office park, but built entirely out of computer chips – remember we started doing an illustration like that once? Well, let’s really go all out this time.” Mat: “Okay.” \n  First (Rough) Draft of \"Future of Working\"    Click on Image to Enlarge. \n At some point a few days later, I get a draft. It is a ROUGH of what the sketch might look like. Just like with software design, it’s really better to make changes here, before the really hard work of illustration is done. This is the point where you have to tell the illustrator if you hate it, want specific details, etc. Sometimes I know that I want some very specific elements in the presentation (for example, in past presentations, I’ve asked for a money tree, a person straddling the “Internet” pipes holding a laptop, etc.). This is the time to tell your illustrator about anything specific that you really NEED to be in that illustration. It will be much harder to add it later. \n At this point in our working relationship, Mat knows that he needs to leave me blank spaces, roughly rectangular in shape, to add the presentation elements. We didn’t know this when we first started doing these presentations, it has been a feature that has evolved over time. If you look carefully, you’ll see that every illustration has space specifically left for this purpose now. When I get next version of the illustration from Mat, there is still a little back and forth between us as we tweak the illustration. \n Once I’m on the final version, I have to produce a SWF file for the illustration (the PDF versions are usually too big to be processed by Prezi). Then I look for the blank canvases that Mat has left me in the illustration. Here are a few examples of places where I will drop the “slides” in this presentation. \n  Nice rectangular spaces on this computer chip. Perfect for a sequence of slides on the same topic. Click on image to enlarge. \n  Here's an example of some less structured space that was left blank for me to add presentation elements. You can see the \"before\" and \"after\" in the comparison. Click on the image to enlarge. \n  Here you can see the same illustrated space without and then with the presentation elements. Click on image to enlarge. \n In the final version, the presentation elements are so integrated with the image, that it can actually be difficult to spot them. The only real indicators are because the presentation elements introduce an element of color to the black & white canvas. \n  Final \"Future of Working\" Prezi.         Click on image to enlarge. \n You can view the final version of this particular illustration here: Future of Working or click through the embedded version below. \n \n \n The Future of Working on Prezi \n \n \n\n Possibly Related Posts: \n \n Favorite Google Chrome Extensions \n Self Evaluation: List of Fives \n Triple Click \n Turning Ideas into Action \n TEDxMuskegon: A Recipe for Free Range Learning"], "link": "http://feedproxy.google.com/~r/TeachingCollegeMath/~3/DpZYCxH9Pj4/", "bloglinks": {}, "links": {"http://prezi.com/": 2, "http://www.addtoany.com/": 1, "http://busynessgirl.com/": 10, "http://prezi.com": 1}, "blogtitle": "Busynessgirl"}, {"content": ["For the last three weeks, in preparation for a presentation, I’ve been thinking a lot about the Future of Working.  Not the Future of Careers per se, but the future of working and work-life – what will it be like to work in the year 2020? \n  \n So after much thinking (usually while doing mundane tasks like weeding gardens and sanding the house), discussions with other futurists, reading, and consideration of the outside pressures on the workplace and work-life, I’ve built a new presentation on the Future of Working.  I do have an audio transcript, which I hope to have my assistant transcribe soon, but for now you can get the general gist of what was discussed by clicking through the Prezi. \n \n \n \n The Future of Working on Prezi \n \n \n The illustration for this Prezi is really incredibly impressive (kudos to my illustrator, Mat Moore).  The setting is an office/industrial/agricultural complex, except the whole complex is built from computer parts.  We’ve worked together on these illustrated Prezis for years now and Mat leaves me blank spaces to incorporate the “slides” in the presentation, as you see in the image below. \n  Mat leaves open spaces in the illustrations for me to drop in photos and frames on the path of the presentation. Click on the image to enlarge it. \n You won’t notice the incredible level of detail in this illustration until you view the zooms during the presentation. He’s really put in some incredibly tiny details like streetlights and trees.  I think I’ll have to print a poster-size version just to find all the easter egg details in this one. \n  Note the details like trees and street lights that Mat has drawn into the illustration. Click on the image to enlarge it. \n \n\n Possibly Related Posts: \n \n Resources for Data Literacy \n Mindmap for Studying Social Media \n Tears of Joy: Canvas Analytics is ON \n Google Hangout + TED Talks = CONNECT \n Web Tools to Enhance Learning"], "link": "http://feedproxy.google.com/~r/TeachingCollegeMath/~3/n79sNBDaq3Q/", "bloglinks": {}, "links": {"http://prezi.com/": 2, "http://www.addtoany.com/": 1, "http://busynessgirl.com/": 7, "http://prezi.com": 1}, "blogtitle": "Busynessgirl"}, {"content": ["My latest “Teaching with Tech” column for MAA Focus just published this week. \n Phone Cameras Handle Information in a Snap! \n  Teaching with Tech: Phone Cameras Handle Information in a Snap! \n \n Here are the general topic areas: \n \n Carrying a library of “good problems” with you for topics you are teaching. \n Transfer an application problem to the computer/projector in your classroom. \n Share your lecture notes from class (from a blackboard, whiteboard, or document camera). \n Keep notes from a meeting. \n Make a copy of a handout or meeting agenda. \n Share student work for discussion about good methods or errors in thinking. \n Answer emailed questions easily. \n Tips for Conferences \n \n Phone Cameras Handle Information in a Snap! \n Archive of Teaching with Tech Columns \n \n\n Possibly Related Posts: \n \n Video Code Easter Eggs \n Online Office Hours in Instructure Canvas \n Tears of Joy: Canvas Analytics is ON \n Aligning Inline Equations Vertically in Instructure Canvas \n Collecting Learning Notebooks in an Online Course"], "link": "http://feedproxy.google.com/~r/TeachingCollegeMath/~3/J9WeIgvGFmQ/", "bloglinks": {}, "links": {"http://busynessgirl.com/": 5, "http://www.addtoany.com/": 1, "http://www.maa.org/": 4}, "blogtitle": "Busynessgirl"}, {"content": ["For the last two years, I’ve been studying social media from all angles in anticipation of teaching a full course on Social Media (which I did in the Winter 2012 semester).  During that time, I tweeted all sorts of articles, videos, blog posts, and resources related to all aspects of Social Media. \n Today I’m doing a 4-hour workshop on Social Media for the MCCVLCC , and in an effort to organize and make sense of two years of study, I decided to build a mindmap about Social Media  from all the tweets I’ve made about this in the last year. \n  View of expanded mindmap for       Studying Social Media. \n \n There are eight major branches on the mindmap: \n \n Guidelines and Policies \n The Business of Social Media \n Studying the Social Network \n History of Social Networks and Media \n Social Media and Education \n Human Relationships \n Technology and Tools \n Legal, Ethical, and Privacy Issues \n \n Keep in mind that this is not, by any means, a complete map of Social Media. This is just everything I’ve tweeted related to Social Media in the last year. \n Mindmap: Studying Social Media \n  View of the eight categories of the       Studying Social Media mindmap. \n NOTE: Due to circumstances I can’t control, you will not be able to view this map from an iPad. Mindomo did just recently put out an App for building a mindmap on iPad, so I suspect viewing mindmaps of other people will be coming soon. Sorry! Please view with a computer for now. \n\n Possibly Related Posts: \n \n Resources for Data Literacy \n Future of Working \n Tears of Joy: Canvas Analytics is ON \n Google Hangout + TED Talks = CONNECT \n Web Tools to Enhance Learning"], "link": "http://feedproxy.google.com/~r/TeachingCollegeMath/~3/GkXIV64gCRE/", "bloglinks": {}, "links": {"http://www.addtoany.com/": 1, "http://busynessgirl.com/": 5, "http://vcampus.mccvlc.org/": 1, "http://www.mindomo.com/": 4}, "blogtitle": "Busynessgirl"}]