[{"blogurl": "http://www.mii.ucla.edu/causality\n", "blogroll": [], "title": "Causal Analysis in Theory and Practice"}, {"content": ["Thank you for visiting. This blog is devoted specifically to the topic of causation to be driven by visitors with interest in the field. \n \n To find out about the purpose of this blog, please click here . \n To submit a topic or question for discussion, please click here   and complete the simple form. \n \n \n We appreciate your interest in causality and hope to see your views on this subject!"], "link": "http://www.mii.ucla.edu/causality/?p=28", "bloglinks": {}, "links": {"https://spreadsheets.google.com/": 1, "http://www.ucla.edu/": 2}, "blogtitle": "Causal Analysis in Theory and Practice"}, {"content": ["Dear friends in causality, \n I am happy to announce that Manabu Kuroki has received a publication award \nfor the Japanese edition of my book, “Causality” from The Behaviormetric Society \nof Japan. “This award has been given to the authors who had excellent publications \nor the translation regarding humanities and social sciences in Japan.” \n The provided links of the award are below (sorry it is in Japanese): \n The Behaviormetric Society of Japan: \n http://www.bsj.gr.jp/about/prize.html \n Kyouritsu Shuppan Co, Ltd: \n http://www.kyoritsu-pub.co.jp/bookdetail/9784320018778 \n Our proud congratulations to Manabu for this immense honor. \nJudea"], "link": "http://www.mii.ucla.edu/causality/?p=508", "bloglinks": {}, "links": {"http://www.gr.jp/": 1, "http://www.co.jp/": 1}, "blogtitle": "Causal Analysis in Theory and Practice"}, {"content": ["The slides used in a recent UAI tutorial on \n“Graphical Models for Causal Inference” are now \navailable for public view and public use. \nclick on \n http://ftp.cs.ucla.edu/pub/stat_ser/uai12-mohan-pearl.pdf \n The slides were prepared by Karthika Mohan \nand the topics include: \n 1. probabilitic graphical models \n2. Markov compatibility \n3. d-separation \n4. Interventions \n5. Causal effects identification \n6. do-Calculus \n7. C-components \n8. Counterfactuals \n9. Markov Equivalence \n10. MAGs \n11. Confounding Equivalence \n12. Instrumental Variables \n13. Verma’s constraints \n Enjoy"], "link": "http://www.mii.ucla.edu/causality/?p=505", "bloglinks": {}, "links": {"http://ftp.ucla.edu/": 1}, "blogtitle": "Causal Analysis in Theory and Practice"}, {"content": ["The European Journal of Personality just published an article by James Lee, titled \n “Correlation and Causation in the Study of Personality” \nEuropean Journal of Personality, Eur.J.Pers. 26: 372-390 (2012) DOI:10.1002/per.1863. \nLink: http://onlinelibrary.wiley.com/doi/10.1002/per.1863/pdf , \nor here . \n Lee’s article is followed by Open Peer Commentaries \n http://onlinelibrary.wiley.com/doi/10.1002/per.1865/full , \nor here . \n (Strikingly, the commentary by Rolf Steyer declares the do-operator to be self-contradictory. I trust readers of this blog to spot Steyer’s error right away. If not, I will post.) \n Another recent paper on causation in psychological research is the one by Shadish and Sullivan, \n “Theories of Causation in Psychological Science” \nIn Harris Cooper (Ed-in-Chief), APA Handbook of Research Methods in Psychology, Volume 1, pp. 23-52, 2012. \n http://www.cs.ucla.edu/~kaoru/shadish-sullivan12.pdf \n While these papers indicate a healthy awakening of psychological researchers to recent advances in causal inference, the field is still dominated by authors who have not heard about model-based covariate selection, testable implications, nonparametric identification, bias amplification, mediation formulas and more. \n Much to do, much to discuss, \nJudea"], "link": "http://www.mii.ucla.edu/causality/?p=489", "bloglinks": {}, "links": {"http://onlinelibrary.wiley.com/": 2, "http://www.ucla.edu/": 3}, "blogtitle": "Causal Analysis in Theory and Practice"}, {"content": ["Andrew Gelman and his blog readers followed-up with the previous discussion (link here ) on his methods to address issues about causal inference and transportability of causal effects based on his “hierarchical modeling” framework, and I just posted my answer. \n This is the general link for the discussion: \n http://andrewgelman.com/2012/07/examples-of-the-use-of-hierarchical-modeling-to-generalize-to-new-settings/ \n Here is my answer: \n http://andrewgelman.com/2012/07/examples-of-the-use-of-hierarchical-modeling-to-generalize-to-new-settings/#comment-92499 \n Cheers, \nBareinboim"], "link": "http://www.mii.ucla.edu/causality/?p=479", "bloglinks": {}, "links": {"http://andrewgelman.com/": 3}, "blogtitle": "Causal Analysis in Theory and Practice"}, {"content": ["In the past week, I have been engaged in a discussion with Andrew Gelman and his blog readers regarding causal inference, selection bias, confounding, and generalizability. I was trying to understand how his method which he calls “hierarchical modelling” would handle these issues and what guarantees it provides. Unfortunately, I could not reach an understanding of Gelman’s method (probably because no examples were provided). \n Still, I think that this discussion having touched core issues of scientific methodology would be of interest to readers of this blog, the link follows: \n http://andrewgelman.com/2012/07/long-discussion-about-causal-inference-and-the-use-of-hierarchical-models-to-bridge-between-different-inferential-settings/ \n Previous discussions took place regarding Rubin and Pearl’s dispute, here are some interesting links: \n http://andrewgelman.com/2009/07/disputes_about/ \n http://andrewgelman.com/2009/07/more_on_pearlru/ \n http://andrewgelman.com/2009/07/pearls_and_gelm/ \n http://andrewgelman.com/2012/01/judea-pearl-on-why-he-is-only-a-half-bayesian/ \n If anyone understands how “hierarchical modeling” can solve a simple toy problem (e.g., M-bias, control of confounding, mediation, generalizability), please share with us. \n Cheers, \nBareinboim"], "link": "http://www.mii.ucla.edu/causality/?p=462", "bloglinks": {}, "links": {"http://andrewgelman.com/": 5}, "blogtitle": "Causal Analysis in Theory and Practice"}, {"content": ["Dear friends in causality research, \n This communication highlights a few meetings in the summer of 2012, that should be of interest to causality researchers. Naturally, these are biased in favor of those that were brought to my attention. If you know of more such meetings, feel free to post. \n 1. \n July 22-26, 2012, Toronto, Canada \nAnnual Conference of the Association for Advancement of \nArtificial Intelligence, AAAI-12, \n http://www.aaai.org/Conferences/AAAI/2012/ \n I will present a lecture on “The Mechanization of Causal Inference, a Mini Turing-Test and Beyond”` \n http://www.aaai.org/Conferences/AAAI/2012/aaai12turing.php \nand Elias Bareinboim will present a completeness result for the transportability problem. \n http://ftp.cs.ucla.edu/pub/stat_ser/r390.pdf \n 2. \n Joint Statistical Meeting \nJSM 2012, San Diego, CA, July 28-Aug 3, 2012 \n There are 73 papers and meetings on causal inference listed in the program, here they are: http://www.amstat.org/meetings/jsm/2012/onlineprogram/KeywordSearchResults.cfm \n These include a day-long course on Targeted Learning: Causal Inference for Observational and Experimental Data \nCE_08C Sun, 7/29/2012, 8:30 AM – 5:00 PM  HQ-Indigo E \nby Maya Petersen, Sherri Rose, Mark van der Laan, http://www.amstat.org/meetings/jsm/2012/onlineprogram/AbstractDetails.cfm?abstractid=304318 \n And J. Pearl tutorial “ Causal Inference in Statistics: A gentle introduction ” Sunday, July 17 4-6pm http://www.amstat.org/meetings/jsm/2012/onlineprogram/AbstractDetails.cfm?abstractid=304318 \n —————An Interesting Observation —— \nIn 2002, JSM-2002 had only 13 papers on causal inference, By any gauge, 73 is a positive sign of progress in the field. \n—————end of interesting observation —— \n 3. \n UAI2012, Catalina, CA, August 15-17, 2012 \n(Uncertainty in Artificial Intelligence) \n Workshop on Causal Structure Learning, Aug. 18 \n http://www.stat.washington.edu/tsr/uai-causal-structure-learning-workshop/ \n Alison Gopnik will speak on “Babies, Brain and Bayes (Banquet Speech), Thursday, Aug. 16., \nand I will speak on “Do-Calculus Revisited” Aug. 17, 1:30 pm \n http://www.auai.org/uai2012/invited.shtml \n 4. \n Workshop on Networks Processes and Causality \nSept 3-6, 2012, Menorca, Spain \n http://people.tuebingen.mpg.de/networks-workshop/ \n 5. \n MLSP 2012 Special Session on Causal Discovery \nIEEE Workshop on Machine Learning for Signal Processing (MLSP 2012) \nSeptember 23-26 2012, Santander, Spain \n http://mlsp2012.conwiz.dk/index.php?id=3D62 \n 6. \n Symposium on Causal Inference, University of Michigan, \nDecember 12, 2012. Contact: Professor Yu Xie. \n Miscellaneous \n7. \nLarry Wasserman has a new blog, and dedicated a page to befriending “causality”. \n http://normaldeviate.wordpress.com/2012/06/18/48/ \n 8. \nA new book “Causality: Statistical Perspectives and Applications”, \nC. Berzuini, P. Dawid and L. Bernardinelli (Eds.) \nhas just been published by Wiley (Chihester) July 2012: see \n http://eu.wiley.com/WileyCDA/WileyTitle/productCd-0470665564.html . \n Perpetual online access to the book is available on: \n http://onlinelibrary.wiley.com/doi/10.1002/9781119945710.fmatter/summary \n 9. \nAnother new book appeared this month \n R.H. Hoyle (Ed.) Handbook of Structural Equation Modeling, New York: Guilford Press. \nIt contains my chapter on “The Causal Foundations of SEM” \n ttp://ftp.cs.ucla.edu/pub/stat_ser/r370.pdf \n 10. \nFinally, the UCLA fruit basket offers a few fresh items, see http://bayes.cs.ucla.edu/csl_papers.html \nOne item of interest to economists-educators is: \n Chen and Pearl “A Critical Examination of Econometrics Textbooks,” where we survey six influential econometric textbooks in terms of their mathematical treatment of causal concepts. The conclusions are revealing, if you click on http://ftp.cs.ucla.edu/pub/stat_ser/r395.pdf (And if you have ideas on reforming econometric education, please share.) \n Wishing you an insightful and productive summer \nBest, \nJudea Pearl"], "link": "http://www.mii.ucla.edu/causality/?p=437", "bloglinks": {}, "links": {"http://bayes.ucla.edu/": 1, "http://www.aaai.org/": 2, "http://onlinelibrary.wiley.com/": 1, "http://people.mpg.de/": 1, "http://www.washington.edu/": 1, "http://eu.wiley.com/": 1, "http://www.auai.org/": 1, "http://normaldeviate.wordpress.com/": 1, "http://www.amstat.org/": 3, "http://ftp.ucla.edu/": 2, "http://mlsp2012.conwiz.dk/": 1}, "blogtitle": "Causal Analysis in Theory and Practice"}, {"content": ["The following problem was brought to our attention by Randy Verbrugge: \n Randy writes: \n \nSuppose the DAG is: \ntop row: unobserved U, with dotted arrows to X and Y. \nbottom row: X –> W –> Y. \n We can identify the causal effect of X on Y via the decomposition in the theorem. As I understand it, if we assume linearity, we regress Y on W and X and take the coefficient on W, call it b; then we regress W on X and take the coefficient, call it a; the causal effect is ab*x. \n However, I wonder if we are (unavoidably) in a situation where X is a near-instrument for W, so that we will have a ton of bias. \n Thanks for your help! \n Randy \n Judea replies: \n Randy, \nThe danger of conditioning on an instrument or a near instrument only exists when we have some residual, uncontrolled bias. In our case, the W—>Y relation is completely deconfounded by conditioning on X, therefore, no bias-amplification can take place. The danger will resurface if there was a bi-directed arc between W and Y. \n An important nuance: The capacity of an instrument to introduce bias where none existed (demonstrated in my paper) only pertains to situations where the zero bias is unstable, i.e., created by incidental cancellations. For example, if we had a bi-directed arc between W and Y that happened to cancel the bias created by the confounding path W Y, then the crude (regressional) estimate of the effect of W on Y would be unstably unbiased, and conditioning on W would introduce bias. \n In general: The bias amplification phenomenon never conflicts with the rules of do-calculus. \n Thanks for raising this question. \n ======Judea"], "link": "http://www.mii.ucla.edu/causality/?p=426", "bloglinks": {}, "links": {}, "blogtitle": "Causal Analysis in Theory and Practice"}, {"content": ["Dear colleagues in causality research, \n This is a Winter Greeting from the UCLA Causality blog, welcoming you back to a discussion on causality-related issues. \n This message contains \n 1. Topics under discussion \n 2. New results \n 3. Information on journals, lectures, conferences, and software. \n   1. Topics under Discussion \n \n 1.1 Principal Stratification – A goal or a tool?’ \n  http://ftp.cs.ucla.edu/pub/stat_ser/r382.pdf \n  http://escholarship.org/uc/item/4xj9d380#page-3 \n Was posted for discussion in the International Journal of Biostatistics (IJB) in March 2011, and has elicited response from eight discussants on whether studies based on Principal Stratification estimate quantities that researchers care about. \n I am about to wrap up the discussion with a summary-rejoinder, so, if you have comments or insights that where not brought up, feel free to communicate them to the IJB’s Editor, “Nicholas P. Jewell” or/and, if you wish, cross-post them on this blog. \n 1.2 Comments and Controversies: \nWe are being warned again that graphical models can produce “incorrect” causal inferences. The warning comes again from Lindquist and Sobel (LS), entitled “Cloak and DAG”: http://www.sciencedirect.com/science/article/pii/S1053811911013085 \n A response to L&S is posted on our causality blog, proving them wrong, and questioning the wisdom of asking researchers to translate assumptions from a language where they stand out vividly and meaningfully into an Arrow-Phobic language where they can no longer be recognized, let alone justified. We have all the reason to suspect that L&S will come back. \n 1.3 The Match-Maker Paradox \nAn apparent paradox concerning the representation of matching designs in DAGs was posted by Pablo Lardelli and resolved by noting that matching involves unit-to-unit interaction and results in “persistent-unfaithfulness.” \n 1.4 An On-going Causal-Inference Discussions on SEMNET (Structural Equation Modeling Discussion Group \nIn the past four months I have spent time discussing modern approaches to causal inference with SEM researchers who, by and large, are still practicing the traditional methods associated with the acronym “SEM”. The discussions are fully documented and archived on http://bama.ua.edu/archives/semnet.html \n Topics include: \n  a. the causal/statistical distinction. \n  b. the structural-regressional distinction \n  c. The residual/disturbance distinction \n  d. The assumptions conveyed by each structural equation. \n  e. The counterfactual reading of structural equations \n  f. What the Mediation Formula tells us about mediation and policy questions. \n  g. Mediators and Moderators. \n  h. d-separation, equivalent models and the testable implications of structural models \n  i. The logic of SEM as an inference engine. \n Additionally, a weekly session is being conducted by Les Hayduk, going page by page over the R-370 chapter ( http://ftp.cs.ucla.edu/pub/stat_ser/r370.pdf ) and explaining it to novices in the field. It answers, I hope, all questions that rank and file researchers find perplexing when introduced to causal analysis. \n 1.5 Draft Chapter on Causality and SEM \nKen Bollen and I finished a draft chapter titled “Eight Myths about Causality and Structural Equation Models.” It covers the history of misconceptions about SEM, including recent assaults by the Arrow-Phobic Society. \n see http://ftp.cs.ucla.edu/pub/stat_ser/r393.pdf \n 1.6 A Survey Paper on Adjustment \nGreenland, S., and Pearl J., “Adjustments and their Consequences — Collapsibility Analysis using Graphical Models” http://ftp.cs.ucla.edu/pub/stat_ser/r369.pdf \n The paper teaches researchers how to glance at a graph and determine when/if an adjustment for one variable modifies the relationship between two other variables. It is a simple exercise for graphical modellers but extremely difficult one for economists and other researchers who ask such questions routinely and have no graphs for guidance. \n 1.7 A New Introduction to Causal Calculus \nAn excellent introduction to causal diagrams and do-calculus was posted recently by bloggist-author Michael Nielsen, titled “If correlation doesn’t imply causation, then what does?” It can be accessed here: http://www.michaelnielsen.org/ddi/if-correlation-doesnt-imply-causation-then-what-does/ \n My response, together with thoughts on the psychology of Simpson’s Paradox is below http://www.michaelnielsen.org/ddi/guest-post-judea-pearl-on-correlation-causation-and-the-psychology-of-simpsons-paradox/ \n 1.8 Haavelmo and the Emergence of Causal Calculus \n http://ftp.cs.ucla.edu/pub/stat_ser/r391.pdf \n Presented at Haavelmo Centennial Symposium, in Oslo, last December, the paper describes the cultural barriers that Haavelmo’s ideas have had to overcome in the past six decades and points to the fact that modern economists are still unaware of the benefits that Haavelmo’s ideas bestow upon them. \n 2. New Results in Causal Inference \n 2.1 Interpretable Conditions for Identifying Natural Direct Effects. \n http://ftp.cs.ucla.edu/pub/stat_ser/r389.pdf \n The paper lists four conditions that are sufficient for the identification of natural direct and indirect effects. The conditions do not invoke “ignorability” jargon thus permitting more informed judgment of the plausibility of the assumptions. It also shows that conditions usually cited in the literature are overly restrictive, and can be relaxed without compromising identification. \n 2.2 Some Thoughts on Transfer Learning, with Applications to Meta-analysis and Data-sharing Estimation \n http://ftp.cs.ucla.edu/pub/stat_ser/r387.pdf \n Summary: How to combine data from multiple and diverse environments so as to take full advantages of that which they share in common. \n 2.3 Understanding Bias Amplification \n http://ftp.cs.ucla.edu/pub/stat_ser/r386.pdf \n This note sheds a new light on the phenomenon of “bias amplification” by considering the cumulative effect of conditioning on multiple “near instruments,” and shows that bias amplification may build up at a faster rate than bias reduction. \n 2.4 Local Characterizations of Causal Bayesian Networks \nby Bareinboim, Brito and Pearl http://ftp.cs.ucla.edu/pub/stat_ser/r384.pdf \n The standard definition of Causal Bayesian Networks (CBN) requires that every interventional distribution be decomposable into a truncated product, dictated by the graph. This paper replaces this “global” definition with three alternative ones, each invoking “local” aspects of conditioning and intervening. \n  3. Journals, Courses, Lectures and Conferences \n  3.1 Tutorial: Causal Inference in Statistics \n \nI will be giving a tutorial (IOL) on causal inference at the upcoming JSM 2012 conference in San Diego California, July 29th, 4-5:50 PM. If any of your students or colleagues wishes to attend, the abstract and further details can be found on http://www.amstat.org/meetings/jsm/2012/onlineprogram/AbstractDetails.cfm?abstractid=304318 \n 3.2 The Journal of Causal Inference \nAs reported in the last blog email, the Journal of Causal Inference (JCI) was launched on September 2011 and the website is open for submissions. http://www.bepress.com/jci \n The first issue is planned for Summer of 2012 and, needless to state, you are invited to submit your latest results, and to bring JCI to the attention of students and colleagues who might be seeking a forum for presenting their latest ideas, results and, yes, breakthroughs! \n The Journal of Causal Inference will highlight both the uniqueness and interdisciplinary nature of causal research. and will publish both theoretical and applied research including survey and discussion papers. \n 3.3 Spring Workshop Graphical Causal Models \nFriday 3/30/2012 \nNorthwestern University, Chicago \n This workshop will introduce graphical causal models, show how to simulate data from, and estimate such models in Tetrad, explain model search, and more…. \nLecturers: Richard Scheines and Joseph Ramsey CMU \nFor details see chicagochapterasa@gmail.com \n http://community.amstat.org/Chicago_Chapter/Calendar/20112012/NewItem6/ \n 3.4 Conference: EVIDENCE AND CAUSALITY IN THE SCIENCE ECitS 2012 \nCentre for Reasoning, University of Kent, 5-7 September 2012 \nOrganizers: Phyllis Illari and Federica Russo \n http://www.kent.ac.uk/secl/philosophy/jw/2012/ecits/ \n 3.5 New Software tool for Causal Inference \nDAGitty: A Graphical Tool for Analyzing Causal Diagrams by Textor, Johannes; Hardt, Juliane; Kn|ppel, Sven \n Epidemiology: September 2011 – Volume 22 – Issue 5 – p 745 doi: 10.1097/EDE.0b013e318225c2be \n This paper announces the release of DAGitty, a graphical user interface for drawing and analyzing causal diagrams. DAGitty, offers several improvements over Kyono’s “COMMENTATOR” http://ftp.cs.ucla.edu/pub/stat_ser/r364.pdf among them efficient listing of all minimal sufficient adjustment sets. It is available under an open-source license obtained at www.dagitty.net and http://www.dagitty.net/manual.pdf \n Best wishes, \n =======Judea"], "link": "http://www.mii.ucla.edu/causality/?p=408", "bloglinks": {}, "links": {"": 1, "http://www.dagitty.net/": 1, "http://www.bepress.com/": 1, "http://www.michaelnielsen.org/": 2, "http://www.ac.uk/": 1, "http://bama.ua.edu/": 1, "http://community.amstat.org/": 1, "http://escholarship.org/": 1, "http://www.amstat.org/": 1, "http://ftp.ucla.edu/": 9, "http://www.sciencedirect.com/": 1}, "blogtitle": "Causal Analysis in Theory and Practice"}, {"content": ["Our attention was called to a new attack on graphical models and structural equation models (SEM), this time in the name of “correctness”.. \n The article in question is: Cloak and DAG: A response to the comments on our comment by Martin A. Lindquist and Michael E. Sobel (L&S) Forthcoming , NeuroImage http://www.sciencedirect.com/science/article/pii/S1053811911013085 \n The advice that L&S give to NeuroImaging researchers reads as follows: \n “For if fMRI researchers continue to use their “familiar approach”, drawing diagrams and fitting SEMs without realizing the assumptions they are making, many of the causal inferences thereby generated will be incorrect, and the development and use of alternative ways of studying effective connectivity will be stifled.” \n L&S’s warning of the importance of scrutinizing assumptions is admirable. Yet readers of NeuroImage will have difficulty understanding why they are judged incapable of scrutinizing causal assumptions in the one language that makes these assumptions transparent, i.e., diagrams or SEM, and why they are threatened with “incorrect inferences” for not rushing to translate meaningful assumptions into a language where they can no longer be recognized, let alone justified. \n For a simple example, … \n Click here for the full post."], "link": "http://www.mii.ucla.edu/causality/?p=384", "bloglinks": {}, "links": {"http://www.ucla.edu/": 1, "http://www.sciencedirect.com/": 1}, "blogtitle": "Causal Analysis in Theory and Practice"}]