[{"blogurl": "http://chandoo.org/wp\n", "blogroll": [], "title": "Chandoo.org - Learn Excel & Charting Online"}, {"content": ["Hurricane Sandy has taken front seat in all major news channels, papers, websites even in far off places like India. I  hope & pray that our readers in US East coast are safe. \n Today, lets understand the journey of Hurricane Sandy in this animated chart, prepared by Chris from Excel365.net . \n Hurricane Sandy Journey – Animated Excel Chart \n \n How is this animated chart made? \n The basic ingredients of this chart are: \n \n An outline map of Americas \n Data of the storm since it was tropical depression (22nd October) to the time it crossed the coast (30th October)\n \n Lat & Long of the storm \n Wind speeds \n Pressure \n \n \n A scroll bar form control that shows only a subset of this data \n A VBA macro that animates the chart \n \n Since all these techniques are previously discussed on Chandoo.org, I am going to list down the process in high-level with links to learn more. \n \n Set up a scroll bar form control \n Based on scroll bar position extract first n values only in to another table. Learn more: OFFSET formula * \n Use an outline map & bubble chart to plot circles along storm’s trajectory. Learn more: Olympic medals by country since 1900 \n Change scroll bar values from 1 to ‘n’ using a vba macro, when triggered. Learn more: Creating a clock in Excel \n You are done! \n \n * Chris uses #N/A based technique instead of OFFSET ranges in the chart. \n Download this and play with it \n Click here to download the workbook & learn by breaking it apart. Examine macros & charts closely and add new techniques to your toolbox. \n Do you love this? Say thanks to Chris \n I really loved this idea. Very intuitive and timely. Thank you so much Chris for sharing this and teaching us something new. \n If you loved this, say thanks to Chris. Check out his website (it is in Chinese) for some useful tricks."], "link": "http://feedproxy.google.com/~r/PointyHairedDilbert/~3/JMy4CH3mjk4/", "bloglinks": {}, "links": {"http://chandoo.org/": 4, "http://excel365.net/": 2, "http://img.chandoo.org/": 1}, "blogtitle": "Chandoo.org - Learn Excel & Charting Online"}, {"content": ["People who were right a lot of the time were people who often changed their minds . \n-Jeff Bezos, Founder, Amazon.com #  \n About 10 days ago, I have introduced Vitamin XL and asked for your feedback. I got several enthusiastic responses (both for and against it). \n I have decided to go ahead and kill this product idea. Please read to understand why. \n \n What is Vitamin XL & Why I thought of it? \n Vitamin XL is a membership program that offers Excel training, resources & community access for monthly fee. \n During last 1 year, many of existing customers & supporters of Chandoo.org have told me that I should have a membership program where people can access all our training programs, Excel resources & get help for a monthly fee. \n A good business person must prioritize the ideas and work on most promising ones first. Since I have few product ideas in mind, I wanted to make sure that Vitamin XL is worth investing my time. As a first step to this, I conceptualized Vitamin XL and shared the idea with all of you on 19th October for your feedback. \n How was the feedback? \n With in 1 day of announcing Vitamin XL, it was clear to me that not many of you are excited about it . Although there were many who wanted Vitamin XL and could not wait to join, the negative feedback was overwhelming. Some of the concerns raised are, \n \n There is no value in it. Already Chandoo.org offers everything for free. \n It is too pricey. $30 or $50 per month is just not feasible. \n It would divide our community in to 2 parts – members & non-members. \n The offering is not clear. Can I still access all the features (forums, downloads, articles) of Chandoo.org? \n \n My next options were… \n Based on this feedback, I narrowed down to 2 options for future of Vitamin XL. \n \n Rework on Vitamin XL’s features & Reduce the price to $99 per year (or $10 per month). \n Kill it and work on something else. \n \n At first glance, #1 seemed to be a natural choice. This is because I got several emails (and comments) telling me that Vitamin XL would work at lower price point. \n So why I am killing it? \n What is true loss? \n There is no truer loss than nobody telling you when you are making a mistake. \n I don’t know where I read this quote, but it came to my mind when deciding the future of Vitamin XL. \n As many long time readers of Chandoo.org know, I run a poll / survey whenever I start work on a new product. Excel School, VBA Classes, Financial Modeling Classes, various crash courses are all born like that. And I do know that for any product, there will be some people who will not like it. So I take the negative feedback with a pinch of salt. \n But in case of Vitamin XL, I got lot of personal emails, passionate comments telling me it is not a good idea. \n The decision became obvious. Its time I let go of Vitamin XL and worked on something else . \n What next? \n There is no change whatsoever to Chandoo.org or all our awesome stuff . \n \n I will continue to write every week and share something beautiful, fun & useful with you, so that you can become awesome at your work. \n I will continue to post excellent examples, downloads & videos every now and then so that you can do more & become a hero. \n I will offer new courses, products & books so that you can learn even more and become a ninja. \n \n During next 2-3 months, I will be working on few more new product ideas: \n \n Advanced Excel School course (slated for launch in Jan 2013) \n An iPhone app to learn Excel \n Conceptualize & Design an MS Access course \n Upgrade our PM Templates to Excel 2010, 2013 \n Ready to use Excel Dashboard Templates \n One / two more e-books \n \n As always, I will take your suggestions & feedback about these ideas. \n Meanwhile, you can continue to enjoy our courses & products: \n \n Excel School – for Excel, advanced Excel & Dashboard training \n VBA Classes – for beginner to advanced level VBA training \n Financial Modeling classes – for creating integrated financial models using Excel \n PM Templates – to manage a project like a pro using Excel \n Formula e-book – to learn 75 every day formulas \n Crash courses – to quickly master formulas , project management or dashboard concepts \n \n Thank you & Sorry \n I feel so fortunate & humbled to know how much you care about Chandoo.org & our future. Thank you. \n My apologies for anyone who felt excited about Vitamin XL and wanted to be part of it. I am sorry I am unable to offer it at this time. I am thankful for your kindness & encouragement. It keeps Chandoo.org going."], "link": "http://feedproxy.google.com/~r/PointyHairedDilbert/~3/lvc6v-aPKHA/", "bloglinks": {}, "links": {"http://37signals.com/": 1, "http://chandoo.org/": 9}, "blogtitle": "Chandoo.org - Learn Excel & Charting Online"}, {"content": ["In this 2 part tutorial, we will learn how to design a project portfolio dashboard . Part 1 will focus on user needs & design. Part 2 on Excel implementation. \n Background: Project Portfolio Dashboards \n As you may know, we sell a set of Excel Project Management templates . These templates help plan, track, manage & report a project right from Excel. \n While these templates good, they have one limitation. They work for one project at a time. Many customers have asked me if I come up with a project portfolio dashboard that can tell what is going on in a set of projects in one view. \n And that is where we begin. \n Who uses a Project Portfolio Dashboard? \n Program managers, group project managers, IT directors, Project owners & CXOs are the target audience for a project portfolio dashboard. These are the people that oversee multiple projects and want to know what is going on with each of them a high level. \n To keep our design task reasonable, we can also say that, \n \n Project portfolio consists of at least 5 projects. \n The dashboard is updated once a month or so. \n \n What should Project Portfolio Dashboard communicate? \n When it comes to a portfolio of projects, the users will not be interested in minute details of each project. Rather, they want to know what is going on, where the attention should be focused, how the plan vs. actual performance is, how money is spent etc. In other words, high level details followed up option to drill down. \n As per my experience, our dashboard should communicate: \n \n Program overview\n \n Total projects, budgets, teams \n Program health indicators – Progress, budget vs. actual, time to complete, un-addressed risks \n \n \n A summary of all projects\n \n Project progress %s, budget vs. actual spend \n Team sizes, outstanding issues, risks & tasks \n \n \n Drill down view of individual projects\n \n Weekly plan, task level progress & budget \n Critical issues, risks by project \n Contact details \n Management comments \n \n \n \n How should our Dashboard look like? \n Based on above details, we can design a rough sketch of our portfolio dashboard. This sketch will guide us when we implement the dashboard in Excel. \n Here is a design I came up with: \n \n The numbers correspond to section 1, 2 & 3 in “What should they communicate” above. \n How should our dashboard behave? \n Because this dashboard contains a lot of data and is used by top management, it makes sense to define its behavior too. \n Lets keep these points in mind when implementing the dashboard: \n \n The data entry for this dashboard should be easy & track-able\n \n Reason: lots of data, so users need to be alerted if data entry is incomplete. Also, one set of users enter the data, while someone else views the report. \n \n \n The dashboard should allow for drill down to know more\n \n Reason: top managers & project sponsors like to ask questions. So, we should allow for interactive drill down, but still present vital stats up front. \n \n \n The dashboard should be printable\n \n Reason: Project sponsors & steering committees have lots of members, often from different parts of a company. And they like to view static version (print out, pdf) when discussing. \n \n \n \n Next steps: Implementing the dashboard in Excel \n That is all for this installment. In the next part, we will learn how to create a project portfolio dashboard using Excel. \n Meanwhile, explore our Project Management using Excel section to learn more . \n \n Do you use Project Portfolio Dashboards? \n When I was working as a business analyst, I used to design such dashboards for some of our clients. Later on, as an Excel consultant too, I have developed few different versions of portfolio & program dashboards. The hardest thing with designing these dashboards is that they have just too much of data. A very high level summary will not do because executives & project sponsors always ask follow up questions like, “So why is this project spending more than $x?”, “What is our mitigation strategy for this risk?”, “Who is handling this issue?” etc. \n But with a bit of balancing act, we can design a good portfolio dashboard that is not too bloated and not too simplistic. \n What about you? Do you use or develop such dashboards? What is your experience like? What would you like such a dashboard to communicate? Please share your ideas and suggestions using comments. \n More on Project Management using Excel \n If you are a project manager or analyst, chances are, you are using Excel to manage portions of your project. At Chandoo.org, you can find lots of resources, tips & templates for this. Check out, \n Preparing & tracking a project plan using Gantt Charts \n Team To Do Lists – Project Tracking Tools \n Project Status Reporting – Create a Timeline to display milestones \n Time sheets and Resource management \n Issue Trackers & Risk Management \n Project Status Reporting – Create a Timeline to display milestones \n More on using Excel for Project Management"], "link": "http://feedproxy.google.com/~r/PointyHairedDilbert/~3/8wPrAgxx1-Y/", "bloglinks": {}, "links": {"http://chandoo.org/": 9}, "blogtitle": "Chandoo.org - Learn Excel & Charting Online"}, {"content": ["The best thing about Excel is that you can do the same thing in several ways. Our yesterdays problem – Extracting file name from full path is no different. There are many different ways to do it, apart from writing a formula. Learn these techniques to be a data extraction ninja. \n 1. Using Find Replace \n Suggested by Iain in the comments yesterday, I love this technique for its simplicity and awesomeness. \n \n Select all the file paths \n Press CTRL+H \n Type *\\ in find field \n Leave the replace field empty. \n Click on Replace all. \n Done! \n \n It is that simple. Do not believe me? See this demo. \n \n Thanks Iain for teaching us this trick. \n 2. Using Text to columns utility \n Buried inside heap of features in Excel is this beautiful Text to columns utility, that can take any text and convert it in to many columns based on the delimiter you specify. [ more uses of text to columns ] \n This is how we can use it: \n \n Select all the file path cells \n Go to Data > Text to columns \n Chose “Delimited” in step 1 and click next. \n Specify delimiter as \\ \n Click Finish \n You will get all folders in to separate cells and file name in last cell. \n Now use a formula like =INDEX($C3:$O3,COUNTA($C3:$O3)) to extract the last cell’s value ie file name \n Done! \n \n \n 3. Using UDFs \n While our formula method tends to be very long or very complicated, we can use 1-2 line VBA to get the file name from a full path. There are many ways to skin this cat in VBA, but 2 easiest methods are, \n For both methods below, you first need to insert a new module and add the code in that. \n Using InStrRev \n As suggested by Daniel Ferry in the comments. \n Public Function ParseFile(sPath As String) As Variant \nParseFile = Array(Mid$(sPath, 1 + InStrRev(sPath, “\\”)), Mid$(sPath, 1 + InStrRev(sPath, “.”))) \nEnd Function \n Note: this UDF returns an array for file name & extension. So you need to enter it in 2 cells together. \n The InStrRev() built in function searches for \\ in the sPath from end and returns the first occurrence’s position. \n Using split \n As suggested by PPH in comments, \n \nFunction ExtractFileName(filepath) As String \n Dim x As Variant \nx = Split(filepath, Application.PathSeparator) \nExtractFileName = x(UBound(x)) \n End Function \n What is your favorite method? \n For most of my data cleaning needs, I use a mix of text to columns, find-replace or VBA. In rare cases, I rely on a formula. This is because data cleaning or extraction is usually one time step and figuring out a complex formula is not good idea in such cases. \n What about you? How do you go about extracting filenames, dates, numbers etc. buried in text? What method do you use often? Please share with us in comments. \n More tips on Data Extraction: \n \n Extract numbers from text using formulas [ and using macros ] \n Extract dates from text with formulas & with text to columns \n Extract user names from email addresses \n Extract duplicates or unique values from a list \n Extract data from multiple files & place in one sheet"], "link": "http://feedproxy.google.com/~r/PointyHairedDilbert/~3/ORtVl5ca49M/", "bloglinks": {}, "links": {"http://chandoo.org/": 9}, "blogtitle": "Chandoo.org - Learn Excel & Charting Online"}, {"content": ["Today lets tackle a very familiar problem. You have a bunch of very long, complicated file names & paths. Your boss wants a list of files extracted from these paths , like below: \n \n Of course nothing is impossible. You just need correct ingredients. \n \n I cannot help you with a strong cup of coffee, so go and get it. I will wait… \n Back already? well, lets start the formula magic then. \n Extracting file name from a path \n If you observe the file paths carefully, to extract the file name, we need to know, \n \n Position of last \\ in the full path text \n \n Of course there are many methods find where the last \\ is. You can find a very excellent summary of these techniques in our formula forensics #21 – finding the 4th slash . \n Today, let us see a new technique (well, sort of). \n Finding the position of last \\ using formulas \n Before writing any formula, first let me clarify the only assumption: \n \n File path is in cell B4 \n \n Now, last \\ is nothing but first \\ when read from right. \n Read that line again. \n Got it? Good, lets move on. \n How do we find the first \\ from right? \n If we can list down all individual characters from path right to left, then we just have to find the first \\ in that. \n Listing down individual characters from a given text \n To get 5th character from text in B4, we can use MID formula like this: \n =MID(B4,5,1) \n Suppose you want both 5th and 6th characters from B4, you can use: \n =MID(B4,{5,6},1) \n This formula returns an array of 5th and 6th characters from the text in B4. \n Cool, extending the logic, =MID(B4, {6,5},1) would give 6th & 5th characters in B4. \n Idea! \n If we can replace {6,5} with decreasing numbers starting from length of text B4 all the way to 1 , then we can list all characters in B4, right to left. \n But this leads us to next problem – listing numbers from a specific value (length of B4) to 1 in descending order . \n Listing numbers from n to 1 in that order \n We can use ROW() formula to generate sequence of numbers like this: \n =ROW(1:10) will give {1,2,3…,10} \n note: this returns an array, so you need to use it with Ctrl+Shift+Enter \n So if we can use =ROW(1:LEN(B4)) we could get numbers from 1 to length of text in B4 {1,2….LEN(B4)} \n Unfortunately this will not work as 1:LEN(B4) is not a valid reference. \n But we can fix that with INDIRECT, like this: \n =ROW(INDIRECT(“1:” & LEN(B4))) \n Tip: INDIRECT formula lets you construct a reference by using values in other cells as shown above. \n Alternative: You can also use OFFSET to get the same result like this: =ROW(OFFSET($A$1,,,LEN(B4))). More on OFFSET here . \n But wait… \n So far, we have only generated numbers from 1 to n. But we need numbers from n to 1. \n No sweat, we just subtract the numbers {1,2…n} from n+1 to get the list {n,n-1,n-2….2,1} \n Like this: \n =LEN(B4)+1 – ROW(INDIRECT(“1:” & LEN(B4))) \n Using these numbers to list characters in file path in reverse order \n Take a sip of that coffee, its getting cold! \n Now, lets integrate our numbers in to MID like this: \n = MID(B4, LEN(B4)+1 – ROW(INDIRECT(“1:” & LEN(B4))) , 1) \n The blue portion gives you numbers {n…2,1} \n The orange portion gives you letters from right to left. \n But we wanted the last \\ \n Oh right. We do not need these letters from right to left. We instead want to find the last \\ in our file path. So now we just ask Excel where the first \\ is in this reversed text. \n = MATCH(“\\”, MID(B4, LEN(B4)+1 – ROW(INDIRECT(“1:” & LEN(B4))), 1) , 0) \n Blue portion gives you letters in reverse order \n Orange portion finds the first \\ in that. \n Tip: Learn more about MATCH formula . \n Extract the file name \n Once you know where the last \\ is, finding the file name is easy. \n use =MID(B4, position_of_last_slash + 1 , LEN(B4)) \n We need to +1 because we do not want the slash in our file name. \n Demo of the entire formula in action \n Okay, lets see all these steps in action in one go. \n \n How to find the extension? \n Extension is few letters added at the end of file to indicate its type. For example, excel files usually have xls, xlsx, xlsm as extension. \n So how to find this extension? \n Extension & file name are separated by a dot . \n But often file name itself can have a dot. \n In other words, Extension is text in the file name followed by last dot . \n Sounds like same problem as finding the last \\ and extracting file name. So I will skip the details. \n But assuming the file name is in D4, extension can be found with =RIGHT(D4,MATCH(“.”,MID(D4,LEN(D4)-ROW(INDIRECT(“1:”&LEN(D4))),1),0)) \n NOTE on both formulas \n Both file name & extension formulas are array formulas. This means after typing them, you need to press Ctrl+Shift+Enter to see correct result . \n Bonus tip: Getting the file names & path from a folder \n If you ever want to list down all files in a folder use this. \n \n Open command prompt (Start > Run > Cmd or Start > Cmd) \n Go to the folder using CD \n Type DIR /s/b >files.csv \n Close command prompt \n \n Now you can see all the files in that folder in files.csv. Double click on it to open in Excel and run your magic \n Download Example workbook \n Click here to download the example workbook . The file uses slightly different formulas. But works just the same. Examine it and learn more. \n How do you extract file names & as such? \n Do you use formulas or do you rely on some other technique to extract portions of text like file names, mail addresses etc. Please share your tips & ideas using comments. \n Extract often? You will dig this. \n Analysts life is filled with 3 Es – extraction, exploration & explanation . And like a good assistant, Excel helps you in all 3. \n If you find yourself with a shovel, bucket and boat load of data often, you are going to enjoy these articles: \n \n Extract numbers from text using formulas [ and using macros ] \n Extract dates from text \n Extract user names from email addresses \n Extract duplicates or unique values from a list \n Extract data from multiple files & place in one sheet"], "link": "http://feedproxy.google.com/~r/PointyHairedDilbert/~3/brIHuQ0dnWM/", "bloglinks": {}, "links": {"http://chandoo.org/": 9, "http://img.chandoo.org/": 1}, "blogtitle": "Chandoo.org - Learn Excel & Charting Online"}, {"content": ["Update: Please read Why am I killing Vitamin XL? to know about this. \n Hello friends, fans & well wishers of Chandoo.org, \n I am happy to announce our new product – Vitamin XL, a membership program for you . I want to make sure that Vitamin XL offers you the best possible features & value. I need your help in designing this product. Please read this short article and give me your feedback. \n \n What is Vitamin XL? \n Just like vitamins you give you strength and health, Vitamin XL ups your Excel mojo, gives you new ideas & powers. Here is what I have in mind: \n Vitamin XL is a membership program with 3 distinct benefits \n \n Excel Training \n Excel Resources \n Excel user community \n \n 1. Excel Training \n There is no such thing as 100% knowledge. More so when you are talking about a technical & versatile platform like Excel. That is why I have included many aspects in our Excel training part. \n \n Excel School & VBA Classes forever: Access all our Excel School, VBA classes & Dashboard lessons – more than 100 videos, 100 workbooks & presentations at any time. Its like having an Excel trainer on call. Just login when you want to brush up on any area of Excel (or VBA) and you are ready to go. \n Monthly video class: Every month a new concept or use of spreadsheets will be explained using videos. These lessons will be highly practical with lots of details & novel uses of Excel. \n Live Webinars: Once in a while, we will have a webinar. The purpose is 2 fold – (1) Teach you a new concept (2) Take up questions from you. I am also planning to invite fellow MVPs & prominent Excel authors to this so that you can learn from them too. \n Articles: Over the years, I have written more than 400 articles, tutorials, tips & examples on Excel, VBA, Dashboards here at Chandoo.org. As a Vitamin XL member, you can access all these articles & many more right from your membership area. I will be curating the articles so that you can learn about any area of Excel with ease. \n \n 2. Excel Resources \n While we all want to learn, often we don’t have time to understand a concept and apply it. That is where our resources section comes in. As a Vitamin XL member, you will get: \n \n Excel Vault: Imagine walking in to a vault where you can find an example or template on almost any aspect of your Excel use. That is our Excel vault. To start with, the vault will contain more than 400 excel workbooks containing formula tutorials, chart templates, models, macro examples, dashboards, excel technique demos etc. The best thing is every month, we will be adding more files to it. \n Template & Add-in Gallery: This is where you can find dozens of templates, ready to use macros for your work situations. Download, Deploy & Delight your users. \n \n Books & Sites: There are probably 1000 books, 100s of sites of offering Excel help, instructions & ideas. But what should you choose? Every month, I will be reviewing a book or sharing a collection of useful resources with you so that you can be even more awesome. \n eBooks & Guides: Download ebooks, handy guides, printable posters & cheat sheets. Every few months, we will be adding more guides & electronic books for you. \n What formula is that? Struck with a formula and need help? Enter our exclusive formula section, where more than 75 day to day formulas are explained with easy to understand syntax, examples. You can also download our interactive sandbox and play with formulas yourself to learn better. \n \n 3. Excel user Community \n Knowledge multiples when you share it. That is why Vitamin XL is a community. In our user community you will get: \n \n Members only forum: Share your excel solutions, problems, new ideas & information with fellow members. You can also ask questions and our in-house Excel ninjas will be helping you. \n Member directory: Learn more about fellow Excel users like you, see how they are becoming awesome using it. Connect with them and make new friends. \n Spot light: Every now and then you come across a truly novel idea, use or example of what Excel can do. In our spot light section, you will get such wonderful ideas both from our community and around web. \n Monthly Newsletter: Get a curated selection of latest articles, tips & examples once a month. As a Vitamin XL member, you will also get discounts and offers on any future Chandoo.org purchases. \n \n Who is this for? \n Anyone who loves Excel & Chandoo.org is going to enjoy Vitamin XL. If you are a data junkie, analyst, manager, MIS or dashboard professional, heavy-dose spreadsheet user, Excel consultant or enthusiast, then you will certainly benefit having access to Vitamin XL. \n But how much? \n Vitamin XL comes with 2 levels of membership: \n \n Basic membership for $30 per month. \n Advanced membership for $50 per month*. \n \n With Advanced membership, you can access all Excel School, VBA & Dashboard videos too. Other than that, everything else remains same. \n * Pricing and features are not yet finalized. \n What do you think about it? \n I want to make sure that Vitamin XL gives you best value & features. Can you please tell me how you feel about it and what additional features would you like in it? \n Please share your suggestions and feedback using comments . If you want to keep it private, please email me at chandoo.d @ gmail.com \n Thank you \n Thanks for your continued support to Chandoo.org. I am so humbled and happy to be in a position to share my knowledge, mistakes, ideas and progress with all of you. Special thanks to scores of Excel School & VBA class students who emailed and suggested that I create something like Vitamin XL. I am eager to roll this out very soon. \n Update: Please read Why am I killing Vitamin XL? to know about this."], "link": "http://feedproxy.google.com/~r/PointyHairedDilbert/~3/5ureV3u7ofk/", "bloglinks": {}, "links": {"http://chandoo.org/": 2}, "blogtitle": "Chandoo.org - Learn Excel & Charting Online"}, {"content": ["Last week in Write a formula to check few cells have same value [Homework] , \n Chandoo posed the question: Can you write a formula to check if a few cells are equal? \n \n A lot of people answered with answers like: \n =IF(COUNTIF(A1:A4,A1)=COUNT(A1:A4),TRUE,FALSE) \n or \n =IF(SUM(A1:A4)/COUNT(A1:A4)=A1,TRUE,FALSE) \n or \n =IF(PRODUCT($A:$A)=A1^(COUNTIF($A:$A,A1)),”Yes”,”No”) \n etc. \n Although these are all correct, the formulas can be simplified by using a built in function of Excel \n The function is =  \n \n = \n In Excel the = sign does two things \n 1. When the = sign is the first character of a Cell, Named Formula or Reference it tells the Cell, Named Formula or Reference that it contains a formula \n 2. It acts as an equality function when it has a value or formula on either side of it \n \n What does the = function do? \n What does the = function do? \n The = function returns a Boolean or TRUE / FALSE value depending on the equality of the values/formula on either side of it \n Example: \n In a blank cell enter =2=1 \n Excel will display FALSE to tell us that the values aren’t equal \n Now change the formula to =2=2 \n Excel will display  TRUE to tell us that the values are equal \n \n Either side of the = sign can contain a Formula, Cell Reference etc \n =(200/100)=2 will return TRUE \n =SIN(PI()/2)=1 will return TRUE \n =SIN(PI()/2)=15 will return FALSE \n =- 1=COS(PI()) will Return TRUE \n \n =SIN(PI()/2)=A1 will return TRUE if cell A1 contains either a 1 or a formula that returns the value 1 . \n It will return False for all other values. \n \n So the above, Homework, formulas can be simplified as : \n Original : =IF(COUNTIF(A1:A4,A1)=COUNT(A1:A4),TRUE,FALSE) \n Simplified :  =COUNTIF(A1:A4,A1)=COUNT(A1:A4) \n or \n Original : =IF(SUM(A1:A4)/COUNT(A1:A4)=A1,TRUE,FALSE) \n Simplified : =SUM(A1:A4)/COUNT(A1:A4)=A1 \n or \n Original : =IF(PRODUCT($A:$A)=A1^(COUNTIF($A:$A,A1)),”Yes”,”No”) \n Simplified : =PRODUCT($A:$A)=A1^(COUNTIF($A:$A,A1)) \n and all will still, correctly, answer the question \n \n Challenge: \n If your formula started with an If(), see if you can rewrite it based on the above."], "link": "http://feedproxy.google.com/~r/PointyHairedDilbert/~3/4yUJwKayBAA/", "bloglinks": {}, "links": {"http://chandoo.org/": 1}, "blogtitle": "Chandoo.org - Learn Excel & Charting Online"}]