[{"blogurl": "http://chartsnthings.tumblr.com\n", "blogroll": [], "title": "chartsnthings"}, {"content": ["The New York Times Graphics Department was one of 10 recipients of the 2012 Missouri Honor Medal . For some reason the school was not able to fly all 25 of us to mid-Missouri for the banquet, so, as the lone Mizzou grad on staff, they sent me to come pick it up.  \n\n \n Nice hardware! (Though sad they didn’t make 25 of them…) \n I also gave a talk to students about the work the department does. It’s probably too sports-heavy in retrospect, but almost every student here was wearing Cardinals gear, so maybe it’s a wash. Also it’s the first time I used Mike Bostock’s  Stack.js  and I’m almost positive I did it wrong, so don’t pop the hood, for your own sake."], "link": "http://chartsnthings.tumblr.com/post/33694955411", "bloglinks": {}, "links": {"http://mbostock.github.com/": 1, "http://kevinquealy.com/": 1, "http://journalism.missouri.edu/": 1}, "blogtitle": "chartsnthings"}, {"content": ["Notes like these are always lying around the office: \n \n In this case, the note refers to the  analysis of Barack Obama and Mitt Romney’s body language  by some of my colleagues."], "link": "http://chartsnthings.tumblr.com/post/32904957489", "bloglinks": {}, "links": {"http://www.nytimes.com/": 1}, "blogtitle": "chartsnthings"}, {"content": ["Chris Fennewald, an editor with the Missouri Farm Bureau Publications, sent me these photos of our recent drought graphic on display at the Missouri State Fair. \n \n \n Nice to see the maps out in the wild!  \n Also, if you missed it, Shan Carter and Mike Bostock revisited the drought data for a recent piece in the Sunday Review."], "link": "http://chartsnthings.tumblr.com/post/29791475604", "bloglinks": {}, "links": {"http://www.nytimes.com/": 2}, "blogtitle": "chartsnthings"}, {"content": ["A few months ago, during the Euro 2012 soccer tournament, I remember watching the Spain-France match, and like everyone who’s ever seen Spain play, was really surprised by how easily they outpassed their opponents. I wanted to make a chart of their passes – not a network diagram of who passed to who, but a chart of where the passes themselves were. My colleague Xaquín G.V. , who had done many of our soccer visualization in the World Cup in 2010, told me to talk to Opta , a company that specializes in this kind game data. \n A few emails, phone calls and data monkeying sessions later, my colleague Jeremy White and I had made charts for every player, highlighting short passes, that we really liked: \n \n Alas, there was not enough time to finish it, so on the shelf it went. \n But when the U.S. women made it to the Gold medal match, the code was right there to use again. Jeremy was busy visualizing the Twitter Olympics , but Xaquín and Amanda Cox pitched in some soccer knowledge and gross XML parsing so we could make and interpret similar charts. After a lot of trial and error, we had mapped all the passes for all the U.S. players over the course of the entire tournament (made using R’s basic plot and segments commands): \n \n We still needed some help understanding it, so we got in touch with Jay Cooney, an assistant coach at Stanford who had coached a some of the players on the national team. But instead of just asking him “what did you think of the games?” we were able to ask “what do these charts tell you?” Giving our source all the charts ahead of time ultimately helped us choose who to highlight and made for much more useful annotation. There certainly could have been more, but we were on a tight deadline and ultimately had to turn it around, start to finish, in about 12 hours. Here’s the final graphic , with some nice design touches from Xaquín:"], "link": "http://chartsnthings.tumblr.com/post/29297503372", "bloglinks": {}, "links": {"https://twitter.com/": 2, "http://www.nytimes.com/": 3, "http://www.optasports.com/": 1}, "blogtitle": "chartsnthings"}, {"content": ["Although it’s not the sexiest of our graphics, we made a couple widgets, for lack of a better word, that lived on the Olympics results pages. One of them documented the shift in rankings for events with lots of splits.  Shan Carter had written a small charting framework for Flash in 2010, and it included some methods to do a chart like this (which happens to be from the 2010 women’s biathlon 7.5k sprint): \n \n But we don’t really use Flash anymore, so I tried to port Shan’s chart for the 2012 games (with embarrassing amounts of help and patience from my colleagues Tyson Evans and Ben Koski in Interactive News). \n Like almost anything I program, this was adapted from a simple online tutorial. This one , from Stack Overflow, seemed to be almost exactly what I needed, but as far as I could tell, none of the D3 interpolations did what I needed the chart to do. Though it was fun to test out some of them: \n \n I ended up having to make a custom interpolator in D3 to do it. I’m would post the code, but Mike Bostock (who, on a recent New York visit, actually groaned when he saw my implementation) made it possible to include your own custom interpolators for d3.svg.line() and d3.svg.area() in last week’s release of  D3 2.10 . Sweet!   \n We were thinking about a few larger implementations of the framework, but in the end we didn’t have the time to do it right. Here’s one (broken) sketch based on some test data from the marathon: \n \n Anyway, aside from a few bugs entirely traceable back to me, the rankings shifts in D3 worked out pretty well for swimming events. Here’s one of the more interesting ones, from the Women’s 400 IM ."], "link": "http://chartsnthings.tumblr.com/post/29291449366", "bloglinks": {}, "links": {"http://benkoski.com/": 1, "http://bl.ocks.org/": 1, "https://twitter.com/": 1, "https://github.com/": 2, "http://london2012.nytimes.com/": 1, "http://stackoverflow.com/": 1, "http://www.twitter.com/": 1}, "blogtitle": "chartsnthings"}, {"content": ["A few people sent this to me the other day. Looks familiar!"], "link": "http://chartsnthings.tumblr.com/post/29211988871", "bloglinks": {}, "links": {}, "blogtitle": "chartsnthings"}, {"content": ["The last few seconds of the Bolt video might seem familiar to some of you, especially if you were a fan of NYT graphics in 2010 during the Vancouver Olympics. One graphic done during those Games, “ Fractions of a Second: An Olympic Musical ” by Amanda Cox, let users hear the difference between finishers. It was a totally new and awesome way of thinking about close results. At least, it was new to me. \n Anyway, we thought it would be cool to employ a similar effect for the sprinters, so I asked Amanda for a hand. (Duh.) An hour later, she sent me a folder titled “why amanda should not be in charge of audio,” which pretty much proves why Amanda should always be in charge of audio. \n This is about 20 percent of the folder but it has most of the fun ones. Also, FYI, the order of the highlights in this one is screwed up…we had to fix it later."], "link": "http://chartsnthings.tumblr.com/post/29211142029", "bloglinks": {}, "links": {"http://www.nytimes.com/": 1}, "blogtitle": "chartsnthings"}, {"content": ["One of our most recognizable Olympics graphics is probably “ One Race, every Medalist Ever ,” a 3D rendering and video that imagines what a race of every athlete ever to medal in the men’s 100-meter sprint might look like. \n I’d love to take credit for the idea, but it’s not new. The first time I ever saw the idea was in 2009, when my colleague Bill Marsh had a small piece in the Week in Review after Usain Bolt got a 9.58 in Berlin, setting the world record that still stands.  \n \n Even this year, other news organizations did a similar approach. The Guardian made one in a retro homage to old video games and Slate had a piece based on the same concept. But one reason I think ours was so successful is that is put the race on a human scale – seeing all those athletes on an actual track is much more accessible than seeing a scatterplot. (Not that I didn’t make tons of scatterplots since they don’t really let me near the 3D software.) \n So Graham Roberts started rendering some people on a track based on some initial calculations. Even his first renderings looked pretty cool: \n \n \n After that, it was just a (very slow) process of storyboarding the video. It’s surprising, to me, anyway, how much the final movie tracked our original storyboard: \n \n Then it was just a matter of rendering all the frames, recording and syncing the audio, and thinking about how to turn it around as soon as possible after the result. If you look closely, you can see that the 2012 results are out of frame for most of the movie – it was mostly pre-rendered. (We also recorded slightly different scripts depending on who won. I didn’t really care who won, but I was sort of rooting against Churandy Martina of the Netherlands because I couldn’t pronounce his name right. Luckily for me, he got sixth .)  \n We didn’t end up turning it around as fast as we wanted to, but about 8 hours after Bolt had won the 100-meter final, the piece was up, and only a day or two later Graham and I had achieved a life goal of having Ashton Kutcher tweet our work . \n \n We also did a chart for print, which went across two pages. Although we had done the chart in perspective for swimming (I’ll get to that another time), the side view of these guys looked really cool, with Usain Bolt leading and everyone in history trailing behind. It was even cooler in the 2008 view, actually: \n \n And in print on Monday, Aug. 6: \n \n I have a couple other fun things from this piece, but I’ll save those for another day. (Like maybe tomorrow.)"], "link": "http://chartsnthings.tumblr.com/post/29142459598", "bloglinks": {}, "links": {"https://twitter.com/": 2, "http://www.nytimes.com/": 1, "http://www.co.uk/": 1, "http://www.slate.com/": 1, "http://london2012.nytimes.com/": 1}, "blogtitle": "chartsnthings"}, {"content": ["Closing ceremonies are this weekend, which means the Olympics are almost over. \n As many readers/skimmers/aggregators of Chartsnthings might know, the New York Times graphics department published one or two things about the Olympics recently, and I’ll try to post little tidbits where I can instead of making a few massive posts. \n What better place to start than in the Olympic pool, where we last left our flags on our Speedos ? (Sorry about that one.)"], "link": "http://chartsnthings.tumblr.com/post/29133053109", "bloglinks": {}, "links": {"http://chartsnthings.tumblr.com/": 1, "http://www.nytimes.com/": 1}, "blogtitle": "chartsnthings"}, {"content": ["Yesterday the graphics desk published the third in its “How to Win” series; here, Shan Carter and Joe Ward explain the handoff in track relays. (You should really be checking those out , btw.) \n Shan sent along one of his first passes at the 3D track, which I believe he made using Modo . This only reinforces my current belief that 3D rendering is a basically a series of inexplicably magical dials. \n \n Here’s his final rendering from the published graphic ."], "link": "http://chartsnthings.tumblr.com/post/27951579285", "bloglinks": {}, "links": {"http://www.nytimes.com/": 4, "http://www.luxology.com/": 1, "http://www.twitter.com/": 2}, "blogtitle": "chartsnthings"}, {"content": ["Last week I got a chance to drop various longer-term assignments and do a small amount of monkeying for my colleague Haeyoun Park , who had obtained some data  from the N.O.A.A. on droughts in the contiguous United States going back more than a hundred years.  \n Every project is different, and when you’re on deadline, everyone just pitches in however they can to get the thing done in time. Haeyoun already knew exactly what she wanted: a grid of small multiples, showing one map per year. She had already done the reporting, gotten the data, made a map or two with GIS software to confirm that the idea would work. She just needed someone to crank out the maps. (Which is to say, she did almost all the work.)  \n As far as the computation goes, these maps are extremely easy to make using maptools . Generally, it takes about 20 minutes to make the first map and about 10 seconds to make the next N maps. (Not that I didn’t need to ask Amanda to fix my code.) These were all written to a single PDF in the grid Haeyoun wanted (here, an area is shaded red if it is under moderate to extreme drought): \n \n Which she annotated and cleaned up for print: \n \n Archie Tse wanted to explore a couple different grid patterns for the web, since we had a little more space to deal with, and he had me export a few different sizes… \n \n …before deciding on the 10-by grid, which is cool because you see an entire decade in every row. (This had not occurred to me until I saw it on the page.) They reordered them to go back in time, with 2012 on top:"], "link": "http://chartsnthings.tumblr.com/post/27728483435", "bloglinks": {}, "links": {"http://haeyoun": 1, "http://www.noaa.gov/": 1, "http://www.nytimes.com/": 1, "http://cran.r-project.org/": 1}, "blogtitle": "chartsnthings"}, {"content": ["Part of this blog is intended to show the processes behind our work, including bad ideas. (Especially bad ideas.) But screw-ups don’t happen just in charts. For example, here’s a recent, not-really-verbatim conversation I had with my colleague Graham Roberts as we looked at visualizing swimmers for an upcoming Olympics project: \n \n GR: “We need a decent way to identify these guys.” \n KQ: “What if we put a flag on their bathing suits?” \n GR: “Like on their Speedos? Wouldn’t that be weird?” \n KQ: “Not really.” \n GR: “Really?” \n KQ: “Let’s just see what it looks like.” \n \n [5 minutes later] \n \n KQ: “So, no flags, huh.” \n GR: “Yeah.”"], "link": "http://chartsnthings.tumblr.com/post/24994361059", "bloglinks": {}, "links": {"https://twitter.com/": 1}, "blogtitle": "chartsnthings"}, {"content": ["On Thursday Facebook had the third-largest I.P.O. ever . In the week leading up it, my colleague Amanda Cox spent some time thinking how to best explain and contextualize this offering to readers. What follows is a series of sketches from Amanda, who shared her project folder with me for this post, and Matt Ericson, who edited the piece. \n The universe of initial public offerings is seemingly simple: about 2,400 tech companies since 1980, compiled by Jay Ritter , a professor of finance at the University of Florida. \n As a first step, Amanda charted the companies by I.P.O. date (x-axis) and value at I.P.O. (y-axis), colored them by their 3-year return. (The key’s not included in her sketch, but for these purposes, know that red is bad and green is good.) \n \n This chart’s not bad (even if, like me, you have low standards), but it doesn’t say much other than that there was a dot-com boom, that most of those companies didn’t do so well, and that Facebook is worth a ton of money. \n Next, a plot of 3-year return by I.P.O. date: \n \n Trying to add in more nuance to this picture, shading the companies by the companies’ price-to-sales ratio at I.P.O. and including Facebook in a random position just for size: \n \n But rather than bringing clarity, it just sort of looked chaotic, even to the seasoned chart freaks of 620 8th Avenue. So she tried another form: a histogram of 3-year returns, colored by I.P.O. date: \n \n Or the same chart but piled into three time periods (not that anyone asked me, but I really like this one): \n \n By the way, even the queen bee of statistical charting screws up that chart the first time (be conservative with your “cex” values, folks): \n \n Another idea, vaguely reminiscent of the balloons from “Up,” is sales vs. market cap at I.P.O. colored by year. I won’t lie, I don’t get this one: \n \n Going back to time series, which many readers are more accustomed to reading and understanding, Amanda focused on one thing that always gets talked about with IPOs: almost all of the companies have a bump in market cap after their first day of trading. So she charted the “trails” of companies over their first day on the market (a log scale makes percentage changes look the same): \n \n The trails felt promising, so she pursued them with sales, too. (Along with some screw-ups.) Again, full transparency here, I don’t get this one either, but since there are some screw-ups in there I think we’re safe: \n \n At this point, there were a lot of charts made, but no clear answers about form or the best things to show. Matt Ericson, eyeing the looming deadlines, looked through Amanda’s analysis and offered a compromise of sorts, related to the histogram she had generated earlier, and suggested a slightly different form: \n \n Which turned into this: \n \n And, ultimately, into this: \n \n If you’ve seen the web version , though, you know it doesn’t look like this. [Amanda thinks print graphics can be smarter than web graphics.] For one, the browser window doesn’t give us this kind of space. But the medium itself plays a part too. Online, if you’re not engaged in 10 seconds, you’re not going to stay on the page, so they needed to keep it fun. For that, Amanda and Matt got some help from three (pretty badass) colleagues: Jeremy Ashkenas , Matt Bloch and Shan Carter . Together, they made an interactive chart that stepped through a handful of the steps above, slowly explaining the dataset, with each step building on the last: \n \n A couple major design processes are at work in this piece. First, sketching with data is massively important. Only by looking at the data in multiple forms, from different angles, did this group of visual journalists really peel back what was most interesting about it. Here, we saw histograms, crazy arrow charts, bubble charts, time series and others – all shaded with different variables. All but one, more or less, got cut. \n Second, and related, is that you go with the chart you have when the deadline comes – or that you’re only as good as the last chart you threw away. (Her words, not mine.) \n To be quite honest, Amanda wasn’t thrilled with her graphics that went in the paper and online. (She is always searching for The Perfect Form, whether or not it’s there.) If the I.P.O. were delayed another week, there would be another dozen charts in the trash can and maybe something else would be the last good chart. But you go to print with the charts you have, not the charts you want. So, you know, make a lot of them."], "link": "http://chartsnthings.tumblr.com/post/23348191031", "bloglinks": {}, "links": {"http://dealbook.nytimes.com/": 1, "http://bear.ufl.edu/": 1, "https://twitter.com/": 2, "http://www.nytimes.com/": 1, "http://maps.grammata.com/": 1}, "blogtitle": "chartsnthings"}, {"content": ["Last week the Times published their interactive electoral map . Although a medium-sized team of reporters, editors, designers and developers (including, but not limited to, Jeremy Ashkenas , Matt Ericson , Alan McLean , David Nolen and Derek Willis ) had a hand in designing and building the project, Shan Carter did much of the developing of the main visualization, and he agreed to let me post some of his sketches here. (I had no hand in this – I’m just the image copy-paster this evening.) \n First, a look back to the Times’ electoral map of 2008 : \n \n You’ll notice some similarities – there is analysis for every state and the option to share your own map. But they wanted to explore some different options this year, too. First, Shan started by making a cartogram in Illustrator, overlaid on a (pretty terrible) hand trace of the US: \n \n And then slowly tinkering with it: \n \n \n One idea was to take the geography out of the graphic completely: \n \n Or at least minimize it further by dividing states into regions: \n \n Another was to compare two maps side-by-side, similar to the “split screen” view of the Senate in 2008: \n \n But no one was really super thrilled with maps as the main conduit for the analysis. Instead, they decided on minimizing the geography and using “bins” for states. (Shan has sort of been obsessed with “bins” since 2008, when his dream of having states magically fall into buckets on election night ultimately didn’t pan out. I personally had to cheer him up after that and it was not pretty.) \n Anyway, an early prototype of that concept: \n And how that part of the graphic ultimately looked: \n \n If you’ve seen this piece by now, you’ll notice that they didn’t make just one decision – they expanded on a few of them in a compelling mix of interactive and linear storytelling that told a few different stories and also let you make your own and share it wherever you wanted. \n It’s also a fun insight into Shan’s workflow, which is to mostly experiment directly with markup rather than with flat outputs from R or Adobe Illustrator mockups, which many of us do. (OK, technically, he tells me the cartograms, being more art than science, were hand-made in Illustrator and then their xy positions were exported to D3, but still, he’s on the record saying “mockups are for suckers.”) \n Also, this was made using D3 and implemented a technique that let the graphic function properly even in Internet Explorer 8. (A sharp guy named Jim Vallandingham chronicled this in extreme detail if you’re interested in doing this sort of thing.)"], "link": "http://chartsnthings.tumblr.com/post/23087069258", "bloglinks": {}, "links": {"http://d3js.org/": 1, "http://elections.nytimes.com/": 4, "https://twitter.com/": 6, "http://vallandingham.me/": 1}, "blogtitle": "chartsnthings"}, {"content": ["One of the best things about working at a newspaper is that you can come into work and do something different every day. Yesterday I had planned on spending the day doing some longer-term work in preparation for the Olympics and generally phoning it in Friday-style when a handful of us got assigned a daily – a graphic that looked back on Mariano Rivera’s career in light of his A.C.L. injury on Thursday . I was totally going to do an insane 3D-video that analyzed his cutter, but apparently someone did that already, so we went with charts instead. I looked at saves over time of top pitchers while my colleague Tom Giratikanon , who just started this week, compared Rivera across different categories. \n We had a broad idea for what we were going for, which Matt Ericson sketched out by hand: \n \n I scraped the data for the players with the most saves from baseball-reference.com (using an old template Shan Carter made using hpricot, which I learned is now “ over ”), then sketched the top 250 or so in R. This only takes a couple seconds to read about,  but it was in fact at least two hours of screws ups and swearing before I saw this chart: \n \n Which eventually turned to this (we export odd colors to pick them up easily in Adobe Illustrator): \n \n And the final print version: \n \n Online, we took basically the same approach, except we wanted to make them interactive, so Shan Carter pitched in some D3 expertise and Tom made his in Raphael, and six painless hours later, after all the programming, browser checking, conditional loading (which might not be a term) and Matt Ericson VPNing in from New Jersey to fix everything, we had a nice interactive, mostly mobile-friendly graphic: \n  \n Our approach wasn’t revolutionary or anything – in fact, Amanda and I used an identical charting form to chart home runs a couple years ago – but the package worked well, and if anything, Rivera stands out more in the saves chart than Barry Bonds does in the homers chart. And it was a promising start to the possibility of turning around this kind of work on deadline."], "link": "http://chartsnthings.tumblr.com/post/22471358872", "bloglinks": {}, "links": {"http://www.baseball-reference.com/": 1, "https://twitter.com/": 1, "http://www.nytimes.com/": 4, "https://github.com/": 1}, "blogtitle": "chartsnthings"}, {"content": ["Elisabeth Bumiller’s recent profile of Jeremy Bernard, the first man and openly gay person to be the White House social secretary, used an interesting dataset: a list of everyone who has attended a state dinner in the Obama administration. I don’t have a ton of experience with Styles (or with “style”, for that matter), but this was a good chance to do something different with a new section. Except not that different, since charts are pretty much the only trick. \n Alicia Parlapiano and I ended up using a sort of spiral plot, which we then just joined together in illustrator. I remembered that we had used a similar technique in one of my first graphics at the Times to visualize which countries were good at which sports . (Then, as now, Amanda did the hard stuff.) So I ported the code from Actionscript to use for this, while also sizing for frequency of visits. \n Here’s the sketch: \n \n And how it looked in print: \n \n Matt Ericson and Amanda Cox helped out on a late night to make a fun interactive version, perfect for gawking at all those people who were invited instead of you."], "link": "http://chartsnthings.tumblr.com/post/22134209043", "bloglinks": {}, "links": {"http://www.nytimes.com/": 4}, "blogtitle": "chartsnthings"}, {"content": ["In last Sunday’s, paper Mike McIntire and Michael Luo published their investigation into White House visits by large Democratic donors. As simple as the chart was, we pondered many complex options before publishing it. \n Early on, I thought some large-scale visualization of all major donors might be interesting, so I plotted a couple hundred of the top donors (based loosely on first and last names) with donations and WH visits on the same axis to see if there was any meaningful pattern. It looked like this: \n \n Although it looked sort of cool (in a meaningless data-art kind of way), nothing there illuminated the real focus of the story – namely, the possibility that large donors might get more access to the White House. Really, that was my only idea, and I was being annoying and complaining about it when Amanda Cox matter-of-factly told me to make a sketch that showed the percent chance of visiting the White House based on one’s total donation size. An hour later, I had this: \n \n We all liked it right away. Most of the remaining work went to matching the databases of donors and visitors as well as we could. That data work is important, but horribly unsexy and not really conducive to sketches. In general, we matched on middle initials where we could, and Matt Ericson helped me implement his handy Mr. People gem to get the various names parsed in a uniform fashion. Otherwise, all the data work was done in R, with a typically heavy-bordering-on-embarrassing level of assistance from Amanda.  \n Once we published, there was some discussion about the form of the chart on Twitter, and I admit it’s slightly odd. We had a lot of discussion about form on our end, too. So I present 4 options, each named for a delightful animal (we do a lot of animal-based filenames in the department, for some reason): \n First, the “Blue Whale,” arguably the most straightforward, accessible approach. This form makes the trend the focus of the graphic: \n “Polar Bear” is perhaps the best chart for a more technical audience… \n \n …but it might mean fewer people understand it. And is it me, or do the horizontal segments look like error margins instead of donation ranges? It’s not quite a scatterplot, since the percentages plotted represent “buckets” of donation sizes rather than individual points.  \n A slightly different approach, the “ Tree Lobster ” might indeed be the most accurate representation of this dataset: \n \n But where’s the continuity? And seriously, how boring are bar charts? Also, labeling is hard on this thing, which is not a trivial problem. \n Lastly, (Dull) Giraffe: \n \n Seriously, this one is dull and maybe not worth discussing. Or is it? Discuss. Any discussion of these forms might happen on Twitter under the hashtag #chartingSpiritAnimals until I figure out how to put comments into this site, which, let’s face it, isn’t ever going to happen.  \n If you’ve seen the graphic online or in print, you’ll know that we went with the Blue Whale. Aside from carrying the crucial Steve Duenes/Matt Ericson/Amanda Cox voting bloc (their decisions somehow track the majority vote 100% of the time), it felt suited for the data and the story it was published with. \n \n (It looks fine  online  too, but it’s sort of stranded on its own URL.) \n Finally, as a disclaimer, the data plotted in these examples is slightly different than what went into print last week, as we did some manual tweaking on a handful of names, which moved a couple percentages up or down a tiny bit.  \n Look forward to seeing if any data visualizers Tweet silly animal names this week. I’ll go first…"], "link": "http://chartsnthings.tumblr.com/post/21631842099", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "https://twitter.com/": 1, "http://www.nytimes.com/": 2, "http://people.ericson.net/": 1}, "blogtitle": "chartsnthings"}, {"content": ["We had a medium-sized graphic in today’s paper looking back on Rick Santorum’s campaign. The map was made in R using maptools , a package I find increasingly easy and fun to use. For me, the best part about visualizing data in R is that it even when you screw things up pretty bad, the result usually looks pretty cool.  \n Anyway, the map is not revolutionary or anything, but it worked well to tell the story we wanted to tell. I took a screenshot of it at various points in the process (although a small army of people took care of most of the hard parts). Looked great online , too, thanks to that same small army. \n Here, making sure I remember how to plot counties: \n \n Sizing bubbles by margin of victory (too big, it turns out): \n \n Getting the colors and sizing closer: \n \n Exporting everything to a PDF so Illustrator can easily clean up the vector work: \n \n In today’s paper:"], "link": "http://chartsnthings.tumblr.com/post/20932481072", "bloglinks": {}, "links": {"http://www.nytimes.com/": 1, "http://cran.r-project.org/": 1}, "blogtitle": "chartsnthings"}, {"content": ["This week the graphics department published a couple graphics based on exit poll data. The first one , made mostly by Shan Carter, was similar in many respects to the one he made in 2008 to show the differences in voters supporting Barack Obama and Hillary Clinton. (Known internally as the “delightful dancing boxes.”) \n This view, which focused on Mitt Romney and Rick Santorum, was perfect for capturing the differences between their supporters, but we also wanted to show the influence of the other candidates, who have gotten substantial amounts of delegates. \n Shan addressed this with a quick sketch: \n \n Next they tried a ternary plot (I had to look it up myself), which is apparently beloved in geology and frequently to describe soil samples. Anyway, I came on to the project late, after the concept had been more or less decided. \n First, a sketch showing how voters of a single demographic group supported in 7 different states. (Groups that supported Mitt Romney are farther to the right; groups for Santorum are farther to the left; groups supporting anyone else are toward the bottom.) \n \n A different approach, and one we eventually went with, showed all the groups across a single state. This is for Iowa.  \n \n\n Then we just tried to show this as best we could. One thought was to label the biggest groups and draw lines for the shift from another state. Here’s who Michigan voters supported, with the lines emphasizing the main groups’ change from New Hampshire. \n \n\n We really liked the lines in print, but once you animate the transitions you don’t really need them, since the motion has the same effect. (Plus I didn’t know how program the lines anyway.) \n Then we just had to build the thing, which we made using the D3 libraries . In Flash this thing would have been not so hard, and it was slow going at the beginning. But we’re as good as anyone at copy/pasting from demos, so it wasn’t too long before this: \n \n\n became this: \n\n  \n\n Fun! \n Also, we used this demo for hit detection. To make your own ternary plots, install the vcd package in R. Here’s the reference ."], "link": "http://chartsnthings.tumblr.com/post/19078001617", "bloglinks": {}, "links": {"http://bl.ocks.org/": 1, "http://mbostock.github.com/": 1, "http://elections.nytimes.com/": 1, "http://en.wikipedia.org/": 1, "http://www.nytimes.com/": 2, "http://cran.r-project.org/": 2}, "blogtitle": "chartsnthings"}, {"content": ["A couple weeks ago, just in time for the Super Bowl, we published a couple fun graphics that used transcripts of ESPN’s “SportsCenter” as a way to look back on the NFL season.  \n Originally, I had a concept in mind very similar to the one we (mostly Shan Carter) did in 2010 for the World Cup. \n \n A colleague suggested instead using 3D players rather than photos, in part just to do something new and in part to give us a way to put more players on a field at one time. Here’s a progression of sketches on that concept: \n Original whiteboard sketch: \n \n A drawing for how it would fit on a print page: \n \n Graham Roberts’s proof of concept (with sizes semi-randomly assigned): \n \n We added some labels and charts to Graham’s final rendering: \n  \n It ended up looking pretty cool and we were happy with it, but in the course of our analysis we really noticed a lot of funny quotes and cliches that the announcers said but I couldn’t really find an interesting way to present them. \n We made a ton of charts looking for keywords we wanted to inspect, which let us sift through the data a little faster (though eventually we would have to weed out non-NFL references by hand). This output showed charts for mentions of words, both cumulative and week-by-week, along with a list of the usage of each word in context: \n \n But presenting them was kind of a challenge. A straightforward approach (the only kind I know how to do, really) didn’t do much for anyone and took up a ton of space, so we dumped it: \n \n We tried highlighting individual sentences (like “You’ll have more luck getting a ticktack out of the mouth of an alligator than getting information, especially about injuries, out of the mouth of Bill Belichick,” Aug. 10), but there wasn’t anything cohesive about a random list of quotes. \n Then my boss said to write something original with the quotes as if I were writing for McSweeney’s . I said, great idea, imagining something like “ Is It OK To Dunk On the President? ”, one of my favorite McSweeney’s articles ever. Unfortunately, I couldn’t get it to work. Luckily, our intern, Ritchie King, who was already helping me with the analysis, was. \n He turned a handful of silly cliches into a hilarious narrative about sports, war and Tim Tebow. We made his cliches piece the center of the graphic and had Sam Sifton read it online. (If you haven’t heard it yet, it’s worth a listen .) \n  \n Anyway, it was a fun project and proof that data is out there for almost any crazy idea. It also emphasized two important lessons. One, from Amanda Cox, is that you should make a hundred charts and pick the best one. We definitely did that – our project folder is full of boring analysis of various players and ideas. The second lesson is that the design and editing machine of the NYT graphics department can take a decent idea and turn it into something much better. \n For the nerds out there, most of the analysis was done in R using the tm , openNLP and Rstem packages, but I can’t be sure which methods I used from which since Amanda just told me to import all of them."], "link": "http://chartsnthings.tumblr.com/post/17905392486", "bloglinks": {}, "links": {"http://www.nytimes.com/": 4, "http://www.mcsweeneys.net/": 2, "http://cran.r-project.org/": 3}, "blogtitle": "chartsnthings"}]