[{"blogurl": "http://www.columnfivemedia.com\n", "blogroll": [], "title": "Column Five Media"}, {"content": ["We all have phobias — spiders, heights, clowns — but creative types see things a little differently. Their fears stem from late, dark nights to software bugaboos, overbearing bosses, and existential ponderings. Here are a few of the most common phobias of creatives in this graphic created with The Creative Finder ."], "link": "http://columnfivemedia.com/work-items/the-creativefinder-infographic-the-common-phobias-of-creatives/", "bloglinks": {}, "links": {"http://columnfivemedia.com/": 1, "http://designtaxi.com/": 1}, "blogtitle": "Column Five Media"}, {"content": ["This motion graphic from Public Impact introduces new models that let schools pay teachers up to 40 percent more and teacher-leaders up to 130 percent more, within budget. Part 1 explains how excellent teachers can close achievement gaps, and why schools must reach more students with these etchers. It also provides brief snapshots of school models that use job redesign and technology to reach more students with excellent teachers, for more pay, usually in collaborative teams that develop all teachers’ skills — creating an “Opportunity Culture” for teachers and students."], "link": "http://columnfivemedia.com/work-items/public-impact-motion-graphic-paying-teachers-more-within-budget/", "bloglinks": {}, "links": {"http://columnfivemedia.com/": 1, "http://opportunityculture.org/": 1}, "blogtitle": "Column Five Media"}, {"content": ["Do you check your phone every two minutes to see how many likes your Instagram photo has? Do your Tweets contain zero vowels? Are you the mayor of a dozen establishments? Your answer to these questions will determine whether or not you belong in the social media infirmary or not. Read on to learn about the social media habits that lead to a severe social sickness and massive decrease in productivity in this infographic created with Marketo ."], "link": "http://columnfivemedia.com/work-items/marketo-infographic-the-social-sickness/", "bloglinks": {}, "links": {"http://columnfivemedia.com/": 1, "http://blog.marketo.com/blog": 1}, "blogtitle": "Column Five Media"}, {"content": ["The past 20 summers have witnessed some of the most high-flying films and lovable movie characters our world has ever seen. But how do the top summer hits compare with one another at the box office? We dive into a variety of metrics to see how they stack up in this interactive created with Mint ."], "link": "http://columnfivemedia.com/work-items/mint-interactive-keeping-it-reel-comparing-20-years-of-summer-blockbusters/", "bloglinks": {}, "links": {"http://columnfivemedia.com/": 1, "http://www.mint.com/blog": 1}, "blogtitle": "Column Five Media"}, {"content": ["Small and midsize businesses are frequently talked about as the engine of the new cloud economy but are rarely defined. Who is this broad category of business owners? What do these companies actually look and feel like, beneath all of the generalities? Here, we take a closer look in this infographic created with VMware at today’s SMBs, examining company sizes, demographics, and decision makers, as well as how rapidly SMBs are adopting new cloud-based technologies in the workplace."], "link": "http://columnfivemedia.com/work-items/vmware-infographic-who-are-smbs/", "bloglinks": {}, "links": {"http://columnfivemedia.com/": 1, "http://blogs.vmware.com/": 1}, "blogtitle": "Column Five Media"}, {"content": ["More than 2,500 people in the United States are serving sentences of life without the possibility of parole for crimes committed as juveniles. being locked up until death may guarantee that a young offender never harms another member of society at large. But is depriving a child of all hope of rehabilitation and release morally, ethically and financially viable? You may think you know the answer to those questions, but check your assumptions with the facts in this infographic created with TakePart ."], "link": "http://columnfivemedia.com/work-items/takepart-infographic-life-without-parole-a-juvenile-injustice-system/", "bloglinks": {}, "links": {"http://columnfivemedia.com/": 1, "http://www.takepart.com/": 1}, "blogtitle": "Column Five Media"}, {"content": ["A new global survey has fond that 1 in 10 people believes that the end of the world will occur sometime in 2012, when the Mayan calendar ends. Whether inspired by media attention or conspiracy theories, the anxiety about an impending doomsday extends beyond just a tiny fringe group of believers. See just how far in this infographic created with GOOD ."], "link": "http://columnfivemedia.com/work-items/good-infographic-who-believes-the-end-of-civilization-is-near/", "bloglinks": {}, "links": {"http://www.good.is/": 1, "http://columnfivemedia.com/": 1}, "blogtitle": "Column Five Media"}, {"content": ["In October 2012, as the Medicare Hospital Readmissions Reduction program is rolled out, hospitals will need to gain better understanding of where their patients go post-discharge. Avalere examined national 2012 Medicare claims data to compare where hospitals report their patients are going and where they actually end up. The results reveal that hospitals may not always know where their patines are going."], "link": "http://columnfivemedia.com/work-items/alavere-health-infographic-do-you-know-where-your-patients-are-going/", "bloglinks": {}, "links": {"http://www.avalerehealth.net/": 1, "http://columnfivemedia.com/": 1}, "blogtitle": "Column Five Media"}, {"content": ["A startup is a unique specimen. From a co-working office and flip-flop sporting founder, to international headquarters and a high-powered CEO, these high-growth, technology-oriented companies have an evolutionary pattern all their own. We created this presentation with Cushman & Wakefield to better understand the evolution of a startup."], "link": "http://columnfivemedia.com/work-items/cushman-wakefield-presentation-evolution-of-a-startup/", "bloglinks": {}, "links": {"http://www.cushwake.com/": 1, "http://columnfivemedia.com/": 1}, "blogtitle": "Column Five Media"}, {"content": ["In 2011, the total cost of care for dual eligibles was $319.5 billion. To address these costs, the Centers for Medicare and Medicaid Services (CMS), acting through the Medicare-Medicaid Coordination Office and the Center for Medicare and Medicaid Innovation (CMMI), created a demonstration opportunity for states to implement a cost effective model of care that improves care and allows for coordinating across the Medicare and Medicaid programs. We take a look at the pending proposals in this infographic created with Avalere Health ."], "link": "http://columnfivemedia.com/work-items/avalere-health-infographic-coordinating-care-for-dual-eligibles-overview-of-state-proposals/", "bloglinks": {}, "links": {"http://www.avalerehealth.net/": 1, "http://columnfivemedia.com/": 1}, "blogtitle": "Column Five Media"}]