[{"blogurl": "http://gilkalai.wordpress.com\n", "blogroll": [], "title": "Combinatorics and more"}, {"content": ["Quid est noster computationis mundus? \n Nine months after is started, (much longer than expected,) and after eight posts on GLL, (much more than planned,)  and almost a thousand comments of overall good quality,   from quite a few participants, my scientific debate with Aram Harrow regarding quantum fault tolerance is essentially over. Some good food for thought, I hope. As always, there is more to be said on the matter itself, on the debate, and on other”meta” matters, but it is also useful to put it now in the background for a while, to continue to think about quantum fault tolerance in the slow pace and solitude, as I am used to, and also to move on in other fronts, which were perhaps neglected a little. \n Here are the links to the eight posts: My initial post ” Perpetual Motion of The 21st Century? “ was followed by three posts by Aram. The first ” Flying Machines of the 21st Century? “ the second ” N ature does not conspire  “ and the third “ The Quantum super-PAC . “ We had then two additional posts ” Quantum refutations and reproofs ” and ” Can you hear the shape of a quantum computer? .” Finally we had  two conclusion posts: ” Quantum repetition “ and ” Quantum supremacy or quantum control? “ \n EDP 22-27 \n We had six new posts on the Erdos Discrepancy Problem over Gowers’s blog (Here is the link to the last one EDP27 ). Tim contributed a large number of comments and it was interesting to follow his line of thought.  Other participants also contributed a few comments. One nice surprise for me was that the behavior of the hereditary discrepancy for homogeneous arithmetic progression in {1,2,…,n} was  found by Alexander Nikolov and  Kunal Talwar. See this post From discrepancy to privacy and back  and the paper . Noga Alon and I  showed  that it is   and at most  , and to my surprise Alexander and Kunal showed that the upper bound is the correct behavior. The argument relies on connection with differential privacy. \n Möbius randomness and computation \n After the -prime number theorem was proved by Ben Green, and the Mobius randomness of all Walsh functions and monotone Boolean function was proved by Jean Bourgain, ( See this MO question for details ) the next logical step are low degree polynomials over Z/2Z  . (The Walsh functions are degree 1 polynomials.) The simplest case offered to me by Bourgain is the case of the Rudin-Shapiro sequence. (But for an ACC(2) result via Razborov-Smolensky theorem we will need to go all the way to polynomial of degree polylog.) I asked it over MathOverflaw. After three months of no activity I offered a bounty of 300 of my own MO-reputations. Subsequently, Terry Tao and Ben Green discussed some avenues and eventually Tao solved the problem (and earned the 300 reputation points). Here is a very recent post on Möbius randomness on Terry Tao’s blog. \n Influences on large sets \n I n my post Nati’s Influence  I mentioned two old conjectures (Conjecture 1 dues to Benny Chor and Conjecture 2) about influence of large sets on Boolean functions. During Jeff Kahn’s visit to Israel we managed to disprove them both. The disproof is inspired by an old construction of Ajtai and Linial. \n Tel Aviv, New Haven, Jerusalem \n Last year we lived for a year in Tel Aviv which was a wonderful experience: especially walking on the beach every day and feeling the different atmosphere of the city. It is so different from my Jerusalem and still the people speak fluent Hebrew. I am now in New Haven. It is getting cold and the fall colors are getting beautiful. And it also feels at home after all these years. And next week I return to my difficult and beautiful  (and beloved) Jerusalem."], "link": "http://gilkalai.wordpress.com/2012/10/15/the-quantum-debate-is-over-and-other-updates/", "bloglinks": {}, "links": {"http://gowers.wordpress.com/": 2, "http://paul.rutgers.edu/": 1, "http://feeds.wordpress.com/": 1, "http://windowsontheory.org/": 1, "http://rjlipton.wordpress.com/": 8, "http://mathoverflow.net/": 2, "http://gilkalai.wordpress.com/": 2, "http://terrytao.wordpress.com/": 1}, "blogtitle": "Combinatorics and more"}, {"content": ["Over Gowers’s blog Tim and I will make an attempt to revisit polymath5. Last Autumn I prepared three posts on the problems and we decided to launch them now. The first post is here . Here is a related MathOverflow question . Discrepancy theory is a wonderful theory and while I am not an expert we had several posts about it here. (This post on Beck-Fiala and related matters ; and this news item on Beck’s 3-permutation conjecture.) I am aware of at least one important recent development in the theory that I did not report.  My posts go around the problem and do not attack it directly but I hope people will have a chance to think about the problem again and perhaps also about polymathing again. Meanwhile,  polymath7  (over the polymath blog) is in a short recess but I hope a new research thread will start soon."], "link": "http://gilkalai.wordpress.com/2012/08/26/looking-again-at-erdos-discrepancy-problem/", "bloglinks": {}, "links": {"http://gowers.wordpress.com/": 1, "http://gilkalai.wordpress.com/": 1, "http://mathoverflow.net/": 1, "http://feeds.wordpress.com/": 1, "http://polymathprojects.org/": 1}, "blogtitle": "Combinatorics and more"}, {"content": ["Near Nagoya : Firework festival; Kyoto : with Gunter Ziegler; with Takayuki Hibi, Hibi, Marge Bayer, Curtis Green and Richard Stanly; Tokyo : Peter Frankl; crowded crossing \n I just returned from a trip to Japan to the FPSAC 2012 at Nagoya and a workshop on convex polytopes in Kyoto. As in my first visit to Osaka in 1999 I found Japan stunning, and this time I was able to share the experience with my wife. \n Kyoto: The week before FPSAC there was a workshop at RIMS devoted to convex polytopes. Some highlights: A classical result by Venkov and McMullen characterizes polytopes whose translates tile the Euclidean d-space.  Sinai Robins talked about his work with Nick Gravin and Dima Shiryaev about k-tilings (every point is covered k times).  Not a full characterization yet but already some impressive results. Gunter Ziegler talked about his work with Karim Adiprasito disproving an old conjecture by Shephard which asserts that there are only finitely many projectively unique d -polytopes for every dimension d . This is false above dimension 81.  Eran Nevo talked about his solution with Satoshi Murai of the generalized lower bound conjecture and some subsequent works on triangulated manifolds. There were several talks relating Ehrhard polynomials of polytopes with enumerative combinatorics,  and several talks on algebraic geometry, toric varieties, Fano varieties, and mirror symmetry. Here are the slides of my lecture entitled open problems on convex polytopes I’d love to see solved (but some further explanations for some parts are needed). I hope to return to some of the topics of the workshop in a later post. \n Nagoya: FPSAC ( Formal power series and algebraic combinatorics ) is a central annual  combinatorial meeting with special emphasis on enumerative and algebraic combinatorics. This year it was the 24th such event although I could have swear that I took part in an FPSAC in Montreal already in 1985 but apparently this was a conference with a similar flavor and different name. Much is going on in enumerative and algebraic combinatorics. Cluster algebras, miraculously discovered a decade ago by Fomin and Zelevinsky are going strong in combinatorics as well as in other areas. Alternating sign matrices continue to offer amazing problems and answers. There were quite a few lectures on representation theory, symmetric functions, random matrices, and also on relations of enumerative combinatorics with hyperplane arrangements with polytopes and with physics. There were lectures involving massive computations and new computerized method and packages for symbolic computations  were described. Here are the slides of my lecture entitled Discrete isoperimetry: problems, results, applications and methods . The program page now contains slides for most lectures. \n What are alternating sign matrices? \n I suppose that you all know what a permutation matrix is (an n by n matrix with 0,1 entries and one non zero entry in each row and each column) and alternating sign matrices are amazing generalization of permutation matrices discovered by William Mills, David Robbins, and Howard Rumsey. (See also this article by Bressoud and Propp ) They are integral n by n matrices with 0,1 and -1 entries. In every row and every columns  the non zero aliments (and there must be at least one such element)  should alternate between 1 and -1 and start and end with a ’1′. Alternating sign matrices are in one to one correspondence with monotone triangle. Thos are triangles of integers starting with a row: 1,2,…,n . With the following rules: (a) all rows are strictly increasing; (b) every element in row i is weakly between the two elements above it. \n The amazing thing is that the number of alternating sign matrices of order n is precisely \n 1!4!7!…(3n-2)!/n!(n+1)!…(2n-1)! \n This was a conjecture by Mills, Robbins and Rumsey and it took over a decade until it was proved by Doron Zeilberger. Later Greg Kuperberg found a short proof and by now several proofs are known. If you have some information or ideas on alternating sign matrices that you would like to share or some questions about them, or about anything else , please contribute a comment."], "link": "http://gilkalai.wordpress.com/2012/08/20/tokyo-kyoto-and-nagoya/", "bloglinks": {}, "links": {"http://gilkalai.wordpress.com/": 10, "http://www.ams.org/": 1, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1, "http://www.ac.jp/": 3}, "blogtitle": "Combinatorics and more"}, {"content": ["Problem: Let P be a polytope in with n facets. Is it always true that P can be covered by n sets of smaller diameter? \n \n I also asked this question over mathoverflow, with some background and motivation."], "link": "http://gilkalai.wordpress.com/2012/07/23/a-weak-form-of-borsuk-conjecture/", "bloglinks": {}, "links": {"http://mathoverflow.net/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "Combinatorics and more"}, {"content": ["Jeff Kahn was in town : so we worked together also with Ehud Friedgut and Roy Meshulam (and others) quite intensively. Very nice! Stay tuned for a report! \n Polynomial Hirsch conjecture (polymath3): While the conjecture remains wide open there are some interesting developments. The conjecture asserts that the diameter of every d-dimensional polytope with n facets is at most polynomial in d and n. J esus de Loera and Steve Klee described simplicial polytopes which are not  weakly vertex decomposable and the existence of non weakly k -vertex decomposable polytopes for k up to about was proved  by Hähnle, Klee, and Pilaud in the paper  Obstructions to weak decomposability for simplicial polytopes . Karim Adiprasito and Bruno Benedetti proved the Hirsch conjecture for flag polytopes (and manifolds) using CAT(0) methods. Karim will write a guest blog post about it. Stay tuned. \n Erdos discrepancy problem (polymath5):  Tim Gowers and I have a plan to try soon to revive the EDP project  at least for a short while. We plan 3 posts about it in the second half of August over Tim’s blog. Update: The first post EDP22 just appeared . \n Polymath7 is going strong on the polymath blog . \n Quantum computer debate with Aram Harrow: The most recent post was entitled Can you hear the shape of a quantum computer?   Quite an interesting discussion, also on the Quantum pontiff . \n “Gold open access” new Forum: See the post and extensive discussion over Gowers’s blog (and also on Tao’s blog). \n Telling spheres: Joel Hass was in town and gave a talk about a recent work with Greg Kuperberg: Telling if a 3-manifolds  is a sphere is in co-NP (assuming GRH). This extends Greg’s work on telling unknots . Topology, provides remarkable questions in NP and coNP where proving both sides are hard. My claim to fame is replacing Joel in grading an exam in 1986 (or so) when he got married! \n High dimensional expander . My course with Alex Lubotzky on high dimensional expanders ended. A lot of nice things to tell about and we learned quite a few new things. Roy Meshulam concluded his course with a crystal clear lecture on Garland’s method. Maybe we will teach it again after a year break. Meanwhile, Ori Parzanchevski promised me to write something about some recent developments over here. Stay tuned for that too. \n 16th Midrasha Mathematicae: Our yearly midrasha ran by Aner Shalev was devoted to Words and Growth . Delicious approximate groups and word maps were observed! \n Interactive quantum lecture: We had an unususal quantum seminar presentation by Michael Ben-Or on the work A multi-prover interactive proof for NEXP sound against entangled provers by Tsuyoshi Ito and Thomas Vidick. Michael ran Vidick’s videotaped recent talk on the matter and from time to time he and Dorit acted as a pair of prover and the other audience as verifier. (Michael was one of the authors of the very first paper introducing multi-prover interactive proofs.) \n Peter Frankl: I plan on meeting Peter on Friday. Will report."], "link": "http://gilkalai.wordpress.com/2012/07/16/some-updates/", "bloglinks": {}, "links": {"http://gowers.wordpress.com/": 3, "http://polymathprojects.org/": 1, "http://front.ucdavis.edu/": 3, "http://feeds.wordpress.com/": 1, "http://gilkalai.wordpress.com/": 1, "http://www.ac.il/": 1, "http://arxiv.org/": 2, "http://rjlipton.wordpress.com/": 1, "http://dabacon.org/": 1}, "blogtitle": "Combinatorics and more"}, {"content": ["The following post was kindly contributed by Eyal Sulganik   from IDC (Interdiciplinary Center)  Herzliya. Eyal was motivated by our poll on certainty “beyond a reasonable doubt,” which is related to several issues in accounting . \n Mathematicians, I believe, are always looking for new areas where their models and concepts can make a difference. Physics, Economics, CS, Biology are just some examples, surely not exhausting a longer list of such areas. Although the origins of accounting emanate from mathematicians (for example: L. Pacioli, and even  A. Cayley found interest in it), it is a fact,  though not unexplained,  that these days  (almost) no mathematicians are interested in accounting and there is no field of “mathematical accounting”.  In the following few paragraphs I would like to thus draw attention to accounting as a possible field for mathematicians. Surprisingly, a possibly “profitable field”. I believe that accounting can be subject, inter-alia, to use of theories of Formal Systems, Information Theory, Voting  theory, Fuzzy Logic, Graph theory and even Catastrophe theory. In brief, accounting (Financial Reporting) deals with the measurement and reporting of economic events .  As such, it is a measurement system interlaced with an information system. (Results such as Blackwell theorem  on the comparison of information systems are of relevance). \n Financial reporting of firms, the lifeline of the Capital Markets, is dictated by “reporting standards”. Those reporting standards are determined by “standard boards” (according to voting rules and procedures, which are very interesting for analysis)  and interpreted and evolve over time (as is the case with other languages).   The reports are audited by accounting firms.  Auditing theory became more sophisticated  but even fairly standard tools like Benford Law are not yet routine. \n Moreover, a huge debate centers on whether to adopt a rule-based system where “every” possible scenario is prescribed in advance or whether to adopt a principle based system which gives” freedom” to every reporting entity in reflecting the economic substance of an event. \n It is well known that a rule-based systems provide greater comparability (between firms), but at the same time, as they are more rigid and make use of “bright lines”,  can be more easily forced to reflect form over substance . Indeed, Bright line Accounting rules are not continuous functions and hence small changes in the description or design of an event can lead to enormous differences in the reported values. For example, given that the definition of “CONTROL” was based on a “50% legal test” ,until recently it was the case that  if company A was holding 50.01% of the shares of company B (other holders being each  much smaller)  and sold only  1.02% it could recognize a profit, due to “loss of control”,  as though it sold the whole holding and bought back 49.01%. Needless to say that although holding “only” 49.01% , A CONTROLs B (Danny Ben Shahar, Desmond Tsang and Myself are in the process of demonstrating that “accounting theory of control” is inconsistent with Shapley Value). \n Principle based systems, on the other hand, must make sure that its principles are common knowledge. For example, if a provision for loss regarding a claim against a firm depends on the chances of loss being “Probable” or  “remote” or “reasonably possible” a question arises what the preparers and users of the financial statements think about those terms. Many years ago, me and my colleague Yossi Aharoni found out-through questionnaires- that different types of agents have different probabilistic interpretations to those terms and we explained the mis-communication it can cause. I attach two simple papers ( one co-authored with Danny Ben Shahar , the other one in hebrew ),  that can shed some more light on the above point of view and I dare state a wish that a new field of “mathematical accounting” will be created ."], "link": "http://gilkalai.wordpress.com/2012/06/19/eyal-sulganik-towards-a-theory-of-mathematical-accounting/", "bloglinks": {}, "links": {"http://portal.ac.il/": 1, "http://gilkalai.wordpress.com/": 2, "http://feeds.wordpress.com/": 1, "http://projecteuclid.org/": 1}, "blogtitle": "Combinatorics and more"}, {"content": ["The Birthday and Diamond Jubilee Honours 2012 was released on 16 June 2012 in the United Kingdom and Tim Gowers was knighted for “services to mathematics”! So I suppose Tim is now becoming ”Sir William.” \n  \n It is possible that the Queen mainly thought about Tim’s wonderful research contributions. (Indeed, I was told, lately she took the relevant volumes of GAFA with her to bed.) But certainly Gowers’s services to mathematics include also the Princeton companion and the very short introduction , general-public presentations, Gower’s blog and Tim’s frequent \n comments on other blogs, Polymath , Contributions to MathOverflow (the first user to get eight golden badges, among other things), Fighting Elsevier  (which is now referred to as the “ academic spring “) and more. Congratulations!"], "link": "http://gilkalai.wordpress.com/2012/06/17/knighted-for-services-to-mathematics/", "bloglinks": {}, "links": {"http://gowers.wordpress.com/": 4, "http://feeds.wordpress.com/": 1, "http://books.co.il/": 1, "http://gilkalai.wordpress.com/": 3, "http://mathoverflow.net/": 1, "http://en.wikipedia.org/": 2}, "blogtitle": "Combinatorics and more"}, {"content": ["Take Our Poll \n (Motivated by two questions from Gowers’s How should mathematics be taught to non mathematicians .)"], "link": "http://gilkalai.wordpress.com/2012/06/13/what-does-beyond-a-reasonable-doubt-practically-mean/", "bloglinks": {}, "links": {"http://gowers.wordpress.com/": 1, "http://feeds.wordpress.com/": 1, "http://polldaddy.com/": 1}, "blogtitle": "Combinatorics and more"}, {"content": ["A new Polymath7 project proposed by Chris Evans is starting in the polymath blog ."], "link": "http://gilkalai.wordpress.com/2012/06/10/a-new-polymath-project-hot-spots-in-triangles/", "bloglinks": {}, "links": {"http://gilkalai.wordpress.com/": 2, "http://feeds.wordpress.com/": 1, "http://polymathprojects.org/": 1}, "blogtitle": "Combinatorics and more"}, {"content": ["Last monday we had the annual meeting of the Israeli Mathematical Union  (IMU) that took place this year in Bar-Ilan University in Ramat Gan. (IMU is famously also the acronym of the International Mathematical Union but in this post IMU will stand for “Isreali Mathematical Union.”) The first IMU meeting that I participated was in 1972 and I try to participate every year.  One year, Nati Linial and me were the treasurer and secretary of the IMU and were assigned (by the IMU president at the time, Yisrael Aumann) the task of organizing the meeting. The IMU meetings have different formats and usually they are very successful and this year was no exception. So I will tell you a little more about it later. Five more short items for today: \n \n Last Wednesday two new research centers were inaugurated. Here at the Hebrew University of Jerusalem the new Quantum Information Science Center   had its kick-off workshop  on Wednesday. Here are the slides of the lecture I gave  devoted to my debate with Aram Harrow . (As always, remarks and corrections are most welcome.) \n In Haifa at the Technion , the newly founded Technion-Microsoft Electronic-Commerce Research Center held a one day workshop on electronic-commerce . \n There is a new research blog Windows on Theory  devoted to research in theoretical computer science. It is run by theory people from Microsoft Research, most from the Silicon Valley. The last post mentioned a nice story of Ehud Friedgut about hitting a rotating sphere from a 1997 paper of mine. \n Last month, Luca Trevisan was the Erdos’ Lecturer of the center for Discrete Mathematics and Theoretical Computer Science, here at HU. Luca is one of the world leaders in theoretical computer science and also the author of a famous blog: In Theory.    Luca Trevisan’s blog’s celebration of Alan Turing’s 100th birthday , spanned over several posts,  will be devoted to a big part of Turing’s life  – being gay. \n Starting on monday: A conference on graph limits (“ Graphs and Analysis “) at IAS, Princeton. Many great talks are expected. Our blog is negotiating with Itai Benjamini for letting us post the slides of his lecture on Euclidean versus graph metrics. \n \n The Bar-Ilan Meeting \n David Kazhdan gave a talk about the classic master equation. \n The abstract of his lecture read: \n \n We formalize the construction by Batalin and Vilkovisky of a solution of the classical master equation associated with a classical action, a regular function on a nonsingular affine variety. We introduce the notion of stable equivalence of solutions and prove that a solution exists and is unique up to stable equivalence. A consequence is that the associated BRST cohomology groups are independent of choices and are uniquely determined up to unique isomorphism by the classical action. \n \n David, however, decided to give a talk about the background to a talk described in the abstract. He gave a quick mathematical introduction to classical and quantum mechanics, leading to the Faddeev-Popov method, described in as elementary and jargon-free as possible  differential geometry language. Beautiful talk! \n Let’s glimpse at the lecture: Quantum mechanics is about calculating integrals of the form While classical mechanics is the study of the stationary points of . (In cases where the stationary point is unique, the derivative at a stationary point is well-defined and the Hessian is non-zero, and other pleasant things occur  we can approximate the integral by a normalized value of .) \n When there is a group  G  (gauge symmetry) acting on X   then we can try to make the computation on the quotient X/G  . (This computation leads to expansion in terms of Feynman diagrams.) Faddeev-Popov method is based on the idea: don’t take quotients but rather enlarge your space! So you replace X by the Cartesian product of X with the associated Lie algebra of G . (Here, a structure of a “supermanifold” emerges.) At this point a) some differential geometry enters into the picture, b) this allows to the master equation promised in the title to emerge, and c) The computation has some cohomological nature. \n After David’s talk Jonathan Wahl gave a talk  on Topology versus geometry of complex singularities. There is a famous book by Milnor on this topic and a lot have been learned since. Then there was a brief prize awards session. Our annual  Erdos’ prize for a mathematician under 40, was awarded to Irit Dinur, and the Haim Nessiyahu prize for excellent doctoral thesis was awarded to Alexander Sodin on his work on random matrices.  Ran Raz gave a talk about PCP and, in particular, on Irit’s contribution.  This is the 20th anniversary of the PCP Theorem. Heartily Congratulations to Irit and Sasha. \n And then we separated into ten  parallel sessions: Algebra and number theory; Analysis; Discrete Math and Computer Science; Dynamics and Ergodic Theory;  History and Philosophy of Mathematics; Homotopy Theory;  Mathematical Education; Topology and Geometry; Probability; Nonlinear Analysis and Optimization. To avoid being torn between too many good options my policy is usually to stay with the combinatorics session. But this year since my flight was brutally delayed and I landed only at five in the morning I had to choose the option of going home to sleep."], "link": "http://gilkalai.wordpress.com/2012/06/03/celebrations-in-bar-ilan-hu-and-the-technion-a-new-blog-windows-on-theory-turings-celebration-on-in-theory-graph-limits-in-princeton/", "bloglinks": {}, "links": {"http://windowsontheory.org/": 1, "http://feeds.wordpress.com/": 1, "http://qcent.ac.il/": 2, "http://www.ias.edu/": 1, "http://imu.org.il/": 1, "http://gilkalai.wordpress.com/": 1, "http://ie.ac.il/": 1, "http://lucatrevisan.wordpress.com/": 1}, "blogtitle": "Combinatorics and more"}]