[{"blogurl": "http://communicationnation.blogspot.com\n", "blogroll": [], "title": "Communication Nation"}, {"content": ["As part of the kickoff for the Global Service Jam, I was asked to offer some tips on how service designers could use gamestorming. So I put together a few thoughts in this short video."], "link": "http://communicationnation.blogspot.com/feeds/5976494804244505349/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Communication Nation"}, {"content": ["The future is podular , originally uploaded by dgray_xplane . One of the most difficult challenges companies face today is how to be more flexible and adaptive in a dynamic, volatile business environment. How do you build a company that can identify and capitalize on opportunities, navigate around risks and other challenges, and respond quickly to changes in the environment? How do you embed that kind of agility into the DNA of your company? The answer is to distribute control in such a way that decisions can be made as quickly and as close to customers as possible. There is no way for people to respond and adapt quickly if they have to get permission before they can do anything. If you want an adaptive company, you will need to unleash the creative forces in your organization, so people have the freedom to deliver value to customers and respond to their needs more dynamically. One way to do this is by enabling small, autonomous units that can act and react quickly and easily, without fear of disrupting other business activities – pods. A pod is a small, autonomous unit that is enabled and empowered to deliver the things that customers value. Read the rest of the post, The future is podular , on the Connected Company blog"], "link": "http://communicationnation.blogspot.com/feeds/1161837567531918291/comments/default", "bloglinks": {}, "links": {"http://connectedco.com/": 2, "http://www.flickr.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["Many thanks to Thomas Vander Wal for the many conversations that inspired this post. The average life expectancy of a human being in the 21st century is about 67 years . Do you know what the average life expectancy for a company is? Surprisingly short, it turns out. In a recent talk , John Hagel pointed out that the average life expectancy of a company in the S&P 500 has dropped precipitously, from 75 years (in 1937) to 15 years in a more recent study. Why is the life expectancy of a company so low? And why is it dropping? I believe that many of these companies are collapsing under their own weight. As companies grow they invariably increase in complexity, and as things get more complex they become more difficult to control. The statistics back up this assumption. A recent analysis in the CYBAEA Journal looked at profit-per-employee at 475 of the S&P 500, and the results were astounding: As you triple the number of employees, their productivity drops by half ( Chart here ). This “3/2 law” of employee productivity, along with the death rate for large companies, is pretty scary stuff. Surely we can do better? I believe we can. The secret, I think, lies in understanding the nature of large, complex systems, and letting go of some of our traditional notions of how companies function. THE COMPANY AS A MACHINE  Historically, we have thought of companies as machines, and we have designed them like we design machines. A machine typically has the following characteristics: 1. It’s designed to be controlled by a driver or operator. 2. It needs to be maintained, and when it breaks down, you fix it. 3. A machine pretty much works in the same way for the life of the machine. Eventually, things change, or the machine wears out, and you need to build or buy a new machine. A car is a perfect example of machine design. It’s controlled by a driver. Mechanics perform routine maintenance and fix it when it breaks down. Eventually the car wears out, or your needs change, so you sell the car and buy a new one. And we tend to design companies the way we design machines: We need the company to perform a certain function, so we design and build it to perform that function. Over time, things change. The company grows beyond a certain point. New systems are needed. Customers want different products and services, so we need to redesign and rebuild the machine, or buy a new one, to serve the new functions. This kind of rebuilding goes by many names, including re-organization, reengineering, right-sizing, flattening and so on. The problem with this kind of thinking is that the nature of a machine is to remain static, while the nature of a company is to grow. This conflict causes all kinds of problems because you have to redesign and rebuild the company while you also need to operate it – an idea dramatized in an EDS commercial from a few years ago: Building an airplane in flight . THE COMPANY AS AN ORGANISM  It’s time to think about what companies really are, and to design with that in mind. Companies are not so much machines as complex, dynamic, growing systems. As they get larger, acquiring smaller companies, entering into joint ventures and partnerships, and expanding overseas, they become “systems of systems” that rival nation-states in scale and reach. So what happens if we rethink the modern company, if we stop thinking of it as a machine and start thinking of it as a complex, growing system? What happens if we think of it less like a machine and more like an organism? Or even better, what if we compared the company with other large, complex human systems, like, for example, the city? Cities are large, complex, systems, but we don’t really try to control them. In Stephen B. Johnson 's book Emergence: The Connected Lives of Ants, Brains, Cities, and Software he quotes complexity pioneer John Holland : Cities have no central planning commissions that solve the problem of purchasing and distributing supplies… How do these cities avoid devastating swings between shortage and glut, year after year, decade after decade? No, we don’t try to control cities, but we can manage them well. And if we start to look at companies as complex systems instead of machines, we can start to design and manage them for productivity instead of continuously hovering on the edge of collapse. Cities aren't just complex and difficult to control. They are also more productive than their corporate counterparts. In fact, the rules governing city productivity stand in stark contrast to the ominous “3/2 rule” that applies to companies. As companies add people, productivity shrinks. But as cities add people, productivity actually grows. A study by the Federal Reserve Bank of Philadelphia found that as the working population in a given area doubles, productivity (measured in this case by the rate of invention) goes up by 20%. This finding is borne out by study after study. If you’re interested in going deeper, take a look at this recent New York Times article: A Physicist Solves the City . Okay, you say, but cities are fundamentally different than companies. Just because this works for cities doesn’t mean that it will work for companies. Right? THE LONG-LIVED COMPANY  Actually there’s some interesting data there too. Back in the early 1980’s, right after the revolution in Iran, Shell Oil was concerned about the future of the oil industry. What might Shell look like after oil, they wondered? So they commissioned a study with some very interesting parameters: 1. First, they looked only at large companies with relative dominance in their industries, companies similar to Shell in that regard. 2. Second, they looked only at companies with very long lifespans – 100 years or more. 3. Third, they looked at companies who had made a major shift from one industry or product category to another. In other words, they looked at the immortals: the companies that didn't die. The study was never published, but the findings were detailed in a book: The Living Company by Shell executive Arie de Geus . Shell studied 40 large, long-lived companies, some of which were still surviving after 400+ years. Interestingly, these companies had a lot in common with large cities: Ecosystems: Long-lived companies were decentralized. They tolerated “eccentric activities at the margins.” They were very active in partnerships and joint ventures. The boundaries of the company were less clearly delineated, and local groups had more autonomy over their decisions, than you would expect in the typical global corporation. Strong identity: Although the organization was loosely controlled, long-lived companies were connected by a strong, shared culture. Everyone in the company understood the company’s values. These companies tended to promote from within in order to keep that culture strong. Cities also share this common identity: think of the difference between a New Yorker and a Los Angelino, or a Parisian, for example. At the Dachis Group we like to call this common culture hivemind . Active listening: Long-lived companies had their eyes and ears focused on the world around them and were constantly seeking opportunities. Because of their decentralized nature and strong shared culture, it was easier for them to spot opportunities in the changing world and act, proactively and decisively, to capitalize on them. At Dachis we sometimes call this dynamic signal (watching and listening) and metafilter (information leading to decisive action). DESIGN BY DIVISION   Historically we have designed companies like machines – by division. We construct the org chart to divide the big chunks of work and separate them from each other: Finance, Sales, Operations. We design the work flows that process inputs into outputs: raw materials into products, prospects into customers, complaints into resolutions. As we design this kind of company – the divided company – we need to separate functions, which means people may not always have a sense of the larger thing they are working on. They get very good at one of the tasks, but lose touch with the larger picture. So we have to design rigid policies and procedures so people will function efficiently and so they won’t interfere with each others’ work. The problem comes with scale. As the number of employees grows, the profit per employee shrinks. It’s a game of diminishing returns. Efficiencies of scale are balanced out by the burdens of bureaucracy. Divisions become silos, disconnected from each other. Overhead costs increase with size. The resulting need for control, and the inability to achieve it at a reasonable cost, is what eventually kills a business. DESIGN BY CONNECTION  Although we tend to design companies like machines, we instinctively and intuitively understand that companies are not made of cogs, levers and gears. In the end, they are made out of people. For top management, it would be wonderful if we could put our business strategy into the machine, push a button and wait for the results. But it doesn’t work that way. You have to put your strategy into people if you want to get results. And today, thanks to social technologies, we finally have the tools to manage companies like the complex organisms they are. Social Business Design is design for companies that are made out of people. It’s design for complexity, for productivity, and for longevity. It’s not design by division but design by connection. To design the connected company we must focus on the company as a complex ecosystem, a set of connections and potential connections, a decentralized organism that has eyes and ears everywhere that people touch the company, whether they are employees, partners, customers or suppliers. Social Business Design is a new discipline, but some basic rules are already emerging. These emerging rules have less in common with traditional business design, and more in common with urban design and city planning. It’s not about design for control so much as design for emergence. You can’t control a complex system, but you can manage its growth, and there are a lot of things you can do that will position it for success. Here are a few of those emerging practices that signal excellence in design by connection: Understand the culture: A company is like a city in many ways. First and foremost, a city is about the people who live and work there; it’s an expression of their collective culture. Before you can start your path to the connected company, you need to understand the culture (or cultures) that are already there, so you can look for ways to enhance and strengthen that shared identity. Start small. Urban designers might look at maps or aerial views as they make their plans, but the life of a city happens at street level. As you initiate social programs, think of them as if you are designing a city street. A successful street is filled with people. The last thing you want is a whole bunch of large, urban areas with no people in them. In a city, big, open, empty spaces feel unsafe and unloved. So start small. The smaller the space is initially, the faster it will fill up with people. A good way to start is with an organization-wide project or initiative that requires participation from a number of people across the company. This gives you a cross-section of ideas and perspectives to look at as you plan the next stage. Spaces need owners. Again, think of the city street: every business or building has an owner. The sidewalks have owners – typically every business at street level “polices” their stretch of sidewalk. And even the street has owners – the street sweeper, the cop on the beat. In the same way, make sure that every online space you create has someone positioned to take care of it, to keep it safe and clean. Every person needs a place. In the same way that public spaces need caretakers, every person needs a place to live; somewhere they can put their stuff. As you build your social business, make sure that every single person has a place where they can put, and see, their stuff: their projects, the links they want to get back to, the documents they have created, their role, qualifications, expertise and so on. Jumping-off points. A good city street offers opportunities that are unanticipated but serendipitous. The promising side-street. The sound of music coming through an open door. As you design for connection, think about how you might create those unexpected, but delightful, surprises. Every time someone visits an online space, there’s a chance to offer them something new. Watch, listen, adjust and adapt. Design by connection is not a top-down activity so much as bottom-up. Complex systems just don’t work that way. In a complex system, you need to pay attention to small things and make little adjustments along the way. Think about how city streets evolve: one small step at a time. One retailer moves to a larger space; another goes out of business. One old building is torn down and replaced; another is rehabbed and turned into lofts. Pay attention to the culture, and watch how people react to the tools you provide. Are they using something in a different way than you expected? Find out why and see if you can enhance that. And what are they ignoring? If they’re not using something you expected them to use, go talk to them and see if you can figure out the reason. The typical company has a very short life, from 15 to 50 years. But cities – and some companies – live much longer lifespans: from hundreds to thousands of years. Wouldn’t you like that for your company? I know I would. If you have thoughts I would love to hear them. Please take a moment and leave a comment.  UPDATE: The book \"The Connected Company\" is now available on Amazon! UPDATE: Based on the extreme volume of response to this post I have set up an email discussion group for those who want to continue the conversation. Please join us here ."], "link": "http://communicationnation.blogspot.com/feeds/4301554770131924915/comments/default", "bloglinks": {}, "links": {"http://www.ariedegeus.com/": 1, "http://knowledge.upenn.edu/": 1, "http://ideas.repec.org/": 1, "http://www.flickr.com/": 6, "http://groups.google.com/": 1, "http://www.cybaea.net/Blog": 1, "http://www.blogger.com/": 1, "http://ecx.images-amazon.com/": 1, "http://www.dachisgroup.com/": 2, "http://www.youtube.com/": 1, "http://www.stevenberlinjohnson.com/": 1, "http://en.wikipedia.org/": 2, "http://www.amazon.com/": 2, "http://www.johnhagel.com/": 1, "http://www.nytimes.com/": 1, "http://www.cybaea.net/": 1, "http://www.vanderwal.net/": 1}, "blogtitle": "Communication Nation"}, {"content": ["Dr. Martin Eppler of the University of St. Gallen interviews me about visual thinking and change. Yes it's a bit more formal than I usually get, but I was in Switzerland and they like that kind of thing :) This video is related to an interview I gave on change management for the management journal Organizations Entwicklung. You can read the article (and comment) in English here and in German here . Leave a comment! I'd appreciate hearing your thoughts."], "link": "http://communicationnation.blogspot.com/feeds/1316608964766106038/comments/default", "bloglinks": {}, "links": {"http://www.zoe.ch/": 1, "http://www.unisg.ch/": 2, "http://a.nnotate.com/": 2}, "blogtitle": "Communication Nation"}, {"content": ["For more Gamestorming goodness, check out the Gamestorming blog ."], "link": "http://communicationnation.blogspot.com/feeds/3963631346967640459/comments/default", "bloglinks": {}, "links": {"http://gogamestorm.com/": 1}, "blogtitle": "Communication Nation"}, {"content": ["Information shadows and spimes , originally uploaded by dgray_xplane . \t\t\t\t \tIn his book Smart Things , Mike Kuniavsky talks about the information shadow as an essential element of a smart thing. The information shadow is the information that's associated with an object such as its name, number, position in space and time, and so on. Metaphors also help people understand new services by linking the new to the familiar. For example, RFID was first introduced as the next generation of the bar code, even though the two technologies had little in common. Information shadows allow designers to make objects simpler, to reduce the size of interfaces and reduce the display requirements of an object. An iPod shuffle, for example, can be tiny because the information display resides in iTunes, not on the device. Science fiction author and futurist Bruce Sterling coined the term spime to describe an object that can be tracked through space and time throughout the lifetime of the object. This is part of a project called Ubicomp Sketchbook that I initiated with user experience designer Peter Morville , author of Ambient Findability and Search Patterns , in order to explore and explain the ideas aand implications of ubiquitous computing, sometimes called the \"internet of things.\" Check out the whole set . Please share your thoughts!"], "link": "http://communicationnation.blogspot.com/feeds/9171967667189579374/comments/default", "bloglinks": {}, "links": {"http://www.flickr.com/": 4, "http://en.wikipedia.org/": 2, "http://twitter.com/": 1, "http://www.amazon.com/": 2, "http://semanticstudios.com/": 1, "http://searchpatterns.org/": 1}, "blogtitle": "Communication Nation"}, {"content": ["The nib cursor , originally uploaded by dgray_xplane . \t\t\t\t \tI love my iPad, but the finger-only interface has been a continuing frustration for me. As an artist and designer, I want to do things that I can easily do with a pen and paper, like write, scribble and sketch. But these are not things we typically do with our fingers, any more than we eat soup or salad with our fingers. Apple apologists will say that you can sketch and write with the iPad, and indeed we can. Yes, and indeed we can also eat salad or even soup without utensils if it's absolutely necessary. But that's not ideal, is it? Over the years we've developed tools, like forks, spoons, knives and yes, pens, that make life easier. We should expect no less from our interface designers. This morning I participated in a stimulating discussion on twitter with user experience designers @docbaty, @daveixd, @mojoguzzi and @fred_beecher that left me thinking -- could we solve this problem without changing the hardware? And indeed I think we can. The problem that a pen solves (beyond carrying ink around) is that it gives the user the ability to \"see where they are going.\" Using your finger to draw on the iPad, or even one of the many styli that are available, has the tendency to hide the point of the virtual \"pen,\" thus hiding the path. Now imagine an interface that allows you to use the natural gesture you use to write with a pen or pencil, and gives you a point that you can see. Suddenly you can see where you are going and the primary problem is solved. One of the things that occurred to me this morning -- which led to this insight -- was that when Apple first \"virtualized\" the keyboard by adding it to the software interface instead of the hardware, there was a lot of initial resistance. I was one of those resisters. I couldn't imagine using a phone without a physical keyboard. But over time, I learned to use the virtual keyboard and now I appreciate the additional flexibility that this interface gives me: to have more screen or less as the case demands. Why not do the same with the stylus? A \"virtualized pen\" would answer most of my gripes and over time I would probably come to love it. I might even stop carrying a pen and paper around. And that would be an interface I could fall in love with."], "link": "http://communicationnation.blogspot.com/feeds/7587723736191221654/comments/default", "bloglinks": {}, "links": {"http://www.flickr.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["Anatomy of a smart thing , originally uploaded by dgray_xplane . In his book Smart Things , Mike Kuniavsky quotes a Scientific American article from 1991 , where Xerox PARC 's then CTO Mark Weiser laid out the vision for ubicomp: \"[Ubicomp is] the idea of integrating computers seamlessly into the world at large ... not simulating the world so much as enhancing the one that already exists ... [most of them] will be invisible in fact as well as in metaphor ... These machines and more will be connected in a ubiquitous network. Today's design challenge, says Kuniavsky, is to create a practice of ubiquitous computing user experience design. Such a practice is by necessity cross-disciplinary, involving identity design (what makes the product or service memorable and unique), interface design (modes of functionality), industrial design (physicality), interaction design (how you can interact with it), information design (how it displays information), service design (how the service maintains consistency across many objects devices and experiences), and information architecture (organizing principles for the information). That's a lot of D words! In other words it takes a team, and this will only increasingly be the case. The practice is changing quickly, and with the power to transform society comes great responsibility. Check out the whole set on Flickr , and please share your thoughts in the comments section!"], "link": "http://communicationnation.blogspot.com/feeds/6526162170553159261/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://www.amazon.com/": 1, "http://nano.xerox.com/": 1, "http://www.flickr.com/": 4, "http://en.wikipedia.org/": 2}, "blogtitle": "Communication Nation"}, {"content": ["Metaphor , originally uploaded by dgray_xplane . \t\t\t\t \tIn his book Smart Things , Mike Kuniavsky suggests metaphor as a tool for thinking through ubicomp designs and interactions. By mapping one category onto another we can discover new insights -- among other things, it's a way to trick the mind into seeing old things in new ways. Organizational metaphors (ways of organizing services) include the factory, the public utility, parallel universes and so on. Metaphors also help people understand new services by linking the new to the familiar. For example, RFID was first introduced as the next generation of the bar code, even though the two technologies had little in common. Kuniavsky suggests that when exploring a new concept via metaphor, it pays to explore the dark side as well as optimistic scenarios to get a more well-rounded picture of the future system. How might your design be thwarted? How might the system be hijacked or co-opted for other uses? Please share your thoughts!"], "link": "http://communicationnation.blogspot.com/feeds/7105133696255936743/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://www.amazon.com/": 1, "http://www.flickr.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["Ubicomp Sketchbook , originally uploaded by dgray_xplane . \t\t\t\t \tIn a recent post titled Ubuquitous Service Design , Peter Morville raised some interesting questions about how we might design for a world where everything is, or potentially can be -- smart. A world where your refrigerator knows what you had for lunch and when the lettuce will be out of date. A world where your car gives you suggestions for getting better gas mileage or tells you a better way to get where you're going. In a ubicomp (ubiquitous computing) world, what kinds of methods, and what kinds of tools, will designers use to think through a whole new set of design problems? The environment and the context of use become much more important. Devices and services become stakeholders in the process, communicating not only with users but with other products and processes over a complex and deeply intertwingled network. How will this change our approaches to design and change? How will it change our lives, our cities, and our social relationships? Peter and I are embarking on a new project we're calling Ubicomp Sketchbook to explore exactly these kinds of things. We hope you will enjoy the ride and also share your thoughts, sketches and ideas. We'll be using the hashtag #ubicompsketchbook for our explorations."], "link": "http://communicationnation.blogspot.com/feeds/1747836850263354234/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://semanticstudios.com/": 1, "http://en.wikipedia.org/": 2, "http://www.flickr.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["Nancy Duarte is the founder of Duarte Design, one of the world’s leading presentation design companies. She just published a new book on storytelling for presentations, called resonate: Present Visual Stories that Transform Audiences , which follows hot on the heels of her recent book slide:ology: The Art and Science of Creating Great Presentations , a critically-acclaimed book on presentation design. I recently had a chance to do a short interview with Nancy about her new book. Q: Your recent book on presentation design, Slide:ology, was a runaway hit. What made you decide to follow that up with a book about storytelling? A: When I wrote Slide:ology, I thought that the most pressing need in business communication was the visual display of information (slides). So I wrote Slide:ology which addresses that. Once I started to see the principles applied in organizations, the slides looked great but it was really the content that was a mess. Beautiful slides created to accompany disastrous content is like dressing up a pig. My new book Resonate deals with the pig. Slide:ology was easier for me to write. It was like capturing what my organization had done for 20 years. The material easily poured from my head. With Resonate, I needed to do more homework and research. Many books exist in business around story but not as applied to a presentation. So I studied literature, cinema and even rabbit-trailed around topics like psychology, philosophy and music. After many hours of study, a great book poured out—from my heart though, not my head.  Q: There’s an image in the book that resonated with me. It depicts a sailboat tacking into the wind, an image that represents the presenter’s challenge to move their ideas against the prevailing status quo. What’s the story behind this image? Can you remember how you came up with the idea? A: It’s funny you’d ask that because I got emotionally attached to the concept myself. Presentations are persuasive which means you’re trying to move an audience from one place to the next. I wanted to find a metaphor that moves back-and-forth like the presentation form sparkline does yet propels forward. Sailing was the most obvious metaphor. When I first developed the presentation form I’d sketched the shape zig-zagged (and that’s where I came up with the idea) instead of pumpkin-toothed as it is today: I’d always envisioned the sparkline as moving back and forth as a zig zag but it was confusing so I changed the sparkline to pumpkin-tooth shaped, so the sailboat had to be used for a different metaphor. One of the guys on my content team tied in the concept of wind resistance as a parallel for audience resistance. Interestingly, when a sailboat is sailing against the wind, if the sails are set correctly to capture the wind resistance, a physics phenomenon happens and the boat can sail faster than the wind itself. That can happen with a presentation. Insert the ways your audience might resist and you’ll get them to adopt your side quicker.  Q: You describe the book as, at least in part, a research project. What process did you follow when writing the book? How did it work for you? Would you do it the same way next time? A: My office was a mess while I worked on this book. I had books and printouts scattered all over the floor and every surface of my office. Plus I had hundreds of pages taped up on the walls. I was very mad-professor-like (see video below): Because the book covers fundamental literature principles, I felt like I needed to study many topics deeply to make sure it was accurate and to avoid it getting challenged by communication professionals who’ve studied speeches for years. So I wanted to dig very deep on each into the subject matter to make sure I covered all my bases which took a ton of time. Honestly, it feels like a huge doctoral project. I used a lot of paper during this process, unfortunately. I’m very tactile and wrote and highlighted on paper. As I studied and read, various themes started to surface. I would binder-clip packets of my research together by topic and make a cover page of bright blue paper:  I built the first pass of the outline in PowerPoint. Each spread of the book has one title (message) and supporting text and graphics. Similar to a slide. So I print and re-print my deck. Posted, rearranged and re-posted it on my wall until the structure was sound. It was just like how we used 3x5 cards to write papers in college. I enjoyed my creative process. Many people thought it looked chaotic but I had a blast. I would definitely use the same creative process. Q: You talk a lot about the presenter as mentor, like Yoda or Mr. Miyagi from the Karate Kid, the “guide on the side” who helps audiences come to conclusions on their own. Yet presenters often are expected to take the role of “sage on the stage,” the center of attention. It’s hard to picture Yoda or Mr. Miyagi on stage giving a dramatic presentation. How do you suggest that presenters can reconcile these two, seemingly contradictory, ideas? A: That’s a good insight, Dave. The reference to mentor doesn’t dictate that they are low energy and are boring on the stage. I’m trying to get presenters to take on a change in mindset and a new stance in their role. The audience determines whether your idea is successful and applied, so they are the hero of your idea. The role of the mentor in movies and mythology is to bring a magical gift, tool or ability to get the hero unstuck. When was the last time you sat through a presentation and felt you received any of that? Besides, if Yoda needed to deliver a formal presentation he would be awe-inspiring I’m sure. Q: You spend a lot of time talking about using sticky notes to map out presentations. Why do you think this is important? A: Sticky notes work great for generating ideas, filtering them down and then arranging and rearranging them until the concept and structure are sound. Great structure plays a critical role in how digestible and insightful your findings are.  Q: Design geek question: Both Slide:ology and Resonate are large-format books packed with full-color images. And they’re square in shape! You don’t see square books very often. What made you choose this particular design for your books? A: I envisioned both my books as reference books that people would want to lay open on their desk. Traditional 5x7 books don’t lay flat like that. Since I work in presentations all day, the open spread of the square books feels more similar to a slide-format and I’m stuck in a groove of writing one complete thought per page. The down-side of the wider format is that airport bookstores are hesitant to carry the book because it takes up too much shelf space. Bummer. Q: Has your book-writing journey resulted in any learning that changed the way you approach your work? If so, what did you learn and how has it changed your work? A: If you had told me three years ago that I would write books and enjoy it, I would laughed and called you crazy. Getting a book done (especially a visual book) takes determination and commitment. So it takes a fire in your belly and daily (and nightly and weekendly) discipline to complete a book. I discovered a few things about myself along the way. I found my writing sweet-spot. I always thought I was a night person, but come to find out I get my best work done between 5 a.m. and noon. Now I block every morning to get my brain-work done. In addition to a new way of working, I also discovered that I’m a systems thinker. I get pretty energized when I find patterns and connections that no one has seen before. Q: If there’s one thing you hope people will take away from Resonate, what would that be? A: I think that everyone is capable of changing the world (maybe not the entire world but at least their own world). Some of the greatest ideas have remained concealed because someone wasn’t brave enough or committed enough to communicate it well. I’m hoping that Resonate gives them a new mindset and guidance to communicate their ideas well so they’re adopted and make the world a better place. If you want to buy either book I've made handy links for you right here. Highly recommended!  If you would like to see more interviews like this please leave a comment and let me know. Thanks!"], "link": "http://communicationnation.blogspot.com/feeds/7365976067404655593/comments/default", "bloglinks": {}, "links": {"http://www.amazon.com/": 2, "http://www.flickr.com/": 5}, "blogtitle": "Communication Nation"}, {"content": ["Here's a sneak peek at my upcoming workshop \"Visual Thinking for User Experience\" which I'll be giving at UI15 (Boston, Nov. 8-10). Description: New workshop on effectively communicating design ideas Wireframes don’t help us with the Why, only the What of our designs. Dave’s simple sketching techniques are powerful tools for communicating your design's rationale. You’ll learn solid strategies for visualizing your ideas, which will help you identify issues while creating great new experiences. I hope you like it! If it sparks any thoughts please leave a comment."], "link": "http://communicationnation.blogspot.com/feeds/5665922160265146464/comments/default", "bloglinks": {}, "links": {"http://www.uie.com/": 1}, "blogtitle": "Communication Nation"}, {"content": [], "link": "http://communicationnation.blogspot.com/feeds/7011729279117007120/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Communication Nation"}, {"content": ["I have a big announcement to make today. Effective this morning, XPLANE is joining the Dachis Group , the world’s leading social business consultancy, as a wholly-owned subsidiary. I want to take a moment to share what this means for XPLANE and our customers, and why I am excited about it. Initially, the only change employees and customers will notice is the Dachis Group logo on our home page. XPLANE will continue to serve customers just as we have for the past 15 years. If you’re a customer, partner or employee, you probably won’t notice any differences at first. But joining the Dachis Group is a strategic move for our company and for our customers. Here’s why I am excited about it: First, Dachis Group is backed by Austin Ventures to the tune of $50 million . This gives us the financial ability to scale so we can serve a growing and global customer base. The combined Dachis Group now has over 100 employees, with offices in seven cities and five countries. Second, the Dachis Group is scooping up the best and brightest teams in social technology. Recent acquisitions include Hinchcliffe & Company , headed by Enterprise 2.0 guru Dion Hinchcliffe ; Headshift , a social-business technology and strategy consultancy; and the 2.0 Adoption Council , a peer group of managers in large enterprises that are pioneering the adoption of Web 2.0 technologies and practices. Third, the Dachis vision for Social Business Design is a sound and compelling one. They understand that social business is a fundamental shift not only in technology but in society and the fundamental ways that we do our work. Their vision for business transformation involves all aspects of business, from employees to partners to customers, from organizational culture to business systems to technology. Fourth, CEO Jeff Dachis has a proven track record growing best-of breed internet consultancies. As co-founder of Razorfish , he grew that company into a global firm which successfully navigated the dot-bomb crisis and eventually its parent company sold to Microsoft for $6 billion. Now owned by Publicis, Razorfish is one of the world’s largest interactive agencies, with more than 2,000 employees and offices all over the world. As a part of the Dachis group, XPLANE will be better financed and more strategically positioned than we have been in the past, so we’ll be able to grow faster and serve our customers better. This move is also strategic for our offerings: As a visual thinking company, XPLANE has the ability to help our customers transform their businesses. Our customers will attest to that. Like any technology, visual thinking, and the clarity it provides, can accelerate growth and offer strategic advantage. But visual thinking, although powerful, is less imperative than social business. For the last 15 years, the biggest thing that businesses needed to figure out was how to transition onto the web and into an internet economy. This was a disruptive change, a huge shift. Many companies perished and many fortunes were made. The risks and rewards were, and will continue to be, great. In the next 15 years, the most significant change that business will undertake is the transition to social technologies. In ten years you’ll be a social business, or you’ll be out of business. Why do I say that? It's pretty simple. All you need to do is ask yourself one question: Is word-of-mouth important to your business success? If so, you need to begin the transformation to being a social business. There are a few things I can say confidently; things in business we can be certain about: Business success has always relied heavily on social networks and networking. Always has, always will. If you are early to recognize the potential of new technologies and build them into your business, you will gain competitive advantage and potentially claim new markets . The core of social technologies is that they make word-of-mouth conversations tangible, sharable and trackable. Do you think this kind of technology might drive real business results? I do. Word-of-mouth is the most trusted source of information, wisdom, references and referrals. You can’t opt out of social business, any more than you could opt out of the internet. You are part of the word-of-mouth conversation whether you participate or not. This means the transition to social is imperative.  New technologies bring change and disrupt markets. The more transformational the technology, the more massive the change and disruption. And social media has transformed life as we know it. Facebook has more users than the USA has people, and it’s growing at a rate of more than half a million people per day. We have seen over and over that when it comes to disruptive technologies, the initial trends are set by individuals and small teams, and are later adopted by the bigger companies. Microcomputers, blogs, email, file-sharing, web services and voice-over-IP were all pioneered by small teams. Today, Twitter and Facebook are setting the trends. Individuals and small teams are using these tools now, and the corporate world is certain to follow. But adoption of new technologies is not simple or easy, and the bigger the enterprise the harder it gets. Here are a few of the opportunities and threats you will have to navigate if you want to socially calibrate your business: Customer service Opportunity: If you’re a social business, you will respond faster to customer issues and thereby improve your customer relationships. You’ll have better product and service quality because you’ll have better feedback loops. You will simply understand your customers better. Threat: If you opt out of social business, your competition will know more about your customer’s complaints than you do. They will swoop in and steal your customers before you know what hit you. They’ll be in a position to steer the all-important word-of-mouth conversation away from you and toward themselves. You’ll respond to customer concerns too slowly or too late. Public relations Opportunity: You’ll be continuously aware of the word-of-mouth conversation and how it affects you. Your social channels will serve as an early-warning system, enabling you to be more proactive and put out more fires before they start. Threat: You’ll be surprised by a new trend because you’re not monitoring the social sphere. By the time you notice a PR fire it’ll be raging out of control and you’ll be operating in crisis mode. Markets and marketing Opportunity: You’ll be tracking the trend-setters and influencers and you’ll know how their ideas spread through the social network. You’ll know who generates recommendations and referrals – who drives the real growth in emerging markets – and you’ll know how they do it. Threat: You’ll watch competitors or new entrants steal away your customers, and by the time you figure out what’s going on it’ll be too late. Intellectual capital Opportunity: Finally there’s a way to deliver on the promise of knowledge management – a way to capture the wisdom, ideas and genius of your employees – the information that’s contained in the heads of the people who walk out the door every day. I’m talking about the information that makes your business effective, even though it’s not written down in any book, manual or report. If you opt in to social business you’ll know who the experts are, and their peers will know how to find them and tap their expertise. You’ll know how information really flows through your organization – not the fiction of the org chart but the real social network that keeps things going. You’ll be able to cut meeting time in half by sharing routine information more effectively. Threat: Your best and most brilliant employees will walk out the door and you won’t even know the value that you are losing. They will want to further their careers, so they’ll head for a more networked company where they can be more effective. Is social media a fad? I’ll let this video answer that question: Social business is like the internet or any other disruptive technology. The question isn't whether to do it or not: the question is whether you're going to be early or late. We decided to be early, and there's no turning back."], "link": "http://communicationnation.blogspot.com/feeds/7528182215819234790/comments/default", "bloglinks": {}, "links": {"http://www.dachisgroup.com/": 4, "http://www.headshift.com/": 1, "http://www.xplane.com/": 1, "http://www.austinventures.com/": 1, "http://hinchcliffeandcompany.com/": 1, "http://www.20adoptioncouncil.com/": 1, "http://farm2.flickr.com/": 1, "http://blog.nielsen.com/": 1, "http://blogs.zdnet.com/": 1, "http://www.razorfish.com/": 1}, "blogtitle": "Communication Nation"}, {"content": ["Dave Gray-Knowledge Games: A Grammar for Creativity and Innovation from Interaction Design Association on Vimeo ."], "link": "http://communicationnation.blogspot.com/feeds/18906608467387663/comments/default", "bloglinks": {}, "links": {"http://vimeo.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["The design philosophy of the AK-47 , originally uploaded by dgray_xplane . In a recent roundup of thoughts from the Interaction 10 conference , Jan-Cristoph Zoels wrote: \"Unfortunately [Dave Gray] illustrated his engaging talk with a glorification of the AK47 as a ‘powerful tool of change’. His agnostic design philosophy hides an ethical ambivalence and repositions designers as hired hands of industry who do whatever is needed – even weapons of mass destruction. Can’t we find ethical examples which enable people, but don’t kill?\" Jan missed the point of my AK-47 example. There's nothing agnostic about my design philosophy -- a philosophy I share with Mikhail Kalashnikov, the designer of the AK-47. The design philosophy is this: Don't design for a perfect world, because the world isn't perfect. Design simple things that are rugged, reliable, simple and easy to use; things that work even when conditions are chaotic; things that work even when they are mostly broken. The AK-47 is a successful weapon because it was designed to work when the world is falling apart around you. When an AK-47 is wet, when it is clogged with mud, sand or snow, it will still work, in conditions where many more precise and accurate weapons will fail. That's not an agnostic design philosophy, it's a philosophy that is deeply rooted in fundamentals. It's a philosophy that requires a designer to prize simplicity and exhibit strength of purpose; that emphasizes ease-of-use and reliability over feature-richness and perfection. Now, we can also argue about ethical ambivalence -- whether it's ethical to design a weapon. This is an age-old and probably unresolvable argument. The intent of my talk was to demonstrate the design philosophy in a memorable and dramatic way by telling the true story of one designer. Mikhail Kalashnikov designed the AK-47 because his homeland had been invaded by an enemy with superior weapons. He wasn't a \"hired hand of an industry, doing whatever was needed.\" He was a tank mechanic who saw fellow soldiers and civilians gunned down and wanted to ensure that it would never happen again. If Kalashnikov had lived in the west he would be a rich man today (Yes, he’s still alive, about 90 years old). But he grew up in a communist state, so he’s now a national hero who lives on a government pension. Mikhail Kalashnikov is on record as saying that he would have preferred to have designed something more useful, for example, a lawn mower. But his country was invaded, he was severely wounded and in his hospital bed, his thoughts turned to weaponry. Can we really blame him? It's hard to see him as a profit-seeker or a \"hired hand of industry.\" He designed a weapon with the intention of repelling invaders, and in fact the AK-47 has to be seen as one of the most successful weapons of all time in this regard. Since he designed it in 1947, Kalashnikov’s weapon has enabled other people to defend their homelands from invaders, even superpowers: It helped the Vietcong drive American troops out of Vietnam, and it helped the Mujahideen drive the Soviet Union out of Afghanistan. Are there other examples I could have used to make my point? I am sure there are. But as a person who has spoken at many conferences, and also as a person who has sat through many polite-but-boring talks, I choose to make my points as dramatically, engagingly and entertainingly as possible. As a history buff, the story of Mikhail Kalashnikov captivated me, and I was sure it would do the same for others if I could tell it compellingly. When I want to make an important point, I do it with drama, because that’s what people remember. There’s a reason that war movies are more popular than design documentaries. I would rather stir up a bit of controversy than subject an audience to slow, agonizing death with PowerPoint bullet points. And if you are speaking and I am in the audience, I hope you will do the same for me."], "link": "http://communicationnation.blogspot.com/feeds/3111663170731741245/comments/default", "bloglinks": {}, "links": {"http://www.experientia.com/blog": 1, "http://www.experientia.com/": 1, "http://www.flickr.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["I got these questions in an email interview by Garrick Gibson recently, and, since I get asked these things fairly often, I thought I would post my answers here. 1) What do you value most about what you are doing in your profession? 2) Name 3 of the most important actions taken to start your business? 3) How much of your personal values played a role in starting and operating your business? How do these values show up in your business? Here are the answers I gave Garrick: Q: What do you value most about what you are doing in your profession? I love that I can walk into a chaotic situation and help people make sense of it so they can make better decisions. It makes me feel useful and appreciated when people recognize and reward that. Q: Name 3 of the most important actions taken to start your business? 1. When I quit smoking it made me realize that I could do anything when I set my mind to it, no matter how difficult it might seem. So, strange as it may sound, the first and most important step was quitting smoking -- it had nothing to do with business and everything to do with building my confidence. 2. Quitting my journalism job to take a much lower-paying job as a university professor. The importance of that step was that I was walking into a position with a definite end point. The position was a one-year contract, renewable up to a maximum of three years, so just as if I were an elected official, my job had a term limit. This set the clock ticking. It gave me a deadline, so to speak. 3. Expanding my world view. I felt strongly that to be successful in business I needed to understand all aspects, so I read voraciously about marketing, sales, strategy and finance. I also asked people who I deemed successful what drove their success. One of them once said to me \"Nothing happens till somebody sells something.\" I took that to heart. An understanding of sales was key to the success of my business. Turns out the biggest secrets of successful selling are great listening skills and an ability to turn understanding and empathy into action and results. These are great skills for anybody to learn, no matter what they plan to do. Q: How much of your personal values plays a role in starting & operating of your business? Personal values are huge. I believe that better clarity and understanding, in the long run, is better for the world. I feel that at XPLANE we are doing something good. Q: How do these values show up in your business? I felt strongly enough about company values that I worked with the team to create a culture map which we use to remain focused on who we want to be. You can see the culture map here . We use this map as a compass to guide our actions and decisions. It turns out to be most useful with the more difficult decisions, not because it gives the answers but because it helps us ask the right questions. Thanks Garrick, for asking the thoughtful questions that generated this post. thanks to you, reader, for reading it. I'd be very interested to hear how you would answer these questions. Please leave a comment and answer Garrick's three questions, or just tell us about your values. How do they motivate you in your business endeavors?"], "link": "http://communicationnation.blogspot.com/feeds/8005913966935772335/comments/default", "bloglinks": {}, "links": {"http://www.linkedin.com/": 1, "https://www.blogger.com/": 1, "http://communicationnation.blogspot.com/": 1}, "blogtitle": "Communication Nation"}, {"content": ["ExcerptOSSSabotageManual , originally uploaded by @bfchirpy . \t\t\t\t \tThanks @bfchirpy for this little gem. How many of us have engaged in one or another of these activities over the years, without thinking of the long-term damage we were causing to the health of an organization we probably joined voluntarily?"], "link": "http://communicationnation.blogspot.com/feeds/5932866194195224143/comments/default", "bloglinks": {}, "links": {"http://www.flickr.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["When you make the complicated simple, you make it better. But when you make the complex simple, you make it wrong.   Read more: how games can help your business engage meaningfully with complexity ."], "link": "http://communicationnation.blogspot.com/feeds/5020627309838990102/comments/default", "bloglinks": {}, "links": {"http://www.knowledgegames.net/": 1}, "blogtitle": "Communication Nation"}, {"content": ["Empathy map , originally uploaded by dgray_xplane . \t\t\t\t \tJust posted over on the Knowledge Games blog about Empathy mapping . Enjoy!"], "link": "http://communicationnation.blogspot.com/feeds/5826198258281220230/comments/default", "bloglinks": {}, "links": {"http://www.knowledgegames.net/": 1, "http://www.flickr.com/": 3, "http://knowledgegames.net": 1}, "blogtitle": "Communication Nation"}, {"content": ["Mr. Fixit , originally uploaded by dgray_xplane . \t\t\t\t \tReason is a dangerous, two-edged sword. It can be seen as Newtonian thinking in a quantum world; a cause-and-effect approach in a world that's more complex than that. In relation to that concept I'd like to make two points, one about humanity and the other about reason. First, humanity: The idea that we are somehow logical, rational or reasonable creatures is a broadly accepted one, yet under close examination it appears completely ridiculous. Yes we are capable of using reason as a tool, but more often than not we ignore what reason tells us and tend to favor other biases, especially cognitive biases. We forget that we are not designed for reason so much as propagation and survival. Take a look at classical game theory, which presupposes that people will act in their own rational self-interest. Turns out that predictions you make based on this assumption go radically wrong. We make decisions based on other factors such as fear, doubt, paranoia, desire, greed, even altruism. Any sales or marketing person can tell you as much from personal experience. The best products don't win: Coke failed the taste test and Microsoft isn't the best operating system. This is not a bad thing -- our non-rational decision-making processes tend to work very well and protect us from harm in a lot of cases. It's just that there are deep blind spots that may actually drive us to extinction, which I think is what concerns many of us. Now, reason: Reason is the best tool that we know of for overcoming our blind spots. I use the word tool for a reason here: A tool is something that's designed for a specific purpose and has certain ideas (about its use) built into it. A hammer sees everything as a nail, a saw wants to cut, etc. Reason, and the empirical method, can be seen as a set of tools based on a theory about the world: that everything is, or potentially can be, understood in rational terms. Yes, the current state of the tool is primitive when it comes to understanding complex relationships and ecosystems, but we are making progress. The quantum world, to make an example, was not discovered by mystics, it was discovered by physicists using empirical techniques. Complexity theory is making great strides toward understanding how nonlinear systems and complex interactions work. Brain science is advancing rapidly these days and helping us make similar strides toward understanding the fallibilities of our senses and cognitive functions. So let's not give up on reason. At the same time let's be sure to understand its limitations. Philosopher of Science Paul Feyerabend advocated a separation of science and state to parallel the separation of church and state. Science, he thought, has enough power, pride and hubris to rival any social structure, religion or philosophy that opposes it. I might not go so far but I do think we need to remember that reason and empiricism are tools, and like any tools, they have their limitations. Reason cannot tell the carpenter what to build or what not to build, or why. Science and technology may influence destiny but they cannot tell us who we are or where we need to go. They cannot shape a vision or offer moral guidance. Reason can't keep a family together or avoid conflict within a community. This gets to my main thesis here, which is that reason must be understood in context. I happen to like simple rules such as First do no harm. Seek to first to understand, then to be understood. Leave no trace. Do unto others as you would have them do unto you; and its corrollary: only if they want that! Etc. Reason is super-effective but also alien to many people who are following the powerful survival-cues of their biological brains, and one thing that seems to be true over time is that the simple memes like those above appeal to the intuitive common sense of the common mind. To be clear: I'm not arguing against reason but for better marketing of it! Can we package the idea of a rational world in simple terms? Can we employ the simplicity of Haiku for example? The great philosophical and religious leaders were able to convey their messages in short simple stories and sayings. Why not reason?"], "link": "http://communicationnation.blogspot.com/feeds/6772343446151572281/comments/default", "bloglinks": {}, "links": {"http://en.wikipedia.org/": 1, "http://www.flickr.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["Working on the workshop , originally uploaded by dgray_xplane .  I recently got an email from a teacher who wanted to know how she could help her students develop better presentations. I've been meaning to write down my method for awhile now and rather than write one email I thought I'd put it into a blog post. When I develop presentations I like to use index cards to sort through ideas. Sometimes I use a bottom-up approach, sorting and sifting through myriad ideas until the best ones float to the top. Other times I use a top-down approach, starting with the audience and their interests, and building a structure underneath that. More often it’s a combination of the two approaches – I start top-down, with an audience and what I think will interest them. Then I start to develop ideas, but those ideas lead to other ideas and soon I have too many thoughts, after which I need to do some bottom-up sifting to let the best ideas emerge. The image above is the sorting exercise I went through to develop a workshop I gave in Toronto in 2006. The approach borrows heavily from the card sorting method used in software design. TOP-DOWN APPROACH This is best when you know who you’re presenting to and what they want to know. If you don’t know where to start this is probably the best way to begin. 1. Start by thinking about your target audience and what they are interested in. It helps to imagine a real person that you know that fits the profile. 2. Now, brainstorm a list of questions that you think they might be likely to ask you about the topic in question. Write down one question per index card. 3. Now, try to sort the questions into a sequence that makes sense. Probably this means the most basic questions (such as “What is it?”) at the beginning, and the more action-oriented questions (Such as “how can I apply it?”) toward the end. Now you can look at the questions and see if they form a meaningful sequence that, say, introduces a topic, develops it, and reaches a conclusion. At this point you should have a sequence of cards running from left to right. 4. Now, under each question card, you can start to develop your “answer” cards – slides that will answer the question. BOTTOM-UP APPROACH This is best when you have a lot of ideas to sort through but don’t know how to weave them together yet. If you know what you want to talk about you might want to start here. 1. Write down as many ideas on a topic as you can – all the elements that might be useful as part of a presentation. Write down one thought or idea per index card. I often like to sketch on the card as well, thinking about how I might illustrate the concept. 2. Sort the cards into piles that represent ideas that “feel like they belong together.” 3. Name each pile and create a “title card” for each group. Each title card now represents a group of related ideas that might form a section of your presentation. 4. Now, try to arrange the title cards into a meaningful sequence – put the cards into a row. This forms the basis of the narrative thread. 5. Under each title card, you can now create a “column” of index cards with the ideas that form the main points for each section. 6. Now, identify gaps in the story, eliminate redundancies and irrelevant information, and go from there. As I said, usually I work with a hybrid of the two approaches. It’s much like a conversation, where one person’s thoughts influence the next person’s ideas. Moving back and forth between what the audience wants to hear (the “top”) and what I want to say (the “bottom”) helps me develop a synthesis that integrates my most valuable knowledge with what people are really interested in hearing. I’m very interested in hearing your thoughts on this approach, and I’d love to hear about your experiences using this or similar approaches in your work. So be a mensch and leave a comment !"], "link": "http://communicationnation.blogspot.com/feeds/8434881945732526580/comments/default", "bloglinks": {}, "links": {"https://www.blogger.com/": 1, "http://en.wikipedia.org/": 1, "http://www.flickr.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["Bitching about work means you like it the way it is , originally uploaded by dgray_xplane . \t\t\t\t \tIt sounds counterintuitive, but when you bitch about work you are only feeding the problems you talk about. Bitching about work is like scratching an itch -- it may make you feel better in the short run, but in the long term you are only making it worse. When you bitch about work you keep your issues and concerns in the dark, as far as your organization is concerned. You also feed negative feelings, divisiveness and cliquishness in your workplace, which makes the office unpleasant and generally brings everybody down. By raising your issues appropriately, in a public forum, you bring them to light, which allows them to be discussed and addressed. Even if you don't agree with the outcome, at least you have been heard and your opinion is known. There are two ways to solve a work situation you don't like: Change the situation or find another job. By bitching in private you're not doing anything to change the situation, and in addition you're making the workplace less fun for everybody. By making your concerns public you have a chance to address them, and even if you don't get what you want, you can make the decision to live with it or move to another job. The third alternative, staying in a job you hate, is like staying in an abusive relationship. It only reinforces negative behavior all around. Your relationship with your co-workers is like any other social relationship. It's not likely to ever be perfect, but focusing on the positive will generate more positive feelings and results, while focusing on the negative will only make things worse. So next time you have the urge to scratch that itch, don't tell yourself it's okay because you're \"only venting.\" Ask yourself if it's worth the damage you'll cause."], "link": "http://communicationnation.blogspot.com/feeds/5338356943825308683/comments/default", "bloglinks": {}, "links": {"http://www.flickr.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["Visual thinking , originally uploaded by dgray_xplane . People often ask me how to visualize information. They ask things like “How can I visualize my industry ecosystem?” or “How can I visualize how my product works.” My first instinct is to try and back them up a bit. This is because they are already defining their project in terms of an answer or solution, and before you can deliver an answer you need to know the question. Getting the question right is the most important component in information design, and it’s the most common point where information design goes wrong. This is because information is always relative. Always. Before you can undertake any kind of visualization exercise, you need to know what question you want to answer, and for whom. A look at the history of information will confirm this point. Science is a process by which we attempt to compare our perceptions with something we call “reality” but in fact reality is something we can never really know for sure. Like the flickering shadows on the wall of Plato’s cave, reality is something we can only see dimly, because it’s distorted by our perceptions and beliefs. Every observation and fact has a margin of error, which is directly related to the observer’s background, beliefs, culture and limitations. It is written in the Talmud, “We see things not as they are, but as we are.” 1 By beginning with an audience and a question you give yourself a focusing device. Like a flashlight, the audience and question will illuminate the information that’s relevant to your goal, while leaving the rest in the dark. Good information design is as much about what you leave out as what you put in. What to put in: Information that’s relevant to your target audience, and that answers a real question that they have. What to leave out: Everything else. The best rule of thumb is “When in doubt, leave it out.” So if you want to create a visual in order to explain something, ask yourself the following questions first: “Who am I explaining it to?” “What do I want them to do?” At XPLANE we call this the WHODO, and it’s a required input to any project we undertake. Once you understand the WHO (your audience) you will have a sense of their level of existing knowledge of the subject. For example if you are explaining scientific or technical information to engineers or scientists you can assume a high level of sophistication and readiness. Based on the cultural expectations in science and engineering fields, you can also assume a high level of skepticism and a need for evidence and proof. Explaining the same information to a group of executives, or salespeople, would be a completely different exercise. You can expect that they will have a different set of questions and probably will be more focused on practical applications and will get impatient with scientific or technical explanations. Thus, the same information will need to be presented very differently based on the audience that you are talking to. Understanding the audience is only part of the equation. The other half of the WHODO is DO. Before you can undertake any explanatory task you need to know what outcome you expect. Describing this as a change in understanding is not enough. Understanding is difficult to observe. People often will say they understand something just to get you out of their hair. People will also believe that they understand something when they don’t really understand it. Have you ever left a meeting where everyone seemed to be in agreement, yet their later actions made it clear that they didn’t agree after all? It’s common to see nodding heads in a room when people don’t agree – they think they agree but in reality they don’t. This is because when an explanation is sufficiently vague, people are free to believe what they want to believe. Politicians often use this rhetorical principle to great effect. Words like “freedom, justice and fairness” mean different things to different people. Vague explanations are common in business, and they can give the illusion of agreement. But they don’t get results. Here’s the key: When people understand things differently, they do things differently. What they say is less revelatory than what they do. So if you want to build a rock-solid explanation, focus on what you want people to do. If they understand what you are saying, what changes in behavior would you expect to see? Once you have defined your WHODO, next you need to anticipate the questions they will ask. This again will depend on your audience and the information they will need to make a decision. Part of this is also cultural. Scientists will want to see scientific evidence. They will want technical explanations and probably a lot of detailed analysis. Busy executives may want different kinds of proof, such as what customers are buying and what competitors are doing. They will also be less generous with their time and expect you to get quickly to the point. But you don’t have to go in cold. If you understand the mind of your audience, you will be able to generate a list of questions that they are likely to ask. Once you have defined your WHODO and generated a list of questions, you can start thinking about how to visualize the information. Will they need a broad overview or detailed charts and specifications? Will they need to see the value to the customer, or the technical operational details? In the fields of information science and knowledge management there is a model known as the Data Information Knowledge Wisdom Hierarchy, or DIKW for short. This has become a standard for defining the terms and how they relate to each other. 2 Here’s how defines the hierarchy: Data has no particular significance beyond representation. It consists of symbols that stand for objects, events or their properties. Data is a collection of facts 3 – also called “know-nothing” 4 to reinforce the point that data, by itself is dumb; it has no meaning. Information is data that has been organized so that it is useful, usually because of relational connections – also called “know-what.” Information answers questions like who, what, where, when and how many. Knowledge is information that has been integrated into the mind, memory and body, such that it can be applied to doing and making things, also called “know-how.” Knowledge is usually acquired through experience, or through stories about other people’s experiences. Wisdom is the ability to perceive value, make judgments, and evaluate long-term consequences. Russell Ackoff describes the difference between knowledge and wisdom as the difference between doing things right and doing the right thing. Wisdom requires values, and values are perhaps the most relative thing of all. So I propose the beginnings of a theory of information relativity: 1. All information is relative, and it’s always relative: relative to the observer and the observer’s point of view; relative to the culture and its values; relative to the situation; relative to what has come before, and to what will come next. 2. The value of information is always relative because it is directly related to it’s usefulness, which depends on the user, the context and the situation. 3. Information design must therefore be driven by the context within which it will be experienced. Information design must serve the needs of real human beings doing real things. Information wants to be used. At its heart, information design is about change. It’s about increasing the amount of useful information in the world. Good information design should result in changes to understanding – increases in knowledge and wisdom – which can be directly measured by observable changes in human behavior. Notes: 1. Also attributed to John Milton, H.M. Tomlinson, Anais Nin and others. 2. Harlan Cleveland first wrote about the DIKW hierarchy in a December, 1982 article “Information as Resource” in The Futurist, citing inspiration from the following lines written by T.S. Eliot: Where is the Life we have lost in living? Where is the wisdom we have lost in knowledge? Where is the knowledge we have lost in information? ~T.S. Eliot, The Rock, 1934 3. Even the things we think of as facts are relative to the observer and a particular point of view. The problem of facts is as old as science itself and is still unresolved. See “Free the Facts” by Dave Gray, 2009. 4. Milan Zeleny, “Management Support Systems: Toward Integrated Knowledge Management,” Human Systems Management 7, no 1, 1987."], "link": "http://communicationnation.blogspot.com/feeds/3350392453705723317/comments/default", "bloglinks": {}, "links": {"http://www.flickr.com/": 3}, "blogtitle": "Communication Nation"}, {"content": ["Yuri Engelhardt's notebook , originally uploaded by dgray_xplane .  Yuri Engelhardt's notes, taken when he was working on The Language of Graphics . Click here for a closer look."], "link": "http://communicationnation.blogspot.com/feeds/123428384172663856/comments/default", "bloglinks": {}, "links": {"http://www.nijhoflee.nl/": 1, "http://www.flickr.com/": 4}, "blogtitle": "Communication Nation"}]