[{"blogurl": "http://to-cs.blog.sohu.com\n", "blogroll": [], "title": "Compressive Sensing：一缕清风"}, {"content": ["Today, Post the updated Igor's blog. \n  \n  As following: \n  \n  \n  \n CS: Matrix Completion via Thresholding, Dick Gordon's Op-Ed, Lianlin Li's Open Question on Compressible Priors Posted: 18 Jan 2010 10:01 PM PST \n Angshul Majumdar just released some new code on Matrix Completion via Thresholding at Matlab Central. From the presentation \n Contains three matrix completion algorithms and a demo script for running them. Also compares against other matrix completion algorithms - Singular Value Thresholding and Fixed Point Iteration. Solves the following three optimization problems: \n min rank(X) subject to ||y - M(X)||_2 \\lt via Iterated Hard Thresholding \n min nuclear-norm(X) subject to ||y - M(X)||_2 \\lt via Iterated Soft Thresholding \n min ||S||_p subject to ||y - M(X)||_2 \\lt err, where S = svd(X) via Iterated Soft Thresholding \n Requires Sparco since the masking operator has been defined in according to the Sparco framework. \n http://www.cs.ubc.ca/labs/scl/sparco/ \n The algorithms are general enough to work with any other linear operator, and not only the masking operator. The masking operator is just a special case when the problem boils down to one of matrix completion. For comparing the results with other algorithms download the Singular Value Thresholding toolbox http://svt.caltech.edu/ \n \n Thanks Angshul ! \n Dick Gordon, one of the first to develop ART for CT tomography just sent me the following (a follow up to a previous entry). I am reprinting it as is (except for some edit on the form and hyperlinks) \n \n How to get CT out of its high dose rut: CS for CT x-ray dose reduction is a political issue \n \n \n The article: \n Pan, X., E.Y. Sidky & M. Vannier (2009). Why do commercial CT scanners still employ traditional, filtered back-projection for image reconstruction? Inverse Problems 25, 36p. #123009. \n places the blame for what Igor Carron calls “the inability of ART to topple FBP“ on the theoreticians and the manufacturers, somehow expecting the latter’s engineers, stuck in the middle, to overcome a number of sociological problems. These are scattered through the paper, so I pull them together here: \n “...it makes little sense to spend endless time and effort refining an inversion formula for an idealized imaging model when there are some compromising factors earlier in the data-flow chain....” \n “Most of the research devoted to image reconstruction aims at developing new solutions to solving imaging model problems. The idea being that the imaging model problems evolve toward realistic situations and that this theory eventually finds its way into application. We submit that this style of research is not effective for translation based simply on the empirical evidence that not much of the work published in Inverse Problems over the past couple of decades is actually used in a CT scanner.“ \n “The bulk of the applied-mathematics research effort seems to go toward developing advanced techniques that will likely never be used in practice or address problems that have little application.“ \n “And presently users of CT are used to some of the streak artifacts in FBP-based reconstructions, and there is not really a huge motivation of exchanging FBP streaks for some other type of artifact.“ \n “Parameter explosion is one of the challenges that face optimization-based algorithms for image reconstruction in commercial products.“ \n “The real progress in moving past FBP-based reconstruction will occur when engineers have real experience with advanced image-reconstruction algorithms and can use this knowledge to design more efficient and effective CT scanners. This development will likely occur first in dedicated CT systems such as head/neck CT, dental CT and breast CT.“ \n “Among the main reasons for slow progress on introduction of algorithmic innovations into clinical CT scanners may also be the proprietary nature of CT technologies and the subjective evaluation of performance by its users.“ \n “The door to innovation in CT algorithms requires an efficient and practical route to develop and test new algorithms. It is unlikely that any investigator, mathematician or engineer could effectively correct for the raw detector measurements from the CT scanner into a form suitable for algorithm testing without the manufacturer’s blessing and assistance. However, manufacturers of CT scanners, in general, have not made the raw projection data available to anyone outside their organizations, even to customers that use their CT scanners.“ \n “There is no Digital Image COMmunication (DICOM) standard for CT raw data [86, 87]. In fact, there are no standards at all. Corrected raw projection-data sets are almost impossible to find in the public domain. Without this data, clinically realistic examples of images cannot be reconstructed. As a consequence, CT-algorithm developers almost universally use highly idealized numerical phantoms for their work and seldom show results obtained with ‘real’ experimental or clinical data. This is surely a major impediment to progress.“ \n “If the system was ‘open’ and could be refined by algorithm developers in the field, such algorithms could be tested and clinically validated. The benefits of new technology, especially in image-reconstruction algorithms, could reach patients without waiting for their possible inclusion in future generations of CT scanners (because this has not happened for the past 25 years and may not in the near future).“ \n “Perhaps the need for an open-source-community-developed CTreconstruction toolkit (CTK) with a database of corrected raw projection data from real CT scanners will be recognized.“ \n I have been asking clinicians on and off for 40 years to put “open access” into their purchasing contracts with CT companies. But for most of them the role of the CT algorithm is invisible, and as is generally true in medicine and biology, the role of the theoretician is simply not recognized, let alone paid a salary or listened to. So how to break this impasse? \n I have a simple proposal: CS (Compressive Sampling) people need to demonstrate to politicians concerned with x-ray dose that they can get the dose down by an order of magnitude or more. This, I think, is the answer to Igor Carron’s analysis:”Therefore a CS system would have to provide something else“. The politicians will then, in effect, legislate a role for CS people in CT design. The companies won’t do it themselves. Nor will their customers, the radiologists. It won’t happen in breast CT, because everyone will just use the dose ceiling already established in projection mammography. \n The only radiologist that I know of who vigorously lectures other radiologists on the need for dose reduction in CT is David A. Leswick of the University of Saskatchewan. His papers are a little less fiery: \n Leswick, D.A., N.S. Syed, C.S. Dumaine, H.J. Lim & D.A. Fladeland (2009). Radiation dose from diagnostic computed tomography in Saskatchewan. Can Assoc Radiol J 60(2), 71-78. \n Leswick, D.A., C.S. Dumaine, N.S. Syed & D.A. Fladeland (2009). Computed tomography radiation dose: a primer for administrators. Healthcare Quarterly 12(Special Issue), 15-22. \n Nevertheless, the latter starts: \n “The use of computed tomography (CT) is growing, and, consequently, the associated radiation dose to patients is increasing as well. There is increasing evidence linking the radiation dose within the range of diagnostic CT with a significantly increased risk of malignancy. These two factors combine to make radiation dose from diagnostic CT a public health concern.” \n Yours, -Dick Gordon gordonr@cc.umanitoba.ca \n Thanks Dick, I agree with you that in the context of CT, maybe, the political whip is the only constraint that can force a dose reduction and opens the dor to more efficient algorithm like ART or other nonlinear reconstruction techniques introduced with compressive sensing. \n Lianlin Li mentioned this to me last week and he just wrote about this on his blog. Lianlin is particularly confused with three papers that seem to contradict each other on the subject of compressible priors for sparse bayesian estimation. The papers are: [1]M.E. Tipping. Sparse Bayesian learning and the relevance vector machine. The Journal of Machine Learning Research, 1, 211–244, 2001. [2] David Wipf, Jason Palmer, and Bhaskar Rao. Perspectives on sparse Bayesian learning, Advances in Neural Information Processing Systems, 16, 2003 [3] Volkan Cevher. Learning with compressible Priors, Preprint, 2009. The slides in the blog entry are in English. The introduction is in Chinese but it is not relevant to the confusion at hand. If you want to clear up the misunderstanding between the papers as presented by Lianlin and feel you cannot comment in the blog with instructions in Chinese then you are welcome to put a comment here and I could make an entry of all y'alls responses. \n Thanks Lianlin for following up on this."], "link": "http://to-cs.blog.sohu.com/142722831.html", "bloglinks": {}, "links": {}, "blogtitle": "Compressive Sensing：一缕清风"}, {"content": ["一直以来，一直为“compressive sensing何去何从”这个问题感到困惑。据压缩感知理论和方法的提出一直到现在，当初的欣欣向荣，遗憾的是，其冷其暖，只有从事压缩感知的人自知。正如我当初所疑惑的，“压缩感知是一团火，还仅仅是团烟？”尽管如此，由压缩感知所诞生的对各种优化策略是极其珍贵的财富；另外，线形问题的重新审视也将是压缩感知的一大功劳；或许最重要的是，在一定程度上，压缩感知促进了数学理论和工程应用领域在一定程度上的融合。 \n \n 记得一位朋友托我写一点压缩感知方法的东西，由于时间比较紧张，到现在为止没能完成。不过，贴下面若干ppt，这ppt上列出了我认为目前文献对compressible prior理解的相互矛盾的解释，希望能够对这个问题作进一步的探讨。希望这点东西对这位朋友有所帮助。 \n \n \n \n \n \n \n \n \n \n \n \n 下面再贴Igor今天的内容 \n This week we have several papers looking at what can be detected in the measurement world before performing any type of reconstruction, enjoy: \n Compressed-Sensing MRI with Random Encoding by Justin Haldar, Diego Hernando, Zhi-Pei Liang. The abstract reads: Compressed sensing (CS) has the potential to reduce MR data acquisition time. There are two fundamental tenets to CS theory: (1) the signal of interest is sparse or compressible in a known representation, and (2) the measurement scheme has good mathematical properties (e.g., restricted isometry or incoherence properties) with respect to this representation. While MR images are often compressible, the second requirement is often only weakly satisfied with respect to commonly used Fourier encoding schemes. This paper investigates the possibility of improving CS-MRI performance using random encoding, in an effort to emulate the \"universal'' encoding schemes suggested by the theoretical CS literature. This random encoding is achieved experimentally with tailored spatially-selective RF pulses. Simulation and experimental results show that the proposed encoding scheme has different characteristics than more conventional Fourier-based schemes, and could prove useful in certain contexts. Hyperspectral target detection from incoherent projections by Kalyani Krishnamurthy, Maxim Raginsky and Rebecca Willett. The abstract reads: \n This paper studies the detection of spectral targets corrupted by a colored Gaussian background from noisy, incoherent projection measurements. Unlike many detection methods designed for incoherent projections, the proposed approach a) is computationally efficient, b) allows for spectral backgrounds behind potential targets, and c) yields theoretical guarantees on detector performance. In particular, the theoretical performance bounds highlight fundamental tradeoffs among the number of measurements collected, the spectral resolution of targets, the amount of background signal present, signal-tonoise ratio, and the similarity between potential targets in a dictionary. Compressive sensing and differential image motion estimation by Nathan Jacobs, Stephen Schuh, and Robert Pless. The abstract reads: Compressive-sensing cameras are an important new class of sensors that have different design constraints than standard cameras. Surprisingly, little work has explored the relationship between compressive-sensing measurements and differential image motion. We show that, given modest constraints on the measurements and image motions, we can omit the computationally expensive compressive-sensing reconstruction step and obtain more accurate motion estimates with significantly less computation time. We also formulate a compressive-sensing reconstruction problem that incorporates known image motion and show that this method outperforms the state-of-the-art in compressive-sensing video reconstruction. On unusual pixel shapes and image motion by Nathan Jacobs, Stephen Schuh, and Robert Pless.The abstract reads: We introduce the integral-pixel camera model, where measurements integrate over large and potentially overlapping parts of the visual field. This models a wide variety of novel camera designs, including omnidirectional cameras, compressive sensing cameras, and novel programmable-pixel imaging chips. We explore the relationship of integral-pixel measurements with image motion and find (a) that direct motion estimation using integral-pixels is possible and in some cases quite good, (b) standard compressive-sensing reconstructions are not good for estimating motion, and (c) when we design image reconstruction algorithms that explicitly reason about image motion, they outperform standard compressive-sensing video reconstruction. We show experimental results for a variety of simulated cases, and have preliminary results showing a prototype camera with integral-pixels whose design makes direct motion estimation possible. Sampling Piecewise Sinusoidal Signals with Finite Rate of Innovation Methods by Jesse Berent,P.L. Dragotti and Thierry Blu. The abstract reads: We consider the problem of sampling piecewise sinusoidal signals. Classical sampling theory does not enable perfect reconstruction of such signals since they are not bandlimited. However, they can be characterized by a finite number of parameters namely the frequency, amplitude and phase of the sinusoids and the location of the discontinuities. In this paper, we show that under certain hypotheses on the sampling kernel, it is possible to perfectly recover the parameters that define the piecewise sinusoidal signal from its sampled version. In particular, we show that, at least theoretically, it is possible to recover piecewise sine waves with arbitrarily high frequencies and arbitrarily close switching points. Extensions of the method are also presented such as the recovery of combinations of piecewise sine waves and polynomials. Finally, we study the effect of noise and present a robust reconstruction algorithm that is stable down to SNR levels of 7 [dB]. Information Theoretic Bounds for Low-Rank Matrix Completion by Sriram Vishwanath. The abstract reads: This paper studies the low-rank matrix completion problem from an information theoretic perspective. The completion problem is rephrased as a communication problem of an (uncoded) low-rank matrix source over an erasure channel. The paper then uses achievability and converse arguments to present order-wise optimal bounds for the completion problem. \n \n And finally a presentation entitled Subsampling, Spectral Methods and Semidefinite Programming by Noureddine El Karoui, Alexandre dAspremont"], "link": "http://to-cs.blog.sohu.com/142625002.html", "bloglinks": {}, "links": {}, "blogtitle": "Compressive Sensing：一缕清风"}, {"content": ["时间过的真快，三个星期的长假转眼告一段落了。这次回国，见了好几个老朋友，久别重逢的感觉真好。 \n 由于学校还没有完全开学，找个营业的咖啡店还有点困难；尽管如此，在图书馆外和Igor聊了一大半个上午。由于国内无法登陆Igor的blog，且国内有不少的科研人员从事compressive sensing方面的工作，因此我向Igor提议，在我的这个blog连续转载Igor blog的内容，用以让国内相关研究人员及时了解compressive sensing及相关课题的研究动态。Thanks, Igor。 \n \n 下面就转载Igor blog近来的若干内容，具体如下； \n \n CS; CS in infinite dimensional space, Ditributed Bearing Estimation via matrix Completion, Optimal incorporation of sparsity information Posted: 13 Jan 2010 06:24 AM PST \n If you thought some of the techniques used to reconstruct signals took long, you've never tried \"infinite dimensional convex optimization\" :-). This is the subject of today's first paper: Compressive Sampling in Infinite Dimensions by Anders C. Hansen. The abstract reads; \n We generalize the theory of Compressive Sampling in Cn to infinite dimensional Hilbert spaces. The typical O(log(n)) estimates (where n is the dimension of the space) are manipulated to fit an infinite dimensional framework. \n Looking at the other interest of the author, I wonder aloud if there is a connection between the computation pseudospectra and the RIP/NullSpace conditons ? For more information on computing pseudospectra of rectangular matrices, one can check Eigenvalues and Pseudospectra of rectangular matrices by Thomas Wright and L. Nick Trefethen. You'd think there is a connection and that theorem 2 would help (since multiplying a matrix with a class of sparse vector is really about reducing the number of columns of that matrix). There is also a connection between DOA and pseudospectra and DOA has been the subject of several papers mentioned here before. \n Volkan Cevher let me know of a new paper Ditributed Bearing Estimation via matrix Completion by Andrew Waters and Volkan Cevher. The abstract reads: \n We consider bearing estimation of multiple narrow-band plane waves impinging on an array of sensors. For this problem, bearing estimation algorithms such as minimum variance distortionless response (MVDR), multiple signal classification, and maximum likelihood generally require the array covariance matrix as sufficient statistics. Interestingly, the rank of the array covariance matrix is approximately equal to the number of the sources, which is typically much smaller than the number of sensors in many practical scenarios. In these scenarios, the covariance matrix is low-rank and can be estimated via matrix completion from only a small subset of its entries. We propose a distributed matrix completion framework to drastically reduce the inter-sensor communication in a network while still achieving near-optimal bearing estimation accuracy. Using recent results in noisy matrix completion, we provide sampling bounds and show how the additive noise at the sensor observations affects the reconstruction performance. We demonstrate via simulations that our approach sports desirable tradeoffs between communication costs and bearing estimation accuracy. Finally, today's arxiv new addtion: Optimal incorporation of sparsity information by weighted $L_1$ optimization by Toshiyuki Tanaka and Jack Raymond. The abstract reads: \n Compressed sensing of sparse sources can be improved by incorporating prior knowledge of the source. In this paper we demonstrate a method for optimal selection of weights in weighted $L_1$ norm minimization for a noiseless reconstruction model, and show the improvements in compression that can be achieved.  \n \n \n \n CS: Graph-Constrained Group Testing Posted: 12 Jan 2010 05:56 AM PST Found today on Arxiv. Interesting finding (emphasis below is mine): \n Graph-Constrained Group Testing by Mahdi Cheraghchi, Amin Karbasi, Soheil Mohajer, Venkatesh Saligrama. The abstract reads: \n Non-adaptive group testing involves grouping arbitrary subsets of $n$ items into different pools. Each pool is then tested and defective items are identified. A fundamental question involves minimizing the number of pools required to identify at most $d$ defective items. Motivated by applications in network tomography, sensor networks and infection propagation we formulate group testing problems on graphs. Unlike conventional group testing problems each group here must conform to the constraints imposed by a graph. For instance, items can be associated with vertices and each pool is any set of nodes that must be path connected. In this paper we associate a test with a random walk. In this context conventional group testing corresponds to the special case of a complete graph on $n$ vertices. For interesting classes of graphs we arrive at a rather surprising result, namely, that the number of tests required to identify $d$ defective items is substantially similar to that required in conventional group testing problems, where no such constraints on pooling is imposed. Specifically, if T(n) corresponds to the mixing time of the graph $G$, we show that with $m=O(d^2 T^2(n) log(n/d))$ non-adaptive tests, one can identify the defective items. Consequently, for the Erdos-Renyi random graph $G(n,p)$, as well as expander graphs with constant spectral gap, it follows that $m=O(d^2 log^3(n))$ non-adaptive tests are sufficient to identify $d$ defective items. We next consider a specific scenario that arises in network tomography and show that $m=O(d^3 log^3(n))$ non-adaptive tests are sufficient to identify $d$ defective items. We also consider noisy counterparts of the graph constrained group testing problem and develop parallel results for these cases. \n \n \n CS: LSH, Photon Sieves, Fieldstream Posted: 09 Jan 2010 04:09 PM PST Sergey Ten asks the following question on Twitter: \n Are there connection between locality sensitive hashing and compressed sensing ? (RIP) \n My take is that one could use random projections to reduce a very high dimensional dataset onto some lower dimensional manifold and then probably use LSH to evaluate how these reduced data are connected to each other. Piotr Indyk on his LSH page makes a different case in the presentation entitled: Near-Optimal Hashing Algorithms for Approximate Near(est) Neighbor Problem, where the following slide appear: \n On a related item, Piotr also taught some course at Rice last year, the list of presentation can be found below: \n These are the lecture notes for a short course \"Streaming etc.\", given at Rice University in Spring'09. \n Introduction to streaming algorithms. Estimating the number of distinct elements and the L0 norm. \n Estimating the L2 norm. \n Estimating the Lp norms using p-stable distributions. \n Heavy hitters and sparse approximations. \n Compressive sensing. Sparse recovery using sparse matrices. RIP1 principle. State of the art table. \n Lower bounds for streaming and compressed sensing. \n Laurent Jacques mentioned to me the use of coded aperture to perform X-ray focusing. As you recall Gerry Skinner does not like coded aperture for imaging x-rays and this is the reason he is looking into Fresnel lenses for x-rays. As it turns out a way of providing additional focus for x-rays is by drilling holes in Fresnel lenses. \n Instead of just using Fresnel Zone plates, they drill a (random ?) distribution of points on them: \n Light passing a circular pinhole produces a diffraction pattern of concentric rings of decreasing width with increasing radius. If light is passed through a mask made up of the same pattern of rings a focus is formed. These Fresnel zone plates are used to focus soft X-rays where conventional optics fail because of strong absorption of all materials in this spectral region. \n The ultimate resolution of a Fresnel zone plate is determined by the width of the outermost zone. The focal spot is surrounded by rings of intensity (secondary maxima) that blur the images obtained in X-ray microscopy and scanning spectroscopy. \n These limitations can be overcome by using a large number of appropriately distributed pinholes instead of rings as the diffracting elements. To obtain a distinct first-order focus, the pinholes have to be positioned such that the optical path length from the source via the center of the pinholes to the focal point is an integral number of wavelengths. \n Furthermore, with photon sieves, the unwanted ring-like secondary maxima generated by zone plates can be suppressed. For a zone plate each ring contributes equally to the amplitude in the focus. This contribution drops abruptly to zero beyond the outermost ring which leads to strong intensity oscillations in the diffraction pattern. With a photon sieve the number of pinholes per ring can be readily adjusted to yield a smooth transition which minimizes the secondary maxima. \n Thanks Laurent. Finally, the Google webcrawler just found the following recently funded project: Fieldstream. The compressive sensing part is currently empty. They seem to be connected to the Urban sensing project at UCLA."], "link": "http://to-cs.blog.sohu.com/142295611.html", "bloglinks": {}, "links": {}, "blogtitle": "Compressive Sensing：一缕清风"}, {"content": ["我将在接下来的三个星期放假，趁今天没有放假，贴一些东西。 \n \n 首先转贴Igor博客的一些东西， \n （note，链接地址： http://www.ceremade.dauphine.fr/~peyre/mia09/ ） Some of the presentations of the MIA'09 meeting can be found below. I'll come back to the last post and some of these presentations later. \n [1]Some Remarks on Derivative Free Regularization by Otmar Scherzer [2]Some Recent Advances in Image Representation for image segmentation, object class detection and image classification by Frederic Jurie [3]Computational Information Geometry From Euclidean to flat Pythagorean geometries by Frank Nielsen [4]Computation is the New Optics by Frédo Durand joint work with Anat Levin, Bill Freeman, Peter Sand, Tim Cho, Ce Liu, Antonio Torralba, Ted Adelson, and others [5]Geometric Medians and Radar Target Detection by Guillaume Bouyt, Le Yang [6]Periodic + Smooth Image Decomposition by Lionel Moisan Hypercomplex mathematical morphology by Jesús Angulo [7]Multifractal stochastic processes to model images and textures by Pierre Chainais [8]Wavelet-Based Statistical Estimators. Application to image restoration by Caroline Chaux [9]Dictionary learning for sparse representations using L1 minimization by Rémi Gribonval, Karin Schnass Sparseness, invariance and independent coding in the visual system by David J. Field \n [10]Proximal Splitting Methods in Signal Recovery by Patrick Louis Combettes [11]Theory and algorithms for anisotropic finite elements with applications to images by Albert Cohen with Nira Dyn, Frederic Hecht and Jean-Marie Mirebeau. \n \n 今天上午仔细研究了一下Frank Nielsen的slids，很有意思。下面贴几张有意思的slids, \n   \n (NOTE,关于该poser，也可以参阅Matthias Seeger的博士论文Bayesian Gaussian Process Models: PAC-Bayesian Generalisation Error Bounds and Sparse Approximations。) \n \n 接下来贴R.G. Baraniuk, V. Cevher, M. B. Wakin的论文“Low-dimensional models for dimensionality reduction and signal recovery: a geometric perspective”，论文摘要， \n We compare and contrast from a geometric perspective a number of low-dimensional signal models that support stable information-preserving dimensionality reduction. We consider sparse and compressible signal models for deterministic and random signals, structured sparse and compressible signal models, point clouds, and manifold signal models. Each model has a particular geometrical structure that enables signal information to be stably preserved via a simple linear and nonadaptive projection to a much lower dimensional space; in each case the projection dimension is independent of the signal’s ambient dimension at best or grows logarithmically with it at worst. As a bonus, we point out a common misconception related to probabilistic compressible signal models, namely, by showing that the oft-used generalized Gaussian and Laplacian models do not support stable linear dimensionality reduction。 \n \n 该论文从“dimensionality reduction”的角度论述了若干种low dim signal models。其中关于low dim signal统计模型的论述，其结论与Tipping等人sparse bayesian的结论不甚一致，值得推敲。 \n \n 再贴一个radar方面的工作，“On compressivesensingappliedtoradar”，论文摘要， \n \n 再贴一个radar方面的工作， \n Reduced Complexity Angle-Doppler-Range Estimation for MIMO Radar That Employs Compressive Sensing \n BY,Yao Yu, Athina P. Petropulu and H. Vincent Poor \n 论文摘要， \n Abstract—The authors recently proposed a MIMO radar system that is implemented by a small wireless network. By applying compressive sensing (CS) at the receive nodes, the MIMO radar super-resolution can be achieved with far fewer observations than conventional approaches. This previous work considered the estimation of direction of arrival and Doppler. Since the targets are sparse in the angle-velocity space, target information can be extracted by solving an `1 minimization problem. In this paper, the range information is exploited by introducing step frequency to MIMO radar with CS. The proposed approach is able to achieve high range resolution and also improve the ambiguous velocity. However, joint angle-Doppler-range estimation requires discretization of the angle-Doppler-range space which causes a sharp rise in the computational burden of the `1 minimization problem. To maintain an acceptable complexity, a technique is proposed to successively estimate angle, Doppler and range in a decoupled fashion. The proposed approach can significantly reduce the complexity without sacrificing performance."], "link": "http://to-cs.blog.sohu.com/139997345.html", "bloglinks": {}, "links": {"http://www.dauphine.fr/": 1}, "blogtitle": "Compressive Sensing：一缕清风"}, {"content": ["昨夜风声与雨声齐作，暇之余，史记相伴。 \n 高中学过秦论以来，脑海里一直勾画过贾谊哥哥柔弱兼刚毅的外表，木纳兼睿智的性格... \n 昨天恰好读到史记的“屈原贾生列传”，字里行间，都透露出史太公对贾谊前无古人，后无来者般智慧的惺惺相惜，也透漏出对贾谊高尚人格，卓越见识的....。难怪“秦皇汉武，略输文采。。。”的薄古厚今的毛老爷子也禁不住赞叹两声“少年倜傥廊庙才，壮志未酬事堪哀。胸罗文章兵百万，胆照华国树千台”(NOTE,尽管有很多人怀疑这首诗不是毛主席他老人家的作品) \n 尽管史太公将贾谊与屈原并列，可见贾谊哥哥在其心中的地位；尽管如此，个人觉得，屈原的怨妇情节似乎过重，政治能力略有不足；也不幸的是，遇上一个昏君楚怀王。然，贾谊，不仅仅敏而好学，博闻强记；也不仅仅能将枯燥乏味的政治述职报告写得文采斐然；更难得是，该生有超凡的政治远见和执政能力，例如，《陈政事疏》，情真意切，不仅列举大汉帝国面临的种种危机，而且提出了超越时代的解决方法，例如 \n “....欲天下之治安，莫若众建诸侯而少其力。力少则易使以义，国小则亡邪心......”。奇才啊！可惜啊，没有发挥才能的舞台！ \n 摘录哦一些语句如下， \n 　　贾生以为汉兴至孝文二十馀年，天下和洽，而固当改正朔，易服色，法制度，定官名，兴礼乐，乃悉草具其事仪法，色尚黄，数用五，为官名，悉更秦之法。孝文帝初即位，谦让未遑也。诸律令所更定，及列侯悉就国，其说皆自贾生发之。於是天子议以为贾生任公卿之位。绛、灌、东阳侯、冯敬之属尽害之，乃短贾生曰：“雒阳之人，年少初学，专欲擅权，纷乱诸事。”於是天子後亦疏之，不用其议，乃以贾生为长沙王太傅。 　　贾生既辞往行，闻长沙卑湿，自以寿不得长，又以適去，意不自得。及渡湘水，为赋以吊屈原。其辞曰： 　　共承嘉惠兮，俟罪长沙。侧闻屈原兮，自沈汨罗。造讬湘流兮，敬吊先生。遭世罔极兮，乃陨厥身。呜呼哀哉，逢时不祥！鸾凤伏窜兮，鸱枭翱翔。阘茸尊显兮，谗谀得志；贤圣逆曳兮，方正倒植。世谓伯夷贪兮，谓盗跖廉；莫邪为顿兮，铅刀为銛。于嗟嚜嚜兮，生之无故！斡弃周鼎兮宝康瓠，腾驾罢牛兮骖蹇驴，骥垂两耳兮服盐车。章甫荐屦兮，渐不可久；嗟苦先生兮，独离此咎！ 　　讯曰：已矣，国其莫我知，独堙郁兮其谁语？凤漂漂其高遰兮，夫固自缩而远去。袭九渊之神龙兮，沕深潜以自珍。弥融爚以隐处兮，夫岂从螘与蛭螾？所贵圣人之神德兮，远浊世而自藏。使骐骥可得系羁兮，岂云异夫犬羊！般纷纷其离此尤兮，亦夫子之辜也！瞝九州而相君兮，何必怀此都也？凤皇翔于千仞之上兮，览德军而下之；见细德之险兮，摇增翮逝而去之。彼寻常之汙渎兮，岂能容吞舟之鱼！横江湖之鳣鲟兮，固将制於蚁蝼。 ..... \n \n 好了，回归正题。 \n 有几个工作值得推荐， \n 【1】Learning with compressible prior By Volkan Cevher \n Can be obtain by google search \n 论文摘要， \n \n 该论文一个重要的结论，非常重要的结论， \n Oft-used generalized Gaussian and Laplacian models DO NOT support stable linear dimensional deduction! \n \n \n [2]Sampling Theorems for Signals from the Union of Finite-Dimensional Linear Subspaces \n BY, Thomas Blumensath， Mike E. Davies \n Can be obtained from arXiv \n 论文摘要， \n Compressed sensing is an emerging signal acquisition technique that enables signals to be sampled well below the Nyquist rate, given that the signal has a sparse representation in an orthonormal basis. In fact, sparsity in an orthonormal basis is only one possible signal model that allows for sampling strategies below the Nyquist rate. In this paper we consider a more general signal model and assume signals that live on or close to the union of linear subspaces of low dimension. We present sampling theorems for this model that are in the same spirit as the Nyquist-Shannon sampling theorem in that they connect the number of required samples to certain model parameters. Contrary to the Nyquist-Shannon sampling theorem, which gives a necessary and sufficient condition for the number of required samples as well as a simple linear algorithm for signal reconstruction, the model studied here is more complex. We therefore concentrate on two aspects of the signal model, the existence of one to one maps to lower dimensional observation spaces and the smoothness of the inverse map. We show that almost all linear maps are one to one when the observation space is at least of the same dimension as the largest dimension of the convex hull of the union of any two subspaces in the model. However, we also show that in order for the inverse map to have certain smoothness properties such as a given finite Lipschitz constant, the required observation dimension necessarily depends logarithmically on the number of subspaces in the signal model. In other words, whilst unique linear sampling schemes require a small number of samples depending only on the dimension of the subspaces involved, in order to have stable sampling methods, the number of samples depends necessarily logarithmically on the number of subspaces in the model. These results are then applied to two examples, the standard compressed sensing signal model in which the signal has a sparse representation in an orthonormalbasis and to a sparse signal model with additional tree structure。 \n \n 该论文在union of subspace框架下讨论了两个重要的问题，第一是算子的one-to-one存在性问题，其获得的结论与Do等人的结论相似，即，测量数据M>=2k，k为稀疏度(可以推广理解“稀疏度”这个概念)；第二个问题是有效解算法存在的问题，即， \n 由上述定理可以看出，由于subspace更有效地建立信号模型，因此，所需测量数据明显减少！ \n \n 【3】Why do commercial CT scanners still employ traditional, filtered back-projection for image reconstruction? \n BY, Xiaochuan Pan, Emil Y Sidky and Michael Vannier \n doi:10.1088/0266-5611/25/12/123009 \n \n 论文摘要， \n Despite major advances in x-ray sources, detector arrays, gantry mechanical design and especially computer performance, one component of computed tomography (CT) scanners has remained virtually constant for the past 25 years—the reconstruction algorithm. Fundamental advances have been made in the solution of inverse problems, especially tomographic reconstruction, but these works have not been translated into clinical and related practice. The reasons are not obvious and seldom discussed. This review seeks to examine the reasons for this discrepancy and provides recommendations on how it can be resolved. We take the example of field of compressive sensing (CS), summarizing this new area of research from the eyes of practical medical physicists and explaining the disconnection between theoretical and application-oriented research. Using a few issues specific to CT, which engineers have addressed in very specific ways, we try to distill the mathematical problem underlying each of these issues with the hope of demonstrating that there are interesting mathematical problems of general importance that can result from in depth analysis of specific issues. We then sketch some unconventional CT-imaging designs that have the potential to impact on CT applications, if the link between applied mathematicians and engineers/physicists were stronger. Finally, we close with some observations on how the link could be strengthened. There is, we believe, an important opportunity to rapidly improve the performance of CT and related tomographic imaging techniques by addressing these issues. \n 这篇论文从工程应用角度论述了cs在MRI应用中的一些问题，因为该观点是从MRI角度出发，所以，其观点难免有失公允，无论如何，一个很好的review文章，值得参考。"], "link": "http://to-cs.blog.sohu.com/139717675.html", "bloglinks": {}, "links": {}, "blogtitle": "Compressive Sensing：一缕清风"}, {"content": ["最近读了一遍T. Blumensath和M. E. Davies的“iterative thresholding for sparse approximations”及\"Normalised Iterative Hard Thresholding;guaranteed stability and performance\"等一系列文章。一直以来总是觉得他们对收敛性问题的研究有点烦琐，而且收敛性的结果有点问题，具体来说，以sparse signal 重建为例，他们的结果如下， \n 他们得到这个结果的出发点是建立surrogate函数，为此奠定了norm(hui,2)<1的这个条件。 \n 我的结论如下， \n \n 证明思路如下，"], "link": "http://to-cs.blog.sohu.com/139401854.html", "bloglinks": {}, "links": {}, "blogtitle": "Compressive Sensing：一缕清风"}, {"content": ["前一段时间，受国内某个杂志的邀请，写一篇关于压缩感知方面review的文章，呵呵。写review的文章？这个难度太大，太大，太大了；精力有限，能力有限，所以谢绝了这个邀请。但那时也决定用一些轻松的文字来调侃一下这个话题， 因为这类型的文字所需承担的责任是最小的，呵呵J。然而一直以来都比较忙，所以，…..,, 天遂人愿阿，恰逢感恩节长短适中的假期，终于有机会写写。 \n \n 说起稀疏重建，就不得不说“稀疏”的度量。事实上，它的根植土壤极其的肥沃。直白来说，稀疏就是广袤无垠沙漠上({x: Ax=b})的若干匹骆驼(min|x|_1,s.t. Ax=b)，当然，如果开心，你可以用其它的比喻来描述。那么，“稀疏重建”就是有勇气走进沙漠，把这些骆驼找出来。事实上，工程人员更喜欢用“探测(detection)”这个多少有点和蔼可亲味道的字眼。所谓“探测”可以大致分为三类：第一类好比去探测外星人是否存在，是否能探测到外星人并不关键，关键的是我们曾经有这样的经历，这或许多少有点烧钱的感觉。第二类探测目标很明确，但是能否如期探测到目标只有天知道。这种探测多少来的很辛苦，就好比老美翻掘阿富汗寻找本拉登，但均无功而返。问题在什么地方呢？本拉登那个家伙会动啊，而且是不停的动, 鬼知道他下一个时刻跑什么地方去了？第三类好比靖哥哥苦觅蓉妹妹（其中假设我们把蓉妹妹固定在桃花岛的第i棵大树旁边，而且其它树旁也固定形形色色的mm），茫茫人海，但目标明确，极其烂漫惬意 (可能很多人不太同意这个观点，当然，这区别于蓦然回首，那人却在灯火阑珊处的感觉)，这才是我们关心的稀疏重建。 \n 要在茫茫人海中寻找你的蓉妹妹，那么你，或者你使用的工具一定得具有强有力的”directivity”或分辨率，否则很多人都可能成为你的“蓉妹妹”(uncertainty)而上错花轿。用数学或物理的语言来描述，就是你的度量工具一定是“各向异性”，而不是“各向同性”。关于这一点，比较Lp(0<=p<=1)球和L2球就不难理解。在这里稍微停顿一下，罗嗦几句关于”L1”优化的一点事情。我们知道，从某个层面来讲，数学特性的不友好（nonsmooth）使其蒙上几道败笔(但是从另外一个层面，就是在这个不友好的特性下蕴涵了极具生命力的soft-threshold算法， 这是后话，暂且略过)，很多人辛辛苦苦去smooth这个满身是刺的bad boy，例如，典型的NESTA算法。呵呵，在这里再多说几句废话。如果使其度量工具具有各向异性，或者directivity的特性，我们不妨从阵列天线的角度说说。具有天线或滤波器理论背景的人均知道，放置一个点源的辐射特性是exp(jkr)/r, 其功能是在整个空间极其公平的辐射它的能量，即，l2球。如果我们按照某种规则多放置几个这样的点源，则可以形成期望的方向图，即，lp球(p<2)。当然，如果你愿意，这种”球”还具有了”reweighted”的特点，也就是说可以在不同的方向设置其不同的辐射强度。当然，这种情况下所设计的“稀疏度量”具有非常友好的数学特性，光滑，非常光滑。也或许，你可以用这种策略设计你的“稀疏正则化”函数(如果你用这个思想设计了令人满意的正则化函数，不要忘了感谢我哦，J)。 \n \n \n 说完稀疏和稀疏度量，接下来说稀疏重建。哇，这是一个极其喧闹的市场，各种叫卖声此起彼伏。把我们的镜头对准基于l1约束的稀疏重建，在此框架下，其中有三类问题是颇受欢迎的，第一类就是(BP)_sig问题，即，min{norm(x,1)}, s.t., norm(Ax-b,2)<sig；第二类问题是LASSO问题，即，min{norm(Ax-b,2)}， s.t. norm(x,1)<=tao; 第三类问题是QP_lambda问题，即，min{lambda*norm(x,1)+norm(Ax-b,2)}。这三类问题在三种不同的先验信息条件下，从三个不同的角度描述了稀疏重建问题，并且在各自的分支内诞生了各自具有鲜明特征的算法。尽管如此，如此同源的三个问题自然有千丝万缕的内在关系，例如，Pareto曲线就淋漓尽致地描述了这三类问题之间的相互依存关系。综观目前的一些优秀算法，算法发展不外乎以下三种策略：第一类问题的难点是非光滑目标函数norm(x,1)，因此其核心是norm(x,1)的光滑化技术, 例如，Barrier方法，NESTA， PANS, 等。第二类问题描述了{x: Ax=b}解在norm(x,1)<=tao的投影问题，因此该问题的核心是处理L1-球的投影问题，例如，SPGL1。第三类问题的难点是数据失配和正则化项的平衡，因此其难点是lambda的选择, 如果选择了合适的lambda，那么柳暗花明又一村，norm(x,1)导数的符号分布特性给你敞开了宽阔的大门，例如，soft-threshold策略。当然，上述方法的互相嫁接也诞生了形形色色的优秀儿女. \n NOTE： \n 第一副图来自rice大学关于compressive sensing的ppt教程，第二幅来自魏文元和宫德明编写的“天线原理”。在此一并感谢。"], "link": "http://to-cs.blog.sohu.com/138250047.html", "bloglinks": {}, "links": {}, "blogtitle": "Compressive Sensing：一缕清风"}, {"content": ["最近忙着整理文章，所以没时间来这里更新帖子；明天就是thanksgiving，所以今天多贴几篇文章。 \n 记得在前面我已经贴过Donoho等人关于\"Message passing algorithm\"的一个工作，今天从Igor的博客了解到这个工作有进一步的发展(这两个工作均可以在arXiv.org上download)，具体来说， \n [1]Message Passing Algorithms for Compressed Sensing: I. Motivation and Construction \n 论文摘要， \n Abstract—In a recent paper, the authors proposed a new class of low-complexity iterative thresholding algorithms for reconstructing sparse signals from a small set of linear measurements [1]. The new algorithms are broadly referred to as AMP, for approximate message passing. This is the first of two conference papers describing the derivation of these algorithms, connection with the related literature, extensions of the original framework, and new empirical evidence. In particular, the present paper outlines the derivation of AMP from standard sum-product belief propagation, and its extension in several directions. We also discuss relations with formal calculations based on statistical mechanics methods. \n [2]Message Passing Algorithms for Compressed Sensing: II. Analysis and Validation \n 论文摘要， \n Abstract—In a recent paper, the authors proposed a new class of low-complexity iterative thresholding algorithms for reconstructing sparse signals from a small set of linear measurements [1]. The new algorithms are broadly referred to as AMP, for approximate message passing. This is the second of two conference papers describing the derivation of these algorithms, connection with related literature, extensions of original framework, and new empirical evidence. This paper describes the state evolution formalism for analyzing these algorithms, and some of the conclusions that can be drawn from this formalism. We carried out extensive numerical simulations to confirm these predictions. We present here a few representative results. \n \n 毋庸置疑，compressive sensing在THZ,光学,量子等成像领域将发挥非常重要的作用，今天贴的第二个事情是关于ghost imaging和optics imaging的两个工作工作， \n \n 【1】论文题目， \n Fourier-transfrom Ghost Imaging for pure phase object based on Compressive Sampling algorithm \n 论文摘要， \n A special algorithm for the Fourier-transform Ghost Imaging (GI) scheme is discussed based on the Compressive Sampling (CS) theory. Though developed mostly in real space, CS algorithm could also be used for the Fourier spectrum reconstruction of pure phase object by setting a proper sensing matrix. This could find its application in diffraction imaging of X-ray, neutron and electron with higher efficiency and resolution. Simulation and experiment results are also presented to prove the feasibility. \n \n \n \n \n 【2】J.Ma的single pixel imaging system,该论文试图设计satellite on-board的single-pixel system，用数值模拟仿真的方法论文其可行性。 \n 论文题目， \n A Single-Pixel Imaging System for Remote Sensing by Two-Step Iterative Curvelet Thresholding \n Download from \n IEEE GEOSCIENCE AND REMOTE SENSING LETTERS, VOL. 6, NO. 4, OCTOBER 2009 \n 论文摘要， \n Abstract—Recently, a new framework named compressed sensing (CS) for the simultaneous sampling and compression of signals has been applied for panoramic-view imaging in aerospace remote sensing. By CS, it is possible for us to take superresolution photographs using only one or a few pixels rather than a million pixels by conventional digital cameras. However, the most popular approach of satellite/airborne remote sensing is line-scan imaging instead of panoramic-view imaging. In this letter, we propose a single-pixel imaging system for line-scan onboard cameras by applying compressive-scanning matrices in a sensing step and a two-step iterative curvelet thresholding method in an offline decoding step, which converges faster than previous single-step iterative thresholding methods. Numerical experiments show good performance of the proposed method for remote sensing. Results indicate the need to design practical single-pixel remote sensing instruments involving less storage space, less power consumption, and smaller size than the currently used charged-coupled-device cameras."], "link": "http://to-cs.blog.sohu.com/137836071.html", "bloglinks": {}, "links": {}, "blogtitle": "Compressive Sensing：一缕清风"}, {"content": ["最近做了许多关于first-order的工作，今天在这里唠叨两句。记得在前面提及到Bregman，Nesterov等first-order最优化算法，这两个算法同属于proximal gradient类算法，拥有诱人的计算速度；并且令人高兴的是这些算法有坚实的理论基础作为保障，当然需要在convex函数的框架下。今天再贴一个相关的工作， \n PARNES: A RAPIDLY CONVERGENT ALGORITHM FOR ACCURATE RECOVERY OF SPARSE AND APPROXIMATELY SPARSE SIGNALS \n (NOTE, can be downloaded from arXiv.org) \n BY, MING GU, LEK-HENG LIM, AND CINNA JULIE \n 论文摘要， \n In this article we propose an algorithm, parnes, for the basis pursuit denoise problem bp(\\u001B) which approximately nds a minimum one-norm solution to an underdetermined least squares problem. parnes, (1) combines what we think are the best features of currently available methods spgl1 [35] and nesta [3], and (2) incorporates a new improvement that exhibits linear convergence under the assumption of the restricted isometry property (rip). As with spgl1, our approach `probes the Pareto frontier' and determines a solution to the bpdn problem bp(\\u001B) by exploiting the relation between the lasso problem ls(\\u001C) and bp(\\u001B) given by their Pareto curve. As with nesta we rely on the accelerated proximal gradient method proposed by Yu. Nesterov [27, 26] that takes a remarkable O(pL=\") iterations to come within \\u000F > 0 of the optimal value, where L is the Lipschitz constant of the gradient of the objective function. Furthermore we introduce an `outer loop' that regularly updates the prox center. Nesterov's accelerated proximal gradient method then becomes the `inner loop'. The restricted isometry property together with the Lipschitz di erentiability of our objective function permits us to derive a condition for switching between the inner and outer loop in a provably optimal manner. A by-product of our approach is a new algorithm for the lasso problem that also exhibits linear convergence under rip."], "link": "http://to-cs.blog.sohu.com/137629178.html", "bloglinks": {}, "links": {}, "blogtitle": "Compressive Sensing：一缕清风"}, {"content": ["今天贴我和Jafarpour合作的两个工作，基于流体模型的石油勘探类的两个工作。并争取在圣诞节放假前将剩余的三个工作整理出来。 \n \n 【1】 \n An Iteratively Reweighted Algorithm for Sparse Reconstruction of Subsurface Flow Properties from Nonlinear Dynamic Data \n BY, Lianlin Li and Behnam Jafarpour \n  \n 论文摘要， \n  \n A challenging problem in predicting fluid flow displacement patterns in subsurface environment is the identification of spatially variable flow-related rock properties such as permeability and porosity. Characterization of subsurface properties usually involves solving a highly underdetermined nonlinear inverse problem where a limited number of measurements are used to reconstruct a large number of unknown parameters. To alleviate the non-uniqueness of the solution, prior information is integrated into the solution. Regularization of ill-posed inverse problems is commonly performed by imparting structural prior assumptions, such as smoothness, on the solution. Since many geologic formations exhibit natural continuity/correlation at various scales, decorrelating their spatial description can lead to a more compact or sparse representation in an appropriate compression transform domain such as wavelets or Fourier domain. The sparsity of flow-related subsurface properties in such incoherent bases has inspired the development of regularization techniques that attempt to solve a better-posed inverse problem in these domains. In this paper, we present a practical algorithm based on sparsity regularization to effectively solve nonlinear dynamic inverse problems that are encountered in subsurface model calibration. We use an iteratively reweighted algorithm that is widely used to solve linear inverse problems with sparsity constraint (known as compressed sensing) to estimate permeability fields from nonlinear dynamic flow data. To this end, we minimize a data misfit cost function that is augmented with an additive regularization term promoting sparse solutions in a Fourier-related discrete cosine transform domain. This regularization approach introduces a new weighting parameter that is in general unknown a priori, but controls the effectiveness of the resulting solutions. Determination of the regularization parameter can only be achieved through considerable numerical experimentation and/or a priori knowledge of the reconstruction solution. To circumvent this problem, we include the sparsity promoting constraint as a multiplicative regularization term which eliminates the need for a regularization parameter. We evaluate the performance of the iteratively reweighted approach with multiplicative sparsity regularization using a set of waterflooding experiments in an oil reservoir where we use nonlinear dynamic flow data to infer the spatial distribution of rock permeabilities, While, the examples of this paper are derived from the subsurface flow and transport application, the proposed methodology also can be used in solving nonlinear inverse problems with sparsity constraints in other imaging applications such as geophysical, medical imaging, electromagnetic and acoustic inverse problems. \n \n \n   【2】 \n Reservoir History Matching Within the Framework of Sparse Bayesian Estimation \n BY, Lianlin Li and B. Jafaropur \n 论文摘要， \n  \n The estimation of reservoir properties is inherently a highly underdetermined and nonlinear inverse problem because of two basic facts: (1) the complex physical interaction between the permeability/porosity and pressure/saturation, and (2) large number of unknowns to be reconstructed relative to the independent available data; consequently, some prior information should be efficiently exploited to obtain the reasonable reconstruction which can be used to make the successful reservoir forecast. The so-called compressibility of permeability and porosity field, which means that in some transformed domain such as DCT, wavelet, and so on only limited components are significant, has been empirically shown that it can be exploited to greatly improve the reconstruction of reservoir parameters. \n As we known, unlike most deterministic reconstruction methods, the Bayesian estimation based algorithm is fully-automated, i.e., the unknown signal coefficients and all necessary parameters are estimated solely from the observation and therefore no user-intervention is needed. Besides it, it also can provide the estimates of the uncertainty of the reconstruction. Inspired by this point, the sparse Bayesian algorithm recently developed to deal with the highly undetermined linear inverse problem with sparsity constraint has been introduced to attack the investigated problem in this paper, i.e. the highly underdetermined nonlinear inverse problem with sparsity constraint. \n Within the framework of Bayesian estimation, the history matching problem with sparsity constraint has been formulated and investigated in this paper. In order to model this sparsity promoting inverse problem, the required Laplace prior of Bayesian estimation has been modeled by two-hierarchical stage or Gaussian mixture strategy as done by standard sparse Bayesian estimation. Moreover, in order to model the measurements (i.e. pressure and saturation) in reservoir engineer which are the function of time and space and usually present different statistical properties, the different statistical parameters of noise variance has been assigned to different measurements instead of identical parameter for all measurements. Unfortunately, an artificial factor should be introduced to avoid the singularity in the resulting Bayesian estimation formulations. To deal with this issue, one efficient variant algorithm has been proposed afterwards. Several numerical synthetic experiments have been carried out to show high performance of proposed method, where the results using traditional Bayesian estimation also been provided and compared. In addition, the proposed methodology also can be used to deal with the nonlinear inverse problem in the other applied field, for example, the well-known electromagnetic inverse problem"], "link": "http://to-cs.blog.sohu.com/136987369.html", "bloglinks": {}, "links": {}, "blogtitle": "Compressive Sensing：一缕清风"}]