[{"blogurl": "http://complexdiagrams.com\n", "blogroll": [], "title": "Complex Diagrams"}, {"content": ["Here are some visualization process notes from my talks and tutorials."], "link": "http://complexdiagrams.com/2012/10/process-notes-handout/", "bloglinks": {}, "links": {}, "blogtitle": "Complex Diagrams"}, {"content": ["Here are the various, videos, recordings, transcripts, notes, and slide decks from some of the talks I gave in the first half of 2012. With one exception, all of these are free to view or download. January 21, ORDcamp Ignite Talk Data Visualizations Done Wrong: live lecture recording. 5:11 (quick and fun) January 25, Strata [...]"], "link": "http://complexdiagrams.com/2012/08/talks-first-half-of-2012/", "bloglinks": {}, "links": {}, "blogtitle": "Complex Diagrams"}, {"content": ["Here’s my table of properties and best uses of visual encodings. Feel free to download the PDF."], "link": "http://complexdiagrams.com/properties", "bloglinks": {}, "links": {}, "blogtitle": "Complex Diagrams"}, {"content": ["I’ll be giving a workshop on effective data visualization. Get a 25% discount when registering by using the code SPEAKER25 Hope to see you there!"], "link": "http://complexdiagrams.com/2011/12/speaking-at-strata-2012/", "bloglinks": {}, "links": {}, "blogtitle": "Complex Diagrams"}, {"content": ["From Chartball.com: Pro-football game charts. They’ve done an excellent job here, visually representing: direction of play position of each down game time on the vertical axis type of play (run, pass, kick) scoring events other events, such as fumbles and intercepts Great use of the field metaphor and direction, as well as team colors. I’d [...]"], "link": "http://complexdiagrams.com/2011/12/great-visualization-pro-football-game-charts/", "bloglinks": {}, "links": {}, "blogtitle": "Complex Diagrams"}, {"content": ["Two appearances from the Strata conference in New York this past September. I gave an Ignite talk called Visualization Done Wrong. This video has too much of me and not enough of my slides.   Alex Howard interviewed me about my new book Designing Data Visualizations and related topics.   I’ll be giving a three hour [...]"], "link": "http://complexdiagrams.com/2011/12/appearances-at-strata-nyc-2011/", "bloglinks": {}, "links": {}, "blogtitle": "Complex Diagrams"}, {"content": ["Edit: the audio of the speech mentioned below is available as an mp3. From: Noah Iliinsky Date: August 26, 2011 11:04:21 AM PDT To: sjobs@apple.com Subject: History, inspiration, thanks. Dear Steve, Twenty years ago this week, we were in the same room. You were speaking to the incoming class at Reed College, and I was [...]"], "link": "http://complexdiagrams.com/2011/10/steve-jobs/", "bloglinks": {}, "links": {}, "blogtitle": "Complex Diagrams"}, {"content": ["After seeing a poor infographic re-posted, I briefly ranted on twitter: Terrible presentation of data. The bars are OK, the rest is worthless. http://bit.ly/o76BOm @litmusapp #fb #li I don’t mean to be harsh, but #infovis culture needs constructive critique to improve, not just reposting. /cc @visualizingOrg @litmusapp To put my mouse where my mouth (well, [...]"], "link": "http://complexdiagrams.com/2011/09/a-quick-redesign-of-useless-graphs/", "bloglinks": {}, "links": {}, "blogtitle": "Complex Diagrams"}, {"content": ["I’m thrilled to announce my latest book, Designing Data Visualizations. The goal of this book is to teach you the process of designing a visualization, presenting the important considerations, and informing the choices that you make. It’s tool-agnostic, and is entirely applicable to visualizations with high and low volumes of data, and to both quantitative [...]"], "link": "http://complexdiagrams.com/2011/09/new-book-designing-data-visualizations/", "bloglinks": {}, "links": {}, "blogtitle": "Complex Diagrams"}, {"content": ["I’ll be speaking at Strata NY next week. My main talk is Designing Data Visualizations, on Friday the 23rd at 11:30am. I’ll also be presenting at the Visualization Showcase Tuesday evening, and at Ignite Strata Wednesday evening. On Friday at 1pm I’ll be at the O’Reilly booth, signing copies of Beautiful Visualization. Not sure if [...]"], "link": "http://complexdiagrams.com/2011/09/presenting-at-strata/", "bloglinks": {}, "links": {}, "blogtitle": "Complex Diagrams"}]