[{"blogurl": "http://cra.org/govaffairs/blog\n", "blogroll": [], "title": "COMPUTING RESEARCH POLICY BLOG"}, {"content": ["As part of its mission to develop a next generation of leaders in the computing research community, the Computing Research Association‘s Computing Community Consortium (CCC) announces the second offering of the CCC Leadership in Science Policy Institute (LiSPI), intended to educate computing researchers on how science policy in the U.S. is formulated and how our [...]"], "link": "http://feedproxy.google.com/~r/cra/WxKq/~3/awwSve3hN5Q/", "bloglinks": {}, "links": {}, "blogtitle": "COMPUTING RESEARCH POLICY BLOG"}, {"content": ["This post marks the first from CRA’s new communications specialist, Shar Steed. Shar will be a frequent contributor to the Computing Research Policy blog and is the new force behind CRA’s communications efforts. Shar joins us from the AAAS Science and Technology Policy Fellows program where she handled communications and marketing duties, and can be [...]"], "link": "http://feedproxy.google.com/~r/cra/WxKq/~3/Ue2BdjTUg6Y/", "bloglinks": {}, "links": {}, "blogtitle": "COMPUTING RESEARCH POLICY BLOG"}, {"content": ["Former CRA Board Chair Peter Lee testified today before the Senate Commerce, Science, and Transportation Committee on “Five Years of the America COMPETES Act: Progress, Challenges, and Next Steps”. The hearing explored the successes of the past and necessary improvements required of the US to remain the preeminent global leader in STEM research and education [...]"], "link": "http://feedproxy.google.com/~r/cra/WxKq/~3/Ae8g9_y0TNY/", "bloglinks": {}, "links": {}, "blogtitle": "COMPUTING RESEARCH POLICY BLOG"}, {"content": ["The House and Senate leadership (and the President) have agreed in principle to a stopgap spending bill that will keep the government running after the start of FY 2013 on October 1st, despite having not passed any of the 12 annual spending bills that fund government activities. The so-called “continuing resolution” will keep government running [...]"], "link": "http://feedproxy.google.com/~r/cra/WxKq/~3/EAcrUFtvjy0/", "bloglinks": {}, "links": {}, "blogtitle": "COMPUTING RESEARCH POLICY BLOG"}, {"content": ["On Friday, July 13th, the Woodrow Wilson Center held an event titled “Universities, High Skilled Immigration, and Regulatory Reform: Implication for America’s Economic Future.” The focus of the discussion was the Start-Up Act 2.0 (S. 3217), legislation that would create a STEM visa program so that U.S.-educated foreign students who graduate with a master’s or [...]"], "link": "http://feedproxy.google.com/~r/cra/WxKq/~3/GBfYZntgLYc/", "bloglinks": {}, "links": {}, "blogtitle": "COMPUTING RESEARCH POLICY BLOG"}, {"content": ["On Wednesday, June 27th the House Committee on Science, Space and Technology’s Subcommittee on Research and Science Education convened a hearing to survey the many challenges that U.S. research universities face. The hearing was held in conjunction with the 150th anniversary of the Morrill Act of 1862, which allowed for the creation of land-grant colleges. [...]"], "link": "http://feedproxy.google.com/~r/cra/WxKq/~3/lGx_qDOPfCs/", "bloglinks": {}, "links": {}, "blogtitle": "COMPUTING RESEARCH POLICY BLOG"}, {"content": ["It appears that Arati Prabhakar has been named the new DARPA Director, taking over for Regina Dugan who left the agency to work with Google. From the memo to DARPA staff: Dr. Prabhakar has spent her career advancing technology in support of both national security and the private sector, from early research and development through [...]"], "link": "http://feedproxy.google.com/~r/cra/WxKq/~3/F5a6YCg9CQQ/", "bloglinks": {}, "links": {}, "blogtitle": "COMPUTING RESEARCH POLICY BLOG"}, {"content": ["This past Wednesday, IBM Corp sponsored a Senate briefing called “Big Data: The New Natural Resource,” which was held in conjunction with an announcement of IBM’s partnership with the Livermore National Laboratory (LLNL) to expand collaboration on high-performance computing.  The collaboration, which will be referred to as “Deep Computing Solutions,” is a part of LLNL’s [...]"], "link": "http://feedproxy.google.com/~r/cra/WxKq/~3/58H-TNCwxvU/", "bloglinks": {}, "links": {}, "blogtitle": "COMPUTING RESEARCH POLICY BLOG"}, {"content": ["On June 19th, the The House Subcommittee on Technology and Innovation held a hearing to learn about different approaches universities and nonprofit are taking to transfer the results of federally funded research.  This “results transfer” is a product of the Bayh-Dole Act, which was passed in 1980 in order to allow universities, small businesses or [...]"], "link": "http://feedproxy.google.com/~r/cra/WxKq/~3/E0G_PPEB_hg/", "bloglinks": {}, "links": {}, "blogtitle": "COMPUTING RESEARCH POLICY BLOG"}, {"content": ["Dr. John Holdren, Director of the White House Office of Science and Technology Policy (OSTP), testified at an oversight hearing of the House Science, Space, and Technology Committee yesterday. In his testimony, Dr. Holdren spoke of the transformative nature of science and technology and its potential for economic growth but also its challenges for public [...]"], "link": "http://feedproxy.google.com/~r/cra/WxKq/~3/WgHfteWSbbA/", "bloglinks": {}, "links": {}, "blogtitle": "COMPUTING RESEARCH POLICY BLOG"}]