[{"blogurl": "http://cooldata.wordpress.com\n", "blogroll": [], "title": "CoolData blog"}, {"content": ["It’s been a full year since I attended the first DRIVE Conference in Seattle, and I’m pleased to let you know (if you don’t already) that a second one is on the way. DRIVE 2013 takes place February 20-21 at the Bell Harbor International Conference Center in Seattle, Washington, and is hosted by the University [...]"], "link": "http://cooldata.wordpress.com/2012/10/18/its-your-turn-to-drive/", "bloglinks": {}, "links": {}, "blogtitle": "CoolData blog"}, {"content": ["Guest post by John Sammis and Peter B. Wylie Thanks to all of you who read and commented on our recent paper comparing logistic regression with multiple regression. We were not sure how popular this topic would be, but Kevin told us that interest was high, and there were a number of comments and questions. [...]"], "link": "http://cooldata.wordpress.com/2012/10/10/logistic-vs-multiple-regression-our-response-to-comments/", "bloglinks": {}, "links": {}, "blogtitle": "CoolData blog"}, {"content": ["When I started doing predictive modelling, I was keenly interested in picking the best and coolest predictor variables. As my understanding deepened, I turned my attention to how to define the dependent variable in order to really get at what I was trying to predict. More recently, however, I’ve been thinking about refining or limiting [...]"], "link": "http://cooldata.wordpress.com/2012/09/20/when-less-data-is-more-in-predictive-modelling/", "bloglinks": {}, "links": {}, "blogtitle": "CoolData blog"}, {"content": ["In Annual Fund, Leadership giving typically starts at gifts of $1,000 (at least in Canada it does). For most schools, these donors make up a minority of all donors, but a majority of annual revenue. They are important in their own right, and for delivering prospects to Major Giving. Not surprising, then, that elevating donors from [...]"], "link": "http://cooldata.wordpress.com/2012/09/13/odd-but-true-findings-upgrading-annual-donors-are-erratic-and-volatile/", "bloglinks": {}, "links": {}, "blogtitle": "CoolData blog"}, {"content": ["by Peter Wylie, John Sammis and Kevin MacDonell (Click to download printer-friendly PDF: Logistic vs MR-Wylie Sammis MacDonell) The three of us talk about this issue a lot because we encounter a number of situations in our work where we need to choose between these two techniques. Many of our late night/early morning phone/internet discussions [...]"], "link": "http://cooldata.wordpress.com/2012/08/20/logistic-regression-vs-multiple-regression/", "bloglinks": {}, "links": {}, "blogtitle": "CoolData blog"}, {"content": ["When a bus holding 50 commuters is forced to wait for 30 seconds for a runner to catch it, the runner has saved the 15 minutes it will take to wait for the next bus, but the total cost in time is 50 people x 30 seconds, or 25 minutes. By this math, the driver [...]"], "link": "http://cooldata.wordpress.com/2012/07/20/bus-driver-math/", "bloglinks": {}, "links": {}, "blogtitle": "CoolData blog"}, {"content": ["When I build predictive models, I normally don’t build just one for each purpose. Presumably the model is going to be used, so I want it to be the best one possible. Yes, I test the model scores against a holdout data sample, but if I built only one model, I wouldn’t have anything solid [...]"], "link": "http://cooldata.wordpress.com/2012/07/12/evaluate-models-with-fresh-data-using-tableau-heat-maps/", "bloglinks": {}, "links": {}, "blogtitle": "CoolData blog"}, {"content": ["The Survey on Analytics for Fundraising is a short survey created to better understand analytics tools and trends, in addition to the presence and impact of analytics for fundraising. This is the third year for this survey, which opens up the opportunity for tracking longitudinal trends. The results will be shared at the APRA 2012 [...]"], "link": "http://cooldata.wordpress.com/2012/07/10/take-part-in-the-2012-survey-on-analytics-for-fundraising/", "bloglinks": {}, "links": {}, "blogtitle": "CoolData blog"}, {"content": ["Guest post by Peter B. Wylie and John Sammis (Download a print-friendly .pdf version here: Finding Predictors of Future Major Givers) For years a bunch of  committed data miners (we’re just a couple of them) have been pushing, cajoling, exhorting, and nudging  folks in higher education advancement to do one thing: Look as hard at their [...]"], "link": "http://cooldata.wordpress.com/2012/06/13/finding-predictors-of-future-major-givers/", "bloglinks": {}, "links": {}, "blogtitle": "CoolData blog"}, {"content": ["There’s been some back-and-forth on one of the listservs about the “correct” way to measure and score alumni engagement. An emphasis on scientific rigor is being pressed for by one vendor who claims to specialize in rigor. The emphasis is misplaced. No doubt there are sophisticated ways of measuring engagement that I know nothing about, [...]"], "link": "http://cooldata.wordpress.com/2012/06/06/how-you-measure-alumni-engagement-is-up-to-you/", "bloglinks": {}, "links": {}, "blogtitle": "CoolData blog"}]