[{"blogurl": "http://www.coolinfographics.com\n", "blogroll": [], "title": "Cool Infographics"}, {"content": ["Wow! This year is the 60th Anniversary of the Bar Code , and I remember when checkout clerks at the grocery store had to key in every price! OK, I only barely remember that as a kid. \n \n The barcode is a fundamental part of how we obtain goods—from scanning items for price comparisons, adding goods to a wish lists and checking out purchased products. We use barcode scanners on a daily basis, but have you ever asked yourself how the barcode came to be? Would you believe that the first barcode was printed on a pack of Wrigley’s gum, and originally created to help grocery stores track inventory? \n Today is the 60th Anniversary of the barcode; and if you’re interested in learning more fun facts like the ones above as well as how the barcode came to be, its practical uses, and how industries have implemented the technology today, check out the infographic below. \n \n Even without any data visualizations, this design does a good job of leading the readers through a short history, and visually shows the reader the different types of bar code technologies and bar readers. \n In the footer, the design is missing both a copyright statement, and a URL to help the readers find the original full-size version on Wasp Bar Code’s landing page. They include the home page URL, but a reader won’t find any mention of the infographic on the home page. \n Thanks to David for sending in the link!"], "link": "http://www.coolinfographics.com/blog/2012/10/31/60th-anniversary-of-the-bar-code.html", "bloglinks": {}, "links": {"http://buzz.waspbarcode.com/": 1, "http://www.waspbarcode.com/": 2}, "blogtitle": "Cool Infographics"}, {"content": ["It is that time of the year again! Halloween is the perfect time for costumes, scary movies, and Charlie Brown! How do you spend your halloween? Halloweencostumes.com has put together some Creepy Halloween Statistics to show some of this holiday’s most popular happenings. \n \n What are you most looking forward to this Halloween? Collecting copious amounts of your favorite candy? Dressing up in a trendy costume? Enjoying a horror movie marathon? Find out what other Americans will be up to this year, with our Ultimate Visual Guide to Halloween Statistics! You’ll discover popular costumes for you and fido, a count-down of the best sweet treats, suggestions for a Halloween playlist and more spooktacular stats! \n \n I really like this design. The color scheme, the design style, and the easy-to-understand top-to-bottom progression of information. There are a few statistics that I would like to see visualized, like the Trick-or-Treating By The Numbers section where the values are only shown in big fonts. I really like the different moon phases to visualize the stats at the top. \n The Top 5 lists are a little text-heavy, and it would have been nice to see movie posters or CD artwork to go along with the entries. \n In the footnote at the bottom, missing are both a copyright statement (or Creative Commons) and a URL link to the original infographic landing page so readers can find the full-size version. \n Thanks to Elise for sending in the link!"], "link": "http://www.coolinfographics.com/blog/2012/10/29/halloween-statistics-2012-creepy-calculations.html", "bloglinks": {}, "links": {"http://www.halloweencostumes.com/blog": 3}, "blogtitle": "Cool Infographics"}, {"content": ["Timeplots has launched a new infographic poster, The Visual History of the United States House of Representatives . Available for purchase from the Timeplots site for $34.95. \n \n This large-scale (48″x32”) print is like nothing else available on the history of the U.S. House of Representatives. It depicts the progression in political ideology of every House seat from 1789 to 2010. Other highlights include a timeline of over 100 major legislative enactments and significant developments in U.S. legislative history, and visual summaries of party control and ideological distribution of the House and Senate in each Congress. A Visual History of the U.S. House of Representatives is packed with information and is not intended to be absorbed at a glance, but rather visited and revisited over time. \n \n The infographic design visualizes the entire history from 1789-2013. The main, central visualization is the unique highlight of this design. Each representative is shown by a colored circle that matches their party affiliation, and placed along a vertical scale based on their ideology. The circles are filled partially transparent, so you get the cumulative color effect when the circles overlap. This creates a darker color when many representatives within any particular two-year Congress share a similar ideology, and you can see clear areas of concentration. Fantastic new visualization method, and creates a beautiful image. \n   \n The poster also visualizes the balance of power for each two-year Congress by party, and compares it to the Senate and the President from the same time period. Major milestones, amendments, governance issues, economy, foreign affairs, civil rights and social policy achievements are also plotted within the time periods they took place. \n Nathaniel Pearlman, Founder and President of Timeplots, agreed to answer a few behind-the-scenes questions about designing the poster. \n \n Cool Infographics: What software applications were used to help analyze the data and create the design? \n Nathaniel Pearlman: So far we have programmed our information graphic prints in the R language and done the final design pass in Illustrator. I’m interested in hearing about other platforms to use for complex data and layout — especially other software applications that would allow us to create interactive and print versions from the same code base. \n Cool Infographics: What’s the most interesting thing you learned from the data? \n Nathaniel Pearlman: As with some of our other posters, I like the big picture: for me, the visual history of the U.S. house print shows the sweep of U.S. history — a marked contrast with the more journalistic, and immediate, take on the political and economic state of the nation that we are used to seeing in the news. You can clearly see the ebb and flow over time of ideological overlap between the parties – and how they are at such loggerheads now. \n Cool Infographics: What was the hardest part behind designing the House poster? \n Nathaniel Pearlman: For the House poster, it took us a while to come up with a compelling central graphic. We were looking for something visually arresting from a distance, but that captured the key patterns in the data. I think we found that. \n Cool Infographics: What should we expect in the future from Timeplots? \n Nathaniel Pearlman: We have recently launched Graphicacy, a design group that helps other tell their own stories with print or interactive information graphics, especially involving large or complex data sets. For Timeplots, we are currently working on a history of U.S. State boundaries and a visual history of baseball. I am excited about both of them. I would also love to hear from your audience what they would like to see, and we are always looking for collaborators, if someone would like to work with us on a project that they care about. We’re open to new ideas! \n Cool Infographics: Who is your primary audience for the posters? Schools, businesses, political offices, individuals, etc.? \n Nathaniel Pearlman: Our primary audience is those with true interest in the subject matter. Our work is explanatory or educational art for smart people – and just about everyone has areas of intense interest, whether it is sports, entertainment, food, politics or finance. Timeplots has done a lot with American politics so far, but we intend to move now into other areas as well."], "link": "http://www.coolinfographics.com/blog/2012/10/26/a-visual-history-of-the-us-house-poster-and-interview.html", "bloglinks": {}, "links": {"http://wig.bz/": 4}, "blogtitle": "Cool Infographics"}, {"content": ["Tracking American Poverty & Policy is an interactive infographic visualization site that breaks down the data about…you guessed it…poverty in America. \n The site provides a sequence of interactive pages that start with the overall poverty numbers, and then break them down in more detail by race, gender, education, age and family type. In addition to the initial pie charts for the official poverty rate, the visualizations change to show details for Near Poverty, In Poverty and Deep Poverty numbers when you hover your pointer over each chart. \n \n   \n You also have the option on each page to change the year to see how the number have changed from 1967 - 2010. \n Good visualization design by Two-N"], "link": "http://www.coolinfographics.com/blog/2012/10/23/tracking-american-poverty-interactive-infographic.html", "bloglinks": {}, "links": {"http://www.trackingpovertyandpolicy.org/": 3, "http://www.two-n.com/": 1}, "blogtitle": "Cool Infographics"}, {"content": ["The Sage Hill School has created an infographic as a marketing piece showing many of the different stats about the school’s history and performance. The Sage Hill Difference has been used as a printed handout, a 7-foot retractable banner, a PDF available for download and the JPG image file online. The design is used to educate and inform prospective families, parents, students and the general public. \n \n  The Sage Difference: 7-foot retractable banner \n I asked Torrey Olins, the Director of Communications and Marketing at Sage Hill, some questions about designing and using the infographic as a marketing tool: \n \n Cool Infographics: What software applications were used to help analyze the data and create the design? \n Torrey Olins: The piece was created using InDesign. The data was collected and analyzed through a combination of resources from Sage Hill School and our advertising firm, O’leary and Partners ( www.adagency.com ) The piece did not require any software for analysis of data. \n Cool Infographics: Who designed the infographic? \n Torrey Olins: The design of the infographic was a collaboration between myself O’leary and Partners. About six months ago, I came up with the idea of creating an infographic for the school’s marketing efforts in our fall 2012 admission season, and in fact, sent my account manager and her assistant links to coolinfographics.com for inspiration. We were unable to find any other high school that had created an infographic for marketing, so we ended up using elements from a variety of different sources. For example, the school history portion of the infographic was inspired by an infographic created to celebrate the history of a small city. \n Because O’leary and Partners has been creating print and digital media for Sage Hill School for several years, they were able to apply our design look and feel (color palate, fonts, etc.) to this piece so that it integrates nicely with our other school communications, while also going in an entirely new direction. I did not want this piece to look like a “one off” and I was pleased that O’leary accomplished my goal of creating an infographic that maintains continuity with our brand. \n Cool Infographics: Would you describe the different formats you published the infographic? \n Torrey Olins: The infographic was published as an 8.5” x 25” folded print piece that we hand out to prospective students and parents at high school fairs, our Admission Open House and other campus events. We also have a jpg and pdf copy of the infographic on our website ( www.sagehillschool.org ) and have published it on our Facebook ( www.facebook.com/sagehillschool ) and Pinterest accounts ( www.pinterest.com/sagehillschool ). We also reproduced the infographic on two large (7’x3’) retractable banners that we can bring to off campus events or use around campus (we currently have one in our lobby for visitors to see while they are waiting for appointments.) \n Cool Infographics: How has the use of the infographic and social media impacted your marketing and recruiting process? \n Torrey Olins: Sage Hill School is Orange County, California’s premier independent, coed, nonsectarian high school. The school was founded in 2000 and currently enrolls 466 students in grades 9-12. Because Sage Hill School is located in a community that does not have as long of a history with independent schools as with the public school system, it is important for us to highlight the differentiators that make Sage Hill School the finest college preparatory option in our area. The infographic is an effective way to communicate the value of a Sage Hill education to the parent who is deciding whether to send a child to public school or pay tuition for Sage Hill School. \n The infographic format met my needs for a fresh approach to demonstrate the achievements and differentiators of Sage Hill School to prospective families, as well as reinforcing the value of the school for our currently enrolled families. We are very excited that Sage Hill School is one of (or possibly the first) high schools to utilize the infographic format for marketing in the 2012-2013 admission season! \n The recruiting season for independent schools typically begins in October and will last until admission decisions are announced and families sign contracts in the spring. Thus, it is quite early in the process and unfortunately, it is too soon for us to speak to increases in inquiries/ applications as a result of the infographic or other social media efforts. \n Cool Infographics: What has been the reaction and feedback to the infographic? \n Torrey Olins: Let’s face it, facts and stats about schools can be extremely dry. For families who are considering a variety of different high school options, numbers and figures tend to run together. Thus far, both current and prospective families have indicated that the information in the infographic is presented in a way that is interesting, fun and memorable. \n As a school in our second decade, Sage Hill has established a reputation for innovation in our educational program; this year we are pleased to educate families about Sage Hill School through the use of an innovative communication tool. We are also excited that this piece has put Sage Hill School’s name out in the broader community as an institution that is eager to embrace new media, both inside and beyond the classroom. I have been contacted by a number of other independent schools who are interested in using this format for their marketing as well. \n \n \n Thanks to Torrey for taking the time to share their process and reaction to using the infographic!"], "link": "http://www.coolinfographics.com/blog/2012/10/22/the-sage-hill-difference-marketing-infographic-interview.html", "bloglinks": {}, "links": {"http://coolinfographics.com/": 1, "http://www.adagency.com/": 1, "http://www.sagehillschool.org/": 5, "http://www.pinterest.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Cool Infographics"}, {"content": ["Fast Fourier Transforms: A Study Guide from Tektronix is a great example of using data visualization and infographic design principles to visually explain the math behind their oscilloscopes. \n \n Most engineers don’t remember the complex algorithms and concepts of the Fast Fourier Transform (FFT) and Discrete Fourier Transform (DFT) that they learned in college. Instead of dusting off your textbooks, check out this Fast Fourier Transform visual from Tektronix. It boils down the key tips and practical knowledge for Engineers and their designs. With this visual, we hope you can skip digging up your old text books and get back to your designs. \n \n The design does a good job of telling a story top-to-bottom. Starting with the basics, moving into the more complicated math and finally applying the math to how the oscilloscope product works. \n Definitely a design focused on their target audience, and not the general public. However, using infographic design to simplify your message to customers is one of the most effective ways to clearly communicate your marketing message. It’s more memorable to your audience when they come to a purchase decision, and communicating clearly builds your brand credibility with the subject. \n At the bottom of the design, they should have included some type of license (copyright or Creative Commons) and the URL to the original infographic landing page. Nothing wrong with listing the URL to the product page, but help readers interested in the information from the infographic find the original full-size version easily. \n Thanks to Matt for sending in the link!"], "link": "http://www.coolinfographics.com/blog/2012/10/17/fast-fourier-transforms-an-infographic-study-guide.html", "bloglinks": {}, "links": {"http://www.tek.com/": 3}, "blogtitle": "Cool Infographics"}, {"content": ["New infographic poster by Larry Gormley from HistoryShots . The History of Film plots out the most important films of the last 100 years into a beautiful, flowing timeline that visually separates the films by 20 different genres. \n \n This graphic chronicles the history of feature films from the origins in the 1910s until the present day. More than 2000 of the most important feature-length films are mapped into 20 genres spanning 100 years. Films selected to be included have: won important awards such as the best picture Academy Award; achieved critical acclaim according to recognized film critics; are considered to be key genre films by experts; and/or attained box office success. \n \n  \n   \n You can buy the 43” x 23” inch poster for $34.00 and definitely check out the zooming viewer to see the poster up close at Historyshots.com . \n Great job Larry!"], "link": "http://www.coolinfographics.com/blog/2012/10/15/the-history-of-film-infographic-poster.html", "bloglinks": {}, "links": {"http://www.historyshots.com/": 6}, "blogtitle": "Cool Infographics"}, {"content": ["The big news in the public health field in the U.S. is Obamacare. In response to its passing, Master of Public Health.org created The Price of Socialized Medicine: Obamacare’s Unconstitutionality by the Numbers infographic to give insight into how it will affect everyone. \n \n The Supreme Court yesterday upheld the constitutionality of the Patient Protection and Affordable Care Act of 2010, in a landmark 5-4 decision. Unfortunately, they got it wrong. The PPACA, known colloquially as Obamacare, should have been struck down by the high court, as it is both unconstitutional and very costly: \n \n Individual Mandate : Obamacare requires that all Americans carry health insurance or face an annual penalty. The federal government is effectively compelling individual citizens to enter a market, which is a clear violation of the Commerce Clause of the Constitution. The Supreme Court ruled that this was constitutionally valid as within Congress’ taxing power. \n Medicaid Expansion : As the original Act is written, the PPACA would require states to expand Medicaid support or risk having their entire Medicaid federal funding cut off. This infringes on states’ rights. Fortunately, the Supreme Court did rule against these sanctions. \n \n In response to the ruling, we have produced an infographic titled, “The Cost of Socialized Medicine: Obamacare’s Unconstitutionality by the Numbers”, which illustrates the folly of the PPACA as well as some of the costs that will be borne as a result. \n \n Obviously, this design is promoting a specific opinion, but we’re here to discuss the infographic design itself. \n \n The design outlines a really good step-by-step story top-to-bottom, and summarizes the data behind their point of view clearly \n Good mix of illustrations and data visualization within each section. \n In general, there’s WAY too much text in the design. They want to be thorough in their explanations, but this much text will turn away many readers from reading the infographic at all. Also, most of the text is too small to read on their landing page. Less text would have been more effective, and allowed for a larger font. \n The timeline looks like events along the heartbeat axis, but they aren’t spaced out appropriately to match their dates. \n I like the icon representation of the justices. Just enough detail to be recognizable. \n Clear, easy to understand map of the costs to each state in the country map \n The sizes of the circles in the Cost of Obamacare section are close, but not quite accurately representing the dollar figures shown. Some are larger than they should be, and a couple are smaller. Almost like the sizes were eye-balled instead of calculated mathematically. Odd. \n The states that have filed lawsuits would be easier to understand if the colored states were still placed within the map of the U.S. \n Good list of sources \n Need a copyright statement and the URL to the original infographic landing page for readers that find the infographic posted on the Internet to be able to find the original. \n \n Thanks to Jimmy for sending in the link!"], "link": "http://www.coolinfographics.com/blog/2012/10/11/obamacare-the-price-of-socialized-medicine.html", "bloglinks": {}, "links": {"http://masterofpublichealth.org/": 2, "http://masterofpublichealth.amazonaws.com/": 1}, "blogtitle": "Cool Infographics"}, {"content": ["Building a Global Visual Language from The Noun Project on Vimeo . \n The Noun Project is beauty in its simplicity. \n I post this video for two reasons: \n \n Even though there are no statistics in the video, I do consider this to be an infographic video. The video is a visual explanation that “shows” the audience icons and illustrations that convey the meaning of representing human concepts in visual form. \n The Noun Project is a fantastic effort to design universal icons. The idea is to design and gather illustrations of concepts that cross languages and cultures, and then make tham available to everyone under Creative Commons license to use in their own designs. Obviously good for infographic design, but also for presentations, websites and even school reports. \n \n From the Noun Project About Page: \n \n Creating, Sharing and Celebrating the World’s Visual Language \n The Noun Project is a platform empowering the community to build a global visual language that everyone can understand. \n Visual communication is incredibly powerful. Symbols have the ability to transcend cultural and language barriers and deliver concise information effortlessly and instantaneously. For the first time, this image-based system of communication is being combined with technology to create a social language that unites the world. \n \n Anyone can also register and submit their own designs to be considered for inclusion in the library. \n   \n Like designed by Marwa Boukarim from The Noun Project"], "link": "http://www.coolinfographics.com/blog/2012/10/10/the-noun-project.html", "bloglinks": {}, "links": {"http://vimeo.com": 1, "http://thenounproject.com/": 4, "http://vimeo.com/": 2}, "blogtitle": "Cool Infographics"}, {"content": ["Science meets art in the Hurricanes Since 1851 infographic from John Nelson, IDV Solutions , on UXBlog . The infographic maps out storm paths and wind speeds of hurricanes since 1851. The photo is the projection view of the globe from the south pole perspective. \n \n Ok, here’s a bottoms-up view of known tropical storms and hurricanes dating back to 1851. The fine folks at NOAA keep an archive of storm paths with wind speed, storm name, date, among other attributes, and are always updating and refining information for past events based on historical evidence and educated hunches. The data are awesome and they make it available in several formats. Here’s what it looks like slapped onto a polar projection (looking up at Antarctica) with point color tied to intensity … A couple of things stood out to me about this data… 1) Structure. Hurricanes clearly abhor the equator and fling themselves away from the warm waters of their birth as quickly as they can. Paging Dr. Freud. The void circling the image is the equator. Hurricanes can never ever cross it. 2) Detection. Detection has skyrocketed since satellite technology but mostly since we started logging storms in the eastern hemisphere. Also the proportionality of storm severity looks to be getting more consistent year to year with the benefit of more data. \n \n Data visualization design reveals patterns and makes data understandable, and this is a huge, effective data visualization. \n Thanks to Renee for sending in the link!"], "link": "http://www.coolinfographics.com/blog/2012/10/9/hurricanes-since-1851.html", "bloglinks": {}, "links": {"http://uxblog.idvsolutions.com/": 2, "http://www.noaa.gov/": 1, "http://www.idvsolutions.com/": 1, "http://en.wikipedia.org/": 1, "http://www.flickr.com/": 1}, "blogtitle": "Cool Infographics"}, {"content": ["The HBO phenomenon that captured our attention it’s first season has become hard to follow. The Supernatural Sprawl of True Blood infographic created by Jess Bachman from visual.ly breaks down the types of characters that have appeared so far in each season and each episode. \n \n TrueBlood started as a show about the relationship between humans and vampires. But over the course of five seasons, the list of supernatural creatures has been steadily expanding. Love it or hate it, there are a lot of supes — and keeping track of them all is becoming increasingly complex. This infographic should help you sort it all out. \n \n The design does a good job of using unique, recognizable illustrations for each type of creature, and then grouping them together for each episode. It’s also very obvious that the episodes have consistently gotten more complicated as the show progressed. \n Credit for the illustrations goes to Ilias Sounas , and thanks to Jess for sending in the link!"], "link": "http://www.coolinfographics.com/blog/2012/10/5/the-supernatural-sprawl-of-true-blood.html", "bloglinks": {}, "links": {"http://www.sounasdesign.com/": 1, "http://thumbnails.netdna-cdn.com/": 1, "http://byjess.net/": 1, "http://visual.ly/": 2}, "blogtitle": "Cool Infographics"}, {"content": ["Designed by Shannon Lattin at S.B. Lattin Design , the Common Cook’s How-Many Guide to Kitchen Conversions is a super-helpful infographic design. Very quickly the reader can lookup to the conversions between many of the most common recipe measurements. \n \n If your kitchen drawers are anything like ours, you never have the right measuring implement for the recipe you’re tackling. Keep this chart on hand, and the next time you find yourself asking “How many…” you’ll know just what to do. \n \n This design is an excellent example of “tell one story really well.” It’s a clear and simple design that is quick and easy for the reader to understand. \n Found on Visual.ly \n Nice job Shannon!"], "link": "http://www.coolinfographics.com/blog/2012/10/3/how-many-guide-to-kitchen-conversions.html", "bloglinks": {}, "links": {"http://sblattindesign.wordpress.com/": 3, "http://visual.ly/": 1}, "blogtitle": "Cool Infographics"}, {"content": ["Honda Accord: 30 Years of American Craftmanship is a large infographic from Honda America that was released as part of the release of the new 2013 model design of the Honda Accord in August. Designed by Jeremy Yingling with InfoNewt (my company) this is a very brand specific, marketing-style infographic. \n \n \n \n \n IN 2012, HONDA WILL MARK 30 YEARS OF ACCORD PRODUCTION IN THE UNITED STATES. \n The first Japanese nameplate manufactured in the U.S., the second-generation Accord first rolled off the Marysville, Ohio assembly line in November of 1982. In the 30 years since, more than nine million U.S.-built 1 Accords have helped define American manufacturing craftsmanship. The all-new 2013 Honda Accord will once again redefine space efficiency and driving joy in the midsize class, signaling the start of Honda’s next three-decade chapter of building the Accord in America. \n \n \n \n \n \n \n \n The 2013 model becomes the ninth major design generation of the Accord. This gave us the opportunity to highlight differences each major model design has brought to the Accord over the last 30 years. The design visualizes the major technical specifications, the major advancements included in the Accord and shows the multi-year periods that each design generation was available. The eye-catching color-waterfall shows the available exterior colors available for every model year, and the milestones along the left-side of the design show the progression to reach a cumulative total over 9 million Accords produced in 2012 coming out of the manufacturing plant in Marysville, OH. \n Honda has done a great job of utilizing this one infographic design in a handful of different ways. The infographic was initially used as 9’ banners at the Honda press events, and included in the press kits provided to everyone invited to attend. Honda has now released the infographic online on the Honda News page on Flickr, making the design available to everyone."], "link": "http://www.coolinfographics.com/blog/2012/10/1/honda-accord-30-years-of-us-production.html", "bloglinks": {}, "links": {"http://infonewt.com/": 1, "http://www.flickr.com/": 3}, "blogtitle": "Cool Infographics"}, {"content": ["Mickey Mouse hasn’t just survived for 80 years, he has thrived. The History of Mickey Mouse infographic from Goin2Travel.com has condensed this famous mouse life style into a highlight timeline. \n \n Mickey Mouse is the most recognizable Disney character on the planet. After more than 80 years of stardom, we thought it would be fun to review the history of this iconic mouse. From humble beginnings during the “roaring twenties”, surviving and even flourishing during the “great depression” right up to the digital age present, he and his fellow, Disney stars, are favorites of children everywhere. \n So whether your planning a visit to Disney World Orlando, or just a fan, sit back, relax, and enjoy this visual history trip through time of Mickey Mouse. \n \n They did a good job of showing the reader actual images and photos of Mickey through the years, and I like the use of Mickey Hands as the arrowheads on the connecting lines. \n The biggest issue is that many of the images are so far away from the correct year along the righthand side, that it’s very hard to follow the connecting lines. You really don’t want images from the 1950s visually placed next to 1970s on the timeline. I would suggest putting the years down the middle and placing the event images on both sides so they can be adjacent to the actual time on the timeline. \n The URL at the bottom should be a link to the original infographic instead of the frontpage of the company site. You want readers to be able to find the original infographic when it’s not correctly linked on the Web."], "link": "http://www.coolinfographics.com/blog/2012/9/28/the-history-of-mickey-mouse.html", "bloglinks": {}, "links": {"http://www.goin2travel.com/": 3}, "blogtitle": "Cool Infographics"}, {"content": ["How Much Does SEO Cost? is generally a mystery in the online marketing world. The range is certainly big, from under $50/month up to the unbelievable price of over $250,000/month! This informative infographic shares the results of custom research from SEOmoz , and was designed by AYTM . \n \n How much does SEO cost? How much time do you have to discuss the various models and prices out there! However, a new survey sheds some light on the subject. \n Over 500 people and companies who offer search engine optimization services were asked about how their models. Turns out, it’s most common to charge $100 to $150 per hour, in the US. But by-the-hour consulting is only one of four nearly co-equal ways of charging. \n Also popular is project-based pricing, where the average price is between $2,500 to $5,000, in the US. That’s also the same average price for those who buy on a monthly retainer basis. Fixed prices on a contract basis is also a popular way that SEO is sold, but no averages were provided. \n The survey was conducted by SEOmoz and compiled into the infographic below by AYTM : \n \n From a design standpoint, there are a lot of things I like about this infographic. \n The consistent columns for regions of the world make the layout very easy to follow. The data is also organized nicely by starting with basic demographic data to provide a foundation to the reader before getting into “The Main Event” - the main research results. \n The data visualizations are fairly simple, and very easy for the reader to understand. I also like the variety of data visualization methods; no one wants to see all bar charts. The color scheme is also simple, which visually implies a certain level of authority. By taking complex data and designing simple visualizations, the design shows the readers that SEOmoz has a clear understanding of the content. \n The actual values are not included in the design, which is disappointing. Since this was custom primary research, I have no way to validate the data visualizations without seeing the data, and that reduces the credibility of the entire design. From a sharing perspective, it’s hard to quote interesting statistics in a text Tweet or Facebook post without having the numbers to work with. \n Legends are Evil! My biggest complaint is their use of legends in a few sections. In those charts, the colors are visually hard to differentiate, and the reader has to work very hard to understand which pie slice or bar goes with each color. This is only a problem in the Agency Type and Common Client Types sections. The rest do a good job of connecting the data labels directly to the visualization. \n The footer should include some type of copyright statement, and the URL for readers to find the original infographic landing page. \n Found on Visual Loop"], "link": "http://www.coolinfographics.com/blog/2012/9/26/how-much-does-seo-cost.html", "bloglinks": {}, "links": {"http://searchengineland.com": 1, "https://aytm.com/": 2, "http://visualoop.tumblr.com/": 1, "http://www.seomoz.org/": 1, "http://searchengineland.com/": 3}, "blogtitle": "Cool Infographics"}]