[{"blogurl": "http://cssanalytics.wordpress.com\n", "blogroll": [], "title": "CSSA"}, {"content": ["Here is a good link to summarize how to calculate various moving averages: \n http://www.metastock.com/Customer/Resources/TAAZ/?c=3&p=74 \n Here is an interesting post showing a comparison of performance of different moving average variants across a number of markets by moving average length. It is worth noting that recency-weighting (wma) tends to perform better on average than the less responsive but smoothed triangular wma. Note that the weighted moving average and triangular moving average are not highly correlated in terms of performance across lookbacks which demonstrates their complementary nature for an adaptive framework: \n http://etfhq.com/blog/2010/10/19/weighted-moving-averages-tests/"], "link": "http://cssanalytics.wordpress.com/2012/10/31/adaptive-frequency-weighted-moving-average-resource-links/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.metastock.com/": 1, "http://etfhq.com/blog": 1}, "blogtitle": "CSSA"}, {"content": ["One of the unique aspects of modelling financial time series  is that recent data is more important than previous data. This is because forecasts need to be made for the next time period, and prices compound in value over time. The other unique aspect of time series data is that there tends to be a combination of random noise and mean-reverting tendencies (especially at shorter frequencies). The researcher often faces a tradeoff between weighting based on recency versus amplifying the noise and mean-reversion that exists at shorter frequencies. This tradeoff is logical, and should be captured explicitly as a function in an adaptive framework (success-weighted) versus back-testing different weighting schemes hindsight. \n Recency is easily captured by a weighted moving average ( wma ). In this scheme, prices are weighted in direct proportion to their recency (the recency rank divided by the sum of recency ranks times the price at time t). This link demonstrates the calculation :  http://www.investopedia.com/articles/technical/060401.asp  . Alternatively,  the best way to eliminate disturbances induced by shorter frequencies is to middle weight the data. That is, we want to give data closest to the middle higher values than more recent data. This is best accomplished using a triangular moving average, which is essentially a moving average of the moving average of the same length. The smoothing induced by a triangular moving average creates maximum weighting on the middle value. The calculation is described here:  http://daytrading.about.com/od/indicators/a/Triangular.htm . \n To keep things consistent, we should use a weighted triangular moving average ( wtma ), which is exactly the same except it uses the weighted moving average versus the simple moving average in the calculation. Thus the Adaptive Frequency Weighted Moving Average can be calculated simply as: \n AFWMA =   w *( wma )+ (1- w )*( twma ) \n where “w” is a constant between 0 and 1 \n The purpose of the AFWMA is to find the optimal balance between recency and avoiding short-term noise. This can be found by solving for “w” to best minimize out of sample error in a forecast format, or to best maximize out of sample sharpe in a trading strategy format. It is a simple and logical way of compressing the value/information content that differs between the weighted and triangular moving averages without resorting to blind optimization (or worse yet the beliefs/opinions of a technical analysis “guru”)."], "link": "http://cssanalytics.wordpress.com/2012/10/30/adaptive-frequency-weighted-moving-average-afwma/", "bloglinks": {}, "links": {"http://daytrading.about.com/": 1, "http://www.investopedia.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "CSSA"}, {"content": ["Here is a spreadsheet that shows the calculation of the Gini Coefficient which is used in calculating the Composite Diversification Indicator (CDI) in the Mincorr Paper. For reference, the Gini is a measure of inequality that is expressed on a scale from 0 to 1.  For a perfectly equal portfolio, the Gini would be zero. For a perfectly concentrated portfolio, the Gini would be 1.  In the CDI, we focus on using the Gini on the asset risk contributions- which is similar to the focus for Equal Risk Contribution (ERC) by Roncalli. ERC is often confused with simpler versions of Risk Parity, it is more sophisticated in that it optimizes to make all risk contributions equal in the portfolio (versus having a fixed equal risk- ie target risk of 10%- for each asset). Below is the spreadsheet to calculate the GINI: \n GINI calculation"], "link": "http://cssanalytics.wordpress.com/2012/10/22/gini-calculation-spreadsheet/", "bloglinks": {}, "links": {"http://cssanalytics.wordpress.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "CSSA"}, {"content": ["This spreadsheet shows the implementation of the Minimum Correlation Algorithm (mincorr). The power function is a new parameter that regulates the weighting in the averaging process toward the most anti-correlated assets. Currently the default is “1″ which is essentially a rank-weighted moving average of pair-wise correlations.  A value of “0″ would imply equal weightings, values lower than 1 would imply a balance between equal and rank weighting, while values higher than 1 would more heavily skew the rank-weighting. More spreadsheets and research will be available soon. \n Minimum Correlation (Mincorr) Spreadsheet"], "link": "http://cssanalytics.wordpress.com/2012/10/16/minimum-correlation-spreadsheet-now-available/", "bloglinks": {}, "links": {"http://cssanalytics.wordpress.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "CSSA"}, {"content": ["We are planning to release some excel worksheets next week showing the implementation of the minimum correlation algorithms and also maximum diversification, minimum variance and risk parity. Michael Kapler from Systematic Investor has worked with me to write the paper, and has written an interesting post on how to implement the algorithm in excel by calling from R . \n He has also written an interesting post comparing the speed of the algorithm versus quadratic programming (mincorr is much faster). We both plan to show some follow up posts on different applications and variations of the algorithm. If you haven’t already added Systematic Investor to your list of blogs to read it is highly recommended for more advanced readers."], "link": "http://cssanalytics.wordpress.com/2012/09/27/minimum-correlation-implementation-in-excel/", "bloglinks": {}, "links": {"http://systematicinvestor.wordpress.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "CSSA"}, {"content": ["This is a draft preview of the Minimum Correlation Algorithm( PDF ) paper. We will be releasing an expanded version soon including new data and analysis as well as a review of the research. Furthermore, we have also planned an SSRN release on a related but larger topic. Please email  mcp@cssanalytics.com  for any questions you have on the content of the paper, and for any questions relating to the R code please contact Michael Kapler at  TheSystematicInvestor@gmail.com . \n \n\n View this document on Scribd"], "link": "http://cssanalytics.wordpress.com/2012/09/21/minimum-correlation-algorithm-paper-release/", "bloglinks": {}, "links": {"http://cssanalytics.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.scribd.com/": 1}, "blogtitle": "CSSA"}, {"content": ["I recently joined a new firm- Flexible Plan Investments - as the Vice President of Economic Research and Strategic Development. Flexible Plan was founded by Jerry Wagner, the co-founder of NAAIM and the creator of the Wagner Award for Active Management . Jerry is a pioneer in the industry for making absolute return strategies widely accessible to investment advisors in separately managed accounts. He has also been a major proponent of strategic diversification: combining a wide variety of uncorrelated strategies that are actively managed to achieve more stable returns across market cycles.  I am excited about the opportunity and  look forward to contributing on the research side. I will be more active on the blog going forward to share a lot of new ideas and directions for quantitative research."], "link": "http://cssanalytics.wordpress.com/2012/09/20/new-position/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "https://www.flexibleplan.com/": 1, "http://www.naaim.org/": 1}, "blogtitle": "CSSA"}, {"content": ["Stay tuned for the release of our forthcoming whitepaper: “The Minimum Correlation Algorithm (MCA): A Practical and Effective Diversification Tool.”  The paper will contain an overview of the algorithm logic as well as a comparison of the  performance and diversification score  of MCA versus Risk Parity, Maximum Diversification, and Minimum Variance. This heuristic algorithm is fast and relatively simple to calculate and can be applied effectively to both asset allocation and also to trading strategies. The complete “R” code for replication will be released in the paper. The scheduled release date is next Thursday."], "link": "http://cssanalytics.wordpress.com/2012/09/12/minimum-correlation-algorithm-mca/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1}, "blogtitle": "CSSA"}, {"content": ["Details here"], "link": "http://cssanalytics.wordpress.com/2012/08/31/naaim-wagner-award-2013-call-for-entries-2/", "bloglinks": {}, "links": {"http://cssanalytics.wordpress.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.naaim.org/": 1}, "blogtitle": "CSSA"}, {"content": ["The National Association of Active Investment Managers (NAAIM) has announced the call for papers in the 2013 Wagner Award paper competition. In its fifth year, the Wagner Award promotes awareness of active investment management techniques and the results of active strategies through the solicitation and publication of research on active management. \n A $10,000 grand prize will be awarded to the best paper that critically looks at how investors might better manage portfolios during market downturns, yet still capitalize on the market’s periods of superior performance. Papers must be of practical significance to practitioners of active investing. \n The competition is open to all investment practitioners, academic faculty and doctoral candidates in the field. The goal of the Wagner Award is to provide academic substantiation of the viability of active management and evidence of the validity of active investing. \n For further details and rules for submission can be found  here."], "link": "http://cssanalytics.wordpress.com/2012/08/29/naaim-wagner-award-2013-call-for-entries/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.prnewswire.com/": 2}, "blogtitle": "CSSA"}]