[{"blogurl": "http://www.rensenieuwenhuis.nl\n", "blogroll": [], "title": "Curving Normality"}, {"content": ["One of my goals while visiting New York, was to experience how PhDs are trained in the US. In addition to doing a PhD myself, I am also the president of the PhD Network of the University of Twente. In ..."], "link": "http://www.rensenieuwenhuis.nl/new-york-the-students/", "bloglinks": {}, "links": {}, "blogtitle": "Curving Normality"}, {"content": ["I just returned to the Netherlands, after having lived in New York for three months. Yesterday I started a short series of 10 blogs about my (academic) experiences. Today: the project I’ve been working on. The premise of my project ..."], "link": "http://www.rensenieuwenhuis.nl/new-york-the-project/", "bloglinks": {}, "links": {}, "blogtitle": "Curving Normality"}, {"content": ["I just returned to the Netherlands, after having lived in New York for three months. I was in New York to do research for my PhD thesis, and to experience academic life in a totally different setting. It was such ..."], "link": "http://www.rensenieuwenhuis.nl/new-york-the-fellowship/", "bloglinks": {}, "links": {}, "blogtitle": "Curving Normality"}, {"content": ["A poster version of my article “Institutional and Demographic Explanations of Women’s Employment in 18 OECD countries, 1975-1999” is now available from my website. Please click this link to get the poster (.PDF, 400Kb). The poster is called: “Combining Motherhood ..."], "link": "http://www.rensenieuwenhuis.nl/poster-institutional-and-demographic-explanations-of-womens-employment/", "bloglinks": {}, "links": {}, "blogtitle": "Curving Normality"}, {"content": ["Influence.ME is an R extension package for R that provides tools for detecting influential data in multilevel regression models. It is developed by Rense Nieuwenhuis (that’s me), Manfred te Grotenhuis, and Ben Pelzer. Recently, a new version (0.9) was uploaded ..."], "link": "http://www.rensenieuwenhuis.nl/influence-me-updated-to-version-0-9/", "bloglinks": {}, "links": {}, "blogtitle": "Curving Normality"}, {"content": ["I just realized that Obama’s chances of being re-elected might be seriously compromised. Not because of any of the policies he did (or did not) implement, but because of polarization of America Public opinion. The New Yorker has a piece ..."], "link": "http://www.rensenieuwenhuis.nl/will-partisan-polarization-get-in-the-way-of-obamas-second-term/", "bloglinks": {}, "links": {}, "blogtitle": "Curving Normality"}, {"content": ["Wow, final day of the WFRN in New York already! Some of my impressions and experiences of this great conference. I attended a session on using social media, a poster session, a round-table conversation on international insights, and so much more."], "link": "http://www.rensenieuwenhuis.nl/attending-the-wfrn-day-3/", "bloglinks": {}, "links": {}, "blogtitle": "Curving Normality"}, {"content": ["Did I mention my first day at the work and family researchers’ network was great? The second day was even more interesting, with a program of thirteen (!!) hours to enjoy. In a session on motherhood in the workplace, Jocelyn ..."], "link": "http://www.rensenieuwenhuis.nl/attending-the-wfrn-day-2/", "bloglinks": {}, "links": {}, "blogtitle": "Curving Normality"}, {"content": ["Today, I attended the first day of the inaugural conference of the Work and Family Researchers Network (WFRN). It was a day full of the most amazing presentations, discussions, and meetings, all focused on topics related to work and family."], "link": "http://www.rensenieuwenhuis.nl/attending-wfrn-day-1/", "bloglinks": {}, "links": {}, "blogtitle": "Curving Normality"}, {"content": ["Being a visiting scholar in New York has it's perks. Next week, I will be attending the Inaugural meeting of the new Work and Family Researchers Network (WFRN). Join me if you can!"], "link": "http://www.rensenieuwenhuis.nl/attending-the-inaugural-meeting-of-the-new-work-and-family-researchers-network/", "bloglinks": {}, "links": {"https://workfamily.upenn.edu/": 1}, "blogtitle": "Curving Normality"}]