[{"blogurl": "http://dailytekk.com\n", "blogroll": [], "title": "DailyTekk"}, {"content": ["If you want to be on top of the latest trends, you can. It’s as simple as that. Most people just don’t know how to effectively harness the best new ideas, services and products. That is what this article is about: identifying and incorporating the latest trends. \n A trend is simply the general direction in which something is developing or changing. Staying current on the latest trends is vital. Why? If you become stagnant you become more and more irrelevant. As I recently wrote , relevance is directly related to trust and trust is the currency of the internet age. \n Really, staying on top of the latest trends is pretty easy–if you know what to look for. It’s not every day that someone will tell you the latest trends in a given topic ( like I did recently in a post titled 100 Must-Know Social Media Tidbits for 2013 ). That’s nice when it happens, but you should take a more proactive and deeper approach to trend spotting. \n First you must identify which industries affect your business or mission (you can learn from any trendsetter whether or not they are in your specific industry or not). Second, you must identify “trend hotspots” or outlets where trends and trendsetters are regularly discovered and discussed and subscribe to their content. Finding these sources is key because they stay on top of the trends for you. You should find and utilize only the top resource so as to not become overwhelmed. Third you must curate (select and organize) the content that you want to make use of. Fourth you must put that content, that knowledge, to use in a way that will make a positive impact on your bottom line. \n 4 Steps to Trend Spotting \n To recap, it takes four steps to stay on top of the latest trends: \n \n Find Innovation – Identify which industries are pumping out ideas that could positively affect your business. \n Follow Innovation – Identify “trend hotspots” or sources that cover specific industry trends and subscribe. \n Focus Innovation – Curate the curators. Weed out the useless info and save/favorite/bookmark the good stuff. \n Fuel Innovation – Assimilate the best new ideas and products into your workflow, marketing, business plan, etc. \n \n Finding the best new products and ideas is relatively simple, as you will see, but sorting through them is the tricky part. Luckily I’ve got you covered. Awhile back I wrote a post titled: The 50+ Best Ways to Curate and Share Your Favorite Social Media and News Content . There are some amazing curation tools there but let me recommend a few of my favorite that you can use as part of the trend curation process: \n Flipboard , as I wrote about awhile back, is an amazing way to absorb information on a smartphone or tablet. It has been out for awhile but this is still the best way I can think of for staying on top of the latest content coming from your favorite blogs. Evernote , which I’ve also covered before , is also an amazing way to organize information. Finally, be sure to check out Faveous , Paper.li , Storify , The Tweeted Times and Keepstream . \n Now let me make things really simple for you. I’ve identified a few industries and “trend hotspots” within those industries that you can simply plug in to your favorite curation software/product/process to stay on top of the latest and best trends and trendsetters. Consider this a starting point. You might have other areas and sources you’d like to add as well (leave a comment to let me know what you would include). \n Design \n Hotspot: Fast Co. Design \n Supplemental: Dribbble Popular , Yanko Design \n  \n Internet \n Hotspot:   Internet Today by LinkedIn \n Supplemental:   Hacker News ,  Robert Scoble \n  \n “Cool” & Culture \n Hotspot:   Cool Hunting \n Supplemental:   Get Addicted To , Trend Hunter \n  \n Technology \n Hotspot: MIT Technology Review \n Supplemental: Gizmag ,  The Verge \n  \n Advertising \n Hotspot:   Adweek \n Supplemental:   Advertising Age ,  Adverblog \n  \n Startups \n Hotspot:   Techcrunch \n Supplemental:   PandoDaily ,  VentureBeat \n  \n Business \n Hotspot: Harvard Business Review \n Supplemental: Inc. , Fortune \n  \n Research \n Hotspot: Futurity.org \n Supplemental: Academia.edu , IBM Research \n  \n Science \n Hotspot: PopSci \n Supplemental: redOrbit , ScienceBlogs \n  \n Education \n Hotspot: MindShift \n Supplemental:   EdSurge , Edutopia \n  \n Post Notes \n Featured image “ Tablet Takeover ” Infographic via Visually ."], "link": "http://feedproxy.google.com/~r/Dailytekk/~3/5pRfl9XERYw/", "bloglinks": {}, "links": {"http://www.adweek.com/": 1, "http://www.inc.com": 1, "http://visual.ly": 1, "http://hbr.org/": 1, "http://news.ycombinator.com/": 1, "http://www.theverge.com": 1, "http://www.technologyreview.com": 1, "http://www.redorbit.com": 1, "http://visual.ly/": 2, "http://blogs.kqed.org/": 1, "http://www.techcrunch.com/": 1, "http://www.flipboard.com": 1, "http://www.coolhunting.com/": 1, "http://storify.com/": 1, "http://www.coolhunting.com": 1, "http://www.evernote.com": 1, "http://www.gizmag.com/": 1, "http://www.yankodesign.com": 1, "http://dailytekk.com/": 5, "http://www.adweek.com": 1, "http://pandodaily.com": 1, "http://www.Futurity.org": 1, "http://keepstream.com/": 1, "http://www.fastcodesign.com": 1, "http://news.ycombinator.com": 1, "https://www.edsurge.com/": 1, "http://dribbble.com/": 2, "http://www.getaddictedto.com": 1, "http://www.futurity.org/": 1, "http://www.edutopia.org": 1, "http://www.techcrunch.com": 1, "http://paper.li/": 1, "http://www.linkedin.com/": 1, "http://www.faveous.com/": 1, "http://money.cnn.com/": 1, "http://scienceblogs.com": 1, "http://scobleizer.com": 1, "https://www.edsurge.com": 1, "http://www.academia.edu": 1, "http://venturebeat.com": 1, "http://www.adverblog.com": 1, "http://adage.com": 1, "http://tweetedtimes.com/": 1, "http://ibmresearchnews.blogspot.com": 1, "http://www.popsci.com/": 1, "http://www.gizmag.com": 1, "http://www.trendhunter.com": 1, "http://hbr.org": 1, "http://www.popsci.com": 1}, "blogtitle": "DailyTekk"}, {"content": ["Innovators. They come in many forms. They dream big but they aren’t just dreamers. They form raw ideas into cool products with disruptive business models. They shatter entire industries and leave established leviathans running scared with their tails between their legs. The  Innovators  interview series connects you with the most driven people on the planet. What makes them tick? What advice do they have for tech founders? What tools do they use to get the job done? Read on to find out. \n Mike Fridgen is the President & CEO of Decide.com , the shopping service that utilizes big data to help shoppers know what to buy and when to buy it. Prior to Decide, he served as Vice President of Marketing & Product Development at Farecast.com , which was acquired by Microsoft in 2008. At Microsoft, Mike led product management for Bing Travel and Bing Shopping . In the late 90s, he was co-founder and CEO of TripHub.com, a venture backed online travel start-up. Mike has a MBA from Harvard Business School and BA from University of Washington. \n What do you enjoy most about your work and why? \n Our mission and team. Decide’s mission is to use technology to fight for consumers and level the playing field. Retailers use sophisticated algorithms to change product prices intra-day. At Decide, we predict WHEN TO BUY so consumes get the lowest price and buy with confidence. Another problem facing consumers is information overload, at Decide we show you just the top rated products by recommending WHAT TO BUY based on technology applied to millions of expert and user reviews. \n Our team of 30 technologists, designers, and product managers are passionate about our mission and we genuinely enjoy being around each other. Our 5 values are: Science, not Marketing, The Best Ideas Win, Ping Pong is a Sport, Consumers Deserve a Level Playing Field, and Be Bold and Move Fast. \n Where does your passion come from? What drives you, inspires you, excites you? \n I am inspired by the tech innovation from so many amazing entrepreneurs all over the country – their courage, tenacity and spirit. I feel grateful to work with people of that same mold, who put their heart and soul into making great products and improving the world. \n Someone reading this wants to start a tech company. What’s your best advice for them? \n There has never been a better time to start a company. Don’t listen to people who say it’s all been done. The world is changing all around us – social, mobile, the cloud, big data – and there are massive opportunities right now to have an impact and make people’s lives better. Go for it. \n What are a few tech startups that you’re really excited about right now and why? \n Uber – love how it adds a little luxury (at a similar price to a cab) and simplifies the experience (transaction, etc.). Also, mobile payment apps – jury is out, but excited for this transformation and opportunity. \n What tech tools (websites, apps, gadgets, etc.) do you rely on both for work and in your down time? \n Apps I use a lot: Flipboard , AlaskaAir (flight out of SEA a lot), Golfshot GPS , TED , Uber, Animoto , and Decide.com (of course). A gadget I want: Sony Alpha NEX-5RK (killer new mirrorless camera from Sony)."], "link": "http://feedproxy.google.com/~r/Dailytekk/~3/M8qIQQiegkE/", "bloglinks": {}, "links": {"http://dailytekk.com/": 1, "https://twitter.com/": 1, "http://golfshot.com/": 1, "https://www.uber.com/": 1, "http://www.bing.com/": 3, "http://www.alaskaair.com/": 1, "http://flipboard.com/": 1, "https://www.decide.com/": 1, "http://animoto.com/": 1, "http://www.ted.com/": 1}, "blogtitle": "DailyTekk"}, {"content": ["I spent the weekend overdosing on TED talks and came away inspired to contribute an idea worth spreading myself. Recently I’ve been focusing on ways to develop a relevant content strategy and one piece of the puzzle is audience awareness–obviously. But knowing your audience and effectively engaging with them are two entirely separate things. So, my big idea was the illustration you’ll find below which is meant to help people better understand how to effectively target specific audiences. \n Before getting too deep, take note of this syllogistic paragraph as it puts everything into perspective for you: Be more relevant and your target audience will spend more time with your brand. The more time people spend with your brand the more engaged they become. Exposure and engagement build trust. Trust is brand currency. Therefore, relevance affects trust levels. The more people trust you, the more likely they are to buy into your message. \n This chart turns that paragraph into an actual graph: \n \n Audience Awareness Factors \n People (represented here by arrows) fit into groups aka audiences. When dealing with these groups of people, there are all these different factors that determine what person fits into what audience. Things like: \n \n Age \n Gender \n Expectations \n Interests \n Culture \n Habits \n Needs \n Style \n \n \n There are probably many more, but these are depicted in the chart above as the gray pyramid shape in the top of the circle. When you are designing a solution for reaching your target market you must account for these factors. They are targets to be aimed at. The more audience awareness factors you hit, the better your changes of striking a bullseye. If you are really firing on all cylinders, your content strategy will be represented by the perfectly vertical arrow labeled 8. Obviously, the more targets you git, the better. \n Brand Exposure and Trust \n The bottom half of the circle represents time (exposure) a person spends with your brand AND the trust they build up as a result. They go hand in hand in my estimation. You’ll notice that some arrows bisecting the bottom half spend more time in certain colored areas (red=low, blue=medium, green=high) than others. More exposure means more trust. It’s as simple as that. It’s one reason why you are more likely to take your friend’s “word for it” than a strangers. It is why Facebook and myriad brands want you to make product recommendations and endorsements for your friends to see. \n Relevancy vs Engagement \n This is the good stuff where everything comes together. The “angle of relevancy” correlates directly to a person’s level of engagement. This means that depending on the angle of approach you take to reach your audience you will hit a number of different audience awareness factors. The more the merrier. Shoot straight and you’ll hit as many as possible. Come in from a side angle and you may only hit 2 or 3. \n Take Action \n To get the best possible response from your audience, it will be important to try to hit at least HALF of the identifiable audience awareness targets. But don’t worry if you don’t achieve this on your very first attempt. Why? Each interaction with your brand, even on a lower level, will function as an advertisement. It’s a relationship building exercise. When it comes time for them to make a purchasing decision, for example, who are they going to go with? A brand they are familiar with or a “cold caller” so to speak? \n Here’s what you need to do to to become relevant to your target audience and build a long-term relationship built on trust and engagement: \n \n Identify key targets (expectations, interests, habits, style, etc.) you can aim for in order to reach your ideal audience. \n Based on these attributes, create content that will “fire on all cylinders.” \n Don’t stop there. Continue tweaking your strategy by adding new targets as they become important. \n Pursue a relationship of trust with your customers. It will pay off–big time. \n \n What do you think? Do you have anything to add?"], "link": "http://feedproxy.google.com/~r/Dailytekk/~3/LTb3YujdFF0/", "bloglinks": {}, "links": {}, "blogtitle": "DailyTekk"}, {"content": ["Innovators. They come in many forms. They dream big but they aren’t just dreamers. They form raw ideas into cool products with disruptive business models. They shatter entire industries and leave established leviathans running scared with their tails between their legs. The  Innovators  interview series connects you with the most driven people on the planet. What makes them tick? What advice do they have for tech founders? What tools do they use to get the job done? Read on to find out. \n Throughout his 27 year Hollywood career, Mark Wolfe has been a Producer or Executive on over 100 films, including such acclaimed and successful movies as Terminator 3, Kinsey, I♥Huckabees, and K-19: The Widowmaker. Shepherding over $1 Billion worth of movie projects through Hollywood, Mark managed to lose only one of the two things he attempted to maintain throughout his career: his sanity and his sense of humor. Having been all over the world making films, worked with some of the greatest actors, writers and directors, and watched a film he produced World Premiere from the Tsar of Russia’s private box in St. Petersburg, Wolfe has proven that film school was actually a good idea and is glad he didn’t try medical school after all. Mark produced two films in which LeVar Burton either directed or starred, leading to a friendship and business partnership in Burton/Wolfe Entertainment , a company founded on the principles of “doing well by doing good.” With Burton/Wolfe’s creation of RRKidz and the acquisition of Reading Rainbow, Wolfe now finds himself shuttling between LA and San Francisco pretending to understand technology despite his inability to successfully utilize a pencil sharpener. \n What do you enjoy most about your work and why? \n Right now, all over the world, thousands, perhaps hundreds of thousands of people are enjoying some movie, TV show or project that I am responsible for. The knowledge that the work we do in Hollywood can entertain, enlighten and educate strangers I will never meet makes it all worthwhile. With Reading Rainbow and RRKIDZ, hearing our customers tell us how their children, never readers before, suddenly embrace and look forward to the stories we are telling makes “work” a true pleasure. Starting with nothing but an idea and a blank whiteboard and a year or so later seeing it become reality in homes all over the world, that’s the most enjoyable part of what I do. \n Where does your passion come from? What drives you, inspires you, excites you? \n Storytelling, whether professionally or just hanging with friends and talking, I am in love with stories. When you combine that passion with the ability through media to have your story heard, that’s what excites me. \n Someone reading this wants to start a tech company. What’s your best advice for them? \n Don’t : ) However if they still want to, my advice is the same advice as for someone wanting to start any business or create any product: know your audience… your consumer. What do they want and why is that thing you are making going to be something they want? If you create just for yourself, you run the risk of making something amazing that no one will ever see. Specifically for tech, I encourage everyone to make sure you combine in your senior management very tech savvy people with very product savvy people. One without the other is a recipe for failure. When my business partner LeVar Burton and I spoke to people in the Silicon Valley early on in RRKIDZ life, we heard a similar story. Many savvy people can create great tech but don’t have strengths in user experience, whereas Hollywood is all about user experience but often doesn’t spend enough time understanding the technology side. Combine the two: Tech and UX. \n What are a few tech startups that you’re really excited about right now and why? \n Ours and any others that are trying to bring education to children. Games are awesome and fun is an imperative part of human existence, but there are a million apps and companies out there making games. LeVar says “All technology is educational; the question is,  what are we teaching? ” I believe in that. Exciting start ups are the ones that help children learn and engage as well as be entertained. \n What tech tools (websites, apps, gadgets, etc.) do you rely on both for work and in your down time? \n My iPad is my portable life, both at work and at home and on the road. Its all in one – entertainment, productive, and practical. And MAPS of any kind. Without navigation programs and tools, I would be still looking for the Hollywood Sign somewhere driving through Atlanta. I use Pandora all the time for music everywhere. And Google . With Google, I can ask any question ever imagined and find out the answer instantly… how amazing is that? To have the sum of all human knowledge at your fingertips literally?"], "link": "http://feedproxy.google.com/~r/Dailytekk/~3/rC7mdL_NiLQ/", "bloglinks": {}, "links": {"http://dailytekk.com/": 1, "https://twitter.com/": 2, "http://www.pandora.com/": 1, "http://www.rrkidz.com/": 1, "https://www.google.com/": 1, "http://burtonwolfeentertainment.com/": 1}, "blogtitle": "DailyTekk"}, {"content": ["Want to vote smarter? Now you can. Voting hasn’t changed all that much since our country began hundreds of years ago. Now, thanks to technology, you can check the facts, find politicians whose values most closely align with yours, see which of your friends are registered to vote (or not) and analyze whose receiving the most buzz on Twitter. This is the year of the mobile election (infographic)  and you better believe technology is going to help shape the outcome of this election in a very big way. Last election, people marveled at Barack Obama’s social media strategy. Now, every politician must dedicate resources to social media or be left behind. Along those same lines, it is now easier than ever to follow the issues that matter most to you, get the latest news and analysis and make a truly informed decision. This is  your election. Make your vote count. \n GovTrack.us \n Keep tabs on your representatives in Congress or to research pending legislation that might impact your life or business. \n  \n ElectNext \n Helps you support your important issues where it matters most. \n  \n New York Times: Politics \n News, opinion, tools and multimedia on politics and government. \n  \n Politico: 2012 Live \n Campaign news, polls, results, debates & candidates. \n  \n Ruck.us \n Determine your political DNA and join politically like-minded people. \n  \n FactCheck.org \n Monitors the factual accuracy of what is said by major U.S. political players. \n  \n Project Vote Smart \n Non-partisan information on U.S. federal and state candidates, ballot measures, issues and legislation. \n  \n The Fact Checker (Washington Post) \n Checking the truth behind the political rhetoric. \n  \n OpenCongress \n News and official government data to track bills, votes, senators and representatives in the U.S. Congress. \n  \n OpenSecrets.org \n A resource for federal campaign contributions, lobbying data and analysis available anywhere. \n  \n THOMAS (Library of Congress) \n Provides several options for finding bills, resolutions, and legislative information. \n  \n The Hill \n Covering congress, politics, political campaigns and capitol hill. \n  \n OhMyGov Media Analytics \n Dig into the influential social conversations making news and impacting policy. \n  \n ReConstitution 2012 \n A real-time, interactive web app that deconstructs the dialogue unfolding on your screen. \n  \n Votizen \n Find out which of your friends are voters and win their votes for your candidates. \n  PollTracker \n Live feed of incoming political poll data. \n  CrowdHall \n A living townhall hosted by anyone and moderated by everyone. \n  \n Whistlestop \n Track how your candidates are performing and to mobilize your friends to support candidates using social media. \n  \n VoterTide \n Be the first to know when online buzz is building, news is breaking and who is talking. \n  \n RealClearPolitics \n News, political opinion and commentary, and the political issues of the day. \n  \n VoteNav.com \n Providing factual awareness in an interactive and informative environment. \n  \n Twitter Political Index \n A daily measurement of Twitter users’ feelings towards the candidates. \n  \n Ballotpedia \n An interactive almanac of state politics. \n  \n VoterHub \n Lets voters easily research the issues, locate their nearest polling place and get up-to-the-minute election information. \n  \n CNN Candidate Match Game \n Find out which candidate you agree with most on the key issues of the day. \n  \n Is Barack Obama the President? \n A ‘yes’ or ‘no’ answer in response to recent polls. \n  \n Political Humor \n Political humor and political cartoons, updated daily with jokes, cartoons, satire, videos, and funny news. \n  \n Aristotle \n Delivers smarter technology, software, micro-targeting data and expertise to political campaigns."], "link": "http://feedproxy.google.com/~r/Dailytekk/~3/QNuVaLU-W0g/", "bloglinks": {}, "links": {"http://mashable.com/": 1, "http://www.govtrack.us/": 2, "https://electnext.com/": 2, "http://mediamonitoring.ohmygov.com/": 2, "http://recon12.com/": 2, "https://www.votizen.com/": 2, "https://election.twitter.com/": 2, "http://www.opencongress.org/": 2, "http://votesmart.org/": 2, "http://www.washingtonpost.com/blog": 2, "http://www.usatoday.com/": 2, "http://ballotpedia.org/": 2, "http://www.realclearpolitics.com/": 2, "http://www.nytimes.com/": 2, "http://www.aristotle.com/": 2, "http://www.whistlestop.com/": 2, "http://crowdhall.com/": 2, "http://voterhub.us/": 2, "http://votenav.com/": 2, "http://thehill.com/": 2, "http://www.ruck.us/": 2, "http://thomas.loc.gov/": 2, "http://www.politico.com/": 2, "http://polltracker.talkingpointsmemo.com/": 2, "http://www.isbarackobamathepresident.com/": 2, "http://factcheck.org/": 2, "http://www.votertide.com/": 2, "http://www.opensecrets.org/": 2, "http://politicalhumor.about.com/": 2}, "blogtitle": "DailyTekk"}, {"content": ["Here’s your chance to get in on the social media revolution in it’s most current form and guess what? These bite-size tidbits will get you informed without taking up much of your time (but there is plenty to dig into if you want to get deeper). This post has it all: from emerging networks to trends to stats and all points in between. Prepare to be informed. \n     This post is #27 in DailyTekk’s famous  Top 100  series which explores the best startups, gadgets, apps, websites and services in a given category. Total items listed: 113. Time to compile: 13+ hours. Follow  @DailyTekk  on Twitter to make sure you don’t miss a week!     \n As the dawn of 2013 approaches, what do you need to know about social media in the upcoming year? If you’ve been out-of-touch for awhile or have simply set your social media skills on cruise control, here’s your chance to play catch-up real quick. Like many posts I create on this blog, I made this one for me as much as for you because I wanted to make sure I was as current as possible on this important subject. I’ve included information from as many different sources as possible to assure variety and depth (including from DailyTekk–see the last section for some amazing resources). While I can’t promise that you will magically become a social media expert after reading this, I can say you will have a good shot at at least sounding intelligent when talking about social media. Please leave your comments and recommendations if I missed something you think should be on this list. \n 10 ‘Other’ Social Networks to Be Familiar With \n \n \n Path – Stay connected with family and close friends. \n Tout – Create 15 second video updates on your phone. \n Airtime – The platform for great video conversation. \n App.net – A real-time social feed without the ads. \n OurSpot – Rediscover relationships. \n Sonar – Connect and share with the people nearby now. \n Highlight – A fun way to learn more about people nearby. \n Pair – An app for couples. \n Nextdoor – The private social network for your neighborhood. \n Roamz – Reveal nearby interestingness. \n \n Things You Need to Know \n \n \n Checking your social media accounts is as addictive as nicotine or sex. More on ConsumerAffairs . \n Women’s Facebook recommendations spur more likes from men. More on  Businessweek . \n Promoting companies on Twitter or Facebook may ruin your friendships.  More  on  Business Insider . \n It is possible to use Instagram to promote your business! More on We Are Social People . \n Being friends with your client on Facebook works. More on PSFK . \n Young women are ‘power users’ on social media sites. More on CNN . \n Facebook and Twitter refer more than half of all traffic to small biz sites.  More  on The Atlantic . \n Tweens are influential and already know more about tech than you ever will. More on Adweek . \n Web content needs to be changed for optimized viewing on handheld devices. More on Upstart Biz Journal . \n Social media can make employment and recruiting better (in 5 specific areas).  More  on  HuffPo . \n \n \n Social Media Trends \n \n \n Teens are turning from Facebook to fresher social media sites. More on USA Today . \n YouTube now ranking videos by time watched, not clicks. More on CNET . \n “Agile Creativity” – Agencies are becoming more nimble on social media.  More  on  Forbes . \n The web is being reorganized around people. More on Simply Zesty . \n “Facebook Refugees” – Not everyone is on the world’s biggest social network. More on Washington Post . \n “Visual social media” is on the rise–big time. More on Fast Company . \n Digital ad report finds big growth in mobile.  More  on  NYTimes.com . \n Facebook is the new resume.  More  on  Big Think . \n This year’s college freshman are addicted to “electronic narcotics.”  More on Today . \n Crowdsourcing is the future of news. More on GigaOm . \n \n \n Examples of Creative Use of Social Media \n \n \n MTV’s multi-platform Video Music Awards experience. More on The Hollywood Reporter . \n These 10 brands came up with stellar ideas to promote their biz on Instagram.  More  on  Social Media Examiner . \n How a book-burning hoax Facebook campaign saved a library. More on Score . \n How gamification helped Patagonia plant real trees. More on The Next Web . \n Project Runway turns to Pinterest and other visual social networks. More on Ad Age . \n A mysterious web game that lures viewers to Tom Hanks show. More on ClickZ . \n Duran Duran uses social media to keep fans hooked.  More  on  Christian Science Monitor . \n Whole Foods tries a tweet-to-give and a pin-to-give program. More on MediaPost . \n See how Pathfinder International uses social media to engage donors.  More  on  John Hayden . \n 5 truly creative uses of social media by brands such as Intel and Heineken.   More  on  Search Engine Land . \n \n \n \n Social Media Strategy & How-To \n \n \n Never, ever start a social media marketing campaign on a Friday.  More  on  VentureBeat . \n Senior leaders can harness social media to shape consumer decision making.  More  on  McKinsey Quarterly . \n If done wrong, social media marketing will actually hurt your business.  More  on  MarketingProfs . \n There are 6 key management issues to include within all social media strategies. More on Smart Insights . \n Businesses can enhance relationships with customers through online brand communities.  More  on  MIT Sloan Review . \n Sticking your head in the sand, AKA “ostrich marketing,” is not a social media strategy. More on Social Media Explorer . \n You need to find a way to get interactive and give people a unique online experience. More on Social Fresh . \n As cool as infographics are, they aren’t a social media strategy.  More  on  Brian Solis . \n Create your own library of resources and document your internal success stories. More on Rohit Bhargava . \n 4 proven strategies for finding a bigger audience for your content. More on Copyblogger . \n 10 social media tips from a top media agency. More on Mashable . \n 6 steps to incorporate into your social media routine. More on Social Media Today . \n 10 Tips for Building for Building a Social Media Strategy. More on BusinessNewsDaily.com . \n How to find time to keep up with social media. More on Communications Conversations. \n \n \n \n \n Avoid These Mistakes \n \n \n Kenneth Cole tweeted a hurtful joke. Don’t. Do. That. More on Hubspot . \n Don’t be so pathetic that you have to ask for retweets (+ 4 other mistakes). More on Digiday . \n Don’t forget about leads; include an effective call to action. More on Treehouse . \n Don’t check into Foursquare all the time everywhere you go. More on Gizmodo . \n Have a social media policy in your office. If you don’t, you’ll regret it. More on Miami Herald . \n Don’t send snarky replies like a Nestle employee did to Greenpeace. More on MDG Advertising . \n Don’t tweet about something you don’t know (like Ashton Kutcher). More on Technorati . \n The NFL failed a major social media test. More on PandoDaily . \n Shouting in CAPS will not get your more attention. It will annoy people. More on Jeff Bullas . \n Romney stands with ‘Amercia’ in misspelled campaign app. More on MSN Now . \n Steer clear of the obnoxious social media handshake. More on Business 2 Community . \n \n \n A Few Interesting Social Media Stats \n \n \n 75% of business owners have been ”put off” by another company’s use of social media. More from The Guardian . \n Every minute, Twitter users send over 100,000 tweets.  More  on  DOMO . \n 22% of all Pinterest “Pins” come from New York.  More  on  MediaPost . \n 95% of Facebook wall posts are not answered by brands.  More  on  Mindjumpers . \n Just 27% of small businesses are harnessing the power of social media.  More  on  Marketing Magazine . \n Only 50% of Facebook users have more than 100 friends.  More  on  Schools.com . \n A new user joins Instagram every second.  More  on  Digital Buzz Blog . \n Only 25% of companies offer employees social media training.  More  on  Marketingeasy . \n Just 35% of LinkedIn users access the service daily.  More  on  SocialTimes . \n Mobile now accounts for 10% of internet usage worldwide (double 2010).  More  on  The Next Web . \n Only 16% of social media marketers have more than 3 years of experience.  More  on  Go-Globe.com . \n \n \n Great Blogs Dedicated to Social Media \n \n \n Social Times  - Your social media source. \n Social Media Explorer – Get educated about social media. \n Social Media Today  - Social media news, strategy, tools and techniques. \n Social Media Examiner – Social media marketing how-to, case-studies, research, news etc. \n Hubspot – Internet marketing. \n Inside Facebook – Tracking Facebook and the Facebook platform for developers and marketers. \n SocialMouths – Social media advice for entrepreneurs. \n We Are Social People – Expert articles about social media. \n Social Fresh – The business of social media. \n Social Media B2B – Exploring the impact of social media on B2B companies. \n \n \n Random & Cool Social Media Info \n \n \n The Newsweek Daily Beast Digital Power Index \n A social media cost-benefit analysis. More from Heidi Cohen . \n Social Pros Podcast – Real people doing real work in social media. \n Universities are failing at teaching social media.  More  from  Fortune . \n College students need social media business tools and courses to succeed.  More  on  SmartBlog on Leadership . \n The fanciest collaboration software doesn’t matter if the team can’t work together. More on MediaShift . \n How technology has changed since the year 1982. More on Now I Know . \n Social media is threatening Hallmark and the greeting card business. More on RepublicanAmerican . \n New Orleans used social media to prepare for Hurricane Isaac. More on Ragan.com . \n \n Social Media Tools and Resources from DailyTekk \n \n \n The Top 100 Twitter Tools of 2012 (Categorized) \n The 50+ Best Ways to Curate and Share Your Favorite Social Media and News Content \n 100+ Professional Social Media Business Tools for Brands and Marketers \n 7 Scorching-Hot Social Media Trends Happening Right Now \n The 100 Best, Most Interesting Blogs and Websites of 2012 (Categorized) \n How NOT to Handle Your Company’s Social Media \n Blogging Basics for Beginners (Plus Tons of Resources) \n Is Google+ Here to Stay? \n Is App.net Going to Kill Twitter? \n How to Create a Wildly Successful Blog in Just 6 Months \n Is Facebook’s Future Bright or Dismal? \n 100 Useful Blogging Tools \n 5 Awesome Ways to Tame Your Social Media Feeds \n 10 Powerful Social Media Monitoring Tools \n 10 Affordable Social Media Tools for Small Businesses \n Want More Twitter Followers? Quit Trying to Bribe People \n A Successful Experiment with the AddThis Button (Screenshot) \n 100 Top Tech Twitter Accounts of 2012 (Categorized)"], "link": "http://feedproxy.google.com/~r/Dailytekk/~3/XeJeo6rIGcI/", "bloglinks": {}, "links": {"http://www.miamiherald.com/": 1, "http://www.rep-am.com/": 2, "http://www.forbes.com/": 1, "http://www.fastcompany.com/": 2, "http://www.theatlantic.com/": 1, "http://now.msn.com/": 1, "http://news.cnet.com/": 1, "http://www.digitalbuzzblog.com/": 1, "http://marketingeasy.net/": 1, "https://join.app.net/": 1, "http://tech.cnn.com/": 1, "https://nextdoor.com/": 1, "http://blog.score.org/": 1, "http://www.washingtonpost.com/": 1, "http://www.domo.com/blog": 1, "http://upstart.bizjournals.com/": 1, "http://gigaom.com/": 1, "http://highlig.ht/": 1, "http://nowiknow.com/": 1, "http://www.ragan.com/": 1, "http://www.socialmediaexplorer.com/": 2, "http://www.businessinsider.com/": 1, "http://www.mediapost.com/": 2, "http://www.roamz.com/": 1, "http://www.com.au/": 1, "http://www.tout.com/": 1, "http://wearesocialpeople.com/": 2, "http://www.mckinseyquarterly.com/": 1, "https://path.com/": 1, "http://trypair.com/": 1, "http://dailytekk.com/": 19, "http://www.sonar.me/": 1, "http://sloanreview.mit.edu/": 1, "http://mashable.com/": 1, "http://blog.hubspot.com/": 1, "https://www.airtime.com/": 1, "http://smartblogs.com/": 1, "http://www.businessnewsdaily.com/": 1, "http://socialtimes.com/": 2, "http://heidicohen.com/": 1, "http://articles.cnn.com/": 1, "http://gizmodo.com/": 1, "http://mediadecoder.nytimes.com/": 1, "http://blog.hubspot.com/blog": 1, "http://socialmediatoday.com/": 2, "http://www.businessweek.com/": 1, "http://www.csmonitor.com/": 1, "http://adage.com/": 1, "http://socialfresh.com/": 2, "http://www.pbs.org/": 1, "http://pandodaily.com/": 1, "http://www.marketingprofs.com/": 1, "http://www.simplyzesty.com/": 1, "http://www.schools.com/": 1, "http://thenextweb.com/": 2, "http://www.copyblogger.com/": 1, "http://www.adweek.com/": 1, "http://www.digiday.com/": 1, "http://www.consumeraffairs.com/": 1, "http://www.socialmediaexaminer.com/": 2, "http://usatoday30.usatoday.com/": 1, "http://socialmediab2b.com/": 1, "http://www.thedailybeast.com/": 1, "http://www.co.uk/": 1, "http://www.insidefacebook.com/": 1, "http://socialmouths.com/blog": 1, "http://www.rohitbhargava.com/": 1, "http://www.psfk.com/": 1, "http://www.mindjumpers.com/blog": 1, "http://www.ourspot.com/": 1, "http://www.hollywoodreporter.com/": 1, "http://www.convinceandconvert.com/": 1, "http://searchengineland.com/": 1, "http://www.business2community.com/": 1, "http://www.clickz.com/": 1, "http://www.go-globe.com/blog": 1, "http://www.twitter.com/": 1, "http://technorati.com/": 1, "http://www.smartinsights.com/": 1, "http://www.mdgadvertising.com/blog": 1, "http://www.briansolis.com/": 1, "http://today.msn.com/": 1, "http://blog.teamtreehouse.com/": 1, "http://venturebeat.com/": 1, "http://www.jeffbullas.com/": 1, "http://bigthink.com/": 1, "http://www.johnhaydon.com/": 1, "http://www.arikhanson.com/": 1}, "blogtitle": "DailyTekk"}, {"content": ["I’m beginning to find out that if you want to make things happen in your life, you have to be the one to initiate change. Good change, that is, because you really have no control over bad change. You can’t just sit and wait for life to happen to you and expect to wind up with a promotion or a job your more passionate about. \n Example: I recently came up with a killer idea, shared it with my boss who shared it with his bosses boss who is the head of our organization in North America. Now my boss and I have a meeting at the North American headquarters to see if the idea will get funded. I’m excited because I am passionate about the work that could be done (by me and others) if the idea gets the green light. It is what I want to do with my life and I am pursuing it. \n If I had never spoken up and shared this idea (which really has nothing to do with my current position) with my boss I would never even have the chance to follow my true passion. \n Are you missing out on following your passion? What can you do to create the change you want to see?"], "link": "http://feedproxy.google.com/~r/Dailytekk/~3/2J9o25zmDT0/", "bloglinks": {}, "links": {}, "blogtitle": "DailyTekk"}, {"content": ["There is a reason why some people are more successful than others. Actually, there are many reasons, but I’m convinced that one of them is this: people don’t want to do hard things, as a general rule, so the few that are willing/able/unafraid to endure a bit of hardship are the ones who are going to come out looking like they accomplished something. Respect, money and even fame are most likely going to follow to some degree. \n Take Bear Grylls for example. You don’t want to eat nasty insects and drink your own urine for the enjoyment of millions of viewers. You probably wouldn’t even want to go through the special forces training he had to endure before he ever made it on TV. But he did it and look what it got him. \n Do you see what I mean? You’ve got to be willing to do something other people aren’t in order to get ahead. This could take many forms. The classic example is being an entrepreneur and trading in the safety of a steady job for the uncertainty of fledging a new company that may or may not make it in the end. It may look like taking more initiative with your boss or learning how to speak up. It could look like starting a blog that nobody reads for 6 months but being sticking with it till it finds an audience. Patience, persistence, the ability to envision the future, optimism and a higher pain tolerance are all hallmarks of successful people. \n Many people have given up on doing something respectable to gain attention and they do something terrible that nobody else is willing to do (like give up their dignity by dressing skimpy to sell music). Some people aren’t willing to trample others underfoot to climb to the top. Either way, doing something that hurts you or someone else is not the way to go. \n If you are tired of the same old routine in your life or if you have big dreams you want to accomplish, you can’t be afraid to give up a bit of comfort for the short term in order to gain something better for yourself in the long term. It’s not for everybody… that’s why some people are more successful than others. \n What do you think?"], "link": "http://feedproxy.google.com/~r/Dailytekk/~3/XPdV0MoxSas/", "bloglinks": {}, "links": {"http://dailytekk.com/": 1, "http://www.beargrylls.com/": 1}, "blogtitle": "DailyTekk"}, {"content": ["You’re about to feast your lucky eyes on 20 of the most fun, unique, cool and, of course, useful iPad accessories the world has ever known. There’s a slight chance that you’ve seen one or two of these before, but chances are they are all brand new to you. From the usual stands and cases to the less common remote-controlled spy robot and all accessories in-between, you are bound to find a few new must haves for your favorite tablet device. Which one is your favorite? \n FridgePad \n  \n HEX code folio \n  \n Hand Dock \n  \n Steelie Hobknob Kit \n  \n Scribbly Marker Pen \n \n  \n GIZMON iCA CPL Filter \n  \n TASCAM Portastudio \n  \n  polyply \n  \n iLog \n  \n iCoverSkin Gold \n  \n Elephant Sleeve \n  \n Rover App-Controlled Spy Tank with Night Vision \n  \n Amplifiear \n  \n Movie Mount \n  \n ‘The Giving Tree’ Decal \n  \n MagConnect Tournez Mount \n  \n Natural Wood Dock \n  \n The Sheffield Case \n  \n Chevron Sleeve \n  \n  CROSSDOCK media rack"], "link": "http://feedproxy.google.com/~r/Dailytekk/~3/NJ0GSm8Muk4/", "bloglinks": {}, "links": {"http://gizmon.com/": 1, "http://www.areaware.com/": 1, "http://www.minimallyminimal.com/": 1, "https://icoverskin.com/": 1, "http://tascam.com/": 1, "https://www.functionals.eu/": 1, "http://www.thejoyfactory.com/": 1, "http://www.brookstone.com/": 1, "http://www.kickstarter.com/": 1, "http://www.woodforddesign.com/": 1, "http://www.etsy.com/": 4, "http://www.steelie.com/": 1, "http://bitemyapple.myshopify.com/": 1, "http://www.co.uk/": 1, "http://www.notonthehighstreet.com/": 1, "http://www.shophex.com/": 1, "http://www.makayama.com/": 1}, "blogtitle": "DailyTekk"}, {"content": ["Quick, somebody call the doctor cause my social media skills are siiiiick!  Depending on your generation, you’ll either view that as a good thing or bad thing. I happen to mean it in the Adam-Sandler-thinks-he-got-a-free-Ferrari way (see Bedtime Stories for more information). Your social media skills, on the other hand, may just be plain ol’ sick–diseased, unwell, ailing. Here, let’s do a quick test to determine which type of sickness you have: Do you understand the basic difference between being on social media and doing something on social media?  If so; siiiiiick!  If not; just sick. If you fall into the latter category, consider this post your social media-cine. \n Bottom line? If you are looking for a way to shine on social media, to go above and beyond, to completely outdo your competition and to have a chance at making a real dent in the online universe (and maybe even the rest of the universe as well), this post is for you. If nothing else, you’ll come away with a better understanding of how social media does and does not work. \n Overview \n \n Don’t just put your brand  on  social media– do something with social media. Otherwise you are merely existing. \n Never, under any circumstances, at any time, for any reason disappoint your audience. Good first impressions can only be made once. \n Creativity is ESSENTIAL. If your company doesn’t bleed creativity, give your culture a transfusion. \n Don’t take a one-size-fits-all approach to social media. Identify your audience and learn to speak their language. \n Start kissing your wallet–you have to put your money where your mouth is to market on social media. \n If you know no trends, you’ll have no friends. Don’t be “that guy” who calls Facebook an emerging technology 10 years after it emerged. \n \n Social Media is Just Plain Dumb… Without Smart Content \n As human beings all people may be created equal, but when it comes to social media managers (from wannabes to professionals and the strategies they employ), the same simply cannot be said. When I hear people who represent a brand, even and especially “communication professionals,” say that they are “on social media,” I cringe. What they really mean is that they have created a Twitter account or Facebook page for their brand (maybe they have even created a Pinboard–woohoo). I think to myself, “Congratulations chief, you exist on a social network. Nay, you merely exist on a social network.” It’s the equivalent of a person who merely exists in life. So what. A rock exists too and so does a landfill, but that doesn’t mean I am going to be particularly interested in them. To really live you have to get out there and do something . It’s the same with social media. Stellar content is what can bring your social media content to life. It’s like the difference between a “smart phone” and a “dumb phone.” Social media platforms like Twitter and Facebook are  just delivery systems. They are pipes through which information can flow. \n Can you see what I’m getting at? Just being on social media means essentially nothing. You have to do something with it. I’ll go even further and say that simply doing the basics on social media (post an update here and a photo there) is nearly just as bad. If that is what you do, seriously, just delete your account right now–or–be content being extremely average, never winning any awards or making a serious difference. There is danger in mere existence… read on. \n There’s No Appointment Like Disappointment \n When I talk about social media, one of my favorite exercises is this: I come up with a silly competition that will yield a quick winner (such as who has the most Twitter followers, for example) and state that there will be a cash prize. I then proceed to write on the whiteboard (if available) what the envelope I am holding contains. I write a one and say, “There will be one of these,” followed by two circles and state, “And there will be two of these.” Naturally, everyone assumes there is $100 in the envelope. When I hand the lucky winner the prize and ask them to open it, they find a $1 bill with two pennies taped to it. So… there definitely was a one and there were two circles… but not what the poor recipient expected ($100 poorer to be exact–bad joke). As I describe the disappointment the victim must feel, a shared sense of being severely bummed out spreads throughout the room.  And just like that, I’ve illustrated the disappointment people feel when they expect something great from you and get ripped off instead (I give the person a free shirt or other sponsor-supplied prize afterwords… still, not as good as $100). \n Lesson? If you have something great going on in the real world (an awesome brick and mortar store, for example) and people jump online and see a website that looks like it came from the beginning of the internet or a social media profile that is beyond lame–if there is any sense of disappointment at all–you just failed big time. You can’t take back a person’s first experience with your brand. If it bombs, you may never see them again or it’s going to be very hard to get them to look at you in a more favorable light. Don’t disappoint. I’ve actually got a friend who can help you accomplish this… \n Introducing Mr. Cre A. Tivity \n Does his name sound foreign to you? No, he’s not from a different country and yes he wants to be your friend too. This is a very serious metaphorical question: Do you bleed creativity? If not, then the reason is probably because its not built-in to your DNA (or the DNA of your company/organization). It’s not something you can fake, but it is something you desperately need if you want to kill it on social media. Why? People crave creativity  (<– you must read this link). In fact, they demand it. You do too, whether you know it or not. If you don’t want to disappoint your audience/customers, you have to be creative. To go from merely existing online to making someone explain, “Wow, this exists?”  requires creativity in large and small doses. \n So what does creativity look like in social media? I guess it doesn’t hurt to spruce your profile up a bit, but that’s not what I’m talking about. I’m talking about content. Here are a few examples . If you aren’t creative, hire someone that is. If you can’t afford to hire someone, start thinking about what you can do that is different than what else is out there. Sometimes creativity is hard to capture–that’s why people who successfully translate creative ideas into reality soar above the competition. It’s rare to encounter. Need to get the creative juices flowing? Fill up your tank with some serious idea fuel . \n Me No Talky English \n Wouldn’t it be great if there was an app that translated your business jargon into your target audience’s preferred dialect? By the way, who is your audience? Who do you want to reach with your message/products? And the million-dollar question: can you speak their language? Can you communicate effectively with them? Example: Many Christian churches look more like museums than movements these days. Why? Aging generations, those in control of operations, no longer know how to reach out to younger generations–they don’t speak the same language. I’m not talking about simple slang here. We live in the age of technology where culture gaps intersect with generation gaps to form killer monster gaps that only grow bigger with time. Whoever your audience is, you must reach them how they want to be reached. You must go where they are. You must talk like they talk. Imagine parachuting into another county and not being able to speak the language (I’m picturing China right now, since I can’t speak Chinese). You’d feel pretty out of place, wouldn’t you? You’d probably want to get out of there as soon as possible. You simply can’t communicate without language. Period. \n Thanks to social media, you can now micro-target sub-audiences; theres no need to take a shotgun-style approach to marketing these days. In fact, I’d consider that a bit lazy. If you know you want to target 18-24 year olds, you can now easily and relatively inexpensively reach out to both males and females in that same demographic with separate assets. First, though, take the time to understand who you are talking to. Identify not only who your audience is, but what makes them tick: age, gender, habits, needs, wants, culture, pain points, etc… What are they seeing on a daily basis? What would not only make sense to them, but what would stand out to them? And that is where Mr. Cre A. Tivity comes in. \n Start Kissing Your Wallet \n Why? It’s time to put your money where your mouth is. You want to reach people on social media. Fine, but social media marketing is not as free as you’d like to think. Case in point? Examine my list of 100+ professional social media tools. Click through some of the links. Most aren’t free and many are quite expensive to use. Sure, it’s free to signup for a Twitter or Facebook account, I’ll give you that. But what is the only way to amplify word-of-mouth marketing online? By spending money. Promoting a link on Twitter can cost $120,000 per day. Want to sponsor a content ad on Facebook for a month? Hope you are ready to part with $800,000. It’s time to stop treating social media marketing like an ugly step-child and fork over some money to 1.) pay people who are more creative than you to do creative things on your behalf, 2.) buy some professional social media monitoring and marketing tools/services and 3.) hire writers/designers/videographers to produce high-quality and effective content you can be proud to post. You know the drill: it takes money to make money and that is no different when it comes to social media. \n If You Know No Trends, You’ll Have No Friends \n I bet that if you and I were to take turns naming social networking platforms one at a time I would stomp you into the ground. Sure, I spend a lot of time researching the subject and do a lot of thinking/writing about social media, but still, if you are tasked with managing your brand’s social media marketing… you should be up on the latest trends. Facebook and Twitter do not count. Even Pinterest is mainstream now. If you know about Path, Pair, OurSpot, Highlight, Sonar, etc… you’re doing better. At least you are current. But what is on the horizon? Where is your audience engaging? There are interest-based networks, location-based networks, private networks for families… the list goes on and on and gets longer every day (so it seems). \n I saved this until the end because, while it is very important to know what social networks are available to you and your audience, it doesn’t really mean anything without the principles I’ve already laid out above. To reiterate: it isn’t enough to be on social media… you have to do something (creative) with it. \n Your Turn \n What do you think? What else should a marketer or brand manager do to be extraordinary on social media? Spill your suggestions and comments now!"], "link": "http://feedproxy.google.com/~r/Dailytekk/~3/79CaV7PCSqs/", "bloglinks": {}, "links": {"http://dailytekk.com/": 2, "http://www.imdb.com/": 1, "http://www.socialmediaexaminer.com/": 1}, "blogtitle": "DailyTekk"}]