[{"blogurl": "http://www.datamining-blog.de\n", "blogroll": [], "title": "Data Mining - Blog.de"}, {"content": ["Durch den Erfolg der Onlinespiele (Casual und andere) hat sich eine ganze Branche entwickelt, die sich um die Analyse der Spieler kümmert. Viele dieser Firmen analysieren in den Spielen, wo die Spiele Schwachstellen haben, wie und wo man Werbung optimiert einsetzen kann, oder welche Art von bezahlten Inhalten den meisten Erfolg versprechen. \n \nFür ihre Analysen setzen diese Firmen stark auf automatisierte Algorithmen aus dem Data Mining. So bietet die Firma HoneyTracks ihren Kunden z.B. eine Kohortenanalyse an, um Zielgruppen besser einteilen und dann auch erreichen zu können. \nNeben der Optimierung des Cash Flow kann das Data Mining auch dazu eingesetzt werden, die Spiele zu optimieren, in Bezug auf Gameplay und Bugs. \nData Mining bietet sich hier besonders an, da die Datenmenge, die ein Spieler während seines Lebenszyklus erzeugt umfangreich ist. Einen Einstieg in das Thema bietet die Firma Game Analytics in ihrem Blog . Diese Firma bietet im Moment auch Zugänge zu einem Beta-Test ihres Systems an. \nAuch die Firma playtomic bietet Spieleentwicklern ihre Hilfe bei der Analyse der Spiele an. \nDie meisten dieser Firmen sind gerade neu gegründet und zeigen, dass es sich hierbei um ein neues und vielversprechendes Geschäftsfeld für die Anwendung von Data Mining in Echtzeit handelt. Vor allem die Leistungsfähigkeit der eingesetzten Algorithmen wird hier über den Erfolg der Software entscheiden, wenn es um die Analyse erfolgreicher Spiele geht. \n\n\n Diese Artikel sind ähnlich und können Sie auch interessieren: PaRen – PaREn Automatic System Construction Wizard in RapidMiner DFKI GmbH Mit PaRen gibt es eine neue Erweiterung... \n FastStats: Data Mining für Marketingspezialisten FastStats (c) Apteco Die Firma Apteco bietet mit ihrer..."], "link": "http://www.datamining-blog.de/allgemein/game-analytics/", "bloglinks": {}, "links": {"https://playtomic.com/": 1, "https://honeytracks.com/": 1, "http://blog.gameanalytics.com/blog": 1, "http://www.gameanalytics.com/": 1, "http://www.datamining-blog.de/": 2}, "blogtitle": "Data Mining - Blog.de"}, {"content": ["Das MIT Distributed Robotics Laboratory hat ein Projekt, das sich damit befasst “intelligenten Sand” zu entwickeln. Die Vision ist, dass man einen Gegenstand in eine Box mit Stand stellen kann und der Sand diesen Gegenstand dann nachbildet. Dieses Verfahren und vor allem die Algorithmen, die das ermöglichen sollen, wollen die Forscher im Mai 2012 auf der IEEE International Conference on Robotics and Automation vorstellen. \nBisher haben sie einige Versuche mit Würfel einer Kantenlänge von 10mm gemacht. Die Würfel sind magnetisch und enthalten kleine Prozessoren, die es ihnen ermöglichen miteinander zu kommunizieren und ein Objekt nachzubilden. \n \n Die Herausforderung des Projekts ist es, mit den knappen Resourcen auf den einzelnen “Sandkörnern” so umzugehen, dass ein möglichst effizienter Algorithmus herauskommt, der die Kommunikation der Elemente miteinander ermöglicht und gleichzeitig auch den Gegenstand nachzubilden. Dazu wird keine Karte des Gegenstands erzeugt und verwendet, da das Team die Resourcen dafür nicht in den einzelnen Elementen sieht, bei der Größe von Sandkörnern verständlich. \nDie Elemente kommunizieren untereinander, um zu erfahren, welchem Element noch Nachbarn fehlen, so dass das Objekt nachbildet werden kann. Nicht benötigte Elemente fallen am Ende einfach vom Objekt ab. \nDie Verkleinerung der Elemente ist laut Robert Wood, Associate Professor of Electrical Engineering an der Harvard University nicht undenkbar, da sich die Anforderungen an die Elemente in Grenzen halten. Allerdings würde es doch eine Menge Arbeit bedeuten diese Elemente herzustellen. \nWir können gespannt sein, wie sich das noch entwickelt."], "link": "http://www.datamining-blog.de/allgemein/intelligenter-sand/", "bloglinks": {}, "links": {"http://www.mit.edu/": 1, "http://www.icra2011.org/": 1}, "blogtitle": "Data Mining - Blog.de"}, {"content": ["Last.fm hat am 15.12.2011 seinen neuen Dienst Discover vorgestellt. In Zusammenarbeit mit dem Microsoft Innovation Team wurde eine HTML5 App erstellt, die aus dem Fundus der Künstlern schöpft, die ihre Songs auf Last.fm zur Verfügung gestellt haben, also hauptsächlich Bands ohne Vertrag oder Major Label. \nZusammengestellt wird die Playliste von Discover, wie bei Last.fm bereits bekannt, über die Tags. Genau an dieser Stelle greift dann, das schon von Last.fm bekannte, System von Scoring. Andrew Clegg, Mitarbeiter bei Last.fm, beschreibt das Vorgehen in seinem Blog . \n \n Die Leistung des Scoring Systems in Bezug auf Discover ist es nun, dass hier Songs von Bands abgespielt werden, die nicht so oft getaggt wurden. Hier ist die Gefahr einer Abweichung der angezeigten Tags im Vergleich zu den bekannteren Bands, relativ groß. Der Faktor der statistischen Korrekturen spielt hier eine größere Rolle, um den Dienst erfolgreich zu machen. \nDer Grund hierfür ist, dass Discover das Radio anhand der vom User eingegebenen Tags zusammenstellt und es auch auf den Geschmack des, angemeldeten, Benutzer abstimmt. \n Diese Anwendung ist ein Beispiel für die Nutzung von Data Mining und Sozialen Netzwerken. Hier wird unabhängigen Bands ein Forum zur Verfügung gestellt, um ihre Musk einem interessierten Publikum vorzustellen und dabei die Streuverluste zu vermeiden. Aufmerksam gemacht auf dieses Thema hat mich der Blog www.eindeutigunsinnig.de . \n\n\n Diese Artikel sind ähnlich und können Sie auch interessieren: Facebook Dating-Data-Mining mit “Wings” von Triangulate Das Produkt \"Wings\" vom US-amerikanischer Start-Up Triangulate, gibt mittels Data..."], "link": "http://www.datamining-blog.de/allgemein/last-fm-discover-datamining-in-sozialen-netzwerken/", "bloglinks": {}, "links": {"http://www.eindeutigunsinnig.de/": 1, "http://blog.last.fm/": 1, "http://www.datamining-blog.de/": 1, "http://last.fm": 1, "http://www.last.fm/": 1, "http://microsoft.com": 1}, "blogtitle": "Data Mining - Blog.de"}, {"content": ["DFKI GmbH \n Mit PaRen gibt es eine neue Erweiterung zum RapidMiner die es ermöglichen soll die Klassifikation von Daten automatisch vorzunehmen. \nDas Vorgehen dazu ist sehr einfach, da man im Grunde nur das zu analysierende Datenset eingeben muss und die Erweiterung dann automatisch die Daten nach dem optimalen Algorithmus zur Analyse durchsucht. Wenn die Analyse beendet ist, erhält man eine Liste der besten Treffer mit einer Angabe zu ihrer Genauigkeit. Zur Überprüfung kann man nun die gewünschten Algorithmen auswählen und mit diesen eine automatische Optimierung der Parameter durchführen lassen. \n \n Nach der Optimierung kann man die tatsächliche Genauigkeit der Berechnungen ansehen und sich für Eine entscheiden. Aus dieser Entscheidung erstellt der Wizard dann einen RapidMiner-Prozess, den man dann für die weitere Verarbeitung nutzen kann. \nEine genaue Anleitung zum Einsatz von PaRen ist auch hier zu finden. Ein sehr schönes Video-Turorial dazu ist auch Neural Market Trends zu finden. \n\n\n Diese Artikel sind ähnlich und können Sie auch interessieren: RapidMiner von Rapid-I auf der CeBIT 2010 RapidMiner ist eine Data Mining Suite Der Firma Rapid-I. Ich... \n Game Analytics Durch den Erfolg der Onlinespiele (Casual und andere) hat... \n FastStats: Data Mining für Marketingspezialisten FastStats (c) Apteco Die Firma Apteco bietet mit ihrer..."], "link": "http://www.datamining-blog.de/data-mining/paren-paren-automatic-system-construction-wizard-in-rapidminer/", "bloglinks": {}, "links": {"http://madm.dfki.de/": 2, "http://www.datamining-blog.de/": 3, "http://www.neuralmarkettrends.com/": 1, "http://rapid-i.com/": 1}, "blogtitle": "Data Mining - Blog.de"}, {"content": ["© Triangulate, Inc. \n Die in Palo Alto in Kalifornien ansässige Firma “ triangulate ” hat es sich auf die Fahne geschrieben, “die Menschen zu bemächtigen mit ihren Daten die Welt zu verbessern”. Zu diesem ehrbaren Zweck vertreibt sie als ihr erstes Produkt “ Wings “, eine Facebook Application, die mit Data Mining Methoden Profile von Usern erstellt und diese matched. Ziel des Ganzen ist es, eine Dating Platform zu erstellen, bei der die “perfekten Paare” zusammengebracht werden. \n Hierbei wird aber nicht mit einem Fragebogen gearbeitet, vielmehr zieht die Software alle benötigten Daten direkt aus den Spuren, die ein Nutzer im Web hinterlassen hat – inklusive seiner Facebook Eigenschaften – aber nicht ausschließlich. Vielmehr bedient sich die Software auch Last.fm oder netflix , um den Musik- und Videogeschmack zu bewerten. Twitter wird analysiert, um die Themenwelt zu erschließen, in der sich der User aufhält. \n \n Sunil Nagaraj, CEO von Triangulate, berichtet von interessanten Ergebnissen, die sich im Laufe der Anwendung gezeigt haben. So zeigt sich die “Dichte des sozialen Netzwerks” von wichtiger Bedeutung; wenn der Freundeskreis an sich “geschlossen” ist, sucht man sich auch in diesem Freundeskreis seinen Partner – und Zufallsbekanntschaften sind dann eher die Ausnahme. \n Wings bei Facebook \n Allerdings ist der hohen Volatilität der Charaktereigenschaften der User nicht viel entgegenzusetzen; manche Menschen ändern fast täglich ihren Musik-Geschmack. Dies ist selbst auch eine Eigenschaft, aber sicher nicht so aussagekräftig wie eine spezielle Musikrichtung, die mit dem “Traumpartner” geteilt wird. \n Der mit 750.000$ (562.000 €) von Investoren getragene neue Start-Up hat in dem sehr wichtigen Dating-Markt gegen Konkurrenten wie match.com oder eHarmony anzutreten, die selbst schon sehr fortschrittliche Dating-Data-Mining Methoden einsetzen. \n Eine wichtige Eigenschaft für eine Dating-Recommendation Engine ist auch das Aussehen der potentiellen Partner. Dieser für viele Menschen sicher sehr wichtige Aspekt findet sich in der Regel nur in ein paar Körpermaße wieder, die mehr oder weniger ehrlich eingegeben wurden. Zu modellieren ob man eine Person auf einem Foto sympathisch findet, ist nicht trivial! Das Dating Projekt okcupid.com verwendet ebenfalls sehr ausgefeilte Data Mining Algorithmen und geht auf diesen Punkt deutlich ein . \n\n\n Diese Artikel sind ähnlich und können Sie auch interessieren: Cloud Mining – CRM Data Mining in der Cloud Cloud Mining ist eine Innovationsform des Data Mining. Hierbei werden... \n FastStats: Data Mining für Marketingspezialisten FastStats (c) Apteco Die Firma Apteco bietet mit ihrer... \n Data Mining im KDD Environment Data Mining ist nur ein Schritt im Finden von Wissen..."], "link": "http://www.datamining-blog.de/data-mining/facebook-app-data-dating-mining-wings-triangulate/", "bloglinks": {}, "links": {"http://www.netflix.com": 1, "http://www.twitter.com": 1, "http://www.last.fm": 1, "http://www.okcupid.com": 1, "http://www.eharmony.com/": 1, "http://blog.okcupid.com/": 1, "http://www.triangulatecorp.com/": 1, "http://www.heise.de/": 1, "http://www.match.com/": 1, "http://www.datamining-blog.de/": 3, "http://www.facebook.com/": 1}, "blogtitle": "Data Mining - Blog.de"}, {"content": ["SAS Institute Inc. \n Data Mining Experten sind eine seltene Spezies im Lebensraum eines Unternehmens. Ganz im Gegensatz zu Business Analysten, die man deutlich häufiger antreffen kann.  Dies ist der Grund, warum immer mehr Anbieter Data Mining Tools auf den Markt bringen, die das Data Mining so weit vereinfachen sollen, das es auch von Business Analysten ausgeführt werden kann. Der große Anbeiter SAS stellt ein neues Produkt vor, das in dieses Muster passt; den SAS Rapid Predictive Modeler . \n SAS hat betont, das dieses Tool tatsächlich den Business Analysten ansprechen soll, und das es Fachbereichs Experten mit begrenzten statistischem Wissen ermöglichen wird, vertrauenswürdige und robuste Data Mining Modelle zu schaffen. Welche schlussendlich zu nützlichen und aussagekräftigen Reports und Grafiken führen sollen. \n \n  SAS® Rapid Predictive Modeler Screenshot \n Dabei arbeitet es mit dem visuellen Interface desSAS Enterprise Guide, oder mit Microsoft Excel und dem SAS Add-in für Microsoft Office, zusammen. \n Der Benutzer wird automatisch durch die Datenaufbereitung und all die anderen notwendigen Data Mining Aufgaben geführt. \n SAS vermeldet, das Data Mining Experten schnelle und einfache Modelle erstellen können, wenn wenig Zeit und Ressourcen vorhanden sind. Das heißt für den Experten aber auch, das man mit mehr Zeit und Ressourcen bessere Ergebnisse erzielen könnte – mit dem großen Bruder des Modelers, dem SAS Enterprise Miner 6.2, welcher sowieso lizenziert werden muss. \n Führt man sich die Lizenzkosten des Miner vor Augen, würden Unternehmer sicher gut daran tun noch ein bisschen mehr Geld in die Hand zu nehmen, und auch einen guten Data Mining Experten einzustellen. Aber das Ergebnis eines gewöhnlichen Business Analysten ist ein ausgezeichneter Benchmark der natürlich auch von den gewöhnlichen Data Mining Experten geschlagen werden muss… \n\n\n Diese Artikel sind ähnlich und können Sie auch interessieren: FastStats: Data Mining für Marketingspezialisten FastStats (c) Apteco Die Firma Apteco bietet mit ihrer... \n CeBIT 2010: Cloud Mining bald auch bei SAS? SAS Institute Inc. Auf der CeBIT 2010 habe ich... \n Data Mining im KDD Environment Data Mining ist nur ein Schritt im Finden von Wissen..."], "link": "http://www.datamining-blog.de/unternehmen/sas-institute/data-mining-ohne-experte-sein-sas-rapid-predictivemodeler/", "bloglinks": {}, "links": {"http://www.data-mining-blog.com/": 1, "http://www.datamining-blog.de/": 5, "http://www.sas.com/": 1}, "blogtitle": "Data Mining - Blog.de"}, {"content": ["KNIME (Konstanz Information Miner) \n Jedes Jahr wählt Gartner den “Cool Vendor” – den coolsten Anbieter der neue innovatice Produkte oder Dienstleistungen vertreibt. Dieses Jahr wurde die Data Mining Software KNIME (kurz für Konstanz Information Miner), eine Open-Source Lösung für Datenintegration, Processing, Analyse und Exploration, ausgewählt. \n KNIME wurde in den Schlüsseltechnologien Analytics, Business Intelligence und Performance Management ausgewählt. \n Gartner vermutet das “Cool Vendors” einen signifikanten Einfluß auf den Markt haben werden. \n\n\n Diese Artikel sind ähnlich und können Sie auch interessieren: RapidMiner von Rapid-I auf der CeBIT 2010 RapidMiner ist eine Data Mining Suite Der Firma Rapid-I. Ich... \n Data Mining im KDD Environment Data Mining ist nur ein Schritt im Finden von Wissen... \n Cloud Computing Tage 2010 Veranstaltet vom Deutschen Kongress Business as a Service und..."], "link": "http://www.datamining-blog.de/unternehmen/knime/knime-ist-gartners-cool-vendor-2010/", "bloglinks": {}, "links": {"http://www.gartner.com/": 1, "http://www.data-mining-blog.com/": 1, "http://de.wikipedia.org/": 1, "http://www.datamining-blog.de/": 3, "http://www.knime.org/": 1}, "blogtitle": "Data Mining - Blog.de"}, {"content": ["FastStats (c) Apteco \n Die Firma Apteco bietet mit ihrer Software FastStats und diversen Plugins eine auf Kampagnenplanung abgestimmte Software für die Adress-Selektion an. \nDie Software arbeitet mit Texdateien, die sortiert und verlinkt werden und ist in .Net erstellt. Das Konzept besteht darin den Anwendern eine einfache Drag’n'Drop Umgebung anzubieten und ihnen so die Bedienung und die Erstellung von Selektionen so einfach wie möglich zu machen. Der für uns interessante Teil der Software bezieht sich auf das Modul “FastStats Modelling”. Hier wurde Mining mit dem patentierten Verfahren “Predictive Weight of Evidence (PWE)” und mit Entscheidungsbäumen implementiert. \n \n Auch in diesem Modul wird auf das Drag’n'Drop-Prinzip gesetzt, um die Bedienung auch Endanwendern in den Marketingabteilungen zu ermöglichen. Gleichzeitig bietet die Software jedoch auch die Möglichkeit alle Werte im Detail anzusehen und nicht nur die farbigen Balken, die die Relevanz bestimmter Attribute oder Zweige in den Bäumen anzeigen. \nNeben der PWE-Methode bietet Apteco auch CHAID bei der Erstellung des Entscheidungsbaums an. \nUm den Erfolg des Modells auch monetär zu bewerten, gibt es die Möglichkeit Werte wie Conversionrate, Umsatz pro gewonnenem Kunden und Kosten für die Kampagne vor der Analyse einzustellen. So kann man in den späteren Auswertungen sehen, welches der berechneten Modelle den höchten RoI hat. \n Die Software bietet trotz weniger Methoden einen guten Einstieg in die Optimierung von Marketingkampagnen. Die Segmentierung der Kunden und die Optimierung von Kampagnen für spezielle Zielgruppen, sowie die Möglichkeit Affinitäten bei den Kunden festzustellen und das alles per Drag’n'Drop und mit Grafiken relativ einfach zu erfassen und die Ergebnisse hinterher in den Daten zu selektieren, heben das Tool hervor. \n\n\n Diese Artikel sind ähnlich und können Sie auch interessieren: Cloud Mining – CRM Data Mining in der Cloud Cloud Mining ist eine Innovationsform des Data Mining. Hierbei werden... \n Facebook Dating-Data-Mining mit “Wings” von Triangulate Das Produkt \"Wings\" vom US-amerikanischer Start-Up Triangulate, gibt mittels Data... \n RapidMiner von Rapid-I auf der CeBIT 2010 RapidMiner ist eine Data Mining Suite Der Firma Rapid-I. Ich..."], "link": "http://www.datamining-blog.de/data-mining-tools/faststats-datamining-fuer-marketingspezialisten/", "bloglinks": {}, "links": {"http://www.apteco.com/": 1, "http://de.wikipedia.org/": 1, "http://www.datamining-blog.de/": 3}, "blogtitle": "Data Mining - Blog.de"}, {"content": ["DFKI GmbH \n Das Projekt Text 2.0 bietet ein Framework basierend auf Basis von HTML, CSS, JS, das die Möglichkeit bietet mittels eines Eye-Trackers den Fortschritt des Lesers in einem Text zu verfolgen. Durch die Umsetzung in Java-Script ist es schnell möglich das Feature in alle möglichen Webseiten einzubinden und dort die Funktionen zu nutzen. Zu diesen Funktionen gehört das Erkennen des Leseverhaltens ebenso, wie die interaktive Darstellung von Inhalten, sobald eine bestimmte Textpassage gelesen wird. \n \n Das Festellen des Leseverhaltens blendet z.B. Worte aus, wenn man einen Text nur überfliegt, so dass man auf einen Blick die wichtigen Informationen des Texts erfassen kann. Das ermöglicht das noch schnellere Überfliegen eines Textes ohne dabei Wichtiges zu verpassen. \nEs wird ebenfalls die Möglichkeit geboten Worte im Text zu erklären, z.B. über das interaktive Einblenden von Fußnoten, die dann im Text in einem Pop-Up besonders hervorgehoben werden, wenn man sie liest. Die Übersetzung von Worten ist ebenso möglich, wie Silbentrennung und auch eine Funktion, die es dem Text ermöglicht bestimmte Worte vorzulesen. \nDie interaktive Darstellung von Inhalten, sobald man eine Passage im Text liest, ermöglicht es z.B. Bilder anzuzeigen, die zur aktuellen Stelle im Text passen und das vorige Bild zu ersetzen. Damit kann man den Text ohne Unterbrechung von Bildern lesen. All das erinnert an die interatkiven Bücher aus Neil Stephensons Diamond Age . Wenn es auch noch nicht ganz die Möglichkeiten bietet, ist es doch ein Schritt in diese Richtung. \nAnwendungsmöglichkeiten gibt es hierzu einige, vor allem in der Werbeindustrie bietet diese Technik neue Möglichkeiten. Statt kontextgebundene Werbung nur beim Betreten einer Seite neu angezeigt zu bekommen, könnte sich die Werbung nun während des Lesens bezogen auf den aktuell gelesenen Inhalt ändern. Derzeit ist eine solche Anwendung allerdings noch weit entfernt, weil die nötige Eye-Tracker Hardware teuer ist und noch nicht weit verbreitet. \n \n\n\n Diese Artikel sind ähnlich und können Sie auch interessieren: Game Analytics Durch den Erfolg der Onlinespiele (Casual und andere) hat... \n Data Applied bietet Cloud Mining mit neuen Funktionen Data Applied ist eine der ersten Cloud Mining Firmen am..."], "link": "http://www.datamining-blog.de/forschung/der-text-weiss-dass-er-gelesen-wird/", "bloglinks": {}, "links": {"http://text20.net/": 1, "http://www.datamining-blog.de/": 2, "http://en.wikipedia.org/": 1}, "blogtitle": "Data Mining - Blog.de"}, {"content": ["Amazon AWS \n Cloud Mining mit Oracles ODM ist seit Februar 2010 auf der  Amazon Cloud möglilch, wie man auf der offiziellen Oracles Website ´sehen kann. Es gibt eine vorinstallierte  Oracle 11gR2 Datenbank und sample datasets fertig zum Testen des Cloud Mining . Benutzer können mit der Oracle 11gR2 Data Mining Amazon Machine Image (AMI), eine Cloud Mining Instanz direkt auf den Amazon Web Services (AWS) ausführen. Es fallen nur normale Amazon EC2 Kosten an. \n Das bedeutet also, das Oracle das Wettrennen um die Cloud gewonnen hat, jedenfalls gegen die Data Mining Experten von SAS . \n\n\n Diese Artikel sind ähnlich und können Sie auch interessieren: Cloud Computing Gütesiegel von Eurocloud Logo des EuroCloud Deutschland eco e.V. Eurocloud, die Europaïsche... \n Cloud Mining – CRM Data Mining in der Cloud Cloud Mining ist eine Innovationsform des Data Mining. Hierbei werden... \n Cloud Mining bei Layered Technologies? Layered Technologies stellt eine neue sichere Virtual Private Data Center..."], "link": "http://www.datamining-blog.de/cloud-mining/oracle-cloud-mining-amazon-aws/", "bloglinks": {}, "links": {"http://www.data-mining-blog.com/": 1, "http://www.datamining-blog.de/": 3, "http://www.oracle.com/": 2}, "blogtitle": "Data Mining - Blog.de"}]