[{"blogurl": "http://dataremixed.com\n", "blogroll": [], "title": "DataRemixed"}, {"content": ["Any time you find yourself with a data set with more than a few columns, say for example the 2012 Major League Baseball regular season stats sheet, you have a number of options when it comes to data exploration and discovery. The data set has all “qualifying” players, their team & position, and their number of games played, at bats, hits, homeruns, doubles, RBIs, etc. for the 2012 regular season. You can find the table online here . \n Option #1: Table Madness \nYou could just sort and filter the table, and maybe even color-code the cells with some fancy conditional formatting in Excel (Home > Conditional Formatting > Color Scales > Red – White – Blue Color Scale). Interesting approach, but this doesn’t make use of the human brain’s superior capacity to make use of position or size to compare values. I’ll save it for all those dense quarterly financial spreadsheets. Here it is, for posterity: \n  \n Option #2: “O-F-A-T” \nOne option (called “O-F-A-T”, or “One Factor at a Time”) is to view each parameter, say, Homeruns, all by itself in a basic chart like a histogram. Rinse & repeat for all the other parameters. As nice as that is, you won’t really know anything about potential correlations between variables, you’ll just know each variable in isolation: \n  \n Option #3: Small Multiples \nYou could make a whole panel of histograms of each parameter, which would really just be a more efficient way of Option #2. Or, as demonstrated in Chapter 6 of Visualize This , you could plot each variable against each other variable in a scatterplot matrix (one form of small multiples chart). This option is preferred by many (created here using the R function “pairs()” which includes fitted LOESS curves ), as it allows you to quickly scan for strong correlations between two variables (in this case, I reduced the number of variables in the matrix from 16 to 10 for readability): \n  \n A fairly quick scan shows that Homeruns and RBIs are fairly closely correlated in a positive sense (as are At bats and Runs). Can you spot the negative correlations? Not that hard to notice that Homeruns and Stolen Bases seem to be negatively correlated, right? To a fan of the game of baseball, none of these correlations will be particularly surprising, but the power in this approach is that many, many correlations can be identified, at least roughly speaking, in a very short amount of time. Do a quick Google Image search for “ small multiples ” and you’ll find other great examples of this powerful visualization. Here’s a recent piece by the New York Times showing drought conditions in the US since the late 19th century. Bottom line: I love small multiples. \n Option #4: Interactive Visualizations \n Lastly, you could create an interactive data discovery dashboard (created here using Tableau Public ), using Parameters to allow the explorer of the data set to dynamically assign any of the 16 variables to the x-axis, the y-axis, the color palette or the circle size: \n \n  \n \n Powered by Tableau \n \n This effectively allows the user to compare any of the 4 parameters together. Of course, since position is more easy to discern than either color or area, the true comparison is still between the variable on the x-axis and the variable on the y-axis. Still, the other two variables are “along for the ride”, aiding a secondary analysis. The interactive environment also allows for the user to hover the mouse over any data point and learn more about the datum, or filter the view (in this case by either position or team). \n So, Which Do You Prefer? \n What I’d really like to know is: between Option #3 (small multiples) and Option #4 (interactive visualizations), which do you prefer, if any, and why? Do you prefer seeing it all at once at a high level, or do you want the ability to drill down, filter and customize a more limited but intricate view? Or are these totally different tools for totally different purposes that shouldn’t really be contrasted? \n Thanks for stopping by! \nBen"], "link": "http://dataremixed.com/2012/10/interactive-visualizations-or-small-multiples/", "bloglinks": {}, "links": {"http://www.nytimes.com/": 1, "http://complexdiagrams.com/": 1, "http://www.tableausoftware.com/": 2, "https://www.google.com/": 1, "http://mlb.mlb.com/": 1, "http://en.wikipedia.org/": 1, "http://www.amazon.com/": 1, "http://dataremixed.com/": 4}, "blogtitle": "DataRemixed"}, {"content": ["It was hard not to watch the coverage of Felix Baumgartner’s record breaking plunge yesterday. To think that a human broke the sound barrier while in free-fall is unbelievable to say the least. \n Seeing Baumgartner climb out of his capsule and look at the planet beneath him got me thinking about how some of the data points of this feat compare with other data points: \n \n How high was he relative to other things I am familiar with, like the cruising altitude of a commercial jetliner? \n How fast did he travel relative to an NHRA dragster or a bullet being fired from a gun? \n How long was he falling compared to the fastest mile time? \n \n I created this viz to help me answer some of these questions: \n \n  \n \n Powered by Tableau \n \n Hope you like it! \nBen"], "link": "http://dataremixed.com/2012/10/a-tribute-to-fearless-felix/", "bloglinks": {}, "links": {"http://www.tableausoftware.com/": 1, "http://www.youtube.com/": 1, "http://dataremixed.com/": 1, "https://encrypted-tbn3.gstatic.com/": 1}, "blogtitle": "DataRemixed"}, {"content": ["Here’s another breakdown of the words used by Mitt Romney and Barak Obama in this week’s first Presidential Debate: \n \n  \n \n Powered by Tableau"], "link": "http://dataremixed.com/2012/10/comparing-words-used-in-the-first-presidential-debate/", "bloglinks": {}, "links": {"http://www.tableausoftware.com/": 1, "http://dataremixed.com/": 1}, "blogtitle": "DataRemixed"}, {"content": ["This is a pretty simple tool that let’s you compare the overall word count for Romney vs. Obama in the October 3rd Presidential Debate: \n \n  \n \n Powered by Tableau"], "link": "http://dataremixed.com/2012/10/presidential-debate-word-counter/", "bloglinks": {}, "links": {"http://www.tableausoftware.com/": 1, "http://dataremixed.com/": 1}, "blogtitle": "DataRemixed"}, {"content": ["One year ago this week, I published my first blog post – a data visualization tribute to one of the biggest heroes of my childhood: Wayne Gretzky. The next day I nearly jumped out of my chair when it was chosen by Tableau as the “Viz of the Week”.  The internets had rewarded my self-deluded boldness in putting something out there, in starting something I had wanted to start for years, but between grad school, changing diapers, and making mortgage payments, I just hadn’t had the chance to start. \n That Gretzky viz went on to be one of the Top 5 Vizzes of 2011, and since then I’ve been hooked.  Hooked on data, hooked on blogging, hooked on Tableau. I feel like there is so much more to explore and learn, but I’d like to relate a few things I have learned over the course of one year of data viz blogging. \n \n Create (but go easy on the “data viz showcase”) – I went on to crank out more and more visualizations , and then fellow blogger Enrico Bertini really burst my bubble with this post about what a good data blog is all about. I want to thank him for rattling my cage and challenging me to think about better things than just “hey, look what I did!” all the time. I’m not totally sold on his “signal to noise” argument (don’t create stuff because it just increases the amount of stuff others have to filter through), but his point is valid – take it up a notch. I’ve tried to, so thanks Enrico. \n Relate  (it’s all about the people, anyway) – I started by creating a twitter account and finding other data viz nut cases to follow, and then I read what they posted, and tried to publish respectful and insightful comments on their blogs. Whether they always saw my comments as respectful and insightful, I’m not sure, but I let their blog posts be triggers to my own posts, and made sure to mention them as my source of inspiration. I emailed them and asked for their opinion of something I had created  before pushing the big red “publish” button. Then, I started reaching out to them via email and asking them to let me record a Skype conversation with them, and publish it as a podcast. Why not?  I feel like I have made great connections that way. \n Educate (a blog should provide others real value) – I noticed that the posts of other blogs that I liked the most were always helpful. They didn’t just give “Top 5 ways to…” link-bait mumbo jumbo, they were more like guided tutorials . I experimented with how-to videos and screen shot walk-throughs , and I felt like I actually made a small contribution that way. Getting the “thank you” comments was the best part of it all. Three of my top 5 posts thus far start with the two simple words, “How to…”  That says it all. \n Pontificate (if you’ve saved up some equity in the blogosphere) – the web is full of people spouting their thoughts, some genius, others….less so. I’m a practitioner, not an expert or guru, so I’ve tried to voice my opinion sparingly. If all you do on your blog is talk about what you think all the time, people will get tired of all the hot air, so I’ve really only published some of my more poignant musings . That’s what I think of them, anyway. \n \n If you’re reading this, well then…I’d like to thank you for reading this. I hope my second year of blogging gives you many more reasons to come back! \n All the best, \n Ben"], "link": "http://dataremixed.com/2012/08/4-data-viz-blogging-lessons-learned/", "bloglinks": {}, "links": {"http://public.tableausoftware.com/": 1, "http://dataremixed.com/": 7, "http://fellinlovewithdata.com/": 1, "https://twitter.com/": 2, "http://serialized.net/": 1}, "blogtitle": "DataRemixed"}, {"content": ["The opening ceremony of the Summer Olympics starts today in London, and I’m sure we’ll all be deluged with a flood of olympic [infographics]. At the risk of adding to the noise, here’s a link to an interactive dashboard created with Tableau Public that let’s you explore which countries were the most efficient in taking home medals last time, when Beijing held the games in 2008. \n How to define “efficiency” in taking home medals? Two ways: 1) medals divided by population, and 2) medals divided by the size of the economy (GDP). 2008 figures were used for all ratios. \n  \n Here are some of my quick findings: \n \n I’d have to give Jamaica the nod as overall medal efficiency winner, ranking #2 in both categories. \n On the other side of the coin, India was the least efficient medal-winning country in both categories, but remember, many countries won no medals at all. \n Of the top 10 medal winning countries, Australia was the most efficient in terms of population, and Ukraine was most efficient in terms of economy. \n Even though the US won far more medals (110) than Canada (18), Canada was more efficient (0.54 per million ppl) than the US (0.37 per million people) in terms of population. (Did I mention I’m Canadian? I choose my moments.) \n \n Thanks for stopping by, and thanks to Nick Harris of sportingintelligence.com for posting a version of this dashboard ( here ) at his great sports data site. \n Ben \n (This project was used as an entry in the Olympics Challenge at visualizing.org . In spite of the fact that judging hasn’t happened yet, please use the comments section to let me know what you think – the good, the bad and the ugly, as always. Criticism is just data, afterall.)"], "link": "http://dataremixed.com/2012/07/medals-of-efficiency/", "bloglinks": {}, "links": {"http://www.sportingintelligence.com/": 2, "http://public.tableausoftware.com/": 1, "http://www.visualizing.org/": 2, "https://twitter.com/": 1}, "blogtitle": "DataRemixed"}, {"content": ["I love chess . Lots of people say that to sound smart, but not me. A 6 year old and an 8 year old have both played me to stalemate, and not because I let them. Of course, the saving grace is that they are my sons, so my abject shame is replaced with a dad’s pride. Losing to your kids is kind of like winning. \n In spite of this fortunate side effect, I put together this winning chess openings dataviz with Tableau to make sure neither budding wiz kid’s king slipped through my fingers again. At least not any time soon. It uses data from this website , which I was not able to substantiate with a second source, so take it with a grain of salt (thanks, internets). \n \n  \n \n Powered by Tableau \n \n How was it made? \n1. The time-consuming part was converting each of the 20 openings in the viz from standard chess notation in the website to a spreadsheet structured as follows (each row corresponds to a specific piece on the board, e.g. wp1 = white’s first pawn, on square A2 to start the game): \n  \n 2. Once all of this was converted to an Excel spreadsheet, the win/draw/loss stats were added to each row, and the Tableau reshaping tool was used to convert the spreadsheet to prepare for connection with Tableau. \n 3. A chess board image and chess piece images were found using Google Image search. \n 4. I started with the chess board view, which looks as follows: \n  \n 4a. I added the “x-pos” field to the column shelf and the “y-pos” field to the row shelf and converted each from a SUM to a dimension (32 small circle shapes appeared in the general positions of the pieces). \n 4b. I added the chess board background image by selecting Map > Background Images > Add Image, browsing to the chess board image file location, setting the coordinates to -0.35 and 9.35 for both the x-axis and the y-axis, and selecting “Always Show Entire Image” in the Options tab. Voilà. \n 4c. I dragged the “Piece” field to the Shape shelf, clicked the down arrow in the “Piece” legend that appeared in the bottom left and selected “Edit Shape…”. I had saved the chess piece images in .png format to the “My Tableau Repository” and “Shapes” folders in a new folder I created called “Chess”. Then it was a matter of choosing the “Chess” option from the “Select Shape Pallette:” drop down menu and assigning the right image to the right piece code (wk = white king, bk=black king, etc.). \n 4d. The Quick Filters were added to limit the board view to one and only one opening (instead of showing all of them overlaid on one another, which just jumbles all the openings into one view). \n 5. A stacked bar chart was created for the chess opening outcomes as shown below: \n  \n 5a. This is basically just a stacked bar chart with some fancy formatting, but the starting point is a bar chart with the “Opening” field in the Rows shelf and the “Frequency” field in the Columns shelf, with the “Outcome” field in the Color shelf. Also added are the rank and the Pts/100 Games fields. The only trick was the sorting – I wanted to sort based on the Points per 100 Games, but had to do so manually. I’m pretty sure there was a better way to do that, but ran out of time. \n 6. After that, I just made a simple table for the move notation and a “Hover for Instructions” image, and dropped everything into a Dashboard. \n In case you want to try it out, here is the Excel spreadsheet , and you can download the completed Tableau Public workbook by clicking “Download” in the bottom right corner of the workbook above. Good luck! If you have any questions or suggestions on how to make it better, I’d love to hear it. \n Thanks for stopping by! \nBen"], "link": "http://dataremixed.com/2012/07/the-best-chess-openings/", "bloglinks": {}, "links": {"https://dl.dropbox.com/": 1, "http://homepage.ntlworld.com/": 1, "http://dataremixed.com/": 5, "http://kb.tableausoftware.com/": 1, "http://www.tableausoftware.com/": 1}, "blogtitle": "DataRemixed"}, {"content": ["There are lots of data analysis and visualization tools out there, but the most commonly used (and misused) has to be Excel.  It’s certainly not the best, but in terms of sheer number of users, I have a hard time imagining any other tool with more. I’ve found that many data discovery efforts include Excel at some point or another in the process. \n If you are interested in getting better at Excel, I highly recommend you follow Jon Peltier , Jorge Camoes and Chandoo . These three guys are the Excel pros, and much of what I have learned over the past few years has come from them. I haven’t featured any Excel dashboards on this blog thus far, but thanks to a recent contest at Chandoo.org, I found myself cranking out the old pivot tables and vlookup formulas to see what I could do with a provided data set of 1,883 responses to a recent salary survey. \n So how did it go? \n Well I have to admit, after a solid year of using mostly Tableau to explore data sets, staying in Excel felt a little like speaking a foreign language. Many times I found myself struggling to do something that would have been second nature in Tableau. I think a huge part of that is the difference in the tools themselves (Tableau is designed specifically for data discovery via visualization), but certainly part of it had to be the user as well – I just haven’t been spending that much time in Excel doing this type of activity lately. \n And what was the end result? \n Here is my final submission. You can download the Excel file here  (692KB): \n  \n \n This survey exploration worksheet shows: \n \n Summary statistics across the top \n Top 5 and bottom 5 country lists, and \n A two-country comparison tool in the middle \n Column charts showing mean salary along with +/- 1 standard deviation error bars at the bottom with \n Pivot table “slicers” which function as global filters for everything in the worksheet \n \n The last bullet point – “slicers” is the most powerful part of the worksheet, and only available (I believe) in Excel 2010. Slicers are cool because they allow the user of the worksheet to drill down to any combination of response attributes. They’re basically like “Quick Filters” in Tableau. An added bell (or whistle if you prefer) is that the country tables include a flag to the left of the country name that changes to match the corresponding country when the slicer filters are applied. “Ooo, fancy!” Hey, thanks! \n To try it out for yourself, just download the worksheet, open it with Excel 2010, and click on any of the colored pills in the section to the lower right under the “Global Filters” header (you can hold down Ctrl to select multiple attributes and press Alt + C or click the little icon in the upper right of the pill grouping to clear the filter). \n What did I learn? \n You have to be careful because many of the countries only have a single survey respondent, making average “mean”ingless (sorry). This often happens with survey response data – people make all kinds of conclusions based on very small sample sizes. While I went ahead and ranked the countries based on mean anyhow, I included the all-important “n” column in the table to flag the user. I stopped short of doing any tests for statistical significance, but this could have been done as well. I also added the “region” field, which wasn’t included in the original data set at all. I was able to obtain these region categories from the UN stats website . It sounds easy enough, but believe me, it was a pain (‘Vietnam’ vs. ‘Viet Nam’ is one example of many mismatches that had to be manually adjusted). \n How to build it: \n \n Summary statistics – these cells are pointed to the grand total row of a simple pivot table . Nothing fancy here. I added it because it really highlights the “big picture” for the user, before they get into the details below. \n Top & Bottom 5 lists – same thing for the tables themselves, the cells are pointed to two different pivot tables, the first of which is sorted based on descending average salary (so the best are at the top), and the second of which is sorted based on ascending average salary (so the worst are at the top). \n Two-country comparison – this section makes use of two data validation cells that allow the user to pick two countries from a drop-down list in a separate worksheet tab. The list is generated from the country name column of yet another pivot table. \n Updating flags – This was the trickiest part to do. Its hard to explain, so I will refer you to this post or this video . Basically, you create a second table in a different worksheet with the country names and the respective flag images fitted to the adjacent cells, name the cells (Ctrl+Shift+F3), create special formulas (Ctrl+F3) using the =INDIRECT() function, and map each image in the worksheet to the right formula. \n The four column charts in the lower section each have their own pivot table (there must be a more efficient way to do this – suggestions are welcome!) and the error bars are added using the ‘Layout > Error Bars > More Error Bars Options’ path and selecting the custom error bars option and pointing it to a pivot table with standard deviations for each of the four attributes (region, experience, job and usage). More on error bars at Jon’s site here . \n Slicers: a great tutorial that Chandoo created to teach about slicers can be found here . This part really wasn’t that difficult, you just have to know to include slicers using the ‘Analyze > Include Slicer’ menu path, and to connect each slicer to all of the pivot tables in the document so that they act as global filters. \n \n Now it’s your turn \n What’s your take? What would you do differently with this specific project? How much do you use Excel? \n Thanks for stopping by, as always! \n Ben"], "link": "http://dataremixed.com/2012/07/exploring-survey-data-with-excel/", "bloglinks": {}, "links": {"https://dl.dropbox.com/": 1, "http://excel.tips.net/": 1, "http://unstats.un.org/": 1, "http://www.excelcharts.com/blog": 1, "http://www.youtube.com/": 1, "http://www.tableausoftware.com/": 1, "http://img.chandoo.org/": 1, "http://www.contextures.com/": 1, "http://peltiertech.com/": 2, "http://dataremixed.com/": 1, "http://chandoo.org/": 4}, "blogtitle": "DataRemixed"}, {"content": ["Data visualization challenges present the opportunity to push our skills to the next level and do what we crazy data-types love to do best: play around with data (no, not something I usually bring up at dinner parties). \n It’s interesting to see how others approach the same data challenge. Sometimes submissions are painful, some are solid , and some are downright sublime . We may not always fully understand the scoring criteria, and we may not always agree with the outcome, but we will definitely learn something in the process. \n Today I found out that I won the Tableau Sports Viz contest  with my dashboard showing the worst sports droughts in North America. (That officially means I am benefiting from other’s misfortune, by the way – sorry, Cleveland). \n What did I win? The chance to duke it out with a couple fellow “Dataviz” enthusiasts at the upcoming 2012 Tableau Customer Conference in San Diego. In front of a crowd. With a timer . And some really  big screens showing my every mouse click (even the stupid ones). I’ve never had to create a dashboard while others watched my every move, so it should be an interesting experience. \n If you’re up for the challenge, and feel like spending a few late nights wrestling with some uncooperative data sets, here are a couple other contests that are on my radar (no onlookers to fret about with these ones): \n 1. Chandoo’s Visualize Excel Salary Data Challenge \n \n Challenge: “analyze more than 1900 survey responses & present your results in a stunning fashion” (get the data  here ) \n Cost to enter: Free \n Winner gets: XBOX 360 & Kinect Bundle (valued at $299) \n Deadline: July 6, 2012 \n \n \n 2. Visualizing.org’s Visualizing the London 2012 Olympic Games Challenge \n \n Challenge: “Use data and design to visualize the Olympics, helping us understand and enjoy as we watch” (find your own data) \n Cost to enter: Free \n Winner gets: $3,000 (interactive submission), $1,500 (static submission), and $500 (people’s choice) \n Deadline: July 27, 2012, 11:59 pm EDT \n \n \n 3. Many more data mining and predictive analytics competitions: Kaggle.com \n \n Best of luck! \n Ben"], "link": "http://dataremixed.com/2012/07/upcoming-data-viz-contests/", "bloglinks": {}, "links": {"http://public.tableausoftware.com/": 2, "https://twitter.com/": 1, "http://visualizing.org/": 1, "http://www.tableausoftware.com/": 1, "http://img.chandoo.org/": 1, "https://www.tableausoftware.com/": 1, "http://chandoo.org/": 1, "http://dataremixed.com/": 1, "http://www.kaggle.com/": 1, "http://conference.tableausoftware.com/": 1}, "blogtitle": "DataRemixed"}, {"content": ["This past week I had the great pleasure of catching a few moments with Andy Kirk of visualisingdata.com . Andy recently returned home to the U.K. from a trip to North America where he conducted data visualization training courses in five different cities – Chicago, Toronto, New York, Washington D.C. and Baltimore. I’m a huge fan of visualisingdata.com and Andy, who unknowingly gave me that extra nudge that I needed to start this blog almost one year ago. \n I wanted to talk to Andy because of his background, and because I was certain that someone who spent a full day with groups of people in each of those cities would have some very interesting things to say about the state of data visualization in North America, particularly the human component. \n \n What type of people are interested in data visualization and why? \n What kind of things do they struggle with or get excited about? \n How do they interact with each other? \n \n Andy and I discuss these topics and more in this 22 and a half minute chat that we recorded for your benefit. You will hear about Andy’s background and how he got hooked on data visualization, and you will hear about his sessions – both what he taught and what he learned from the attendees. That and you’ll get to hear his Yorkshire accent, which is reason enough to listen. \n Here are some key excerpts: \n About the training sessions – what is covered, and what is the format? \n Andy – “We cover in the first instance, the background of the subject, the foundation of some of the key theories, especially around cognitive science about how the brain and the eyes work – visual perception, and then we really launch into the methodology and the morning session is really around the preparatory stage, about how you contextualize and understand exactly what you’re trying to achieve with the visualization project, what curiosities you’re answering, what questions, what story you’re trying to portray, and also the intimate familiarization process of getting the raw data and learning about this raw material that you’re going to be working with. \n “And then we move on in the afternoon session purely about the design – What are the different visual options, the different visual layers that we need to harmonize and bring to a creative solution, but also the reasoning why some solutions work better than others… \n “And then we finish off with the construction and the launch of a project…we spend a decent amount of time in groups, conceiving a potential solution to a given problem, and using that session help try and cement what we’ve learned for the rest of the day.” \n On Andy’s philosophy or approach to data visualization: \n “I try and steer clear of any strict rules and hard principles. I tend to present considerations – things that people need to think about and justify to themselves or their client because there are so many different scenarios that lead to endless permutations about when something is a better solution than others, so I try and equip people with the thinking skills to be able to reason themselves through a project.” \n On the type of people that attend: \n “The variety and the richness of the background of people going to these events is fantastic for me. It’s not a single industry, it’s not a single, typical delegate. It’s literally everyone from every background – all ages, all levels of seniority…And for me that’s kind of justified the very objective, or the very mission I was trying to fulfill, which is to take this subject to all these people around the world, who are really representing the age that we live in – everyone is responsible for data in some shape, way or form, whether it’s analyzing or presenting or any kind of stage of the process. Everyone’s now got a responsibility that would otherwise in the past have been on the fringes of an organization, or very specialist roles, statisticians, engineers. And so the sheer fact is that the variety of people that come along to these events just sort of supports that mission, really.” \n More training sessions coming soon! \n The good news for folks like me on the west cost of North America is that Andy plans on bringing his training sessions to our neighborhood in the winter. Who wouldn’t want to visit L.A. and San Diego at that time of year? I’ll be sure to post a link to the 2nd leg of his tour as soon as it is announced. In the meantime, if you want to influence what cities are included in the itinerary, now is the time to let Andy know. You can get Andy’s contact info here . \n Thanks for stopping by, and many, many thanks to you, Andy, for sharing your insights with me and my readers! \n Ben"], "link": "http://dataremixed.com/2012/06/interview-with-andy-kirk/", "bloglinks": {}, "links": {"http://www.visualisingdata.com/": 3, "https://twitter.com/": 1, "http://visualisingdata.com/": 1}, "blogtitle": "DataRemixed"}]