[{"blogurl": "http://www.datapointed.net\n", "blogroll": [], "title": "Data Pointed"}, {"content": ["Upon first sight of Brent Yorgey’s brilliant Factorization Diagrams , I knew that I should take his lovely little dots and make them dance. \n Our first tango would be inspired by the digital clock , with a separate diagram for each of the hours, minutes, and seconds. For example, we’d portray 4:34:27 am like so: \n \n One night, plans discreetly set, we stole away, rendezvoused, and had our fun prancing about. But alas, although our encounter had grace, it begged for drama. Quite simply, there wasn’t enough panache – dynamic range – because while hours go up to 23, and minutes and seconds to 59 ( * ), the diagrams don’t really start cooking until they reach the triple digits. And, per the choreography, zero maps to a motionless blank space, which, represented by an alternate step, becomes a stray left foot in a square clog, staggering unnaturally amongst the positive, round-slippered wholes . \n So, instead, we practiced the best parts of our “clock” routine – the rhythmic movements and snappy transitions – and distilled the remainder to its essence. \n  \n And thus was borne the Factor Conga : a promenade of primes, composites, and their constituents, arranged with an aesthetically-tuned variation of Yorgey’s rules, one per second. \n Please play with the interactive , and do give it a minute to hit its stride. Or whirl there with a tap of the fast forward button. \n This is what the dance clubs look like on Alpha Centauri ."], "link": "http://www.datapointed.net/2012/10/animated-factorization-diagrams/", "bloglinks": {}, "links": {"http://www.merriam-webster.com/": 1, "https://www.google.com/": 1, "http://www.datapointed.net/": 3, "http://en.wikipedia.org/": 4, "http://api.tweetmeme.com/": 1, "http://mathlesstraveled.com/": 1}, "blogtitle": "Data Pointed"}, {"content": ["For hire, instruct me to throw caution to the wind, and I’ll gleefully tap dance across the bleeding-edge Web for as long as you like. \n Here, however, color me conservative. Sure, the haves drive shiny, freshly-updated, triple-headed, dodeca-core Mac Pros and can handle whatever I throw at them. But I also get lots of have nots , like Ma and Pa, who use the same ancient version of Windows SimpleBrowser that their kid installed five years ago. For their sake, I’ve gotta step lightly with my tech. Because regaling them with a gray rectangle just ain’t gonna cut it. \n On the flip-side, a neckbeard visited this site a few seconds ago, and now curses into the green glow of his Lynx - VT100 - dialup rig: \n \nNo animated ASCII? WTF?!!!\n \n Well, sorry, dude, I’m here to help. But, to paraphrase Lincoln , I can only please X fraction of the people Y fraction of the time, where X = 1 and .99 > Y > .8 , or vice versa. \n Ergo, client-side, the 90% Rule : \n If a new technology makes the experience better for nine tenths of the audience, use it. \n Why do I tell you this? Because, after what seemed to be years of waiting patiently, at approximately 2:47pm on Thursday, September 13, 2012, Data Pointed’s user share of the last “non-modern” browsers – those that don’t support some semblance of HTML5 , like Internet Explorer 8 – dwindled below the magic 10% threshold. \n In other words, Inline SVG and Canvas , come to papa! \n \n To celebrate, I’ve completely overhauled my His And Hers Colors visualization, which now renders in Retina-Ready SVG using Mike Bostock’s fantabulous D3 library. Read the backstory , then fire up the dataviz , zoom or fullscreen to taste, and mouse/tap each circle to see its color name and gender preference. And, don’t miss the new buttons along the bottom, which sort left-to-right by hue, saturation, popularity, and more. \n All in all, that’s 2,000 circles and radial gradients. They sing in Chrome, dance happily on IE9+ and Mac Safari, but trigger some serious Firefox rendering sludge , and spin the iPhone/iPad’s tiny embedded hamster wheel to terminal velocity. When the viz detects the “slow” browsers, it degrades gracefully, drops the fancy transitions, and displays at lower quality to improve the viewing experience. \n Please give it a whirl, tweet me your feedback, and stay tuned for more HTML5 hijinks, coming soon."], "link": "http://www.datapointed.net/2012/09/his-and-hers-colors-d3-svg/", "bloglinks": {}, "links": {"http://aa-project.sourceforge.net/": 1, "http://bost.ocks.org/": 1, "http://www.d3js.org/": 1, "https://bugzilla.mozilla.org/": 1, "http://www.javacoffeebreak.com/": 1, "http://www.datapointed.net/": 4, "http://en.wikipedia.org/": 6, "http://api.tweetmeme.com/": 1, "http://twitter.com/": 1, "http://www.quotationspage.com/": 1, "http://www.urbandictionary.com/": 1}, "blogtitle": "Data Pointed"}, {"content": ["Editor’s Note: This article is a recycled concept from several years ago, updated with a new rendering scheme that made it worth sharing again. \n A while back, I created two fanciful maps of a hypothetical, earth-penetrating, inverse-squared burger force, as broadcast by the 36,000-plus domestic restaurant locations of the eight largest U.S. fast food chains. Recently, I upgraded my Visualizationator’s speed by a few orders of magnitude, and as a test, I focused it on said beefspace , yielding several new renditions that you might find more delicious than before… \n But first, a few changes. In a nod to the reality of hungry humans, we retooled the power-law metric to mirror the long-distance travels of bank notes, per Brockmann’s seminal “Where’s George” study . The colors now represent the three most influential chains at each point, weighted by cumulative force at a 4:2:1 ratio, where black is McDonald’s, red Burger King, yellow Wendy’s, magenta Jack In The Box, periwinkle Sonic, cream Dairy Queen, green Carl’s Jr., and cyan Hardee’s. Together, you can think of these tweaks as elegantly exposing the subtle contours of market dominance, then splattering them with the individual restaurant locations. \n To wit, behold, the contiguous United States, viewed through the lens of the beefspace: \n  \n Now, let’s zoom into East Texas, Mississippi, and Louisiana: \n  \n That’s Dallas-Fort Worth at upper left and the Mississippi River delta lower right. Note the outlying clouds of also-ran franchise strength, dotted magenta on Houston’s south side and yellow at Jackson, Mississippi. \n Next, please peruse the nebulous burger ecosystem of the southern Piedmont, running northeast from Atlanta, Georgia to Charlotte, North Carolina: \n  \n Zooming west and inward, we train our gaze on metropolitan Phoenix and the faint rectangular hints of its primary street grid: \n  \n And finally, let’s roll the clock back to when all of this business began. Our singular universe, zeptoseconds before the Big Bang: \n \n Somewhere in there, as Sagan once said , billions and billions of burgers are waiting to be served! \n Thanks to AggData for providing the geolocated store information that made this article possible."], "link": "http://www.datapointed.net/2012/08/beefspace-maps-of-burger-territory/", "bloglinks": {}, "links": {"http://www.youtube.com/": 1, "http://www.datapointed.net/": 5, "http://en.wikipedia.org/": 1, "http://api.tweetmeme.com/": 1, "http://books.google.com/": 1, "http://rocs.northwestern.edu/": 1, "http://www.aggdata.com/": 1}, "blogtitle": "Data Pointed"}, {"content": ["Ah yes, the end of summer, and with only a month ’til school starts, the heat begins the segue to Autumn chill, and all of your coworkers return from their big vacations, it’s time to answer that burning question: \n How fast could you visit all 50 states? \n My inspiration? Blog Twelve Mile Circle’s article on the most state-tudinous 24-hour road trips, which I’ve tweaked and expanded into this all-encompassing route across America: \n \n Altogether, that’s a pleasant 6,813 mile drive , starting at South Berwick, Maine and ending in Taft, Montana, and passing, if ever so briefly, through each of the remaining Lower 48 states and the District of Columbia. \n \n Up for it? First, score a used box truck on Craigslist. Next, cut some windows through the sides, bolt in a bed and a fridge, and wire for sound. Then, with promises of one helluva rolling party, recruit a team of like-minded comrades. Now, tank full and fridge stocked, you’re ready to cover some asphalt. \n Average 55 mph with stops, swap in fresh drivers as necessary, and you’ll traverse every member of the contiguous U.S. in just under 124 hours. \n To complete the fifty, you’ll need to bag Alaska and Hawaii. Curb the truck at Spokane and fly a three-legged loop to Honolulu, Anchorage, and back, which adds about 36 hours , including layovers, for a total travel time of: \n Just under one week: 160 hours, or 3.2 hours per state. \n That’d be an awesome achievement, and about as fast as us little people can do it. \n However, if you’re that someone special, like Mitt Romney – who can bounce to the Caymans on a whim and wouldn’t be caught dead in the back of a box truck – the modern miracle of corporate jet travel opens a frontier far beyond the highway-addled imagination of the unwashed masses. \n \n You see, Mittens doesn’t need to arrive two hours before his scheduled flight. With a chortle, he glides past the cattle queue at the airport Rent A Wreck. And, this morning, his secretary wired orders to the Bain Capital logistics hit squad: “optimize Big Willard’s next trip for speed.” \n Now, she confirms, all the resources are in place: two Learjet 45s , working in tandem – one for the current hop, and the other to fly ahead and be ready for the next – and a limousine pre-positioned at each of his twenty airstrip stops, to whisk him to neighboring states in fully-stocked ( if unquaffable ) minibar style. \n Romney’s route mirrors the proles’, except that flyovers replace the mind-numbing intrastate parts. Cruising at 460 knots, his pilots deftly retire the 6200 air miles in just 11.7 hours, and at fifteen over the speed limit, his drivers navigate the 440 road miles in 6.3 hours. Add ten minutes per takeoff and landing, and 14 hours for the chartered Alaska-Hawaii Boeing 737, for a total of: \n 39 hours, or 47 minutes per state. \n “Not bad for new money,” booms a charismatic voice from on high. Hey, that’s Mr. Executive Privilege, Barack Obama . \n \n Our Commander-In-Chief reminds us that he can clear the airspace with a wag of his finger. Then, outfitted with the appropriate military hardware – a pair of souped-up fighters and a squadron of Apaches – he can buzz the same route more than twice as fast. The exact details are classified, but the jet can sustain Mach 1.6 and the helicopter 150 knots, so if we add five minutes to touch down and fully enjoy each state, it’ll take a total of: \n 18 hours, or 21 minutes per state. \n Every member of the union in a single day, with six hours to spare! And, going into November, Obama can toss off a sonic boom or two – oops! – to shatter a few windows and show those pesky Red States who’s boss. \n It’s good to be King on vacation."], "link": "http://www.datapointed.net/2012/08/fastest-route-to-visit-all-fifty-united-states/", "bloglinks": {}, "links": {"http://wearethe99percent.tumblr.com/": 1, "http://www.howderfamily.com/blog": 1, "http://abcnews.go.com/": 1, "http://mormon.org/": 1, "https://www.google.com/": 1, "http://www.baincapital.com/": 1, "http://en.wikipedia.org/": 6, "http://api.tweetmeme.com/": 1, "http://goo.gl/": 3}, "blogtitle": "Data Pointed"}, {"content": ["Here at Casa Von Worley, when fresh data strolls though the door, the first thing I do is test its mettle – with a quick-n-dirty visualization. And so, some months ago, to explore my nascent Growth Rings concept, I downloaded the U.S. Census block geometries , colored them randomly, and plotted a map of San Francisco. \n Faith in the Feds? I don’t have much, so I expected a close enough for government work City, cleansed by apathy and sloth of all but the coarsest detail. However, surprise surprise… \n \n Out popped a precise rendition of San Francisco’s crisp-yet-quirky street grid, the sinuous curves of 101 and 280 , and every dock and marina on the waterfront, faithfully modeled down to the individual slips. Hubba hubba! \n In tribute to the Census Bureau’s hard work – and as a study of how we occupy, manipulate, and subdivide our surroundings – I humbly present these maps, wherein each Census block is colored to contrast with its neighbors and contribute harmoniously to the overall texture. Below, you’ll find New York City , Boston , Seattle , and thirteen other interesting places. Click to embiggen, as always: \n                               \n At this point, I’d be remiss not to mention artist Jennifer Maravillas and her kindred drawings of Manhattan and San Francisco … created entirely by hand. Wowzers. \n Bravo, Jen, and block on, y’all!"], "link": "http://www.datapointed.net/2012/04/parts-and-parcels-us-census-block-maps/", "bloglinks": {}, "links": {"ftp://ftp2.census.gov/geo/tiger/TIGER2010/": 1, "http://www.datapointed.net/": 22, "http://en.wikipedia.org/": 2, "http://api.tweetmeme.com/": 1, "http://jenmaravillas.com/": 1, "http://frecklesofcolor.tumblr.com/": 2}, "blogtitle": "Data Pointed"}, {"content": ["Bradford Street was getting nervous. Two years ago, I’d crowned it as San Francisco’s – and possibly the world’s – steepest. But now, online chattered a successor to the throne: Hawaii’s Waipiʻo Valley Road , which reputedly cascades 900 vertical feet to the Pacific at a maximum grade of 45%! Impressive… except that you can’t believe everything you read on the Internets. So, last month, I grabbed my digital level, boarded a 747, flew to the Big Island , and motored over to Waipiʻo, in the interest of truth. \n West out of quaint Honokaʻa , the road rolls gracefully through pasture and rainforest. Sure, it’s a bit hilly. But extreme? No way. Did I miss a turn somewhere? Then, ten miles in, after a particularly worrisome run of flatness, the faint hum of tourists, a parking lot, and the pavement dives into a giant gash. I’d reached the rim of the Waipiʻo Valley, and it was all downhill from here: \n \n Per the signage, by law, only bona fide four wheel drive vehicles can proceed. No AWD allowed. Always the good citizen, I curbed my wimpy rental SUV, unpacked my level, and walked over the lip. \n By any measure, the Waipiʻo Valley Road is steep: you might say damn steep, extremely steep, or even butt-ass f*cking steep , depending upon your particular level of refinement and color commentary. It averages a 26% grade – descending 900 vertical feet over two thirds of a horizontal mile – and long sections tilt at a sustained 30% plus. In general, for whatever reason, photos don’t do steep streets justice, but here’s one anyways: \n \n As I descended, gravity urged: “Run, roll, slide to the bottom!” But that might hurt. So, instead, I carefully checked my acceleration with every step. Five minutes in, perspiration began to bead on my forehead. Walking downhill, the constant effort required to arrest my fall was making me sweat!  \n Along the way, I measured the instantaneous pitch with my digital level: 36%, 33%, 37%, 39%… and nothing steeper, anywhere, top to bottom. \n Now, back to San Francisco, the median grade of the northwest quarter of Bradford Street’s tiltiest slab , as surveyed by Yours Truly, last November: \n \n Yes, that’s a slope of 42.8% . Take a deep breath, Bradford, because in the kingdom of wheelbase tilt – how much your car would pitch, axle-to-axle, while driving up or down the road without any monkey business – you’re still the Big Kahuna . \n Now, please permit me to veer off topic and dish a few niblets of Kona (leeward Big Island) wisdom: \n \n Shaka : Like the Californian hang-loose sign, but with back of hand towards the recipient. Meaning: hey braddah , right on, thanks, etc. If you’re a tourist and get a shaka from a local, you’re doing it right. \n Luau : Tried the Royal Kona version. Leis, fire, swords, poi, pork, and mai tais. Serviceable portrayal of Pacific Island dances. Pleasant with a hint of shlock. Recommended. \n Accommodations : Relative to Waikiki , main town Kailua is cute and undespoiled, but I refuse to bed down anywhere within walking distance of a Bubba Gump’s Shrimp Company. To get off the tourist grid, travel 15 miles south to Captain Cook and the low-frills Manago Hotel . No TV in the rooms! \n Driving : Big Island is Big . But surely, I canz haul ass on the “Belt Highway” ? Bzzzt! Even the slightest curve in the road means 45mph, tops. Any attempt to not slow down and feel the aloha will be met by a stinky Datsun pickup, limping just off your front bumper. \n Snorkeling : We snorkeled Kona’s most popular sites: Kealakekua Bay (incredible variety of sea life), Honaunau’s Two Step (spinner dolphins), and Kahaluʻu (fish-bowl-style shallows). The young lava shoreline means many holes, fingers, slots, arches, cracks, tubes. Go before 9am to avoid crowds and near-entry gridlock. Equipment: dry snorkel with a purge valve, water shoes, fins. Visit a dive shop to find a mask that fits right. Cover your back with sunscreen or shirt. After you’ve “gotten your feet wet”, try the more adventurous options. \n Helicopter : “You don’t appreciate the full scale of the eruption until you see it from the air,” says my wife. And the electric lava sloshing in the two-hundred-foot-wide bathtub atop Puʻu ʻŌʻō crater… beyond words. We flew Safari Helicopters out of Hilo, but next time, I might try Blue Hawaiian . \n Luggage : Departing the Bay Area, our two bags weighed 92 pounds total. On the return, the same stuff tipped the scales at 108 pounds. The difference: damp, sandy clothes and gear? Dunno, but to avoid the onerous overweight fees, pack an extra bag, just in case. \n Island Fever : Primary symptom: distant, removed stare, manifesting hourly upon return to the mainland. “I think Steve’s in Hawaii again.” \n \n Aloha!"], "link": "http://www.datapointed.net/2012/04/steepest-streets-hawaii-waipio-valley-big-island/", "bloglinks": {}, "links": {"http://www.yelp.com/": 1, "http://www.safarihelicopters.com/": 1, "http://www.managohotel.com/": 1, "http://www.bluehawaiian.com/": 1, "http://www.shorediving.com/": 1, "http://mapper.acme.com/": 1, "http://www.to-hawaii.com/": 1, "http://www.letsgo-hawaii.com/": 1, "http://www.tripadvisor.com/": 1, "http://www.hawaiihighways.com/": 1, "http://www.kona123.com/": 1, "http://www.datapointed.net/": 1, "http://en.wikipedia.org/": 8, "http://api.tweetmeme.com/": 1, "http://www.curbsideclassic.com/": 1, "http://www.gohawaii.com/": 1, "http://www.urbandictionary.com/": 1}, "blogtitle": "Data Pointed"}, {"content": ["Is California headed into a drought? Should we expect a tardy parade of storms – the mythical March Miracle – to bury the Sierra and refill our reservoirs? Or will high pressure lock down the North Pacific, nudge the jet stream towards Alaska for good, and doom us to eight more months of summer? \n When it comes to weather, past performance is often indicative of future results, so I charted the last fifty years of rainfall in downtown San Francisco: \n \n That’s a line per rain year – the period running from July 1st through the following June, centered on California’s wet winter months – with a circle for each day sized by the amount of precipitation. The bars show the total rainfall received on either side of Valentine’s Day for each year. To enhance readability, smaller amounts are tinted “dead grass” brown and larger amounts “pooling water” blue. The data comes from meteorologist Jan Null’s Golden Gate Weather site , with updates from the NWS monthly summaries . \n On average, downtown San Francisco gets about 22.0 inches of annual rainfall: roughly two thirds (14.8″) on or before February 14th and the remainder (7.2″) after. This season thus far, the City has received 6.8 inches, about 46% of normal for the date, ranking as the third driest pre-Valentine’s period on record since 1960, behind 1975-76 and 1990-91. \n As for our March Miracle? Check the chart, and you’ll find that the years which finished wettest share one thing in common: none started out unusually dry. Furthermore, the ten seasons with the driest beginnings averaged 8.1 inches before V-Day and a paltry 5.2 inches after, which suggests that when the last raindrop falls, the 2011-12 rain year will clock in at around half of normal. \n “Don’t call a drought!” implore my skis and lawn. And perhaps rightfully so. At any moment, Mother Nature could deliver a duck-drowning deluge of Noachian proportions. However, the numbers suggest the opposite scenario, wherein the coastal Californian might be wise to toodle over to the local Home Despot and get one of them new fangled home desalination units – while the gettin’s good!"], "link": "http://www.datapointed.net/2012/02/san-francisco-rain-year-before-after-valentines-day/", "bloglinks": {}, "links": {"http://ggweather.com/": 1, "http://www.sacbee.com/": 1, "http://ww2010.uiuc.edu/": 1, "http://en.wikipedia.org/": 3, "http://api.tweetmeme.com/": 1, "http://campingsurvival.com/": 1, "http://www.noaa.gov/": 1}, "blogtitle": "Data Pointed"}, {"content": ["A public service announcement from the rural parts of America: \n Hello there, friend. I’m the country. Chances are, within the past week or three, you flew over or motored right through me. And that’s okay, of course – life’s hectic, and it’s a long way from here to there. But I miss you. \n So, please, come and visit. Upon arrival, you can do whatever you want. Relax, discover yourself, commune with nature, spot a UFO , fire large caliber weapons … I won’t judge. \n Getting here is an easy two-step process. First, figure out where everyone else is. Then, head in the other direction: \n  \n That’s me in black: every U.S. 2010 Census block with less than one resident per square mile. I freckle the East, define the West, and blanket icy Alaska almost in its entirety: \n  \n Perhaps grizzlies and tundra aren’t your thing? Bask in the warmth of my untrammeled Hawaiian shores: \n  \n Of the eight main islands, Lānaʻi is for lovers of peace and solitude. Unless you prefer to tiptoe through the UXO . \n All in all, stateside, just under 155,000 people live in my 2,120,000 square miles: 0.05% of the total U.S. population spread across 60% of the land. In other words, when you visit, you’ll have plenty of room to stretch, pitch a tent, and build a campfire. Or bang on the bongos, strip naked, and prance around like an antelope . Whatever makes you happy. \n Looking forward to seeing you soon! \n The Country"], "link": "http://www.datapointed.net/2012/01/maps-of-sparsely-populated-us-census-blocks/", "bloglinks": {}, "links": {"http://www.datapointed.net/": 4, "http://www.youtube.com/": 2, "http://en.wikipedia.org/": 6, "http://api.tweetmeme.com/": 1, "http://www.census.gov/": 1}, "blogtitle": "Data Pointed"}, {"content": ["Now, to accentuate the late round action, a few circular variations of our San Francisco 2011 mayoral election ranked choice voting visualizations . \n Warning! Warning! Warning! The following experimental images resemble pie graphs! If you’re a Chart Nazi and find them offensive, leave this page immediately. And go chase a unicorn. Tease a kitten. Whatever floats your boat. But please, no negative vibing in this direction. M’kay? \n In these charts, ranked choice ballot trajectories radiate from the center, first round inside to last round out. Angular width represents the fraction of the overall vote, like a pie graph. An additional 1,900 votes have straggled in since we created the originals , causing Hall and Alioto-Pier’s exits to flip-flop and the color scheme to change slightly. \n First, let’s view all ballots with a valid #1 choice other than mayor-elect Ed Lee or runner-up John Avalos , grouped by initial preference: \n \n Next, the same non-Lee/Avalos first choice ballots, grouped by final result: \n \n Finally, the 27% of all ballots cast, free of Lee or Avalos in any spot, which became exhausted: \n \n Tom Petty was right! In a 16-candidate election, the wasting is the hardest part. \n And that’s all I have to say about that."], "link": "http://www.datapointed.net/2011/11/san-francisco-mayoral-ranked-choice-election-pie-edition/", "bloglinks": {}, "links": {"http://www.datapointed.net/": 6, "http://en.wikipedia.org/": 4, "http://api.tweetmeme.com/": 1, "http://www.youtube.com/": 1}, "blogtitle": "Data Pointed"}, {"content": ["Inspiration comes in many forms, and most recently, as the following carrot, dangled in front of my face by fellow blogger Burrito Justice : \n  \n My my, San Francisco Department of Elections, what a big table you have. Because the whole circus – sixteen (16!) people – decided to run for mayor this year, and the City uses the system known as ranked choice voting . \n For those unfamiliar, here’s how ranked choice voting works. Go to a polling place, grab a ballot, and mark your favorite candidates in order of preference, one, two, three. First choice is Abraham Lincoln, of course. Second choice, Betsy Ross. Third choice, Winston Churchill. San Francisco elections are pick three, so you’re done. Bask in the warm glow of civic duty. \n But don’t bask long, because it’s time to tabulate! Add up the first choice votes. A majority wins, but otherwise, determine the least popular candidate ( * ), eliminate them, and give their votes to the next remaining choice on the supporting ballots. Repeat the process until finished. \n In our hypothetical four-way election, suppose the first choices break out 40% Ross, 36% Lincoln, 18% Churchill, and 6% Gandhi. Gandhi is lowest, so he’s eliminated, and his supporters’ second choices split between Lincoln and Churchill. So, going into Round 2, we have 40% Ross, 39% Lincoln, and 21% Churchill. Churchill loses, and per next choices, two thirds of his votes go to Lincoln, and the rest to Ross. Honest Abe wins with a 53% majority. \n Now, ramp that up to 16-candidate Frisco, and you get the tabular thicket of numbers pictured above. \n In the interest of clarity, Burrito Justice tweeted : \n Thanks! Hey @datapointed, time to apply the crayola chart methodology! RT @McClure_SF: @burritojustice http://www.sfelections.org/results/20111108/data/mayor.html via @kevinmonty\n \n Great idea! Then, I whipped up a few drafts which didn’t go anywhere, and, at that point, I shoulda stopped. But Señor Justice had me hooked… \n So, using the official San Francisco mayoral election data (as of November 17th), we calculated the trajectory of each ballot: the sequence of candidates that it counted towards in each round of the tabulation process. Next, we eliminated the trajectories for ballots with no valid choice. Then, we rendered each as a fixed-thickness horizontal line, colored by candidate, first round left to last round right. Finally, we stacked them to create a chart where the vertical axis represents the overall fraction of the voting pool. \n Here are the trajectories, sorted most common first: \n \n At the top, we see the purple and medium blue of winner Ed Lee and runner-up John Avalos . A first choice of either of those two counted for them all the way through. Next is the bright cyan of Dennis Herrera, dark blue for David Chiu, cream for Leland Yee, and so on. To decode the colors, click through to the large version , which has labels for the major candidates. \n The same trajectories, grouped by first choice: \n \n The bars along the left side show the initial preference by candidate. And… Newsflash! San Francisco isn’t completely colorblind; note the flow of votes along ethnic channels, especially from Herrera to Avalos and Chiu to Lee. \n And to wrap it up, let’s sort by final result: \n \n To the right, we see Lee over Avalos, and large slug of dark gray, representing the trajectories which had no choices left in the race. These exhausted ballots – 27% of the total cast – ended up not counting. That being said, in a sixteen candidate torture test, ranked choice voting trounces the traditional plurality system , which would have degenerated into a government-sponsored festival of wasted votes. \n Nevertheless, the “27% exhausted” figure bothers me, so I have to ask: \n Is there a fairer way to deal with the insane variety of San Francisco politics? A ranked choice primary to narrow the field, followed by a ranked choice runoff? \n Let’s take a vote. \n Footnote: (*) Technically, in San Francisco, in each tabulation round, the most popular candidate who has more votes than the total for all less popular candidates is determined, and the votes of these less popular candidates are redistributed simultaneously. Typically, one candidate’s votes are redistributed in each round, except in Round 4 of this election, in which four candidates votes were redistributed."], "link": "http://www.datapointed.net/2011/11/san-francisco-mayoral-ranked-choice-election/", "bloglinks": {}, "links": {"http://www.mayoredlee.com/": 1, "http://avalosformayor.org/": 1, "http://api.tweetmeme.com/": 1, "http://sfelections.org/": 3, "http://www.datapointed.net/": 6, "http://en.wikipedia.org/": 2, "http://www.sfelections.org/": 1, "http://www.burritojustice.com/": 1, "http://twitter.com/": 4}, "blogtitle": "Data Pointed"}]