[{"blogurl": "http://myreckonings.com/wordpress\n", "blogroll": [], "title": "Dead Reckonings"}, {"content": ["Last month Joe Marasco, Leif Roschier and I published an article on Bayes’ Theorem in The UMAP Journal that included a foldout of large circular nomograms for calculating the results from it. The article, Doc, What Are My Chances? , can be freely downloaded from the Modern Nomograms webpage, which also offers commercial posters of the two nomograms used to calculate Bayes’ Theorem (one for common cases and one optimized for calculating rare cases). \n Bayes’ Theorem is a statistical technique that calculates a final posttest probability based on an initial pretest probability and the results of a test of a given discriminating power. Thomas Bayes (1701-1761) first suggested this method, and Pierre-Simon Laplace published it in its modern form in 1812. It has generated quite a bit of controversy from frequentists (who work from a null hypothesis rather than an initial posited probability), but this technique has become much more popular in modern times. \n Among many other applications, this is a common technique used in evidence-based medicine, in which statistical methods are used to analyze the results of diagnostic tests. For example, a diagnostic test might have a sensitivity of 98%, or in other words, the test will return a positive result 98% of the time for a person having that disease. It might have a specificity of 95%, which means it will return a negative result 95% of the time for a person who does not have the disease. For a disease that has a prevalence (a pretest probability) of 1% in the general population, Bayes’ Theorem provides, say, the probability of a person having the disease with a positive test result. Pretty darn likely, right? Well, it turns out it’s about 16% because the false positives from the 99% who do not have the disease overwhelm the true positives from the 1% who have it. This is the basis for recent recommendations to stop PSA screening in men, for example, as expensive and counterproductive. But all this is described in detail in the article. Enjoy!"], "link": "http://myreckonings.com/wordpress/2012/03/11/bayes-theorem-medical-diagnostics-and-nomograms/", "bloglinks": {}, "links": {"http://www.modernnomograms.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["I want to announce that my fellow collaborators in nomography, Joe Marasco and Leif Roschier, and I have a new website called Modern Nomograms to offer posters of new nomograms that we hope will interest people. Our initial posters are nomograms for calculating results from Bayes’ Theorem as described in the next post here, but we expect more will follow. \n This project does not in any way affect the content here—essays will continue to be written as usual on lost arts in the mathematical sciences, including nomography. This is simply an outlet to provide an option for nomograms in poster form."], "link": "http://myreckonings.com/wordpress/2012/03/11/new-modern-nomograms-website/", "bloglinks": {}, "links": {"http://www.modernnomograms.com": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["by Ron Doerfler and Miles Forster \n Part I of this essay provided  background information that demonstrates the difficulty of the problem of mental extraction of 13th roots and the efforts of calculators to master it. But can it be possible for us to extract 13th roots of 100-digit numbers without devoting portions of our life to it? With a basic talent in mental arithmetic and some study, it can certainly be done, even if not in record time. We present a new method that involves no logarithms, no antilogarithms and no factoring, one that works with 13th powers that end in 1, 3, 7 or 9 (the cases attempted by record holders). The memorization consists of one table and a few formulas. As always, a printer-friendly PDF version of Parts I and II is linked at the end of this essay. \n (more…)"], "link": "http://myreckonings.com/wordpress/2011/10/05/the-13th-root-of-a-100-digit-number-part-ii/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["by Ron Doerfler and Miles Forster \n Mental calculators of note (so-called “lightning calculators”) developed areas of expertise in performing calculations that seem astonishing, even unbelievable, to the rest of us. One such specialty is calculating the 8-digit root of a 13th power of 100 digits. Achieving record times historically required massive memorization and calculating speed, racing through a procedure that remains a mystery to most people. Part I of this essay provides a historical overview of the extraction of 13th roots, including the methods used by a few mental calculators, methods that largely rely on a mix of intensive mental calculation and large-scale rote memorization. It demonstrates the creativity and drive of these  marvelous people. \n In Part II of this essay we will propose a new method for 13th roots like those posed to lightning calculators that is relatively easy to learn, one that makes this feat feasible for those of us with basic mental math capabilities and a desire to do something amazing. As always, a printer-friendly PDF version of Parts I and II is linked at the end of this essay. \n (more…)"], "link": "http://myreckonings.com/wordpress/2011/10/05/the-13th-root-of-a-100-digit-number-part-i/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["Those of us who enjoy our expeditions through the lost world of nomography quickly discover that many original sources that are still considered masterpieces in the field have never been translated into English. In my case this is a serious handicap, and I find myself struggling through the texts trying to understand the rationale behind the beautiful nomograms I see on the printed page. Nomography and its predecessors were invented in France and only later spread to such places as Germany, the U.S, Britain, Russia and Poland. Today it seems to me that most research appears in Czech journals. In addition to the language difficulties, many of the original sources are in obscure, hard-to-find journals. \n In 1982 H.A. Evesham produced his doctoral thesis, a review of the important discoveries in nomography. It is often cited in other works, but unless you know someone who knows someone, it is very difficult to find—I have never been able to locate a copy. However, just recently Mr. Evesham’s thesis has been professionally typeset and released as a book (click here or here ) by Docent Press under the aegis of Scott Guthery. If you have an interest in the theoretical aspects of nomography beyond the basic construction techniques of most books and of my earlier essays, you will appreciate this book as much as I do. Mr. Evesham does a wonderful job of weaving mathematical discoveries in nomography from many contributors into a readable but scholarly work. \n (more…)"], "link": "http://myreckonings.com/wordpress/2011/02/12/book-review-the-history-and-development-of-nomography-by-ha-evesham/", "bloglinks": {}, "links": {"http://www.docentpress.com/": 1, "http://www.amazon.com/": 1, "http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["I have researched and written about methods of mental calculation over the years, and I’m often surprised at the ingenuity evident in the mathematical methods developed specifically for it. Based on my Lightning Calculator series of essays here , I’ve created a new 2011 calendar titled Lightning Calculation . It’s a unique, interactive calendar for developing abilities in mental calculation. You can download a free PDF file for printing on your computer, or if you prefer, order it for delivery through Lulu.com. I also think it might be a nice thing to make as a Christmas gift for someone interested in this sort of thing, or for displaying in a math classroom. \n NOTE:  If you choose to have the calendar professionally printed by Lulu.com rather than on your own printer, through December 31 you can enter the code REMARKABLEYEAR305 at checkout for 20% off the price of $17.60. The Lulu site is also posting daily coupon codes in December here . \n (more…)"], "link": "http://myreckonings.com/wordpress/2010/11/22/a-2011-%e2%80%9clightning-calculation%e2%80%9d-calendar/", "bloglinks": {}, "links": {"http://myreckonings.com/": 2, "http://www.lulu.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["Part I of this essay described and analyzed Charles Lallemand’s L’Abaque Triomphe , the first published example of a graphical computer called a hexagonal chart . Here we discuss the mathematical principles behind hexagonal charts and provide examples of these charts from the literature of the time. The related development of triangular coordinate systems is also covered in this second part. Trilinear diagrams , a simpler offshoot of triangular coordinate systems, are still seen today in fields such as geology, physical chemistry and metallurgy (as shown to the left). A list of references is provided as well. As always, a printer-friendly Word/PDF version with more detailed images is linked at the end, with a hexagonal overlay in the appendix that can be used to exercise these charts. \n (more…)"], "link": "http://myreckonings.com/wordpress/2010/05/05/lallemands-labaque-triomphe-hexagonal-charts-and-triangular-coordinate-systems-part-ii/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["In 1885, Charles Lallemand, director general of the geodetic measurement of altitudes throughout France, published a graphical calculator for determining compass course corrections for the ship, Le Triomphe . It is a stunning piece of work, combining measured values of magnetic variation around the world with eight magnetic parameters of the ship also measured experimentally, all into a very complicated formula for magnetic deviation calculable with a single diagram plus a transparent overlay. This chart has appeared in a number of works as an archetype of graphic design (e.g., The Handbook of Data Visualization ) or as the quintessential example of a little-known graphical technique that preceded and influenced d’Ocagne’s invention of nomograms—the hexagonal chart invented by Lallemand himself. Here we will have a look at the use and design of this interesting piece of mathematics history, as well as its natural extension to graphical calculators based on triangular coordinate systems. Part I of this essay covers Lallemand’s L’Abaque Triomphe , while Part II covers the general theory of hexagonal charts and triangular coordinate systems. As always, a printer-friendly Word/PDF version with more detailed images is linked at the end of the essay. \n (more…)"], "link": "http://myreckonings.com/wordpress/2010/05/05/lallemands-labaque-triomphe-hexagonal-charts-and-triangular-coordinate-systems-part-i/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["Last summer a fellow nomography enthusiast and friend, Joe Marasco , e-troduced me to the editor of the Undergraduate Mathematics and Its Applications (UMAP) Journal , with the idea of submitting my original 3-part nomography essay on this blog for publication. The experience I’ve had on this project with Paul Campbell, a professor at Beloit College and the editor of the journal, has been superb. In addition to his enthusiastic support on the article, he invited me to give talks on nomography and sundials at the college, which I thoroughly enjoyed doing last September. \n The article, a significantly revised version of my blog essay, has now been published in the UMAP Journal , and per the standard agreement I can post the PDF of the article here for anyone to download. More information and a link to the article are below. \n (more…)"], "link": "http://myreckonings.com/wordpress/2010/04/18/nomography-article-in-the-umap-journal/", "bloglinks": {}, "links": {"http://www.barbecuejoe.com/": 1, "http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["As you may have noticed, the history of graphical computing (nomograms and the like) has become one of the major themes of this blog. I did not foresee this, as I knew virtually nothing about the subject before I started researching my first essays on nomography a couple of years ago. This topic is still one of my main pursuits, and I’m as astonished by what I find now as I was back then. To capture a bit of this spirit, I’ve created a free 2010 calendar titled The Age of Graphical Computing that is available for downloading and printing. The fun thing is that you can test the examples right on the calendar to show that they work! \n There are two formats available: two-sided 8-1/2″ x 11″ sheets of paper printed in landscape mode that can be connected at their edge as shown in the photo on the left, and two-sided 11″ x 17″ sheets of paper printed in portrait mode with two pages per side that can be folded as a group and stapled in the middle. Either of these could be printed to fit on A4 or other sizes, I’m sure. White paper can be used, but the color scheme is really designed for a light beige or ivory paper and it looks so much more professional when it’s printed on paper of some color (gray might work). The stapled format requires no other binding. As you can see from the photo on the left, I printed the first (non-stapled) format and took the printed sheets (24 lb. Southworth ivory linen paper from OfficeMax) to a local office shop (Kinko’s FedEx) and had them add clear plastic sheets to the front and back and install a spiral wire (a 60-second job that costs $5). Drilling a hole in the center along the top to hang it completes the calendar. Using 3 rings through punched holes along the top may be a cheaper option. \n Continue below to see thumbnail images and the download instructions. \n (more…)"], "link": "http://myreckonings.com/wordpress/2009/12/31/a-2010-graphical-computing-calendar/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["Are you intrigued by nomograms but have no idea how to go about drawing them? PyNomo is an amazing, free software package for drawing precision nomograms. The output is in vector form in a PDF or EPS file, so it can be printed in any size and still retain its sharpness. PyNomo directly supports 9 basic types of nomograms based simply on the format of the equation, so for these types there is no need to convert the equation to the standard nomographic determinant or use geometric relations. But it also supports compound nomograms as well as more complicated equations that have been cast into general determinant form, so it can produce output for any equation that can be plotted as a nomogram. \n When I started writing an essay on using PyNomo my plans were to show three examples of nomograms. But I had so much fun making really cool nomograms that the essay turned out to be more of a user’s manual, with examples of all the supported types and descriptions of the many parameters you can use to customize your nomograms. Leif Roschier, the author of the software, spent a great deal of time reviewing draft versions of the essay and making software updates for new features that were rolled into it, so the essay is comprehensive in scope and quite complete in details and practical advice. PyNomo is clearly my choice for drawing nomograms going forward, and I think you will find it as uniquely wonderful as I have. \n The essay is too long and the example nomograms too detailed to be rendered in HTML here. The PDF version of the essay (Version 1.1) can be found here . The PyNomo website, which also contains many examples, is found here . \n [NEW - December 21, 2011]:  Detailed instructions on downloading and installing all required software applications onto a Windows XP or Windows 7 PC can be found here . \n ——————- \n Updated October 19, 2009, to Version 1.1 for the new features of PyNomo Release 0.2.2: \n \n  Automatic spacing of tick marks along scales—more tick marks where space is available and less where it’s crowded. \n Drawing of sample isopleths  between specified values on scales. \n Printing of only significant digits of scale values by default, producing a cleaner-looking nomogram overall."], "link": "http://myreckonings.com/wordpress/2009/07/31/creating-nomograms-with-the-pynomo-software/", "bloglinks": {}, "links": {"http://www.myreckonings.com/": 1, "http://www.pynomo.org": 1, "http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["William Thomson called them “beautiful and ingenious geometrical constructions,” and in variance to their rather humdrum name dygograms are certainly charming to the eye. But these geometric constructions can conveniently generate and then calculate the magnetic deviation of a ship compass at a location. \n With our electronic calculators and computers, we take for granted the effortless arithmetic and trigonometric calculations that so vexed our ancestors. Pre-calculated tables for roots and circular functions, generated through hard work, were often used to create tables of magnetic deviations for specific ships and locations. To reduce the chance of misreading these tables, a few types of graphical diagrams, not just dygograms, were invented to provide fast and accurate readings of magnetic deviation. These graphical calculators are the focus of this part of the essay. \n (more…)"], "link": "http://myreckonings.com/wordpress/2009/04/18/magnetic-deviation-comprehension-compensation-and-computation-part-ii/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["The Scottish mathematician and lawyer Archibald Smith first published in 1843 his equations for the magnetic deviation of a ship, or in other words, the error in the ship’s compasses from permanent and induced magnetic fields in the iron of the ship itself. This effect had been noticed in mostly wooden ships for centuries, and broad attempts to minimize it were implemented. But the advent of ships with iron hulls and steam engines in the early 1800s created a real crisis. A mathematical formulation of the deviation for all compass courses and locations at sea was needed in order to understand and compensate for it, and Smith became the preeminent expert in this sphere of activity. With Capt. Frederick J. Evans he extended his mathematical treatment to detailed procedures for measuring the magnetic parameters for a ship, and he also invented graphical methods for quickly calculating the magnetic deviation for any ship’s course once these parameters were found, constructions called dynamo-gonio-grams (force-angle diagrams), or dygograms for short. \n Today, radio navigational systems such as LORAN and GPS, and inertial navigation systems with ring and fiber-optic gyros, gyrocompasses and the like have reduced the use of a ship’s compass to worst-case scenarios. But this triumph of mathematics and physics over the mysteries of magnetic deviation, entered into at a time when magnetic forces were barely understood and set against the backdrop of hundreds of shipwrecks and thousands of lost lives, is an enriching chapter in the history of science. Part I of this essay presents a brief sketch of the problem and the analysis and solutions that were developed to overcome it. Part II sets out with a discussion of Smith’s graphical methods of computing the magnetic deviation and concludes with a list of the references cited in the essay. \n (more…)"], "link": "http://myreckonings.com/wordpress/2009/04/18/magnetic-deviation-comprehension-compensation-and-computation-part-i/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["You are invited to participate in a new forum established to share ideas and information related to lost art in the mathematical sciences. If you have feedback related to a specific essay or its user comments, please continue to provide comments at the end of the post. Otherwise, for general comments or suggestions for future essays, and in fact for wide-ranging discussions on erstwhile discoveries in mathematics and science, please feel free to post entries on the forum here , specifically on the discussion board for this blog. I will be posting essays here as I always have, and I’m still soliciting guest essays for this blog—the forum is simply a separate but related enterprise that involves more people and opens up more topics."], "link": "http://myreckonings.com/wordpress/2008/07/25/added-forum-on-lost-art-in-the-mathematical-sciences/", "bloglinks": {}, "links": {"http://www.myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["In a clear breach of this blog’s charter, I’d like to announce the release of free software I developed for creating convenient, pocket-sized paper organizers. Using LaTeX as a typesetting engine, a high quality PDF file is generated of 16 mini-pages, which is then printed on both sides of a sheet of letter or A4 paper and folded to create a small booklet that can fit in your pocket. The Windows interface directly supports several types of standard pages (List, Text, Calendars, Contacts, etc.) and maintains all user data between sessions. It also provides page types not seen in conventional organizers, such as a Vigenere Cipher page for on-the-go encrypted text and an Astronomy page with a calculated planisphere of current star/planet/moon locations along with other astronomical data. Beyond this, custom user-designed pages can be easily written in LaTeX script and shared in the Plans Unfolding forum and galleries. For more information, please visit the Plans Unfolding home page here . Now back to the subject at hand—thanks for your indulgence."], "link": "http://myreckonings.com/wordpress/2008/07/25/off-topic-plans-unfolding-paper-organizer-software/", "bloglinks": {}, "links": {"http://www.plansunfolding.com": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["Mental calculators of yesteryear were usually described in magazines, newspapers and books in ways that can be startling in our more cynical age. But even today newspaper articles, documentaries and television features on modern lightning calculators appear almost regularly, often with a “hook” such as diminished capabilities in other areas (the “Einstein” effect). Surely there must be some reports that try to be objective, but I haven’t found them. At best they are naively written by people with little mathematical background; at worst they use considerable license (deception, really, if only by omission) to present a better story. This part of the essay is not directly related to the historical art of mental calculation itself, but I think it serves as a cautionary tale in evaluating articles on it. \n (more…)"], "link": "http://myreckonings.com/wordpress/2008/04/15/lightning-calculators-iii-the-media/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["The types of calculations performed by lightning calculators were historically quite limited, notable mainly for the size of the numbers and the speed at which they were manipulated. But remember that the questioner had to verify every calculation by hand, making higher powers and roots (particularly inexact roots) much less feasible. The dawn of calculators and computers propelled some of these tasks into hitherto uncharted territories such as 13 th or 23 rd roots, deep roots of inexact powers, and so forth, much of it supported by more sophisticated mathematics. Here we will review the methods of calculation used in the past, many of them not commonly known, as well as other techniques that are relatively new. \n (more…)"], "link": "http://myreckonings.com/wordpress/2008/04/15/lightning-calculators-ii-the-methods/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["Individuals with preternatural abilities to calculate arithmetic results without pen, paper or other instruments, and to do so at astonishing speed, are the stuff of mathematical and psychological lore. These “lightning calculators” were sometimes of limited mental ability, sometimes illiterate but of average intelligence, and sometimes exceptionally bright, this despite the popular notion of the idiot savant . The techniques used by these people are not generally well known. In fact, despite claims by educators that acquiring a mental facility with arithmetic operations is essential to a student’s mathematics education, I see little in the textbooks other than simple estimations based on rounding values, surely the most basic and least interesting mental task. The field of mental calculation may not be a lost art per se, but in this digital age it most certainly is a neglected one. \n Part I of this essay attempts to take a fresh look at both historical and modern lightning calculators. Part II describes classic and modern methods of mental calculation. And finally, Part III demonstrates as a cautionary tale the shallow and deceptive nature of most media coverage of lightning calculators, an important consideration in analyzing reports on them. \n (more…)"], "link": "http://myreckonings.com/wordpress/2008/04/15/lightning-calculators-i-the-players/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["by Liunian Li  李留念 and Ron Doerfler \n Designing a nomogram for an equation containing more than three variables is difficult. The most common nomogram of this sort implements pivot points, requiring the user to create a series of isopleths to arrive at the solution. In this guest essay, Liunian Li describes the ingenious design of a nomogram that requires just a single isopleth to solve a 4-variable equation. For convenience the method is described in both English and Chinese. \n (more…)"], "link": "http://myreckonings.com/wordpress/2008/03/13/a-4-variable-nomogram-%e5%9b%9b%e5%8f%98%e9%87%8f%e8%af%ba%e6%a8%a1%e5%9b%be/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["In Part III of my essay on The Art of Nomography , I mentioned the use of Weierstrass’ Elliptic Functions to create a nomogram composed of three variable scales overlaid onto a single curve. In particular, Epstein describes using this family of functions to create a nomogram for the equation u + v + w = 0 , adding that the formula can be generalized for functions of these variables. This topic generated some interest, and it certainly is interesting to me, so I’ve explored it in more detail by designing a single-curve nomogram based on functions of u, v and w. This essay describes the procedure I followed to create a “fish” nomogram (found  here ) manifesting the formula for the oxygen consumption of rainbow trout as a function of weight and water temperature—a modest attempt to blend art with artifice. \n (more…)"], "link": "http://myreckonings.com/wordpress/2008/02/24/a-zoomorphic-nomogram/", "bloglinks": {}, "links": {"http://www.myreckonings.com/": 1, "http://myreckonings.com/": 3}, "blogtitle": "Dead Reckonings"}, {"content": ["I’ve been fascinated by astrolabes for a very long time, roughly 20 years. It was this avocation that led to my interest in sundials and, because they share museum space, my interest in clocks. When I lived in Rockford, Illinois, I would haunt the Time Museum, an institution that produced the most beautiful book on astrolabes. Adler Planetarium in nearby Chicago has one of the best astrolabe collections in the entire world, producing another beautiful book solely on Western astrolabes and a gorgeous book on antique scientific instruments in general. None of these provide the mathematical details of astrolabe design beyond a description of stereographic projection, and indeed this kind of detailed information is rarely found. The Astrolabe , a new book by James E. Morrison, is an absolutely unique and wonderful book on the mathematics needed to create accurate, beautiful designs of astrolabes, quadrants and other related instruments. I can’t recommend it enough to those who share the interests of this blog. \n (more…)"], "link": "http://myreckonings.com/wordpress/2008/01/16/book-recommendation-the-astrolabe-by-james-e-morrison/", "bloglinks": {}, "links": {"http://www.astrolabes.org/": 2, "http://www.amazon.com/": 2, "http://shop.adlerplanetarium.org/": 1, "http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["In addition to providing sophisticated nomograms, the use of determinants as described in the previous Part II offers one other huge advantage. Often the scaling factors of variables have to be manipulated to get a nomogram that uses all the available area and yet stretches portions of the curves that are most in need of accuracy; alternatively, there may be a need to bring distant points (even at infinity) into a compact nomogram. This can be done by morphing the nomogram with any transformation that maps points into points and lines into lines. It is also intriguing to consider the aesthetics of such transformations, creating eye-catching nomograms as an artistic process. \n This final part of the essay reviews the types of transformations that can be performed on a nomogram, and it concludes by considering the roles of nomograms in the modern world and providing references for further information. \n (more…)"], "link": "http://myreckonings.com/wordpress/2008/01/09/the-art-of-nomography-iii-transformations/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["The previous Part I of this essay described the construction of straight-line nomograms using simple geometric relationships. Beyond this, a brief knowledge of determinants offers a powerful way of designing very elegant and sophisticated nomograms. A few basics of determinants are presented here that require no previous knowledge of them, and their use in the construction of straight line nomograms is demonstrated. Then we will see how these determinants can be manipulated to create extraordinary nomograms. \n (more…)"], "link": "http://myreckonings.com/wordpress/2008/01/09/the-art-of-nomography-ii-designing-with-determinants/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["Nomography, truly a forgotten art, is the graphical representation of mathematical relationships or laws (the Greek word for law is nomos ). These graphs are variously called nomograms (the term used here), nomographs , alignment charts , and abacs . This area of practical and theoretical mathematics was invented in 1880 by Philbert Maurice d’Ocagne (1862-1938) and used extensively for many years to provide engineers with fast graphical calculations of complicated formulas to a practical precision. \n Along with the mathematics involved, a great deal of ingenuity went into the design of these nomograms to increase their utility as well as their precision. Many books were written on nomography and then driven out of print with the spread of computers and calculators, and it can be difficult to find these books today even in libraries. Every once in a while a nomogram appears in a modern setting, and it seems odd and strangely old-fashioned—the multi-faceted Smith Chart for transmission line calculations is still sometimes observed in the wild. The theory of nomograms “draws on every aspect of analytic, descriptive, and projective geometries, the several fields of algebra, and other mathematical fields” [Douglass]. \n This essay is an overview of how nomograms work and how they are constructed from scratch. Part I of this essay is concerned with straight-scale designs, Part II additionally addresses nomograms having one or more curved scales, and Part III describes how nomograms can be transformed into different shapes, the status of nomograms today, and the nomographic references I consulted. \n (more…)"], "link": "http://myreckonings.com/wordpress/2008/01/09/the-art-of-nomography-i-geometric-design/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["An operational calculus converts derivatives and integrals to operators that act on functions, and by doing so ordinary and partial linear differential equations can be reduced to purely algebraic equations that are much easier to solve. There have been a number of operator methods created as far back as Leibniz, and some operators such as the Dirac delta function created controversy at the time among mathematicians, but no one wielded operators with as much flair and abandon over the objections of mathematicians as Oliver Heaviside, the reclusive physicist and pioneer of electromagnetic theory. \n (more…)"], "link": "http://myreckonings.com/wordpress/2007/12/07/heavisides-operator-calculus/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["Pendulums are the defining feature of pendulum clocks, of course, but today they don’t elicit much thought. Most modern “pendulum” clocks simply drive the pendulum to provide a historical look, but a great deal of ingenuity originally went into their design in order to produce highly accurate clocks. This essay explores horologic design efforts that were so important at one time—not gearwork, winding mechanisms, crutches or escapements (which may appear as later essays), but the surprising inventiveness found in the “simple” pendulum itself. \n It is commonly known that Galileo (1564-1642) discovered that a swinging weight exhibits isochronism , purportedly by noticing that chandeliers in the Pisa cathedral had identical periods despite the amplitudes of their swings. The advantage here is that the driving force for the pendulum, which is difficult to regulate, could vary without affecting its period. Galileo was a medical student in Pisa at the time and began using it to check patients’ pulse rates. \n Galileo later established that the period of a pendulum varies as the square root of its length and is independent of the material of the pendulum bob (the mass at the end). One thing that surprised me when I encountered it is that the escapement preceded the pendulum—the verge escapement was used with hanging weights and possibly water clocks from at least the 14th century and probably much earlier. The pendulum provided a means of regulating such an escapement, and in fact Galileo invented the pin-wheel escapement to use in a pendulum clock he designed but never built. But it took the work of others to design pendulums for truly accurate clocks, and here we consider the contributions of three of these: Christiaan Huygens, George Graham and John Harrison. \n (more…)"], "link": "http://myreckonings.com/wordpress/2007/11/19/the-not-so-simple-pendulum/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["Have you ever had to calculate the positions of astronomical objects? Orbital calculations relative to an observer on the Earth require derivations and time-consuming solutions of spherical trigonometric equations. And yet, these kinds of calculations were accomplished in the days prior to the advent of calculators or computers! \n For example, to find the zenith angle (angle to overhead) and azimuth (angle from North) of the sun at any day and time of the year for any location on Earth, the laws of spherical trigonometry produce the formulas below. Here the solar declination δ is a function of the solar longitude λ and ecliptic angle ε as shown in the figure to the left. \n \n These calculations can be automated today—but did I mention that these solutions were found before electronic calculators? \n … or slide rules, or logarithms? \n  … or trigonometric formulas?  \n … or even algebra ?? \n In fact, Vitruvius (ca. 50) and Ptolemy (ca. 150) provided mathematical and instrumental means of calculating the sun’s position for any hour, day, and observer location by the use of geometric constructions called analemmas (only indirectly related to the figure-8 analemma on globes). An important application of analemmas was the design of accurate horizontal and vertical direct and declining sundials for any observer location. These analemmas are awe-inspiring even today, and as the study of “Descriptive Geometry” has disappeared from our schools they can strike us as mysterious and wondrous inventions! \n (more…)"], "link": "http://myreckonings.com/wordpress/2007/10/28/12/", "bloglinks": {}, "links": {"http://myreckonings.com/": 1}, "blogtitle": "Dead Reckonings"}, {"content": ["This journal attempts to capture my occasional encounters with the technically elegant but nearly forgotten in the mathematical sciences—artistically creative works that strike me as particularly brilliant. These can be small, clever things (say, an algorithm for calculating roots), or they can be ingenious technical inventions of more general application, basically anything that makes me think ‘Wow, that’s neat!’ Think of pendulum clock escapements; of beautiful precision sundials, astrolabes and other antique scientific instruments; of music theory and instrument design; of early, desperate attempts to calculate logarithms and trigonometric values; of stereo photography and linkage mechanisms; of difference engines, trinary arithmetic and slide rules; of old map projections and vacuum tube op-amps. \n Posts here are brief or not-so-brief essays of unusual things of this nature that I read or hear about, supplemented with references and some amount of research I typically do on these topics. Any longer papers that emerge (particularly on mental calculation and antique scientific instruments) will be placed in my main website area http://www.myreckonings.com . To avoid printing difficulties with this wide format, there will be a link to a PDF version at the end of each entry. \n Comments on the posts are appreciated! A forum has also been added for discussing anything related to lost art in the mathematical sciences at http://www.myreckonings.com/forum . Also, feel free to use the Contact link to send me general comments or any ideas (or text!) for new topics. \n Ron Doerfler \n (The figure above is from Oronce Fine’s Second Book of Solar Horology , translated with interpretation by Peter Drinkwater)"], "link": "http://myreckonings.com/wordpress/2007/10/17/welcome/", "bloglinks": {}, "links": {"http://www.myreckonings.com/": 2}, "blogtitle": "Dead Reckonings"}]