[{"blogurl": "http://www.decisionsciencenews.com\n", "blogroll": [], "title": "Decision Science News"}, {"content": ["A TOOL TO REPRESENT PROBABILITIES IN AN EASY-TO-UNDERSTAND WAY \n  \n We’ve written before about using information grids when communicating risks to the general public . We like them. Turns out they are also called pictographs and, as we learned from an email from Brian Zikmund-Fisher, icon arrays . \n As Brian puts it \n Iconarray.com is a free online tool that enables anyone to create icon array risk graphics (sometimes called pictographs), download the images, or even embed the graphics in web pages just the way you can embed YouTube videos. \n To learn more, see my blog post at  Risksense.org  or just visit the site directly at  iconarray.com . \n The current demonstration version is sponsored by the  University of Michigan Risk Science Center  and the  UM Center for Bioethics and Social Sciences in Medicine . \n Here’s a glimpse at the user interface:"], "link": "http://feedproxy.google.com/~r/DecisionScienceNews/~3/_lqynk_GhJg/", "bloglinks": {}, "links": {"http://iconarray.com": 1, "http://feedads.doubleclick.net/": 2, "http://www.risksense.org/": 1, "http://journal.sjdm.org/": 1, "http://www.cbssm.org/": 1, "http://www.iconarray.com/": 1, "http://www.decisionsciencenews.com/": 2, "http://www.umriskcenter.org/": 1, "http://iconarray.com/": 2}, "blogtitle": "Decision Science News"}, {"content": ["FACULTY POSITIONS IN ORGANIZATIONAL BEHAVIOR \n  \n There are quite a few JDM (Judgment and Decision Making) researchers at Yale. Have a look at http://jdm.som.yale.edu/people.htm . \n The Yale School of Management is seeking additional faculty members at all levels in the area of organizational behavior. Ph.D./Ph.D. equivalent (or at the final stages of dissertation) and demonstrated potential for high quality research and teaching required. Interdisciplinary orientation and interest in theory and application is preferred. Appointments will be made for the 2013 – 2014 academic year. \n To apply online, visit: http://mba.yale.edu/faculty/faculty_openings.shtml \n Applications must be submitted electronically by November 7, 2012 . \n Yale is an equal opportunity, affirmative action employer and especially encourages applications from women and members of minority groups."], "link": "http://feedproxy.google.com/~r/DecisionScienceNews/~3/49AwFtPOX78/", "bloglinks": {}, "links": {"http://mba.yale.edu/": 1, "http://jdm.yale.edu/": 1, "http://feedads.doubleclick.net/": 2, "http://www.decisionsciencenews.com/": 1}, "blogtitle": "Decision Science News"}, {"content": ["SCP AS PART OF THE APA SUMMER CONFERENCE, NOVEMBER 16, 2013 DEADLINE \n  \n The Society for Consumer Psychology (SCP) will hold its summer conference as part the 121st Annual Convention of the American Psychological Association (APA) from July 31st to August 4th 2013 at the Hawaii Convention Center. SCP (Division 23 of APA) represents consumer researchers and psychologists interested in a broad range of consumer research issues united by psychological theories. We are seeking competitive papers, working papers (posters), special session symposia, and skill building sessions. Diverse themes and methodological approaches are welcome. We especially welcome submissions that address topics related to addictive or excessive consumer behaviors (e.g., gambling, video-gaming, over-eating, compulsive buying, excessive use of social media), as well as research that addresses consumer welfare at the individual or societal level (e.g., materialism, sustainability, youth and family risk, food and health decision making). \n All submissions must be made through the APA website by the November 16, 2012 deadline. \n If you have any questions (or any trouble using the conference submission website), please feel free to contact the Division 23 conference chair: Rebecca Walker Naylor , The Ohio State University. \n More Information on the SCP Summer Conference (PDF) | Conference Website \n NOTE: \nThis is a small SCP conference, not the main SCP conference, which is February 28 – March 2, 2013 at Omni La Mansion del Rio Hotel, San Antonio. See http://www.myscp.org for more information."], "link": "http://feedproxy.google.com/~r/DecisionScienceNews/~3/Dp50L1MQAAE/", "bloglinks": {}, "links": {"http://apacustomout.apa.org/": 1, "http://feedads.doubleclick.net/": 2, "http://www.apa.org/": 1, "http://www.myscp.org/": 1, "http://www.myscp.org": 1, "http://www.decisionsciencenews.com/": 1}, "blogtitle": "Decision Science News"}, {"content": ["DO RESEARCH ON COGNITION, MEMORY, AND DECISION MAKING ACROSS THE LIFESPAN \n \n When Decision Science News was born, it was born at Columbia’s Center \nfor the Decision Sciences. Now CDS is hiring again. \n Did you know that Decision Science News started while it’s editor was working at Columbia University’s Center for the Decision Sciences? It’s true. \n Columbia University’s Center for the Decision Sciences (CDS) anticipates hiring a postdoctoral fellow for a period of a minimum one year with an immediate start date. The position includes a full time salary and health benefits, starting as early as October 15th, 2012 and continuing until January 31st, 2014, with the possibility of renewal. \n The main responsibility will be to carry out research related to cognition and memory with an emphasis on decision-making and the construction of preferences across the lifespan, under the supervision of Professors Eric Johnson and Elke Weber. This position is open to candidates with behavioral research experience, data analysis and modeling skills (particularly structural equation models), and training in cognitive psychology or a related discipline, who have recently earned their PhD or who are expecting their doctorate in 2013, on a topic relevant to the psychology of decision making broadly defined. Training in neuropsychology as well as neuroscience and fMRI research would be a particularly valuable skill. Additionally experience with health- and cognitive function screening of older adults and experience with on-line research is also a plus. \n The candidate should have experience with running complex structural equation models, factor analysis, and multiple group invariance testing. Experience using Mplus is useful and experience with R is critical. Knowledge of cognitive aging research, especially the distinction between fluid and crystallized intelligence, is desirable. \n To apply, please send a CV, two letters of recommendation, reprints of published papers, and a cover letter describing your research interests. In your cover letter, please describe your research expertise, data analysis and modeling skills, neuropsychological and neuroscience skills, and computer skills (including any experience with online research). \n Review of applications will start immediately and continue until the position is filled. Electronic applications (all parts as attachments to a single email) should be submitted to zeynep@decisionsciences.columbia.edu. \n Columbia University is an Affirmative Action, Equal Opportunity Employer"], "link": "http://feedproxy.google.com/~r/DecisionScienceNews/~3/iA5PrIqXMus/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "Decision Science News"}, {"content": ["OPEN LETTER URGES LABS TO REPLICATE RESULTS TO AVOID A LOOMING “TRAIN WRECK” \n  \n Daniel Kahneman issued an open letter to researchers doing social priming research, which has become the subject of skepticism after some studies were found to be fabricated and others were not able to be independently replicated. His letter offers advice to scholars about how to address the situation: Find out the truth through extensive replication and announce it. \n The text of the letter is below: \n From: Daniel Kahneman \nSent: Wednesday, September 26, 2012 9:32 AM \nSubject: A proposal to deal with questions about priming effects \n Dear colleagues, \n I write this letter to a collection of people who were described to me (mostly by John Bargh) as students of social priming. There were names on the list that I could not match to an email. Please pass it on to anyone else you think might be relevant. \n As all of you know, of course, questions have been raised about the robustness of priming results. The storm of doubts is fed by several sources, including the recent exposure of fraudulent researchers, general concerns with replicability that affect many disciplines, multiple reported failures to replicate salient results in the priming literature, and the growing belief in the existence of a pervasive file drawer problem that undermines two methodological pillars of your field: the preference for conceptual over literal replication and the use of meta-analysis. Objective observers will point out that the problem could well be more severe in your field than in other branches of experimental psychology, because every priming study involves the invention of a new experimental situation. \n For all these reasons, right or wrong, your field is now the poster child for doubts about the integrity of psychological research. Your problem is not with the few people who have actively challenged the validity of some priming results. It is with the much larger population of colleagues who in the past accepted your surprising results as facts when they were published. These people have now attached a question mark to the field, and it is your responsibility to remove it. \n I am not a member of your community, and all I have personally at stake is that I recently wrote a book that emphasizes priming research as a new approach to the study of associative memory – the core of what dual-system theorists call System 1. Count me as a general believer. I also believe in a point that John Bargh made in his response to Cleeremans, that priming effects are subtle and that their design requires high-level skills. I am skeptical about replications by investigators new to priming research, who may not be attuned to the subtlety of the conditions under which priming effects are observed, or to the ease with which these effects can be undermined. \n My reason for writing this letter is that I see a train wreck looming. I expect the first victims to be young people on the job market. Being associated with a controversial and suspicious field will put them at a severe disadvantage in the competition for positions. Because of the high visibility of the issue, you may already expect the coming crop of graduates to encounter problems. Another reason for writing is that I am old enough to remember two fields that went into a prolonged eclipse after similar outsider attacks on the replicability of findings: subliminal perception and dissonance reduction. \n I believe that you should collectively do something about this mess. To deal effectively with the doubts you should acknowledge their existence and confront them straight on, because a posture of defiant denial is self-defeating. Specifically, I believe that you should have an association, with a board that might include prominent social psychologists from other field. The first mission of the board would be to organize an effort to examine the replicability of priming results, following a protocol that avoids the questions that have been raised and guarantees credibility among colleagues outside the field. \n The following is just an example of such a protocol: \n* Assemble a group of five labs, where the leading investigators have an established reputation (tenure should perhaps be a requirement). Substantial labs with several students are the most desirable participants. \n* Each lab selects a recent demonstration of a priming effect, which they consider robust and most likely to replicate. \n* The board makes a public commitment to these five specific effects \n* Set up a daisy chain of labs A-B-C-D-E-A, where each lab will replicate the study selected by its neighbor: B replicates A, C replicates B etc. \n* Have the replicating lab send someone to see how subjects are run (hence the emphasis on recency – the experiments should be in the active repertoire of the original lab, so that additional subjects can be run with confidence that the same procedure is followed). \n* Have the replicated lab send someone to vet the procedure of the replicating lab as it starts its work \n* Run enough subjects to guarantee power (probably more than in the original study) \n* Use technology (e.g. video) to ensure that every detail of the method is documented and can be copied by others. \n* Pre-commit to publish the results, letting the chips fall where they may, and make all data available for analysis by others. \n This is something you could do quickly, and relatively cheaply. The main costs are 10 trips, and funds to cover these costs would be easy to get (I have checked). You would have to be careful in selecting laboratories and results to maximize credibility, and every step of the procedure should be open and documented. The unusually high openness to scrutiny may be annoying and even offensive, but it is a small price to pay for the big prize of restored credibility. \n Success (say, replication of four of the five positive priming results) would immediately rehabilitate the field. Importantly, success would also provide an effective challenge to the adequacy of outsiders’ replications. A publicly announced and open effort would be credible among colleagues at large, because it would show that you are sufficiently confident in your results to take a risk. \n More ambiguous results would be painful, of course, but they would still protect the reputations of scholars who sincerely believe in their work – even if they are sometimes wrong. \n The protocol I outlined is just an example of something you might do. The main point of my letter is that you should do something, and that you must do it collectively. No single individual will be able to overcome the doubts, but if you act as a group and avoid defensiveness you will be credible. \n In response to Ed Yong’s article in Nature in which Kahneman’s letter is published, Norbert Schwarz, has written a response , saying “There is no empirical evidence that work in this area is more or less replicable than work in other areas.” \n REFERENCE \n Nobel laureate challenges psychologists to clean up their act"], "link": "http://feedproxy.google.com/~r/DecisionScienceNews/~3/Dv3LhcaNZ-A/", "bloglinks": {}, "links": {"https://docs.google.com/": 1, "http://www.nature.com/": 1, "http://www.decisionsciencenews.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "Decision Science News"}, {"content": ["PROFESSORSHIPS IN OPERATIONS AND INFORMATION MANAGEMENT AT THE UNIVERSITY OF PENNSYLVANIA \n \n  \n The Operations and Information Management Department at the Wharton School is home to faculty with a diverse set of interests in decision-making, information technology, information-based strategy, operations management, and operations research.  We are seeking applicants for a full-time, tenure-track faculty position at any level: Assistant, Associate, or Full Professor. Applicants must have a Ph.D. (expected completion by June 2013 is preferred but by June 30, 2014 is acceptable) from an accredited institution and have an outstanding research record or potential in the OPIM Department’s areas of research. Candidates with interests in multiple fields are encouraged to apply.  The appointment is expected to begin July 1, 2013 and the rank is open. \n More information about the Department is available at: http://opimweb.wharton.upenn.edu/ \n Interested individuals should complete and submit an online application via our secure website, and must include: \n \n A cover letter (indicating the areas for which you wish to be considered) \n Curriculum vitae \n Names of three recommenders, including email addresses [junior-level candidates] \n Sample publications and abstracts \n Teaching summary information, if applicable (courses taught, enrollment and evaluations) \n \n To apply please visit our web site: https://opimweb.wharton.upenn.edu/faculty/faculty-recruiting/ \n Further materials, including (additional) papers and letters of recommendation, will be requested as needed. \n To ensure full consideration, materials should be received by November 21 st , 2012. \n Contact: \n Kartik Hosanagar \n The Wharton School \n University of Pennsylvania \n 3730 Walnut Street \n500 Jon M. Huntsman Hall \nPhiladelphia, PA 19104-6340 \n \n The University of Pennsylvania values diversity and seeks talented students, faculty and staff from diverse backgrounds.  The University of Pennsylvania is an equal opportunity, affirmative action employer. Women, minority candidates, veterans and individuals with disabilities are strongly encouraged to apply."], "link": "http://feedproxy.google.com/~r/DecisionScienceNews/~3/JJkTeOrRfwQ/", "bloglinks": {}, "links": {"https://opimweb.upenn.edu/": 1, "http://feedads.doubleclick.net/": 2, "http://www.decisionsciencenews.com/": 1, "http://opimweb.upenn.edu/": 1}, "blogtitle": "Decision Science News"}, {"content": ["PIONEER OF MATHEMATICAL PSYCHOLOGY \n \n  \n Duncan Luce passed away earlier this year. William Batchelder has written (for the Society for Mathematical Psychology) the following biography of Duncan Luce’s intellectual contributions: \n FACETS OF DUNCAN LUCE’S RESEARCH CAREER \nDuncan Luce (1925-2012) was one of the pioneers in establishing mathematical psychology as a field of study. It is arguable that without Duncan’s leadership, intellect, and scholarly skills, the field would not have existed. He was the main force behind the publication of the two readings volumes and the three handbook volumes in mathematical psychology edited by Luce, Robert Bush, and Eugene Galanter from 1963-65. These five books together served to define our field. Later, he played a crucial role in starting our flagship journal, the Journal of Mathematical Psychology, as well as our Society. While everyone in the Society for Mathematical Psychology knows about Duncan and some aspects of his work, there are facets of his work that many members may be unaware of. The main purpose of this note is to celebrate Duncan’s work by focusing on a few of these facets. \nDuncan received his PhD in Mathematics at M.I.T. in 1950. His thesis was titled “On Semigroups,” an area in abstract algebra. His earliest work in the social and behavioral sciences was in the area now called social networks. In his very first paper, published in 1949 with A. D. Perry, he mathematically defined the concept of clique and exploited the idea of representing graphs in matrix form, where matrix manipulations could be used to reveal the structure in a graph. This approach to analyzing graphic structures has become standard in the field of computer science, an area that hardly existed at the time of Duncan’s early work. \nDuncan’s first academic position was as co-director of a network laboratory at M.I.T. from 1950-53, and his first tenure track position was as an Assistant Professor of Mathematical Statistics and Sociology at Columbia University (1954-57). It was in this period that Duncan acquired his lifelong interest in decision theory, and his 1957 book with Howard Raiffa, Games and Decisions: Introduction and Critical Survey, has become a classic in the economic sciences. \nPerhaps the earliest hint of his future interest in psychology is seen in a paper with L. S. Christie in 1956 titled “Decision structure and time relations in simple choice behavior.” This paper foreshadowed the publication of Duncan’s well-received book, Response Times, published 30 years later. Apart from this 1956 paper almost all his early work was in the areas of social structure and decision theory, areas well outside of psychology at that time. \nIn 1959 Duncan published a very influential book, Individual Choice Behavior: A Theoretical Analysis. It is in this small book with a red cover that Luce’s choice axiom is proposed. One consequence of the choice axiom is the so-called ratio rule, namely if several possible choice alternatives have positive valued strengths, then the probability of any one of them being selected is its strength divided by the sum of the strengths of all the other available alternatives. The ratio rule has been employed by a number of cognitive modelers in moving from latent representations of response strengths into actual manifest responses. It is perhaps ironic that the ratio rule is only a small consequence of Luce’s choice axiom, which also includes the case where one or more of the choice alternatives has zero strength in certain contexts. In fact, his book explores the consequences of the choice axiom in many areas including paired-comparison scaling, Fechnerian scaling, signal detection, utility theory, and learning theory. \nThe style of the 1959 book, like almost all of Duncan’s work, is to proceed rationally with definitions, axioms, theorems, and proofs. The primary goal is to make progress by discovering the consequences of simple, non-trivial assumptions, rather than, say, inventing complex hypothetical structures with the primary goal of fitting data. Nevertheless, in all cases the aim of Duncan’s work is to discover the testable consequences of one’s assumptions. Duncan did not pose the choice axiom as the ‘correct theory’ of choice behavior. Instead, it was intentionally posed as an elegantly simple theory with many surprising consequences. Then when some choice phenomena is found not to satisfy the consequences of the choice axiom, it is often clear exactly what aspects of the axioms are in need of elaboration. Indeed, later work by others on choice theory has worked in the important concepts of item similarity, context effects, and time to respond that were intentionally missing from the choice axiom. \nIn 1959, Duncan published another classic work, “On the possible psychophysical laws.” In it he shows that given only knowledge of the scale type (ratio, interval, etc.) of an independent and dependent variable, one can determine the possible functional forms relating the two variables that are invariant under permissible scale transformations. That paper was not without controversy, because in many scientific laws there are dimension-absorbing constants that free up possible functional forms and thus delimit the applicability of Duncan’s results. Nevertheless, the 1959 paper was seminal in directing his interest to dimension analysis, an area associated at that time with mathematical physics. This interest in dimensional analysis was one of the strands that lead to Duncan’s long-term interest in the foundations of measurement discussed later. \nIn addition to the axiomatic/theorem approach, the 1959 paper on psychophysical scales reveals another hallmark of Duncan’s approach to formal theory. The idea is that a theory formulated by empirically motivated axioms can give rise to functional equations whose solution provides the possible functional relationships between theoretical and behavioral variables. The solutions to these equations can suggest experiments that have the potential to falsify the theory, and if falsified one can look at specific axioms for what went wrong and how to fix it. In Duncan’s later efforts to exploit this approach to theory construction, others assisted him, including the mathematician János Aczél, perhaps the World’s most respected solver of functional equations. \nFoundations of measurement became a central topic of Duncan’s research from the middle 1960s up to the publication of the second and third volumes of the Foundations of Measurement in 1990, with Patrick Suppes, David Krantz, and Amos Tversky. In addition to the co-authors of the three foundational volumes, other mathematically savvy colleagues such as Louis Narens, Jean-Claude Falmagne, and Tony Marley joined him in this monumental effort. The thrust of the work was more directed to philosophy of science rather than to psychology. For this reason, the approach was mostly concerned with finding proper axiomatic formulations in idealized, error free settings rather than in more realistic settings involving measurement error. Despite the lack of concern with measurement error, some of the axiomatic work in foundations has been very influential in psychology such as Duncan’s 1964 paper with the statistician John Tukey on conjoint measurement. This paper has guided experimental psychologists to more carefully regard the hypothesis of an interaction between experimental variables. \nMuch of Duncan’s more empirical work was in the areas of psychophysics, with a special interest in acoustics. This work started in the middle 1960s, and much of it was carried out with his close association with David M. Green. Green’s active acoustics laboratory and Duncan’s mathematical ideas gave rise to some influential theoretical papers such as his 1972 paper with Green, “ A neural timing theory for response times and the psychophysics of intensity.” Somewhat uncharacteristically for Duncan, he published an undergraduate text, “Sound and Hearing,” in 1993, based on a course he developed at Harvard. I am certain many of us can understand how difficult it must have been for Duncan to find things to teach at the undergraduate level in an American university. \nIn his last ten years, Duncan published over fifty papers, and in these papers all the themes discussed above were represented many times over. Much of this work was coauthored with others mentioned earlier, and some of it was greatly assisted on the empirical side by his research association with Ragnar Steingrimsson. \n William H. Batchelder \nOn behalf of The Society for Mathematical Psychology \n http://www.mathpsych.org/index.php?option=com_content&view=article&id=162"], "link": "http://feedproxy.google.com/~r/DecisionScienceNews/~3/YuN2YHIhezA/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.mathpsych.org/": 1, "http://www.decisionsciencenews.com/": 1}, "blogtitle": "Decision Science News"}, {"content": ["ONE METHOD OF MANGO CUTTING \n \n Not long ago, we at Decision Science News did not know how to cut a mango. Then we learned. After that, we made this subtitled tutorial video on a cool way to cut a mango. \n It can be bookmarked for future reference here: http://www.youtube.com/watch?v=H5y3QV179Do"], "link": "http://feedproxy.google.com/~r/DecisionScienceNews/~3/XYB8bHApba8/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.youtube.com/": 1}, "blogtitle": "Decision Science News"}, {"content": ["WORK IN THE UK’S FAMOUS “NUDGE UNIT” \n \n \n \n We at Decision Science News have gotten to know and respect the UK Government’s Behavioral Insights Team as a member of its Academic Advisory Group. The team (aka the “nudge unit”) is a smart, small, and highly effective group inside the Cabinet Office (Number 10 Downing Street) that uses behavioral economics to improve government and policy in the UK. They do very good work and have had a number of visible “wins” in their first few years as a team. For this reason, we are excited to pass on the news that they are hiring and have four posts to fill. See a blurb below, with a full posting at: http://tinyurl.com/bit-job \n Join the Behavioural Insights Team in the Cabinet Office/Number 10 \n The Behavioural Insights Team (more commonly referred to as the Nudge Unit) was set up in 2010 to help apply behavioural economics and behavioural psychology to public policy in the UK. It is generally regarded as one of the most innovative parts of the UK Government. \n Having built a small, high performing team within the Cabinet Office, we are now looking to build our capacity in response to the growing demand across the public sector. We are looking to recruit up to 4 candidates. \n Successful candidates will need to show that they: \n1. have a good understanding of the behavioural science literature \n2. have an understanding and ideally ability to conduct randomised controlled trials to test policy interventions; and \n3. are highly motivated individuals capable of developing innovative solutions to often complex policy problems. \n4. are strong team players \n Candidates should be prepared to work on potentially any aspect of government or wider public sector policy. For example, over the past year the team has led work on health, energy, fraud, electoral registration, charitable giving, consumer affairs, the labour market, and access to finance for SMEs. \n We would welcome applications from individuals looking to join the team on a part-time basis, for example while finishing PhDs. \n Joining Cabinet Office – Flexible Resourcing and Development (FRD) \n Joining us means you become part of the Cabinet Office Flexible Resourcing arrangements, the benefits of which include an opportunity to work in an organisation where the emphasis is placed on development as well as delivery, helping ensure people get the most out of the experience during their time with us. \n In addition to working on interesting and challenging project work you will also get a dedicated development manager and join one of our 9 development streams. You will be actively encouraged and supporting to think about your development plan and share your skills, experience and expertise with others."], "link": "http://feedproxy.google.com/~r/DecisionScienceNews/~3/P4e_nIA30K0/", "bloglinks": {}, "links": {"http://www.gov.uk/": 1, "http://tinyurl.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.decisionsciencenews.com/": 1}, "blogtitle": "Decision Science News"}, {"content": ["TRICKING PEOPLE INTO THINKING YOUR SCIENTIFIC SHOTS NEVER MISS \n \n \n \n You visit the farm of a Texan, Joe, who claims to be a sharpshooter. When walking past his barn, you see a chalk target drawn on the wall with a bunch of tightly-grouped bullet holes in the bullseye. After observing that Joe can’t shoot well at all, you realize that he drew the bullseye after firing the shots. \n The tale of the Texas sharpshooter resonates with JDM (Judgment and Decision-Making) research on perceiving illusory patterns, and a topic of recent interest, detecting bogus experimental results. In a recent paper , Ulrich Schimmack talks about multi-study research papers in this way. When you see 10 studies in a single paper that confirm a hypothesis, can you conclude that the basic effect is replicable and robust? \n One problem in science is that reading a research article is a bit like visiting Joe’s farm. Readers only see the final result, without knowing how the final results were created. Is Joe a sharpshooter who drew a target and then fired 10 shots ar the target? Or was the target drawn after the fact? \n-Schimmack, in press \n We have been looking into the roots of the Texas Sharpshooter vignette in academic writing. The earliest and most common “initial” cite we found after a quick search was Grufferman’s from 1977, with no claims that this is the earliest use: \n Here it is. \n There have been several dramatic time-space clusters of leukemia reported in which, following an initial observation of two or more cases in a locality, a time unit and geographical area are selected so as to best define a time-space cluster. Such a posteriori clusters are analogous to the story of the Texas sharpshooter who would shoot his rifle at the side of a barn and then carefully draw a target around each bullet-hole so that each bullet-hole passed exactly through the center of the “bull’s-eye.” Although a posteriori clusters do serve to demonstrate that cases can cluster in time and space, they do not allow for determining whether this is more than a chance occurrence. \n -Grufferman (1977) \n REFERENCES \nGrufferman S. (1977). Clustering and aggregation of exposures in Hodgkin’s disease. Cancer 39, 1829-1833 \n Schimmack, U. (in press). The Ironice Effect of Significant Results on the Credibility of Multiple Study Articles. Psychological Methods. \n Photo credit: http://www.flickr.com/photos/24730945@N03/4130123404/sizes/l/"], "link": "http://feedproxy.google.com/~r/DecisionScienceNews/~3/qoXcoAsF_e4/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.utoronto.ca/": 1, "http://www.decisionsciencenews.com/": 1}, "blogtitle": "Decision Science News"}]