[{"blogurl": "http://designnotes.info\n", "blogroll": [], "title": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["Near the end of last week I spent some time at AIGA National Design Center. As I was walking through the Get Out the Vote 2012 Exhibition I was struck by one poster in particular. While most people take it for granted they can vote, one issue I had never considered is how a homeless person could vote. Homeless Does Not Mean Voteless makes it easy for anyone to understand. Unfortunately I don’t have the name the person that designed the poster as the name was too blurry with the photo I shot. What the posters informs people is that “when registering to vote, homeless people may use a shelter, park or street corner as the residence”. While I can’t vote in the US election because I’m Canadian, I found this poster incredibly powerful to simply let it be known how American’s that do not have a home can vote."], "link": "http://designnotes.info/?p=7553", "bloglinks": {}, "links": {"http://www.flickr.com/": 4, "http://www.aiga.org/": 1}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["Friend of Design Notes Kimberly Taylor let me know about an augmented app for the new cover of Metropolis Magazine. I don’t interact with much AR these days so playing around with the cover via my iPhone and iPad definitely held my interest. While the cover is only a teaser I wish that I could have interacted more on screen. There’s icons that I would have liked to have been able to press or even a simple link to the newsstand issue. Even with that said it offers a glimpse of something much more interesting than a static cover often can be. \n You can read more about the actual app on Metropolis site titled Augmented Possibility By Avinash Rajagopal . The link to Apple’s App store is https://itunes.apple.com/us/app/the-new-city/id562210465?mt=8 and Android at https://play.google.com/store/apps/details?id=fr.artefacto.metropolisra&feature=search_result#?t=W251bGwsMSwxLDEsImZyLmFydGVmYWN0by5tZXRyb3BvbGlzcmEiXQ.."], "link": "http://designnotes.info/?p=7543", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://www.metropolismag.com/": 1, "https://play.google.com/": 1, "https://itunes.apple.com/": 1, "http://www.flickr.com/": 4}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["I’ve been meaning to write this post for some time. Last Xmas I got back to building with Lego. At the time I spent 2 days building the Lego Volkswagen T1 Camper Van. The time really flew by. Part of it was organizing the elements and putting them together. It was also hard to deny getting back to my youth when I would spend days putting structure together with lego and wood blocks. \n As I was building the VW Van, I would take shots to remember the progress. I really enjoyed viewing the progress and seeing the underlying structure. Every couple of hours significant progress would be made. Fast forward to now and I’m just followed the same process building Fallingwater. The biggest difference between the two builds for me was I spent a lot less time organizing the bricks. For the VW I spent hours organizing the bricks by color and size. For Fallingwater I just dumped everything before starting with the instructions. \n Below I’ve posted some of the pics that I shot for both the VW and Fallingwater. At the time I posted them first on Instagram and secondly on Flickr. What shouldn’t be understated is that people really enjoy commenting and favoriting that stuff in real time. While I wasn’t going to stop before I finished, I found the encouragement helpful plugging away. \n LEGO VOLKSWAGEN T1 CAMPER VAN \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n \n FALLING WATER"], "link": "http://designnotes.info/?p=7521", "bloglinks": {}, "links": {"http://www.flickr.com/": 26}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": [], "link": "http://designnotes.info/?p=7506", "bloglinks": {}, "links": {}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["I hate to sound consistent but the past couple of months have been crazy. Below are some of the images that made me pause long enough to stop and consider what was in front of me. I’ve had the opportunity to hit the reset button on a lot of things and Design Notes is no exception. Over the next couple of months I’ll be chipping away making tweaks where needed."], "link": "http://designnotes.info/?p=7415", "bloglinks": {}, "links": {"http://www.flickr.com/": 85}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["Last week I was in Chicago as a presenter for RE:DESIGN/Inspire . The format was slightly different in that there was an emphasis to have the audience participate as much as the presenter. Below are my slides for how I’ve turned serendipity into predictable patterns of inspiration. For my talk I shared a number of photo projects that built upon and influenced each other as the years progressed. From there I looked at three well known daily projects online discussing some of the common traits between them. The talk lasted about 75 minutes. For the last 20 minutes I asked the audience to go walk outside with their smart phone. Their project was to set an arbitrary measurement for taking photos. I gave the example of going outside and shoot what was in front of them every 30 seconds. The discussion afterwards allowed people to share their unexpected patterns of what they saw. By having them go through the exercise I was hoping it would be a starting point for other projects they might want to do on a daily basis. Below my deck are three examples of what people shot. \n \n  Turning serendipity into predictable patterns of inspiration from Michael Surtees \n \n Mike Healey \n \n \n Erica Barricklow \n \n \n \n \n \n \n \n \n \n \n \n Colleen Hill"], "link": "http://designnotes.info/?p=7384", "bloglinks": {}, "links": {"http://www.slideshare.net/": 2, "http://www.redesignconference.com/": 1}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["As with most people that live in a city like NYC that have an iPhone, people are regretting the iOS 6 upgrade because of maps. It’s almost impossible to find anything in the city now. I could go on about it but it’s likely you’ve already read about it. Another subtle but noticible issue is the lack of humans in the maps in the realistic view. It’s as though everyone has been erased. At first glance the renderings (depending on the area) in NYC aren’t that bad but something feels wrong. What is odd and creepy is that there’s no people and no cars driving except those in parking lots. It’s strange. After posting the above image on instagram I got a couple interesting comments. A friend suggested that it’s a post-apocalypse preview app, one suggested it looked like it was from SimCity 2020 and another friend said she felt like she was browsing a scene from 28 Days Later. Will this mood subside as people get used to it? Only time will tell."], "link": "http://designnotes.info/?p=7375", "bloglinks": {}, "links": {"http://instagram.com/": 2, "http://www.theverge.com/": 1}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["A couple months ago I reached out to Stefan Boublil for lunch. I had a lot on my mind and I was curious to see where the convo would go. Prior to lunch I really didn’t know him outside the interwebs. We had talked on Skype previously a while ago but for our lunch talk I wanted to pick his brain about a couple situations that I was dealing with. While our talk was going back and forth about things he point blank asked me what I stood for. A deceptively easy question that is anything but that to answer. For someone like myself that is OCD on the introspectiveness, I hadn’t really thought about it. I’ve always been building on top of actions and reactions to what has been presented in front of myself. \n We had meet for lunch at Cipriani Dolci in Grand Central Station. After he left I pulled out my MUJI notebook and started to mind map words that felt natural to me. What I came up with above isn’t so much a process diagram about design but a way I react to the idea of design. Each piece fits together at the appropriate time. As with anything that is related to action it’s a work in progress that will change as I grow with experience. While I’m not going to talk about what each action means to me personally, if you haven’t considered what you stand for, a great exercise is to start throwing out words and see what fits. You might be surprised with what you see in front of yourself and how it might map out new directions."], "link": "http://designnotes.info/?p=7348", "bloglinks": {}, "links": {"http://www.flickr.com/": 2, "http://www.theapt.com/": 1}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["For the past five months I’ve been in a reactionary mode. Everything that I’ve known has changed. I was blindsided in ways that I wouldn’t want anyone to experience. It hasn’t been fun. Adversity is rarely pretty but it shows what a person is made of. Now that I look back at the last month I can say that July was the first month that I got to start laying down a new foundation. Most of these photos from July are just me outside but shows a story that I will need some more time to reflect on. \n \n NYC \n  \n \n  \n \n  \n \n  \n \n  \n \n CONDÉ \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n SIGNS \n  \n \n  \n \n  \n \n  \n \n  \n \n FLATIRON \n  \n \n  \n \n  \n \n  \n \n  \n \n PEOPLE, FLUIDS AND TECH"], "link": "http://designnotes.info/?p=7320", "bloglinks": {}, "links": {"http://www.flickr.com/": 32}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["Photo sharing now is as second nature as tweeting something that a person overheard, publicizing a Kickstarter project link or doing something that people ignore on Facebook. With that said I keep an eye out on unexpected photo sharing connections. They might not be easy to replicate with technology or aggregating socially but could potentially get there with a small upgrade when it becomes a natural action with their iPhone. Case in point, there was a fire in DUMBO and two people that I follow on Instagram shot the same thing from their different locations and uploaded it roughly at the same time. I found it fascinating to see the same action caught from two distinct POV’s. Each image gave a piece of info that the other couldn’t. While the fire wasn’t something that was going to change my day, seeing both of those images in my stream connected gave me something to pay attention to that I would have ignored otherwise if I had seen that smoke with my own eyes. \n UPDATE (4.24pm 7.14.2012) \n  \n Ironically a couple hours after this post, a 3 alarm fire happened in NYC across the waterway. Images can be seen at http://pbump.net/k97-2"], "link": "http://designnotes.info/?p=7295", "bloglinks": {}, "links": {"http://instagram.com/": 1, "http://pbump.net/": 1, "http://www.flickr.com/": 1}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["I’m having a bit of Tor de France withdrawal today as there’s no cycling today. July is one of my favourite months because the Tour de France shows the best of teams, individuals and strategic dynamics of a sport like no other for an entire month. This year might be the first when I’ve finally understood how points are won and time is saved. While I don’t have a favorite racer or team I thought it would be interesting to look at some of the trends and special features of a couple teams sites. \n SKY PROCYCLING \n  \n Overall I think team Sky has the best site for those interested in getting up to date Tour de France news on the team. Within seconds a viewer can get news highlights of the days stage, photos and videos in an easy to identify way. They keep the site up to date with their posts and make it easy to find archived items. In terms of typography they’ve balanced the headlines and body text simply with Verdana but added a bit of punch with their titles using a font called Cafeta . On their right rail, I really like how they’ve integrated a Spotify playlist though all songs do not play in the US. The only thing missing is a Twitter feed of the riders participating in the race or a feed of the images that the racers are taking. \n \n RADIOSHACK-NISSAN \n  \n There isn’t a huge difference in terms of easy to find info with Team RadioShack-Nissan’s site to Team Sky’s. I would have liked to see more posts on the home screen to balance out the right rail modules. The density of info is a bit much for the first time viewer but can easily navigate their way once they’re familiar with the site. Unlike Team Sky, they do integrate a standard Twitter feed. While helpful to see who is saying what, the actually content from the tweets is minimized which makes it less useful. Typography wise, they’ve spent a lot of time thinking about the hiearchy using different weights and sizes including Matrix, Engschrift and Lucida. While they have large image galleries, the UI for the player is pretty poor. Half the time the buttons to advance the images was missing. Overall it’s a strong site design wise, though a bit predictable with no real technical surprises. \n \n MOVISTAR TEAM \n  \n Technically in terms of detailed small extras, Moviestar team excelled. I really liked seeing the number of wins they’ve had, the km biked and how they integrated media types together. I was able to listen to after race commentary with the ability to download the audio file if wanted. I’m not sure how many times I would do that but it shows that they’re thinking much harder than the typical video and photo galleries that the other sites showed. They’ve also got their own custom font called Moviestar. I think it works really well for display purposes but feels pretty heavy for body copy. With that said I like how they’re looking at all the details. The home screen falls a part a bit as it’s essentially a bunch of modules. While not hard to find up to date news by clicking on the news section, I think they should have brought more headlines to the first page. Overall this site has a decent amount of creativity that the other sites missed out on. \n \n BMC RACING TEAM \n \n I think the aesthetic heaviness of the site threw me off. Ignoring that big issue the site is practical as it is simple. It’s pretty easy to find the latest news on the racers. Unfortunately they don’t update the site after each stage. That inconsistency might throw a person off to wanting to come back over time. They too have audio podcasts but don’t take the experience as far as Moviestar. \n \n GARMIN-SHARP \n  \nIn terms of layers, Garmin-Sharp makes scrolling a lot easier than the multiple layers that Moviestar has on the homescreen. Unfortunately a lot of those additional modules are for merchandise as opposed to helpful content. With that said the large images really add a lot of impact compared to the smaller thumbnails from the other team sites. They’ve also got a pretty decent article detail page with lots of thumbnail images. It would have been nice to have a gallery view inside the rail though they made the choice to go full screen with images and give the ability to advance images that way. It’s a pretty decent solution. My biggest confusion is the url: www.slipstreamsports.com , I’m not sure how that relates to the team name. \n \n Other Teams \nBelow are the other team sites to compare with the sites that I thought were worth taking note of. \n OMEGA PHARMA-QUICK STEP \n LIQUIGAS-CANNONDALE \n KATUSHA TEAM \n ASTANA PRO TEAM \n AG2R LA MONDIALE \n FDJ-BIGMAT \n COFIDIS LE CREDIT EN LIGNE \n TEAM EUROPCAR \n LOTTO-BELISOL TEAM \n VACANSOLEIL-DCM \n EUSKALTEL – EUSKADI \n SAUR-SOJASUN \n TEAM SAXO BANK-TINKOFF BANK \n RABOBANK CYCLING TEAM \n LAMPRE – ISD \n ORICA GREENEDGE \n TEAM ARGOS-SHIMANO"], "link": "http://designnotes.info/?p=7270", "bloglinks": {}, "links": {"http://www.slipstreamsports.com/": 3, "http://www.1t4i.com/": 1, "http://www.greenedgecycling.com/": 1, "http://en.teameuropcar.com/": 1, "http://www.teamliquigascannondale.com/": 1, "http://www.vacansoleildcm.com/": 1, "http://www.equipecyclistefdj.fr/": 1, "http://www.rabosport.com/": 1, "http://www.proteam-astana.com/": 1, "http://www.azfonts.net/": 1, "http://www.radioshacknissantrek.com/": 2, "http://www.movistarteam.com/": 2, "http://www.ag2rlamondiale.fr/": 1, "http://www.lottobelisol.be/": 1, "http://www.bmcracingteam.com/": 2, "http://www.katushateam.com/": 1, "http://www.equipe-cofidis.com/": 1, "http://www.teamsky.com/": 2, "http://team-euskaltel.blogspot.com/": 1, "http://www.saur-sojasun.com/": 1, "http://www.teamsaxobanktinkoffbank.com/": 1, "http://www.omegapharma-quickstep.com/": 1, "http://www.teamlampre.it/": 1}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["Every couple months I’ll take a step back and look at some of the natural patterns emerged with the photos that I shot. May and June was all over the place — I looked out the window a lot, I shot a lot from the ground floor and I even watched a lot of New York Ranger’s playoff hockey. There was a healthy collection of type driven images as always. All I can say is once September rolls around I’ll be very curious to see how July and August treated me. \n MADISON \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n GROUND LEVEL \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n FOOD \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n LOOKING OUTSIDE \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n NYR \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n TYPE & PAINT \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n EMPIRE STATE BUILDING \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n Ford in Detroit \n I was among the 250+ bloggers and press invited to Detroit to test drive a number of Ford’s new vehicles. Ford was responsible for the airfare and accommodations. Below are some of the photos of the experience."], "link": "http://designnotes.info/?p=7210", "bloglinks": {}, "links": {"http://www.flickr.com/": 135}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["A couple weeks ago I shot a series of photos on Sullivan’s benches that were in front of stores. The idea for the series came as I was on my way to shoot the above seating area on Spring and Sullivan. As I headed down Sullivan it seemed obvious at the time that I needed to photograph each bench. \n Now that a bit of time has passed I thought it was worth coming back to aforementioned bench around the tree. When it comes to design effectiveness there’s almost an infinite number of ways that it can be measured. How many hits did it get, how many RT’s, what were the sales, how much did it save and the list goes on. But is there really a way to measure something that enhances a tree on the sidewalk like a simple bench? That single tree now has been transformed into something much more. It now offers shade to a public space that otherwise would have been unnoticed as people walk by. It opens up the sidewalk to something more than just a route from point A to B. \n While it’s the first design like this that I’ve come across I’m sure there are many others of a similar nature out there. I don’t have the back story on how the bench came to be but I think it would make a lot of sense for other’s that have a storefront to consider such an idea. It would cost very little and enhance space in an unmeasurable way."], "link": "http://designnotes.info/?p=7201", "bloglinks": {}, "links": {"http://designnotes.info/": 1, "http://www.flickr.com/": 1}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["Going through a couple months (February — June) worth of photos tonight that I took, I was looking for a theme to tie a bunch of images together. Almost immediately typography caught in the wild of NYC jumped out at me. I decided to leave the captions off of each image as the type speaks for itself. However if you choose to click on an image you’ll be able to see the original caption, often discovered and considered while I was walking to work."], "link": "http://designnotes.info/?p=7187", "bloglinks": {}, "links": {"http://www.flickr.com/": 28}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": [], "link": "http://designnotes.info/?p=7182", "bloglinks": {}, "links": {"http://www.flickr.com/": 1}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["Recently I came across a great post over at Peta Pixel going over 50 Quick Photography Tips in Less Than 15 Minutes . Number 7 stuck with me. Simply pack light. While I don’t carry anything outside of my iPhone most days and the internal dialog that strikes me, last Sunday packed a lot of natural light. Over the course of one day in NYC, this was what the greatest city there is had to offer up."], "link": "http://designnotes.info/?p=7176", "bloglinks": {}, "links": {"http://www.petapixel.com/": 1, "http://www.flickr.com/": 5}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["Hashtags are nothing new, especially on posters and ads. But something struck me walking past the #makeitwork poster. If I look for that hashtag on Twitter I’m going to get one stream of content. If I do the same search on Instagram , I’m going to see other content. The content seen through Instagram was fascinating because I could tell how long the campaign had been going because the first image uploaded was two days ago. I also saw some other stuff somewhat associated with the the television show, I say that because it was semi related to fashion of regular people. Contrast that with Twitter . Sort of the same but doesn’t have the same feel. The difference is that when the show is on, Instagram will loose it’s relevance for an hour and a community will keep an eye on Twitter to see what people think about the show. This type of communication has been going on for a while but the fact that people accept these forms of getting info at this mainstream level is quite compelling to learn from."], "link": "http://designnotes.info/?p=7166", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://web.stagram.com/": 1, "http://www.flickr.com/": 1}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["I was going through U-Haul’s website today and came across a nice, informative and slightly humorous way to make selecting moving pod boxes less boring. The language they use makes the process of figuring out the number of moving pods actually helpful and places the person in the context of their situation. I kind of wish it was site wide though. When I went to check out a van, I had the option buying some boxes. There was no way to indicate how many boxes I might need depending on the moving situation. Pods and boxes are different but a similar tool would have been helpful."], "link": "http://designnotes.info/?p=7153", "bloglinks": {}, "links": {}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["The I Heart Etsy iPad app from Gesture Theory has had some modest success so far with the number of downloads. It’s not a cash cow but the consistency is nothing to blink at if it stays the same for the year. The feedback has been positive from the Etsy community with helpful suggestions on how it can be improved upon. \n The most fascinating thing that was slightly unexpected was watching the live Google Analytics with the page views per minute. People were hitting Etsy with the app at over 100 page views per minute. People were literally going through 2 pages per second. I’ve never seen anything like that before. That kind of smooth browsing is not available with any experience except an app. The mobile web that takes the device into consideration is a must now. There’s no reason why a site can’t be responsive depending on the screen (as long as the timeline is willing as is the budget). But for pure speed of trying to find something, if the UI is designed in such a way, apps, especially on the iPad will enable viewable content with speed in a way that has not been seen before."], "link": "http://designnotes.info/?p=7144", "bloglinks": {}, "links": {"http://itunes.apple.com/": 1, "http://www.flickr.com/": 1, "http://gesturetheory.com/": 1}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}, {"content": ["I’m really happy to mention that Gesture Theory launched the I Heart Etsy iPad app . It was really exciting to see how we could build a product like this internally. If you’re a fan of Etsy and have an iPad, this makes the discovery process really fast. We’ve also added some fun ways for a person to heart a product or section. \n He’re our description in the iTunes store: \n *** Optimized for iPad Retina *** \n I Heart Etsy was designed especially for Etsy lovers. It provides an ideal browsing experience and seamlessly integrates with your Etsy profile to make your shopping experience fun, easy, and addicting. \n ♥ Easily view item details, favorite items, bookmark categories and add items to your cart. \n ♥ Find that perfect item by searching on keyword, price, and location from your favorite categories. \n ♥ Browse the hottest treasuries and get great gift and craft ideas. \n ♥ Share favorite products with friends through Facebook and Email. Coming soon, Twitter and Pinterest! \n ♥ Beautiful retina display images and graphics for the best browsing experience. \n ————— \n We value your feedback and appreciate your support. Please email us at iheartetsy@gesturetheory.com if you have any issues. \n Or find us on twitter @IHeartEtsyApp \n Note: The term ‘Etsy’ is a trademark of Etsy, Inc. This app uses the Etsy API but is not endorsed by Etsy, Inc."], "link": "http://designnotes.info/?p=7135", "bloglinks": {}, "links": {"http://itunes.apple.com/": 6}, "blogtitle": "DesignNotes by Michael Surtees | DesignNotes by Michael Surtees"}]