[{"blogurl": "http://blog.diegovalle.net\n", "blogroll": [], "title": "Diego Valle's Blog"}, {"content": ["Ever since the end of the Mexican Revolution and the Cristero War violence in Mexico inched down in fits and starts from a high of about 60 homicides per 100,000 people to its lowest level sometime during the middle of the last decade (there's some uncertainty about the number of homicides in 2007 ). Then, the drug war happened and the homicide rate shot straight up. \n \nAfter reading The Better Angels of Our Nature: Why Violence Has Declined , by Steven Pinker, and looking at reviews of the literature on homicide decline in Europe, it seemed to me as if some of the posited reasons for the decline of violence would involve strong cohort effects — each generation successively becoming less and less violent . This immediately reminded me of Mexico, and so I decided to take a quick look at the data: \n \n  \n Each cohort group is connected by a loess line(only ages 12-60 are shown in the graph) \n \n \n For a more formal analysis of the decline of violence I used homicide data from the INEGI/SINAIS at the national level from 1985 and at the state/municipality level from 1990 onwards. Since I'm interested in understanding the period before the drug war I discarded all data after 2006. As usual, there are some issues with the data: \n \n \n About 3% of homicides have no data corresponding to the age of the victim. I'll simply ignore the missing data. The data also presents clumping of victim's ages which end in 0 or 5 , to deal with this I grouped the data by 5 year age groups. \n Some deaths of unknown intent are probably homicides, for sure I could use multiple imputation to get better estimates of the number of homicides for the age-period-cohort model, but again I'll ignore this. \n Previous to 1994 there were a lot of homicides registered in the INEGI database with no year of occurrence recorded . I used the date of registration of the homicide as the year of occurrence before 1994 . \n There are some errors in the mortality database where homicides are registered as accidents or simply missing. And of course the Acteal Massacre is missing from the homicide database. \n \n \n In countries with reliable statistics on offenders most women are \nkilled by men, so I focused on total homicide victims rather than each \nsex since I see no reason why Mexico should be any different. To explore the data I plotted the age-adjusted homicide rates for each state of Mexico. Since the five states with the biggest declines in homicides all lie in this contiguous area of Mexico I highlighted them in blue. \n \n \nThe border states seem to follow a different dynamic than the rest of Mexico so I plotted the age-adjusted homicide rate for all municipalities whose head locality lies at least 200 km from the U.S. border: \n \n \n \n \n \n \nSince we have a bunch of contiguous states which saw big declines in violence and the municipalities near the U.S. border which saw increases, I'll build two different age-period-cohort models for each area using the Epi package (tough I could also use a multilevel model). Prior to building the age-period-cohort model I'll visualize the four classic plots for the two areas of Mexico I mentioned. \n \nThe southern states: \n \n \nMunicipalities 200 km from the border: \n \n \n \n \n \n The top left plot shows the rate versus the age with each birth cohort group connected by a quadratic polynomial regression line. You can see a very clear pattern of each cohort being less violet in the southern states but not in the municipalities near the U.S. border. \n The top right plot shows the rate versus the age, with each period connected. You can see that children have low homicide rates and young adults the highest. Near the U.S. border there is a drop in homicide rates after 40 years of age (but remember the cohort effects from the first plot!). \n The bottom left plot shows the rate versus the period, with each age group connected. You can see that the decrease in violence occurred primarily among the ages with the highest rates in the southern states but not so much near the U.S. border. \n The bottom right plot shows the rate versus the cohort, with the each age group connected. You can see how in the southern states each cohort suffered less violence than the rest, though not so much near the U.S. border (but keep in mind period effects!). \n \n \nAfter looking at those plots it seems appropriate to fit an Age-Period-Cohort model to separate the effects of each component: \n \n \n Age effect: Changes in the rates according to biological process of aging: children have low homicides rates, young adults a high one. \n Cohort effect: Changes in the rates according to the birth date of each homicide victim. People born in the 50s were more likely to be murdered than people born in the 90s (well, until the drug war), which could reflect better schooling, higher literacy, etc. \n Period effect: Changes in the rates affecting the entire population at a given point in time, related to historical events such as the arrival of the drug cartels to the border during the 90s and the problems with the Familia Michoacana before the drug war. \n \n \nIn the model, I used the 1970 cohort as reference for the age and cohort effect, and 2003 as the period reference since that was the year before the expiration of the assault weapon ban, Chapo Guzmán killing the brother of the Juárez Cartel leader, La Barbie in Nuevo Laredo and the whole La Familia Michoacana thing. \n \n \n \n \n \nFrom the chart we can see that the age pattern for homicides follows that found in other countries (Fig 3.3 page 41), once we control for cohort and period effects, with the highest risk of being a homicide victim for people in their early 20s. Interestingly, near the border people remain much much violent throughout their lives. Also note how much more violent southern Mexico was compared to the U.S. border. Infants living in the south where at a higher risk of dying of murder than people in their 20s near the U.S. border (controling for cohort and period effects). This probably because people in their 20s commit infanticide and also kill their peers in their 20s. \n \nLooking at the cohort effect there was a big decrease in violence by each successive generation. The period effect shows a rise in the early 90s which might have been related to the land reform enacted about that time (this is pure speculation) and the heightned importance of the Mexico-US border for traficking cocaine in the 90s, the model also shows a rise after 2003 which is very likely related to the whole breakup of the Federation and the rise of La Familia Michoacana as stated previously, though keep in mind its size compared to the cohort effect (they are on the same scale) \n \n Note : I'm more interested in explaining the decline of \nviolence in Mexico rather than predicting the drug war, so the age \nspecific rates for the 1970 cohort are wrong after age 38 since 2008 was\n the year homicide rates shot up because of the drug war. \n \nOne problem with looking at homicide victims is that we ignore data on those who committed the homicides. But in Mexico there is very little data on those who commit murder, in 1930 the government detained about 6,500 presumed murderers , the same number as in 2011! But in other parts of the world those who commit homicide have similar ages to their victims, in fact they are usually acquaintances (with the obvious exception of infants). \n \nThere is also the possibility that rather than a reduction in violence the decrease in homicides could reflect better medical treatment, but Mexico also saw a reduction in all criminal activity: \n \n \n \n  \n The trendline was adjusted for seasonal effects and length of month \n \nThere is also the fact that the homicide rate in Mexico followed the homicide rates of Canada and the U.S. until the drug war. The consensus is that in Canada and the U.S. people really became less violent. \n \n  \n Data Sources: INEGI, FBI, and Statistics Canada (Criminal Justice) \n \nSo my best guess is that each cohort of Mexicans really was less violent than the previous ones. You certainly didn't want to mess with someone born around the time of the revolution, but with each passing generation, for reasons still unknown, people became less and less violent until the late 80s and early 90s saw the birth of the mirrrey generation : people more interested in aping the clothing style of uncivilized proles , with their garrish logos and shirts with legible clothing, than in being violent. \n \n \nThe real tragedy is that what was supposed to be the least violent generation in recorded history is now the protagonist of the drug war: \n \n  \n Each cohort group is connected by a loess line(only ages 12-60 are shown in the graph) \n \n \nP.S. You can download the code and data from GitHub"], "link": "http://blog.diegovalle.net/feeds/1193978971598604354/comments/default", "bloglinks": {}, "links": {"http://grammar.about.com/": 1, "http://3.blogspot.com/": 4, "http://imgur.com/": 1, "http://www2.ac.uk/": 1, "http://1.blogspot.com/": 2, "http://www.diegovalle.net/": 1, "http://4.blogspot.com/": 2, "http://www.columbia.edu/": 1, "https://github.com/": 1, "http://www.mexicomaxico.org/": 1, "http://2.blogspot.com/": 4, "http://cran.r-project.org/": 1, "http://www.mirrreybook.com/": 1, "http://www.unodc.org/": 1, "http://blog.diegovalle.net/": 4}, "blogtitle": "Diego Valle's Blog"}, {"content": ["According to data from the National Survey on Drug Use & Health 2001-2011 marijuana and heroin use are up, but cocaine and methampethamine use are down. (Data on methamphetamine consumption was statistically adjusted to account for survey changes)  \n \n \n \nThe spike in heroin users in 2006 is probably because the NSDUH is a household survey and as such it probably has quite a bit of error in capturing the real number of drug users. Since most drug consumption is due to addicts, I'm also showing data for those persons that were dependent or abused drugs. \n \n \nFor drug seizures I used data from the National Drug Threat Assessment 2011 (page 50). The southwest region corresponds to the the US-Mexico border crossings and nearby counties. Basically seizures of all drugs along the US-Mexico border have gone up except for cocaine, probably because cocaine consumption has decreased. (Also see this blog post by Alejandro Hope for Mexican drug seizure data) \n \n \n \nAs a percentage change I decided to only show seizure data along the northern border for Marijuana and MDMA (ecstasy) since all the other numbers are so small. Also keep in mind that MDMA from Mexico grew from a very low starting point, though seizures are now about the size of those along the Northern border in 2006."], "link": "http://blog.diegovalle.net/feeds/5320211616849180195/comments/default", "bloglinks": {}, "links": {"http://www.animalpolitico.com/blog": 1, "http://3.blogspot.com/": 2, "http://www.samhsa.gov/": 2, "http://1.blogspot.com/": 1, "http://www.justice.gov/": 1, "http://2.blogspot.com/": 2}, "blogtitle": "Diego Valle's Blog"}, {"content": ["I've written before about how the deaths of the Acteal massacre weren't registered as homicides in the mortality database and about the large number of deaths of unknown intent in Ciudad Juárez . There's actually another large error in the database that occurred in January and February of 2007. Lots of accidents of unspecified injury mechanism were registered in the Federal District at the same time there was a never before seen drop in the number of homicides. \n \nThe drop didn't just involve homicides but also all kind of accidental deaths, though that is not an error but a drop in the quality of vital statistics data (I only show accidental deaths by cause of transportation in the chart for clarity purposes) \n \n \nLoking at the data for the whole metro area of Mexico City broken down by state of occurrence one can see that the error only occurred in the Federal District (the spike during late 2007 in the State of Mexico is due transport accidents misclassified as unspecified, though it is difficult to see in the data due to seasonal patterns) \n \n \nThe ages of accidental deaths by unspecified cause that took place during January and February 2007 look different than those that occurred at other times. \n \n \nThe male to female ratio of accidental deaths by unspecified cause that took place during January and February 2007 look different than those that occurred at other times. During January and February more males than females died, just as in homicides and accidental deaths by cause of transportation. \n \n \nI don't think there can be any doubt that some homicides \"leaked\" into accidental deaths by unspecified cause. I tried to classify the Jan-Feb accidents into homicides and accidents based on the characteristics of the dead (age, sex, place of occurrence) but given that the cause of death was left unspecified (firearm, suffocation, cut/pierce, etc) I was only able to obtain sensitivities and specificities of .60, which is only a little better than chance. \n \nIt looks as if the error didn't just happen in the Federal District but all over Mexico (though obviously no the state of Mexico). You see the same pattern of a big drop in homicides at the same time accidents by unspecified cause rise. Perhaps someone hired his dump brother in law to administer the database and he screwed things up? \n \n \nThe most worrying part is that the error coincided with the first military operations of the drug war. Perhaps the Mexican government saw the drop in homicides and became a little too cocky about its capacity to take on the drug cartels. \n \n \n \nIn Nuevo Laredo during the first months of 2007 there were more drug related homicides that total homicides according to the INEGI."], "link": "http://blog.diegovalle.net/feeds/4516231237824395780/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 3, "http://1.blogspot.com/": 1, "http://www.diegovalle.net/": 1, "http://4.blogspot.com/": 2, "http://2.blogspot.com/": 1, "http://blog.diegovalle.net/": 2}, "blogtitle": "Diego Valle's Blog"}, {"content": ["Rates for Panama and Nicaragua are from 2009, all other countries 2010. Municipalities which are part of a metro area in Mexico are shown with the metro area homicide rate. \n \n Visit the interactive map of homicides \n \nHaving just posted on violence along Mexico's northern border , I figured it's time to analyze what is happing south of Mexico where some countries have experienced sharp increases in homicides. \n \n It's a little bit fallacious to compare a country as big as Mexico with its southern neighbors since Mexico's most populous state has more people living in it than the entire country of Guatemala, and all Mexican states are more populous than Belize, also the administrative divisions in each country are a little bit different: \n \nIn Mexico the divisions go something like this: \n \nStates -> Municipalities (Counties) \n \nIn Guatemala: \n \nDeparments -> Municipalities \n \nIn Belize: \n \nDistricts -> Constituencies \n \nSo in the map I'm showing at the top of this post I'm comparing level 1 divisions in Guatemala and Belize (departments and districts) with level 2 divisions in Mexico (municipalities). \n \nIn addition, homicide records are not always reliable in both Mexico and Guatemala, in Mexico vital statistics records of homicides based on death certificates are usually more reliable than those compiled from police records, but in Chiapas –which borders Guatemala– police records consistently record a higher number of homicides. Looking at the monthly data one can see that some months both transportation accidents and homicides fall to levels near zero . I interpret this as Chiapas not being able to register every death, being one of Mexico's poorest states this is not surprising. Chiapas health records are not up to par with the rest of the country. \n \nHomicides in Chiapas from different sources: \n \n  \n  2010  2011 \n  INEGI (Vital Statistics)  197  185 \n  SNSP (Police)  513  613 \n \n \nIn Guatemala police records consistently document more homicides than vital statistics compiled by health authorities, though there are a lot of deaths of unknown intent. I interpret this as police records being more accurate than vital statistics. \n \nWith all that said it's now a matter of collecting the data. Lucky for me, La Prensa Gráfica compiled homicide statistics for Central America and they used the police sources for Guatemala. So, it's mostly a matter of downloading and merging shapefiles to analyze the data: \n \n getMaps <- function ( codes , level ) { \n ##Different column names to uniquely identify each group \n ##depending on the level requested \n column.name <- ifelse ( level == 1 , \"NAME_0\" , \"ISO\" ) \n ##Download the maps \n country.ll <- llply ( codes , \n      function ( x ) getData ( \"GADM\" , path = \"maps\" , \n           country = x , level = level ) ) \n ##Change the id of the maps since some are repeated and we need to \n ##merge them, use ISO code as the unique identifier \n country.ll <- llply ( country.ll , \n      function ( x ) spChFIDs ( x , str_c ( row.names ( x ) , x [ [ column.name ] ] [ 1 ] ) ) ) \n ##Merge the list of maps one by one \n for ( i in 2 : length ( country.ll ) ) { \n  if ( i == 2 ) { \n  map <- spRbind ( country.ll [ [ 1 ] ] , country.ll [ [ 2 ] ] ) \n  } else { \n  map <- spRbind ( map , country.ll [ [ i ] ] ) \n  } \n } \n map\n } \n ##Codes for the Central American Countries \ncountry.codes <- c ( \"GTM\" , \"BLZ\" , \"HND\" , \"SLV\" , \"CRI\" , \"NIC\" , \"PAN\" ) \n ##Get the maps of States/Districts \nmap <- getMaps ( country.codes , level = 1 ) \n ##Get the maps of the country outlines \nmap.borders <- getMaps ( country.codes , level = 0 ) \n \nHere's a map showing the homicide rates from police sources in the Mexican states that border Guatemala and Belize: \n \n \n  \n Rates for Panama and Nicaragua are from 2009, Mexico from 2011, and all other countries 2010. Data for Central America from La Prensa Gráfica , Mexico from SNSP \n \n \nIf the police homicide statistics are closer to reality, then the border states of Mexico would have a homicide rate of 13 (about the same level as metro Mexico City). The departments and districts of Guatemala and Belize that touch the border with Mexico would have a combined homicide rate of 20 (about the same level as metro Detroit or New Orleans). And as you can see, the most violent part of Guatemala is closer to Honduras and El Salvador than Mexico, with the big exception of Petén. I wonder why the souther border hasn't seen the increase in violence seen in other parts of Mexico? The real contrast is provided by Nicaragua. \n \nThe intensity of drug trafficking does seem to be correlated with homicides according to this report by the World Bank (page 13). \n \nFor the time series of homicide rates I added a line representing the Mexican states of Baja California, Sonora, Chihuahua, Sinaloa, Durango and Nayarit \n to serve as comparison, together these states would have a population \nsimilar to that of Guatemala and about twice that of El Salvador or \nHonduras, though their area is much bigger and their GDP per capita much\n higher. Belize is a pretty small country, so keep in mind that while \nthe trend is increasing, the number of homicides went from 41 in 2000 to\n 129 in 2010. Another thing to keep in mind is that Central American \ncountries are very young and Ceteris Paribus having more young adults \nwill mean more homicides. \n \n  \n Sources: UNODC Homicide Statistics 2012 , INEGI \n \n Violence in Guatemala as of 2011 is at its lowest level since 2004. But homicide rates are higher in all Central American countries compared to 2000: \n \n  \n Sources: UNODC Homicide Statistics 2012 , INEGI \n \n \nHere's an interactive map : \n \n \nMunicipalities which are part of a metro area in Mexico are shown with the metro area homicide rate. \n \nP.S. Data and code are available from GitHub"], "link": "http://blog.diegovalle.net/feeds/5468120877346595634/comments/default", "bloglinks": {}, "links": {"http://www.org.mx/": 1, "http://inside-r.org/": 8, "http://www.gob.mx/": 2, "http://1.blogspot.com/": 3, "https://www.google.com/": 2, "http://data.un.org/": 2, "http://3.blogspot.com/": 1, "http://siteresources.worldbank.org/": 1, "http://multimedia.laprensagrafica.com/": 2, "http://2.blogspot.com/": 1, "http://www.diegovalle.net/": 1, "https://github.com/": 1, "http://blog.diegovalle.net/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["The drug war in Mexico has increased the homicide rate in several parts of the country, but one of the most affected regions has been those areas near the U.S. border. \n \n  \n Sources: CDC / INEGI. For Mexican municipalities the distance to the border was measured from the main locality of each municipality, for US counties the distance to the border was measured from the centroid. \n \nViolence has generally stayed on the Mexican side of the border. The trend in \nhomicides for all U.S. counties at least 160 km from the Mexican border has been downward since the drug war started. \n \n  \n Sources: CDC / INEGI \n \nKeep in mind that violence in Mexican municipalities at least 160km from the border was lower in \n2006, when the drug war started, than in 1999. \n \nP.S. When referring to homicides in the US I included those deaths that were the result of legal interventions since in Mexico police/military interventions are usually counted as homicides."], "link": "http://blog.diegovalle.net/feeds/6948910041091026984/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://1.blogspot.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["The Mexican government through the INEGI just released preliminary homicide data for 2011 . I feel bound to remind my readers that the government also released preliminary data in 2010, with the state of Chihuahua missing over a thousand murders, so the data should be interpreted as strictly preliminary. \n \n According to the INEGI the homicide rate was 24 and the total number of homicides in 2011 was 27,199. \n \nHomicides actually went down in many of the most violent states in 2010. Chihuahua, Sinaloa, Baja California and Sonora all registered a drop in homicides in 2011, though they still are way above their longtime trendlines. In Chihuahua and Baja California it's been claimed that part of the reason for the drop in homicides is the fact that the Sinaloa Cartel won control of the plaza (the drug smuggling routes and the political and law enforcement arrangements through which drug traffickers work). Since the Mexican government seems to be going after the Zetas rather than Sinaloa there seems to be one hell of an incentive to invade other cartel's plazas. \n \n \n  \n \n \n \nKeep in mind that Tamaulipas had lots of deaths of unknown intent in 2010 and it is possible the same thing happened in 2011. \n \n \n \n \n \n \n \n \nThe rise in homicides in Michoacán and Guerrero used to justify the drug war now seem quaint and barely visible \n \n \n \n \n \n \nVeracruz in spite of all the bad press Veracruz doesn't seem to be all that violent relative to other regions of Mexico, though I wonder how it breaks down at the municipality level? Without access to the mortality database I have no idea. According to the drug-war related homicide database the Veracruz metro area is extremely violent. \n \n \nThe rate of increase has been higher for the State of Mexico than the Federal District, it would be interesting to break it down for the Mexico City metro area. \n \n \nThe data is not without problems, for example in Chiapas the vital statistics system doesn't seem to be very good, with falls in both homicides and transportation accidents coinciding with the New Year. \n \n \n \nThe number of homicides in the the SNSP database was greater than the number of homicides according to the INEGI in San Luis Potosí . This is very likely due to the high number of deaths of unknown intent, but I need access to the 2011 mortality database to be certain. \n \nDeaths of unknown intent and by homicide in San Luis Potosí \n \n  ANIODEF Homicide Unknown  \n  2004 135 36 \n  2005 131 66 \n  2006 160 68 \n  2007 145 3 \n  2008 200 11 \n  2009 209 17 \n  2010 357 99"], "link": "http://blog.diegovalle.net/feeds/7788594921215959307/comments/default", "bloglinks": {}, "links": {"http://www.org.mx/": 1, "http://1.blogspot.com/": 1, "http://www.diegovalle.net/": 1, "http://3.blogspot.com/": 4, "http://4.blogspot.com/": 1, "http://2.blogspot.com/": 3}, "blogtitle": "Diego Valle's Blog"}, {"content": ["P hoto Credit: Jesús Villaseca Pérez \n \nEver since March 2008 Ciudad Juárez began to register an alarming number of homicides becoming Mexico's most violent city. According to the Mexican vital statistics system Ciudad Juárez (coterminous with the Juárez municipality) went from having just 202 murders in 2007 to 1,616 in 2008, 2,397 in 2009, and 3,686 in 2010. \n \nMexican and US officials explain the dramatic increase in violence as due to a conflict between the Sinaloa and Juárez Cartels. After a new governor was elected in October 2010 Ciudad Juárez does seem to have started turning around, but it is still an extremely violent city. \n \n Mortality from ill-defined conditions is quite high in Ciudad Juárez. Deaths of unknown injury intent went from 33 in 2004 to 193 in 2010. It is an open question just how good the homicide records are in places that saw incredible rises in homicides since one can only assume that forensic services were overwhelmed and that educated professionals like doctors were the first to leave town. \n \nRecently there was a story in the New York Times about how Target figured out a teen girl was pregnant before her father did based on her shopping patterns, and if Target can classify its shoppers into pregnant and not pregnant based on the stuff they buy, I can certainly train a computer to classify deaths in Mexico based on the characteristics of the deaths. \n \nIntuitively if someone were to ask you to guess the type of death of a 70 year old woman whose cause of death was transport related you would probably guess it was an accident. On the other hand, if you had to guess the type of death of a young adult male whose cause of death was a firearm, and the injury took place on a public street in Juárez, you would probably guess it was a homicide. \n \nThe Mexican government supposedly keeps a record of all deaths in its mortality database . For my purposes there are four types of violent or injury intent deaths: \n \n \n Accidents (unintentional injuries) \n Suicides (self inflicted injuries) \n Homicides (intentional injuries) \n Unknown Intent (cases where forensic or legal experts determined information was not sufﬁcient to make a decision about the injury intent) \n \n \nThere is a fifth type of injury intent death: \"Legal intervention, operations of war, military operations, and terrorism\" but there are only about 30-40 deaths of this type in Mexico each year. Most of them occur in Puebla. It is very likely that most of the shootouts where the police or military kill someone (or die themselves) are classified as plain old homicides, so I chose to recode this type of death as homicides. \n \nThe Mexican vital statistics database assigns every death an International Classification of Diseases (ICD) code which is used worldwide to categorize diseases, injuries, and external causes of injury. Sadly, it can be a little too specific since it includes distinctions for \"wounds inflicted by macaws\" and \"wounds inflicted by parrots,\" in addition it combines the injury mechanism (parrot, macaw, drop bear, chupacabras, etc.) with intent (suicide, homicide, etc.), e.g., the code for accidental death by handgun is \"W32,\" and the code for homicide by handgun is \"X93\". \n \nIdeally I would have a way of classifying the injury mechanism into meaningful groups separate from intent, something akin to the game of clue where there are half a dozen or so weapons like candlestick, knife, rope, gun, etc. that can be used to harm people, except since epidemiology is a real science we would have to substitute the name of the weapons for fancy names like \"struck by or against,\" \"cut/pierce,\" \"suffocation,\" \"firearm,\" etc. Lucky for me the CDC's National Center for Health Statistics has already done exactly that with its External Cause of Injury Mortality Matrix for ICD-10 \n \nOnce we have recoded the mortality database to include the mortality matrix we can visualize the different types of violent or injury intent deaths according to injury mechanism: \n \n \nYou can visually notice the resemblance between homicide deaths and deaths of unknown intent since both tend to involve firearms. Deaths by accident are mainly caused by transportation (motor vehicles) and suicides by suffocation (think hanging). \n \nIt's also worth pointing out that accidental deaths by unspecified mechanism increased at precisely the same time homicides shot through the roof, which could imply that there was some leakage of homicides into accidents, but in this post I'll go with the conservative assumption that all homicides, suicides and accidents were correctly classified by the Mexican health authorities. \n \nThe injury mechanism isn't the only useful information we can use to differentiate the type of death since victims of homicide also tend to be younger. We can also use the location where the body was found and the year of death. I could certainly use a more complex model that included marital status, day of week when they death occurred, and so on, but with the high specificity and sensitivity that resulted from the simple model I used, I saw no need to complicate things further (that and my laptop has 2GB of RAM). \n \n \n \n \n \nOf course things are never as simple as in textbooks, and the Mexican mortality database has some missing values. I assumed homicides where the year of occurrence was not available occurred in the same year the death was registered. For the rest of the data I used k-Nearest Neighbors to impute the missing values. \n \n \n \n \n \n \n \n \n \n \nMost accidents by unspecified injury mechanism were classified as transportation accidents which agrees with previous findings that road deaths are under-counted in Mexico. \n \nThe cleaned up dataset looks like this: \n EDADVALOR   CAUSE SEXOtxt  LUGLEStxt ANIODEF PRESUNTOtxt\n7.483315 All Transport Male   Home 2007 Accident\n5.656854  Firearm Male   Home 2007 Homicide\n6.164414  Firearm Male Public Street 2009 Homicide\n6.082763  Firearm Male   Home 2007 Homicide\n4.690416  Poisoning Male Public Street 2004 Accident \nWhere: \n \n EDADVALOR is the square root of age in years \n CAUSE is the injury mechanism \n SEXOtxt is the sex of the victim \n LUGLEStxt is the place where the lesion occurred \n ANIODEF is the year the death occurred \n PRESUNTOtxt is the injury intent \n \n \nI divided the dataset into training (75% of the data) and test sets. I then fit a penalized a regression (glmnet package), a support vector machine (with a radial kernel since it had better performance than a linear one), and a random forest model to the training set and evaluated their accuracy against the test set using the caret package . \n \n \n \n \n \n \nThe random forest model had the highest accuracy (though within the margin of error of the SVM) and that's the algorithm I used to classify the deaths. Here's its confusion matrix: \n Confusion Matrix and Statistics\n\n   Reference\nPrediction Accident Homicide Suicide\n Accident  743  50  5\n Homicide  92  2083  22\n Suicide  19  33  92\n\nOverall Statistics\n           \n    Accuracy : 0.9296   \n     95% CI : (0.9201, 0.9383)\n No Information Rate : 0.69   \n P-Value [Acc > NIR] : < 2.2e-16  \n           \n     Kappa : 0.8422   \n Mcnemar's Test P-Value : 4.468e-05  \n\nStatistics by Class:\n\n      Class: Accident Class: Homicide Class: Suicide\nSensitivity     0.8700   0.9617  0.77311\nSpecificity     0.9759   0.8828  0.98278\nPos Pred Value    0.9311   0.9481  0.63889\nNeg Pred Value    0.9526   0.9119  0.99098\nPrevalence     0.2721   0.6900  0.03791\nDetection Rate    0.2367   0.6636  0.02931\nDetection Prevalence   0.2542   0.6999  0.04587 \n \nThe random forest had a sensitivity of 96% for homicides, that is, out of the 2166 homicides in our testing sample, 2083 where classified correctly. And a specificity of 88%, that is, out of the 973 suicides and accidents in our testing sample, 859 where classified correctly. \n \nHere's the comparison with the original data: \n \n \n \n Year Injury Intent Original Deaths Imputed Deaths  \n 2004 Homicide 208 226 \n 2005 Homicide 275 288 \n 2006 Homicide 221 248 \n 2007  Homicide  202  300  \n 2008 Homicide 1616 1679 \n 2009 Homicide 2397 2476 \n 2010 Homicide 3686* 3867 *  \n \n * Under-counted by about 3% \n \nThe imputed number is still not the final number of homicides since (ignoring any statistical error and clandestine graves) homicides are under-counted by around 3% for the last year because the database has a cutoff date for registering deaths of December 31st. Taking this into account and rounding up, the number of imputed homicides in Juárez woud be close to 4,000. According to the SNSP there were 3,903 homicides in the state of Chihuahua (yeah right), and according to the criminal rivalry database there were 2,738 drug war-related homicides in Juárez during 2010. \n \n \n Total 2008-2010 Original Deaths Imputed Deaths  \n  7699 8022 \n \n \n \n Why did it happen? \n \nThe high number of deaths of unknown injury intent that resemble homicides could be due to several factors: \n \n The takeover of law enforcement functions by the military in 2008, then the federal police in 2010, and yet again the municipal police in 2011 could have played havoc on record keeping. \n The high levels of violence overwhelmed forensic services and legal authorities. \n Some estimates put the number of people who left Juárez as high as 230,000, this surely that had some effect on the quality of vital statistics. \n Given that classifying deaths of unknown intent increased the number of homicides by about 50% in 2007-- before the violence started-- statistical manipulation is certainly worth some consideration. According to wikileaks Juárez had 316 murders in 2007 (though it's not clear if the number refers to the Zona Norte) which is close to the imputed estimate. \n \n \n \n \n Future Research \n \nJuárez is not the only place where deaths of unknown intent increased, it's also worth checking out states like Tamaulipas, Coahuila, San Luís Potosí and Durango. \n \n \nSometimes accidental deaths by firearm have interesting patterns \n \n \nIn Michoacán homicides dropped soon after the start of the Operation Michoacán on December 11, 2007, but accidents of unknown injury mechanism rose at the same time, since transport accidents dropped at the same time as homicides it is not entirely clear what happened: \n \n \n \nP.S. You can download the code and data at my github account"], "link": "http://blog.diegovalle.net/feeds/8108434569098161564/comments/default", "bloglinks": {}, "links": {"http://www.cdc.gov/": 1, "http://cran.r-project.org/": 1, "http://www.flickr.com/": 1, "http://www.icd10watch.com/blog": 1, "http://www.gob.mx/": 2, "http://1.blogspot.com/": 2, "http://4.blogspot.com/": 1, "https://github.com/": 2, "http://en.wikipedia.org/": 2, "http://3.blogspot.com/": 2, "http://www.who.int/": 2, "http://www.nytimes.com/": 1, "http://kpbs.ellingtoncms.com/": 1, "http://2.blogspot.com/": 3, "http://blog.diegovalle.net/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["As expected Peña Nieto won and AMLO came in second place, but the polls way overestimated the voting intention of Peña Nieto, underestimated AMLO's expected vote, and to a lesser extent also underestimated Josefina Vázquez Mota's vote. \n \nThe Federal Elections Board in Mexico runs a \"quick count\" (conteo rápido), a random sample of returns from voting booths across the country, which serves as a highly accurate exit poll. Measuring the euclidian distance from the normalized \"quick count\" to the voting preferences, the most accurate pollsters were: SDP Noticias-Covarrubias, Grupo Reforma, Ipsos-Bimsa, and UNO TV-María de las Hera. The worst performing pollsters were Milenio-GEA ISA and Indemerc. \n \nRerunning my polls of polls using the quick count results as if they were the result of a poll taken on election day with a massive sample size and free of pollster bias (I plan on rerunning this analysis when the final election results are known) I get the chart at the top the post. The results are quite striking, particularly with regard to Pena Nieto, and indicate a relatively big bias among most pollsters. I'm very curious about what it is the polling firms did wrong to oversample PRI voters or otherwise bias their results. \n \nThere's always the possibility that AMLO had a late surge, but it doesn't look like there was one since some of the private exit polls also tended to put Peña Nieto ahead of what the \"quick count\" predicted. And exit polls are usually much more accurate than polling. It's very likely there was bias. \n \nReference \n \nSimon Jackman. Bayesian Analysis for the Social Sciences. John Wiley & Sons, 2009"], "link": "http://blog.diegovalle.net/feeds/3931746796713682014/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["On Sunday, July 1, 2012 Mexican voters will go to the polls and elect a new president. In Mexico whichever candidate wins a simple plurality of the national vote is elected. Before the election of Vicente Fox of the PAN in 2000 Mexico had been ruled by a single party (the PRI) for over 70 years. \n \nThere are three main parties in Mexico: \n \n The Partido Revolucionary Institucional (PRI) commonly described as center-left. Its candidate is the former governor of the State of Mexico Enrique Peña Nieto (EPN) \n The Partido Acción Nacional (PAN): The right-wing party which currently holds the presidency. Its candidate is Josefina Vázquez Mota (JVM) \n The Partido de la Revolución Democrática : A left wing party which lost the presidency in 2006 by the razor thin margin of .56%. It's candidate is the same one as in 2006, Andrés Manuel López Obrador (AMLO) \n \n \n The Data \n \nMy data comes from the poll of polls by ADN Político . I made some adjustments to the data: \n \n I'm using the midpoint of the start and end dates of the surveys as the polling date \n I added a couple of polls conducted by Indemerc and corrected some missing polls from El Universal - Buendía y Laredo \n I'm using weekly averages of the GEA-ISA daily tracking poll because it has some weird periodical artifacts \n \n \n The Model \n \nMy first idea was to simply model the presidential race using a dirichlet regression for all four candidates smoothed with splines. This ignores any effect each polling firm may have (some polling firms tend to favor one particular candidate) \n \n \nI later switched to a Bayesian method of pooling the polls. I'm using a Kalman \nFilter that corrects for House Effects (the bias of each polling firm) \nas described in Pooling the Polls Over an Election Campaign (pdf), by Simon Jackman (any mistakes are obviously mine). The only difference from the paper (a minor one) is that since Australia has two main political parties and Mexico has 3 main ones plus one small one, the precision is calculated a bit differently. \n \nI could certainly have improved the forecast by taking into account the economic and security conditions in Mexico since those are the two issues which come out on top when voters are asked what they care about the most. But with virtually only one free presidential election having happened in Mexico (the 2006 one doesn't count since it was very close) it would involve more time than I'm willing to commit. \n \n \n \n \n  \n  \n \n \n \nGiven the security and economic situation in Mexico, once campaigning started Josefina Vázquez Mota dropped in the polls . Even former president Vicente Fox recently stabbed the PAN in the back and called on the electorate to \nvote for the front-runner Peña Nieto and accused the current president \nof violating human rights due to the drug war. \n \n Forecast \n \nMexico enforces a polling ban three days before the election (starting tomorrow) and there seems to be very noticeable trend in the voting intention of the candidates so I simulated draws from the posterior voting intention of each candidate and then used the auto.arima function from the forecast package to predict what the trend would be on election day. \n \n House Effects \n \nThe model could also be improved by using better priors for the house effect of each polling firm. For example, if you believe there is an institutional bias in favor of Peña Nieto and that the most thrustworthy pollster are Reforma, SDP Noticias and UNO TV then you'll disagree with the estimate from the model I'm using with diffuse priors. \n \n \nThe three polling firms where Peña Nieto polled the worst where Grupo Reforma, SDP Noticas-Covarrubias, and UNO TV-María de las Heras (María de las Heras was the worst pollster at predicting the 2006 election). All three polling firms reported and increase in Peña Nieto voting intention from May to June (Uno TV 39% -> 40.1%, SDP Noticias 40% -> 41%, and Reforma 38% -> 42%) \n \nIt would take an act of god for Peña Nieto not to be declared the winner\n on Sunday. The probability of AMLO beating JVM for\n the second place is 96% . \n \n \n \n \n Interactive Chart \n \nI may still be missing one or two polls in this analysis so be sure to visit my interactive chart for the latest info and forecast. \n \nOne thing is for certain: there is no stopping Enrique Peña Nieto; the PRI will soon be here. And I for one welcome our new prehistoric overlords. I'd like to remind them that as a trusted blog personality, I can be helpful in hiding crime statistics (under the bed) while the proletariat toils in their underground meth labs. \n \n \n \n References \n \nPooling the Polls Over an Election Campaign, Australian Journal of Political Science , 2005 V40(4):499-517"], "link": "http://blog.diegovalle.net/feeds/4063387724521643281/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.co.uk/": 1, "http://www.ac.uk/": 1, "http://1.blogspot.com/": 1, "http://www.diegovalle.net/": 1, "http://4.blogspot.com/": 2, "http://2.blogspot.com/": 3, "http://cran.r-project.org/": 1, "http://www.adnpolitico.com/": 1, "http://blog.diegovalle.net/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["Check out the interactive poll of polls I made. \n \nP.S. There is a poll ban starting tomorrow so I'll restrict access to the interactive chart to people outside Mexico."], "link": "http://blog.diegovalle.net/feeds/6941301528044792998/comments/default", "bloglinks": {}, "links": {"http://www.diegovalle.net/": 2}, "blogtitle": "Diego Valle's Blog"}, {"content": ["In Mexico presidential campaigns last 90 days. This year campaigning started on March 30, before this date all campaigning was prohibited. Judging by the way Josefina Vázquez Mota's support fell after she started campaigning voters either didn't like what they saw in her ideology and issue stance or she is a very bad campaigner."], "link": "http://blog.diegovalle.net/feeds/5808045952266336868/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["Gabriel Quadri, the candidate for the Mexican presidency of a small party practically owned by the teachers' union must be a good debater. Since his debate performance he has managed to consistently poll over the 2% required for his party to keep its registration. One small problem with this analysis is that sometimes polling firms report voter preferences as rounded numbers, and for candidates polling in the 0-4% range this introduces some artifacts."], "link": "http://blog.diegovalle.net/feeds/1456892458569843677/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["Time for another update of my poll of polls. With less than two weeks remaining until voting day the race is on! I mean the race for second place because Enrique Peña Nieto of the Partido Revolucionario Institucional has pretty much cinched the presidency for the next six years. \n \nI've now switched to a Bayesian method of pooling the polls. I'm using a Kalman Filter that corrects for House Effects (the bias of each polling firm) as described in Pooling the Polls Over an Election Campaign (pdf), by Simon Jackman . I'm using diffuse priors for the house effects but I could probably switch to using the posteriors for each polling firm from the 2006 election, if I ever get around to modeling it. \n \nThe thing that worries the most is that polling firms tend to be highly variable, for example, in 2006 the most accurate pollsters were Reforma and GEA-ISA, but in the last elections they did not perform so well. Oh well, we'll see what happens. \n \nTo recap from previous blogs \n \n My data comes from the poll of polls by ADN Político. \n I added a couple of polls conducted by Indemerc and corrected some missing polls from El Universal - Buendía y Laredo \n I'm using weekly averages of the GEA-ISA daily tracking poll because it has some weird periodical artifacts \n \n \nReferences \n \nPooling the Polls Over an Election Campaign, Australian Journal of Political Science , 2005 V40(4):499-517"], "link": "http://blog.diegovalle.net/feeds/5732073207981637999/comments/default", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://3.blogspot.com/": 1, "http://www.adnpolitico.com/": 1, "http://www.ac.uk/": 1, "http://fivethirtyeight.nytimes.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["I now use the weekly average of the GEA-ISA daily tracking poll and I've added the Indemerc pollinf firm and some polls from Buendía y Laredo that were missing from ADN Político 's poll of polls. None of the polls were conducted after the presidential debate. A chart including those who did not answer is provided after the jump \n \n The polling firms taken into account for the first chart: \n \n El Sol de México-Parametría \n El Universal-Buendía y Laredo \n SDP Noticias-Covarrubias  \n Excélsior-Ulises Beltrán  \n Grupo Fórmula-Con Estadística \n Consulta Mitofsky    \n Grupo Reforma     \n UNO TV-María de las Heras  \n Ipsos-Bimsa     \n Indemerc      \n GEA-ISA (trimestral)   \n Milenio-GEA ISA \n \n \n \n \n  \n Note that not all pollster release gross voting intention \n \nThe pollig firms which report estimates including voters who didn't answer the survey \n \n El Sol de México-Parametría \n El Universal-Buendía y Laredo \n SDP Noticias-Covarrubias \n Grupo Fórmula-Con Estadística \n Consulta Mitofsky \n Grupo Reforma     \n Ipsos-Bimsa \n Milenio-GEA ISA"], "link": "http://blog.diegovalle.net/feeds/2722170288688969027/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://3.blogspot.com/": 1, "http://www.adnpolitico.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["After 49 bodies were dumped on a highway leading from Monterrey to Reynosa you would have expected May to have been a particularly violent month in the Monterrey metro area. Instead it was one of the least violent months of 2012. Still, violence is an order of magnitude above what is was before the Zetas broke from the Gulf Cartel . \n \nThe state of Nuevo Leon, unlike Chihuahua, Baja California, Durango or Veracruz is usually pretty good at reporting known homicides, including massacres and known mass graves, so while the data is not 100% trustworthy it can be considered to reflect homicide counts as publicly known. Though that still leaves the issue that the Mexican government so far has been unable to identify a single one of \nthe victims of the Cadereyta massacre which would imply that there may be more mass graves we just don't know about. \n \nLooking at the data broken down by municipality violence was going up in Cadereyta before the massacre occured. At the AGEB level there is a somewhat inverse relationship between population density and homicides, so while populous municipalities certainly have more homicides, that does not wholly explain differences in number of homicides. \n \n  \n Source: Estadística de Procuración de Justicia"], "link": "http://blog.diegovalle.net/feeds/7117957712641467186/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.scielo.cl/": 1, "http://gruporeforma.elnorte.com/": 1, "http://www.gob.mx/": 1, "http://1.blogspot.com/": 1, "http://blog.diegovalle.net/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["With the presidential election less than a month away and Noel Maurer baiting me into analyzing it, now is good time to start tracking vote intentions. But we have to keep in mind that since the 2006 election was won by .58 percentage points and before 2000 Mexico was ruled for 70 years by the PRI we really don't have much data to go on. And most importantly, I don't follow politics closely, if it wasn't for a couple of big revelations shown during the debate I would have no idea there is a guy called Quadri running for president. \n \n As a first step I grabbed the effective preference election poll data from the poll of polls run by ADN Político (are there other data sources?), but it seems to be missing some polls by El Universal-Buendía y Laredo , so I added them manually. I chose a Dirichlet regression since the votes for the candidates have to sum up to 100%. \n \nThe model is a gross oversimplification since some pollsters are biased and surely some are more reliable than others. I did not take this into account. The poll themselves are run over several days and I chose the mid-date of their date range as the polling date. Also, since I'm using effective preferences the algorithm to apportion undecided voters could be improved. \n \nAs we can see in the chart at the top of the post, Enrique Peña Nieto enjoys a commanding lead over his rivals, although he has fallen somewhat over the last month. López Obrador is now solidly in second place and Josefina Vázquez Mota has fallen to third place after a long downward trend. Gabriel Quadri is last, but his polling went up after the debates. \n \nIn the next chart I compare the different polling organizations against the trendline. Being far from the trendline doesn't necessarily mean the pollsters are biased --it may be that the pollster with many outliers actually has the best poll and all the rest are biased. I'm just trying to get a feel for the way each pollster trends. And yes, you can guess which poll was conducted by Reforma just by looking at the big yellow and red outliers near the end of June. \n \n  \n Pollsters compared to the trendline \n \nThe poll run by GEA-ISA has some weird sinusoidal artifacts. That means they are doing something wrong, plus since they run the only daily tracking poll their results tend to dominate my trendline estimates. I ran the Dirichlet regression again excluding GEA-ISA and the results are very similar, with Peña Nieta a little lower and López Obrador a little higher. \n \n  \n Poll of polls excluding pollster GEA-ISA"], "link": "http://blog.diegovalle.net/feeds/4798227572218863978/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://2.blogspot.com/": 1, "http://3.blogspot.com/": 1, "http://www.adnpolitico.com/": 1, "http://noelmaurer.typepad.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["In an article published last year, security spokesman Alejandro Poiré and María Teresa Martínez argued that the Mexican government's strategy of targeting high level drug lords did not increase violence. The authors analyzed the specific case of the killing of Nacho Coronel and concluded that the increase in violence in the states of Jalisco, Nayarit, and Colima did not start with the killing of Nacho Coronel, but rather preceded it and coincided with the kidnapping of his son, which started an inter-cartel war between his organization and the Beltrán Leyvas. \n \nTo backup their claims Poiré and Martínez used weekly drug war-related homicide data which are not publicly available (at least not to people who question the Mexican government's strategy since they did make it available to Joaquín Villalobos ). To perform my own analysis I'll use the daily (grouped by week) homicide data available from the Mexican vital statistics system and confine my analysis to the state of Jalisco. \n \nFitting an AR(1) model to the weekly data I find two breakpoints whose 95% confidence intervals contain the capture of \"El Mochomo\" (week 212), and as Poiré and Martínez state in their article, the kidnapping of Nacho Coronel's son (week 327). The breakpoint coinciding with the capture of \"El Mochomo\" is where things get interesting since Poiré and Martínez did not include it in their analysis of the rise in violence. \n \n ## \n## Confidence intervals for breakpoints\n## of optimal 3-segment partition: \n## \n## Call:\n## confint.breakpointsfull(object = bp.ri)\n## \n## Breakpoints at observation number:\n## 2.5 % breakpoints 97.5 %\n## 1 211   223 236\n## 2 322   325 330 \nAlfredo Beltrán Leyva, \"El Mochomo,\" was a top level drug boss of the Sinaloa Cartel when in January 2008 he was captured by the Mexican Army. His brothers blamed the leader of the Sinaloa Cartel \"El Chapo\" Guzmán for his arrest. This caused a rupture inside the Sinaloa Cartel as the Beltrán Leyva brothers and their associates went to war with the rest of the Sinaloa Cartel. \n \nGiven that the Beltrán Leyva brothers ordered the killings of the son of \"El Chapo\" and the son \" El Ondeado ,\" it is all but certain that the kidnapping and subsequent killing of Nacho Coronel's son was revenge for the capture of \"El Mochomo.\" Thus, I find it a glaring omission that Poiré and Martínez would not analyze the capture, even if they were partly right about the kidnapping having sparked a new round of violence. \n \nIn addition to the structural change I used a dynamic linear model or state space model to compute the kalman smoothed value of weekly homicides adding dummy regressors indicating whether \"El Mochomo\" had been captured or the son of \"Nacho Coronel\" kidnapped. \n \n  \n The blue line represents the kalman smoothed estimate of weekly homicides in Jalisco with its associated 95% confidence interval \n \nRepeating the analysis with data from the nearby states of Nayarit and Colima I find similar patterns. Though it would be a good idea to take into account zero inflation and the analysis is further complicated in Nayarit since a week after Nacho Coronel's son was kidnapped the local Beltran Leyva plaza boss was killed in a joint operation by the Mexican Army, Marines, and Federal Police (this is likely related to the kidnapping). \n \n Nayarit: \n \n  \n The blue line represents the kalman smoothed estimate of weekly homicides in Nayarit with its associated 95% confidence interval \n \n Colima: \n \n  \n The blue line represents the kalman smoothed estimate of weekly homicides in Colima with its associated 95% confidence interval \n \n \nAs we can see from the charts and contrary to what Poiré and Martínez express in their article, the fall of drug lords sometimes does coincide with an increase in homicides, and may drive them to seek revenge on their rival's families. \n \nPercentage of population that considers the municipality they live in insecure: \n \n \n \n \n \n \n \n  \n Source: Tabla II-55 \n \n \nP.S. Gist with the source"], "link": "http://blog.diegovalle.net/feeds/8030851610588646427/comments/default", "bloglinks": {}, "links": {"http://www.com.mx/": 2, "http://3.blogspot.com/": 1, "http://www.org.mx/": 1, "http://en.wikipedia.org/": 1, "http://www.milenio.com/": 1, "http://4.blogspot.com/": 3, "http://2.blogspot.com/": 1, "https://gist.github.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["According to rumor, the violence in northeastern Mexico started after \"El Condor 3,\" an associate of the leader of the Zetas, was assassinated by a member of the Gulf Cartel going by the nickname of \"El Metro 3\". This reputedly happened on February 23 and broke up the relationship between the Zetas and the Gulf Cartel. Looking at the weekly number of homicides in Nuevo León (excluding the Monterrey metro area) and Tamaulipas there was a sharp rise in the number of homicides precisely during that week."], "link": "http://blog.diegovalle.net/feeds/5704776113158760161/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["Keeping with this week's divorce theme, here's a map of the Mexican states where marriages are most likely to end in divorce. Perhaps not surprisingly, there seems to be an inverse correlation with the state percentage of the population that is catholic and the proportion of marriages which end in divorce. You can download the code to generate the map from my GitHub account ."], "link": "http://blog.diegovalle.net/feeds/8793354816032667759/comments/default", "bloglinks": {}, "links": {"https://github.com/": 1, "http://1.blogspot.com/": 1, "http://www.economist.com/blog": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["Over the last two decades families in Mexico have undergone rapid social changes. The proportion of marriages ending in divorce has risen for each cohort since data became available, this is independant of the recently approved express divorce law in the Federal District. \n \nLooking at the the period during which marriages are more likely to end in divorce it seems there is a 3 to 7 year itch. \n \n \nand by state we see that the rise in the proportion of marriages that end in divorce has been nearly universal across the states of Mexico, though, of course, there is some internal migration within Mexico and more recently people have been divorcing in the Federal District because of its more permissive divorce laws, so the numbers aren't exact. \n \n \nCumulative proportion by state: \n \n \nWhile it will take more than a decade to obtain long term marriage dissolution data for recent cohorts, the rising pattern looks very predictable and I used a multi-level model to predict future marriage dissolutions. The data has been adjusted because divorces registered in 2009 were under-counted by about 5%, and those registered in 2008 by about 1%. \n \n \n \n fit <- lme ( fixed = percent.divorce ~ marriage.length + log ( marriage.length ) + marriage.year + express.divorce , \n   random = ~ - 1 | marriage.year , \n    data = subset ( marriage.duration , marriage.length >= 2 ) ) \n \n \n \n \n \n \n \n \n \nCross country comparisons are always problematic, but comparing the percentage of all marriages that end in divorce in Mexico to first marriages that end in divorce in the US (not an apples to apples comparison!), the divorce rate would be lower in Mexico than in the US during the 1950s. See Figure 2 of Marriage and Divorce: Changes and their Driving Forces by Stevenson and Wolfers. \n \nThere are a couple of reasons why my assumptions in making the estimates may be wrong: \n \n Thought I did add a dummy variable denoting if express divorce had been approved, if divorces keep increasing and increasing in the Federal District eventually they'll make a dent in the country wide statistics. And as I mentioned in the post there is some uncertainty on whether the rise will prove permanent. \n As we saw in my last post express divorce has proven particularly popular outside the Federal District, so I wouldn't be surprised if in the future other states adopted similar laws. \n \nAnd let's not forget that births outside of marriage are now a majority of births in Mexico, so looking at marriage \ndissolution provides only a partial look at what union dissolution is \nlike \n \n \n \nP.S. You can download the code from my GitHub account"], "link": "http://blog.diegovalle.net/feeds/5489998412771790764/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 2, "http://inside-r.org/": 5, "http://repository.upenn.edu/": 1, "http://1.blogspot.com/": 1, "https://github.com/": 1, "http://4.blogspot.com/": 1, "http://2.blogspot.com/": 1, "http://blog.diegovalle.net/": 3}, "blogtitle": "Diego Valle's Blog"}, {"content": ["On October 2008 Mexico's capital, the Federal District, approved a version of no-fault divorce locally known as \"express divorce\". With the new law the requesting spouse no longer had to provide a cause to dissolve the marriage and the couple no longer had to live apart before filing for divorce. Furthermore, the process of determining child custody and alimony were now separate from the divorce trial. The Federal District has so far been the only federative entity in Mexico to adopt a less adversarial divorce system. \n \n A quick look at the monthly divorce data in the Federal District shows that there is a strong seasonal component to divorce with a fall in the number filings during July, December and to a lesser extend January. But more importantly, it shows a big increase in divorces for the year after the law went into effect. The number of divorces filed went from 6,897 in 2007 to 7,410 in 2008, and 9,835 in 2009 (because it takes time to enter the divorces in the vital statistics database the number of divorces are under-counted by about 1% in 2008 and 5% in 2009) \n \n \n \n \nFitting an ARIMA(1,0,0)(1,0,0) 12 model to the divorce data with the strucchange package I find a structural change that coincides with the October implementation of express divorce. \n \n \n \n \n \n \n \n \n \n \nLooking at the divorces that were filed in the Federal District ( Distrito Federal ) by the state where the marriage took place reveals there's a very strange pattern whereby the whole increase in the number of divorces can be accounted by people from outside the Federal District taking advantage of its laws to get a divorce. In fact, among people who got married in the Federal District and filed for divorce in the Federal District there was a decrease in the number of divorces! \n \n  \n Notice the y axes of the plot are on different scales \n \nThe Federal District was the only entity where there was a decrease in the number of divorces filed: \n \n \n \n  \n There were less divorces in the Federal District in 2009 than in 2008 \n \n \n \n \nIn Did Unilateral Divorce Raise Divorce Rates? A Reconciliation \n and New Results Justin Wolfers argues that immediately after the United States adopted no fault divorce there was a big increase in divorces, but the trend reversed after about a decade, that is, the rise in divorces after no fault divorce was adopted was not persistent and the temporary rise may have been due to a backlog of couples who were in bad marriage but had postponed going through a burdensome divorce process. \n \nSince I only have express divorce data for about a year I thought that one way to test if the rise in divorces was on path to becoming permanent would be to look at the trend in length of marriages among those who file for divorce, though of course, it is foolhardy to extrapolate from only one year of data since as more people become aware of the divorce law, they may take it into account in deciding whether and at what age to marry. Or maybe with the introduction of the new law divorce will become more socially acceptable and less stigmatized. \n \n \n \n \n \n \n \nHere's a table with the total number of divorces (instead of the percentage change) in the Federal District, by length of marriage: \n \n Year 0-1 \nyears 2-4 \nyears 5-9 \nyears 10-14 \nyears 15 \nor \nmore years  \n 2007 278 1,382 1,844 1,105 2,258 \n 2008 339 1,453 1,852 1,205 2,561 \n 2009 342 1,716 2,358 1,659 3,760 \n \nThe biggest \nincrease in people filing for divorce was among those who had been \nmarried the longest, but remember the previous chart? If we divide the \ndata into those who married in the Federal District and outside it, we \ncome to a completely different conclusion. \n \n Outside the Federal District \n \nAmong those who married outside the Federal District we see an increase in divorces among recent marriages \n \n  \n The biggest percentage change outside the DF occurred among those couples who still remember their honeymoons \n \nHere's a table with the total number of divorces (instead of the percentage change) in the Federal District of marriages that took place outside the Federal District, by length of marriage: \n \n  0-1 \nyears 2-4 \nyears 5-9 \nyears 10-14 \nyears 15 \nor \nmore years  \n 2007 17 85 194 134 259 \n 2008 23 91 205 144 320 \n 2009 208 877 948 486 1,224 \n \n Federal District \n \n \nAnd among those who got married in the Federal District we see the opposite pattern: there was an increase in divorces among people who had been married a long time and for people who hadn't been married long there was a big decrease, even though a law making it easy to get a divorce had just been passed. \n \n \n \n \n \nHere's a table with the total number of divorces (instead of the percentage change) in the Federal District of marriages that \ntook place in the Federal Distric, by length of marriage: \n \n  0-1 \nyears 2-4 \nyears 5-9 \nyears 10-14 \nyears 15 \nor \nmore years  \n 2007 261 1,297 1,650 971 1,999 \n 2008 316 1,362 1,647 1,061 2,241 \n 2009 134 839 1,410 1,173 2,536 \n \nIn the vital statistics database most of people who filed for divorce in the Federal District but got married outside of it are coded as having lived in the Federal District at the time they filed for divorced. I'm guessing this is probably just a quirk of the law that makes it easy to use a Federal District address and that there really is a lot of \"divorce tourism\" going on rather than the unique stress of living among chilangos (the inhabitants of the Federal District) causing men and women from provincia (the region of Mexico outside the Federal District) to get divorced. \n \n \n \n \n  \n The proportion of marriages ending in divorce decreased in the Federal District and increased in Morelos and Hidalgo. I have no idea what sort of witchcraft Querétaro uses to ward off the perverting influence\n of that hotbed of depravity and den sin better known as the Federal \nDistrict. \n \n \n \n \n \n Why did divorces decrease in the Federal District? \n \n \nOne clue lies in the fact that marriages fell in the Federal District a few months before the divorce law went into effect. In 2007 there were 41,427 marriages, in 2008 33,968, and in 2009 32,083. There are various reasons these could have happened \n \n \n \n An error in the database . But according to this story in Excelsior (link in Spanish) the authorities double checked the data to make sure there were no errors. \n The story also mentions a price increase but discards that theory as not very likely. A quick internet search reveals the fact that a marriage license costs about $70 US dollars ($900 pesos). Marriage would have to have quite a large price elasticity to fall that much. \n Another hypothesis is that since abortion was legalized in April of \n2007 perhaps pregnancies that previously resulted in shotgun marriages \nnow end in abortions. And it was precisely these marriages that were more likely to end in divorce. When looking at the age specific marriage totals, the younger the bride \nthe bigger the percentage decrease in marriages compared to previous years. But this theory doesn't explain the fall in divorces among those marriages more than a few years old. \n \nBasically I don't have an all-encompassing theory of why marriage fell. \n \n \nP.S. You can download the code from my GitHub account \n \nReferences \n \nWolfers, Justin, Did Unilateral Divorce Laws Raise Divorce Rates? A Reconciliation and New Results (August 2003). Stanford Law and Economics Olin Working Paper No. 264; Stanford Law School, Public Law Working Paper No. 68. Available at SSRN: http://ssrn.com/abstract=444620 or http://dx.doi.org/10.2139/ssrn.444620"], "link": "http://blog.diegovalle.net/feeds/6682737906646515740/comments/default", "bloglinks": {}, "links": {"http://www.com.mx/": 1, "http://3.blogspot.com/": 3, "http://1.blogspot.com/": 3, "http://www.gob.mx/": 1, "https://github.com/": 1, "http://4.blogspot.com/": 2, "http://2.blogspot.com/": 2, "http://cran.r-project.org/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["Click on the image to visit the interactive drug war map . Or try the Spanish version \n \n \nIf you're interested at all in what's happening in Mexico you can't miss the interactive map of the drug war I just made. You can link directly to cities or whole regions within Mexico and post them to Twitter and Facebook by clicking on the \" Share This Map \" link at the bottom of the box. You can even compare 2007 México with 2010 México and switch between drug war-related homicides and total homicides (the ones from the INEGI ). If you hover over the chart you'll get the monthly values and information on important events. To top it off you can export the monthly data to csv. You'll need a latest generation browser to use it. \n \nTo unclutter the map and following the lead of the paper Trafficking Networks and the Mexican Drug War by Melissa Dell, I decided to only show the optimal highways (according to my own data and Google Directions) to reach the US border ports from the municipalities with the highest drug plant eradication between 1994 and 2003 and the highest 2d density estimate of drug labs based on newspaper reports of seizures. The map is a work in progress and is still missing the cocaine routes, but hopefully I'll be able to add them shortly. \n \nMy assumptions in making the map: \n \n Homicides that were registered with no date of occurrence were assumed to have occurred on the month they were registered. \n The total homicide database has a cutoff date of the last day of the year for recording deaths, so for example, in 2009 there occurred 671 homicides that weren't registered until 2010 (most occurred in December). I adjusted the 2010 database assuming the homicides were under counted by the same percentage as they were in 2009. So instead of the 25,005 homicides in the database I'm showing the adjusted number of 25,679. I used a similar adjustement at the municipality level. \n Even though the municipalities of Culiacán and Navolato are not officially a metro area I considered them one since they are only half and hour from each other and together have a million inhabitants. \n \nThe really cool thing about the map is that it makes it very easy to select regions of Mexico and link directly to them, which makes refuting mistaken claims by government officials, like the one Poiré made last year, a cinch. \n \nIn Jalisco, Colima, and Nayarit, violence was increasing systematically previous to the killing of Nacho Coronel at a rate of more than 1 death per week, or 6 extra deaths every five weeks. After his death violence remained at a high level, but it increased at a much slower rate, barely 1 death every five weeks. \n[...] \nReplicating the analysis with data from the state of Jalisco, the region where Nacho Coronel was killed, and even with data from Zapopan, we obtain the same results \n \n--Alejandro Poiré, Nexos \n \nBut did violence really stop increasing near Guadalajara ? This should serve as a warning not to extrapolate based on a few months of observations and underlines the importance of making the data available to researchers on a prompt basis to avoid embarrassing mistakes. \n \nThere are about a million things you can analyze with the maps: \n \n The weird falls in homicides in Chiapas around the end 2007 and 2009. \n Why did Sinaloa end up with more drug war-related homicides than total homicides from mid 2007 until the end of 2008? (the answer will be my next post) \n The sudden increase in homicides in Nuevo León and Tamaulipas around the end of February when the Zetas and CDG (Gulf Cartel) went to war with each other. \n Perhaps you heard that México is much safer than a certain other much smaller country or sub-country region and wish to only compare certain parts of México with a similar population/shape to the much smaller country/sub-country region. \n The super secret link to the 2011 drug war-related homicides . (The size of the circles and the color scale used to fill them was annualized so it's on the same scale as the years for which full data is available, but the numbers shown on the map correspond to the Jan-Sep data). \n Are the Zetas really the most brutal cartel as the Mexican Government and Stratfor assert ? You can compare northeastern Mexico to Chihuahua and find out just how mistaken they are, both in terms of rates and total homicides. \n How the Tubutama massacre is registered as having occurred in Tubutuma according to the homicide database, but in Saric according the drug war-related homicide database \n \n \n \n A note about drug war-related homicides \n \n \n \nI'd be very surprised if the Mexican government had the capacity to correctly count the drug war homicides. There were big differences between the homicide databases starting in 2009 in Tijuana and in 2010 in Juárez . I tend to think of the drug war-related homicides as an independent count of a subset of firearm/extremely violent homicides based on police records rather than death certificates (independent of whether organized crime was involved or not). Looking at the whole country there has been a steady increase in the difference between INEGI homicides and the drug-war related ones. \n \n \n \nThis is not to say that the data for INEGI is without errors, besides not having registered the mass grave in Taxco and the immigrant massacre in San Fernando , there has been a steady increase in deaths of unknown intent by external injury caused by firearm. In Mexico most accidents are by transportation, most suicides by suffocation and most homicides by firearm, so a quick and dirty way to see if a more in-depth analysis is needed is to look at firearm deaths: \n \n \nThis is not to say all the deaths were homicides, since it would be perfectly reasonable to expect that as the availability of firearms increases, the number of accidents involving firearms increases, but the evidence does suggest that there has been an important under counting of homicides and even more so of drug war-related homicides. \n \nDeaths of unknown injury intent in all of Mexico that were by firearm: \n \n   \n Year Cause Deaths \n \n 2004 Firearm 399 \n 2005 Firearm 431 \n 2006 Firearm 373 \n 2007 Firearm 520 \n 2008 Firearm 494 \n 2009 Firearm 737 \n 2010 Firearm 1,063 \n \n \nYou may also be wondering why there were more drug-related homicides than total homicides in the Frontera Chica , but not in the northern region Nuevo León . The most likely cause is that some homicides were registered as deaths of unknown intent in Tamaulipas, but not in Nuevo León. \n \nDeaths by firearm that were not homicides in Tamaulipas : \n \n   \n Year Cause Deaths \n \n 2004 Firearm 46 \n 2005 Firearm 47 \n 2006 Firearm 33 \n 2007 Firearm 39 \n 2008 Firearm 54 \n 2009 Firearm 45 \n 2010 Firearm 251 \n \n \n \nA similar thing happened in Durango, it's most obvious in La Laguna . Deaths by firearm that were not homicides in La Laguna: \n \n   \n Year Cause Deaths \n \n 2004 Firearm 9 \n 2005 Firearm 10 \n 2006 Firearm 10 \n 2007 Firearm 14 \n 2008 Firearm 28 \n 2009 Firearm 61 \n 2010 Firearm 120 \n \n \n \nP.S. You can download the source at GitHub"], "link": "http://blog.diegovalle.net/feeds/6570555803628057420/comments/default", "bloglinks": {}, "links": {"http://www.com.mx/": 1, "http://3.blogspot.com/": 1, "http://econ-www.mit.edu/": 1, "http://1.blogspot.com/": 1, "http://www.gob.mx/": 1, "https://github.com/": 1, "http://www.diegovalle.net/": 27, "http://www.stratfor.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["Recently the Mexican government released to the public the final homicide data for 2010, and as you can see from the chart Mexico has suffered from a steep rise in homicides since 2008, and in 2010 reached the highest homicide rate in recent history. \n \n The Mexican government had actually released preliminary homicide data a couple of months ago, but I though it looked incomplete so I didn't blog about it. For some reason (too much ponche?) the INEGI hasn't issued a press release with the final data --including more than 1,000 previously uncounted homicides. Hopefully they'll do it sometime soon. \n \n \nBecause of the cutoff date for registering deaths of December 31 there is always an under-counting of homicides during the last year for which data is available. Taking this into account, the number of homicides in Mexico for the last few years has been: \n \n   \n  Year  Homicides  \n  2004  9,347  \n  2005  9,983  \n  2006  10,426  \n  2007  8,840  \n  2008  14,175  \n  2009  19,771  \n  2010  25,800 (25,000 in the database)  \n   \n \n México had an homicide rate of 23 in 2010 . There has been a steady growth in the increase in violence each year since 2008: from 2007 to 2008 homicides grew by 5,300, the next year they grew by 5,600 and in 2010 they grew by 6000. \n \n Problems with the data \nGiven previous problems with the recording of homicides I did some quick checks of the data and found the following issues: \n \n The 55 bodies found in the mass grave in the municipality of Taxco were not recorded in the database (not even as accidents). In the drug war-related homicide database 55 deaths were recorded during the month of May. \n There were an unusually high number of deaths of unknown injury intent in the state of Tamaulipas, and many parts of the state had more drug war-related homicides than total homicides. \n In the muncipality of San Fernando 72 immigrants were killed in August, but only 51 deaths were recorded in the database for that month. In the drug war-related homicide database 89 deaths were recorded during August. \n \nObviously these problems deserve a more rigorous analysis. \n \n \n \n The Charts \n \nSince the median age in México went from 19 in 1990 to 26 in 2010 I figured I'd age adjust the data using the 2000 Mexican population estimates from the CONAPO/COLMEX \n \n \n \n \n \n \n \n \n \n \nAll the border states now suffer from historical homicide records: \n \n \n \n \n \nFor comparison purposes the most violent state in the US, Louisiana, had a homicide rate of 11 in 2010. \n \nIn southern and central Mexico violence rose in Morelos and to a much lesser extent in the State of México and the Federal District. Sadly, while Michoacán and Guerrero saw violence decrease in 2010, all the available information points to an increase in violence in 2011 as the capture of \"La Barbie\" and the split of La Familia Michocana with the Caballeros Templarios led to an unraveling of alliances between drug gangs. \n \n \n \n \n \n \n \n \nThe split between the Zetas and the Gulf Cartel led to an increase in violence in Tamaulipas and Nuevo León (and to a lesser extent San Luis Potosí) \n \n \n \n \n \nSince the rise in violence in northeastern Mexico was so sudden it would point to at least some level of organization and vertical integration in the Zetas and the Gulf Cartel (only in México obviously). \n \nIn Nayarit, Colima, and Jalisco violence had started rising since 2008 when \"El Mochomo\" was captured, but it reached a whole new level in 2010 due to the kidnapping of one of the sons of \"Nacho Coronel,\" the death of \"El Chaguin,\" and the split of the Milenio Cartel in two. Nayarit actually had to start summer vacation early because so many shootouts were occurring. \n \n \n \n \n \nSince there were no military operations in these states previous to the escalation of violence this would be evidence against the theory that the violence in México is mainly the byproduct of the military coming in and unraveling local crime markets by taking over police duties. \n \n \n \nIn northwestern Mexico violence kept on rising, and if you've been reading my blog you won't be surprised to know that the number of homicides rose in the municipality of Tijuana by about 10% from 2009 to 2010. Hopefully in 2011, with Leyzaola gone, violence will finally go down in Tijuana. \n \n \nIn Ciudad Juárez there were a total of 3,800 homicides (3,684 in the database), but there were 193 deaths of unknown injury intent, there are only 400-500 deaths by accidents each year in Juárez and 2010 wasn't anything out of the ordinary, so many of those deaths of unknown intent are likely to be homicides. Coming up with an exact number is complicated. Whichever the true number, the metro area of Ciudad Juárez with a population of 1.3 million had more deaths than the states of California and Texas combined. \n \nWhat's weird about the 2010 homicide number in Juárez is that at first the Fiscalía del Estado put the number of homicides at around 3,000, but much later in 2011 corrected the number to 3,600. This is something to keep in mind with all the talk of Juarez becoming less violent in 2011. Numbers can be updated, and I wonder if the whenever the drug-war related homicide database is updated it will reflected the newer homicide data. \n \nIn both Chihuahua and Sinaloa homicides were the main cause of deaths beating Ischemic heart disease. \n \n \n \n \n \nFor calculating which \"cities\" in mexico are the most violent I used the metro areas as defined by the INEGI, adding a made up metro area of Culiacán-Navolato, plus those municipalities which are not part of a metro area but have a population of more than 200,000 people. \n \n \n \nIt's always tricky to do comparisons across countries since cities in the US are geographical concepts akin to localities in México but with local governance (municipalities would be the equivalent of counties), and as such, only a small percentage of the people present at a given locatility/city/town actually live there , so as a first approximation it is better to use the concept of an integrated economic region--the metropolitan statistical area. New Orleans-Metairie-Kenner had a homicide rate of 21 in 2010. \n \n \n \n \n \nCiudad Juárez is a clear outlier in female homicides, a female homicide rate of 58 is unbelievably sad. Since Juárez had a reputation for being a killing ground for women since before the drug war, I again did a comparison with the metro area of New Orleans (parishes of Jefferson, Orleans, Plaquemines, St. Bernard, St. Tammany, St. Charles, and St. John the Baptist) using data from the CDC , and while you can argue just how accurate the population estimates for both cities are and whether all homicides were recorded properly in Juárez, I don't think it' crazy to claim that before the drug war Juárez was safer for women than New Orleans. \n \n \n \n \n \n \nThe urban centers that saw the biggest increases or decreases in homicide rates with a log scale: \n \n \n \n \n \n \nWith so many bodies going unclaimed it is not surprising that the quality of the ages in the database measured as an excess of 0s or 5s has decreased. The most violent age groups: \n \n \nNote the rapid rise in the homicide rate of 15-19 year olds. \n \n \n \nHere's a comparison of urban and rural (those with less than 10,000 people) municipalities, age adjusted since I just don't want to measure whatever age difference exists between the different levels of urbanization: \n \n \n \n \n \n \n \n \n \n \nSince the Mexican police has been publishing monthly homicide statistics for 2011 I decided to use the auto.arima function from the forecast package to predict homicides and drug war-related homicides in 2011. It may sound silly to use police homicides to predict vital statistics homicides, but the Mexican police is notorious for under-reporting homicides and manipulating the data they publish, even if it does follow the overall trend in violence. The results were between 13,000 and 19,100 drug war homicides and between 27,500 and 31,700 homicides in 2011 \n \n \n \n \n \n \nHopefully in 2011 violence didn't rise quite as much as in the previous years. \n \nP.S. You can download the code to clean up the homicide data from github or simply check out the cleaned up files from the data sets section of my website"], "link": "http://blog.diegovalle.net/feeds/3569600976461841592/comments/default", "bloglinks": {}, "links": {"http://www.fbi.gov/": 1, "http://www.org.mx/": 2, "http://cran.r-project.org/": 1, "http://www.elmanana.com/": 1, "http://1.blogspot.com/": 2, "http://www.diegovalle.net/": 1, "http://3.blogspot.com/": 2, "http://en.wikipedia.org/": 2, "http://www.stylizedfacts.com/": 1, "http://4.blogspot.com/": 7, "http://2.blogspot.com/": 5, "http://www.nytimes.com/": 1, "http://wonder.cdc.gov/": 1, "https://github.com/": 1, "http://blog.diegovalle.net/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["Click on the image to go to the interactive map \n \n \nThe Mexican government recently released crime data for 2011 at the municipality level. Sadly, it is no disaggregated by month, but beggars can't be choosers. To analyze the data I made an interactive map with d3 that includes the locations of the municipalities with the highest drug plant eradication and a 2d kernel density estimate of the location of meth labs based on newspaper reports. \n \nThe data is not without problems since Acapulco actually came out on top as the most violent urban center (metro areas or municipalities not part of a metro area with more than 100,000 people) in Mexico, and while violence has certainly increased in the port city during the last few months --it may even have been the most violent city in Mexico during August-- there is no way it is more violent than Ciudad Juarez taking into account the whole year. \n \n \n \nMexico has an epidemiological monitoring system, it is designed for transmissible diseases like influenza rather than violent deaths. There is always some delay in recording homicides since by law you have to perform an autopsy and the police are involved; however, Chihuahua is one of the few states that records homicides in a more or less timely manner, even if the data is still incomplete. Checking the data in the epidemiological system there were 1,176 murders in Juárez through July (the last month available) compared to 1,055 in the police database through August (one extra month). \n \nTo believe the SNSP data you'd have to posit that doctors are making up homicide certificates and recording them each month in the epidemiological system so that the monthly numbers match the final data. Homicides in Juárez are down from the same period in 2010, but the police case data from the SNSP is plain wrong. \n \nA similar thing happened in 2010 when the SNSP reported 3,806 total murders in the state of Chihuahua compared to 4,427 drug-related (or organized crime) murders. Stuff like this probably happens because there are many victims per police case. It's pretty sad when doctors are better at recording crime than the police. \n \nDurango, Durango is another municipality that shows a big discrepancy, with a preliminary 421 homicides (including the mass graves ) in the epidemiological system and 143 in the police database. \n \nLooking at other crimes it is not surprising that kidnappings were high in certain regions of Durango and Tamaulipas where mass graves were found. The Zacatecas, Morelia, and Villahermosa metro areas also have worryingly high kidnapping rates and are hot spots of drug cartel activity. \n \nAnd if you want to look at historical homicide data you can't do better than this map by Stanford student Dorothy Kronick: \n \n  \n Map by Dorothy Kronick \n \n \nP.S. What's happening in Atarjea, Guanajuato, by its location I'd guess meth labs."], "link": "http://blog.diegovalle.net/feeds/1137369602572398137/comments/default", "bloglinks": {}, "links": {"http://stanford.edu/": 2, "http://justiceinmexico.org/": 1, "http://www.gob.mx/": 3, "http://www.diegovalle.net/": 2, "http://mbostock.github.com/": 1, "http://2.blogspot.com/": 1}, "blogtitle": "Diego Valle's Blog"}, {"content": ["Former Mexican Army general Jorge Juárez Loera was shot dead last Saturday when getting out of his Mini Cooper after a traffic accident in Mexico City. \n \nJuárez Loera had just retired on May 16th after turning the mandatory retirement age of 65. Before leaving his post he was an Oficial Mayor of the Secretary of Defense, the third most position in the Mexican military. \n \n \n \nDuring 2007 he was the commander of the XI Military Region, headquartered in Torreón (part of the metropolitan area of La Laguna), as such he oversaw military operations in La Laguna : \n \n  \n Sources: Mortality Database SSA/INEGI, Segundo Informe de Labores - 2008 - SSP \n \n In 2008 he commanded the controversial Joint Operation Chihuahua, which coincided with a rise in homicides all across the state of Chihuahua, particularly in Ciudad Juárez and the metropolitan area of Chihuahua, Chihuahua. \n \n \n \n \n \nJuárez Loera rebuffed critics of the rising death toll by saying : \"I would like to see reporters change their articles and instead of writing about 'one more death', they should say, 'one less criminal.' \" \n \n \n \nIn July 2008 General Espitia replaced Juárez Loera as the head of J.O. Chihuahua. Four of the military bodyguards assigned to protect his wife were attacked while traveling in a Cadillac Escalade reported stolen in Durango. Two were killed. \n \nAre there other areas where we see a steep rise in homicides after a Joint Operation? There was an increase in homicides after Joint Operation Culiacán-Navolato: \n \n \nThis presentation [pdf] by Alejandro Poiré mentions that the operation in Culiacán was expanded into Mazatlán in July. As in Culiacán and Navolato there was a subsequent rise in homicides: \n \n \nLooking at the drug-related homicide rates we see a similar pattern . Noé Sandoval, the general in charge of Joint Operation Culiacán-Navolato, was promoted in December 2010 to be commander of the IV Military Region headquartered in Monterrey, Nuevo León. \n \n \n  \n Source: Reporte mensual sobre los niveles de delincuencia el Área Metropolitana de Monterrey, producido por la asociación civil Iluminemos Nuevo León con base en las estadísticas oficiales. \n \n \nSince the Mexican government views violence among cartels as a sign of success, it should come as no surprise that Generals with records of failing to stop the rise in homicides are promoted. \n \nTwo more generals have suffered attempts on their lives: Tello Quiñones who was kidnapped and killed by Zetas from Morelia, Michoacán . Before retiring and serving as a security consultant to the police force of Cancún Tello Quiñones was the commander of the 21th military zone in Morelia, Michoacán during 2007, where one can only assume he battled the Zetas. It is interesting to note how unlike in Chihuahua and Sinaloa, military operations in Michoacán were correlated with decreases in homicides: \n \n \n \nThe other general who suffered an attempt on his life was Acosta Chaparro, he was shot in the abdomen during an attempted robbery in 2010. Acosta Chaparro was sentenced to prision in 2000 because he allegedly received money from Amado Carrillo Fuentes. However in 2007 he was exonerated of all charges and set free."], "link": "http://blog.diegovalle.net/feeds/1913413305628088903/comments/default", "bloglinks": {}, "links": {"http://www.com.mx/": 2, "http://3.blogspot.com/": 2, "http://blogs.elpais.com/": 1, "http://1.blogspot.com/": 2, "http://www.gob.mx/": 2, "http://goliath.ecnext.com/": 1, "http://4.blogspot.com/": 3, "http://2.blogspot.com/": 1}, "blogtitle": "Diego Valle's Blog"}]