[{"blogurl": "http://scienceblogs.com/digitalbio\n", "blogroll": [], "title": "Discovering Biology in a Digital World"}, {"content": ["If all the information you had about scientific careers came from newspapers or TV, it would be easy to think that everyone who works in life sciences / biotechnology is either a Ph.D. scientist, post-doc, or graduate student.  In reality, the life sciences are more like an iceberg.  The public sees the people at the top, with advanced degrees, while the many people who have bachelors or associates degrees are hidden from view. \n \n \n \n \n The NIH has realized that a fair number of people they hire are community college graduates who have associate degrees in biotechnology. Many students from the Germantown campus, at Montgomery College , MD, and The Community College of Baltimore County  have gone on to work at NIH. \n To better recruit these students and make more students aware of opportunities, the NIH has started hosting a day-long workshop specifically for community college students and instructors. The workshop will be held October 19th  and will include panel discussions, networking events, and sessions on job-finding skills. \n If you are interested, please RSVP by Oct. 5th . \n Dr. Toby Horn’s blog post at Bio-Link has more information as well."], "link": "http://scienceblogs.com/digitalbio/2012/09/04/community-college-day-at-the-nih/", "bloglinks": {}, "links": {"https://www.nih.gov/": 1, "http://www.bio-link.org/": 3}, "blogtitle": "Discovering Biology in a Digital World"}, {"content": ["Many of you may remember a time when music-stealing was rampant on the internet.  Apple changed this situation by establishing a new kind of marketplace. \n \n Now people pay for music and download it from iTunes. \n \n What if there were a third party group, with an iTunes-like model, where scientific publishers would make papers available for purchase? Could this kind of model work? \n \n Two arguments support this idea. \n \n 1.  Volume sales \n 2.  The cost of creation \n \n \n Volume sales \n Volume sales work like this.  Let’s say a publisher sells 10 papers at $30 each.  This brings in $300. \n \n That same publisher could also bring in $300 by selling 100 papers at $3 each. \n \n They could earn the same of money but get materials out to more people. \n \n Will the volume be there?  The experiment hasn’t been tried. \n \n \n The cost of creation \n Many people have noted that most of the cost of creating a scientific publication is funded by taxpayers through government grants. The recording industry lacks that support, yet it seems to have survived the iTunes pricing model. \n \n I made a table below that compares some aspects of the recording industry with scientific publishing  (you can click the image to see a larger version). \n  \n \n \n \n Granted recording artists and scientists, and their funding sources have different goals.  In the case of the scientific research the goal is to advance knowledge.  One would assume that access to knowledge is an important part of making this work. \n \n One of our commenters noted that paying $30 a paper, is hardship for many.  Not only does this obstacle  discourage students from using scientific literature , it  prevents the public from accessing peer-reviewed work . It does seem that the taxpayers who fund most of this work should get a better return on their investment. \n \n Another commenter volunteered  that journal pricing practices aren’t a problem because he could use his MIT and Harvard logins to get papers. \n \n Certainly, a system where small companies and individuals rely on friends with library subscriptions is one way to get papers, but wouldn’t a system that’s less dishonest be a better one?"], "link": "http://scienceblogs.com/digitalbio/2012/01/10/could-an-itunes-like-model-wor/", "bloglinks": {}, "links": {"http://scienceblogs.com/": 4}, "blogtitle": "Discovering Biology in a Digital World"}, {"content": ["The Backstory : As it stands today,when one of the National Institutes of Health (NIH) provides the funding for a scientific research project, and those results are published, they must be made freely available to public, within a set period of time. The reasoning behind this requirement is that taxpayers funded everything about the research except for the final publication, and so they have already paid for access. \n The Research Works Act ( #RWA ), HR 3699, is a bill in the House of Representatives that would roll back this requirement. If it passes, taxpayers will most likely have to pay exorbitant fees for access to publicly-funded research. I’ll explain why in a moment. \n The Research Works Act will harm science education because students and instructors at small colleges and community colleges generally lack access to scientific journals and we will no longer be able to afford to use scientific literature in our courses. \n \n How much does it cost? \n \n One commenter on a my earlier post about the effect on science education noted that students and others would still be able to purchase research articles if RWA passes. \n I thought, dear readers, you might like to know what that privilege is likely to cost. \n \n What does a personal subscription cost today? \n Today, a one year personal subscription to Science costs $149 for a member and $75 for a student. A personal subscription for one year of Nature costs $199. We subscribe to both and pay $350 a year for the privilege. \n The problem is that working in science, and learning about science, requires looking at papers from multiple journals and multiple years from those journals. \n Access to one journal is rarely sufficient. \n Let’s look at the subscription costs for some other journals. \n Two other journals that I frequently use are Nature Genetics and Nature Biotechnology. These cost $225 per year and $250 per year, respectively. \n \nHere are the yearly subscription costs for a few of the other Nature journals: \n \n$503 Acta Pharmacologica Sinica \n$586 American Journal of Hypertension \n$319 Asian Journal of Andrology \n$865 Bone Marrow Transplantation \n$99 BoneKEy Reports \n$474 British Dental Journal \n$569 British Journal of Cancer \n$542 Cancer Gene Therapy \n$417 Cell Death and Differentiation \n$417 Cell Research \n At $865 per year, a personal subscription to the on-line only version, of Bone Marrow Transplantation would be hard for me to justify. But then, I’m not an M.D. \n \nNow, consider Nature has 91 publications, with many subscription costs over $300 per year for each journal. I’ve been told that library subscriptions are more costly than personal subscriptions. Is it really that surprising that our libraries say no? \n \n What do individual articles cost? \n Could we get by with having students read individual articles? \n \nI looked up the prices for individual articles from some of the journals that I use. \n \nThe table below shows the costs to purchase a single article from 14 different journals. \n \n  \n \nOut the 14 journals, 9 of them charge $30 per article or more. I looked at multiple Nature journals since the prices for each journal subscription varied so widely. \n Many times when we have students research a topic, we want them to look at multiple articles from multiple journals. Students might need to look at ten papers to complete an assignment. \n We also tend to have students investigate different topics. This means that we can’t just give every student the same set of articles. Each student needs to get multiple articles from multiple sources, and each article could cost $30-35 at today’s prices. Today, we can make do by having students stick to open access articles. RWA will kill that option. \n If papers were priced more reasonably, like songs in iTunes, we instructors would find RWA less alarming. But as it stands, if publishers charge the all articles with the prices they’re using now, it will kill our ability to use the literature in the classroom."], "link": "http://scienceblogs.com/digitalbio/2012/01/09/how-much-does-it-cost-to-get-a/", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://scienceblogs.com/": 1}, "blogtitle": "Discovering Biology in a Digital World"}, {"content": ["The C.R.E.A.T.E. strategy is an approach to making biology teaching a better model of biology, the science. \n From the C.R.E.A.T.E website , \n …C.R.E.A.T.E. teaching focuses on on authentic published work–peer reviewed journal articles–with students reading either series of papers produced sequentially from individual labs or series of papers from different labs focused on a single line of research. \n This summer and next, the National Science Foundation is funding two identical workshops designed to help instructors learn how to use the C.R.E.A.T.E. strategy. \n These will be held in June 2012 and 2013 at Hobart College and William Smith College, in Geneva, New York. All expenses will be covered except for travel. \n If you’re interested, APPLY NOW The deadline is January 15, 2012. \n You can download the pdf application form and more information from this page . \n C.R.E.A.T.E. stands for: \n Consider \nRead \nElucidate the hypotheses \nAnalyze and interpret the data and \nThink of the next \nExperiment \n The timing of the workshop announcement a little ironic, since New York congresswoman Carolyn Maloney is co-sponsoring a bill ( HR3699 The Research Works Act (click the “Bill pdf” link at the site to download the bill) that will make it much more difficult for students to access this valuable resource."], "link": "http://scienceblogs.com/digitalbio/2012/01/06/apply-now-for-the-create-summe/", "bloglinks": {}, "links": {"http://www.teachcreate.org/": 2, "http://thomas.loc.gov/": 1}, "blogtitle": "Discovering Biology in a Digital World"}, {"content": ["This morning, I learned that congress wants to reverse the advances made by NIH and go back to restricting access to scientific publications. Congresswoman Carolyn Maloney (New York) and Congressman Darrell Issa (California) are co-sponsoring a bill to restore the limits on public access to NIH-funded research. \n \nI’ve written many times before ( here , here , here , and here ) about the challenges that community college faculty and students have in getting access to scientific papers. \n \nIn an era where the economic benefits of educating students in science are well-known (1), the idea of crippling science education by cutting off access to the primary literature is puzzling. If anything, I would expect congress to support science education by asking the National Science Foundation (NSF) to follow NIH’s lead and require that publications from NSF funded research be made open access, too. \n \nInstead, bill H.R. 3699 will roll back the NIH Public Access Policy and block similar policies at other federal agencies. The effects would be horrific. \n \nMaloney and Issa might not be aware of this, but faculty and students at 1,167 community and technical colleges will be negatively impacted by this bill (2). Many community college faculty rely on open access materials. Not only are these publications important tools for keeping our understanding current, we rely on these publications to help educate our students. \n \n How we use primary literature in biotechnology education \nUnlike the faculty in research universities, many of the instructors in community college biotech programs are scientists with backgrounds in the biotech industry. These instructors routinely assign scientific papers as part of their courses since they are training biotechnology technicians and industry technicians are expected to be able to read this type of literature. \n Industry advisory boards also encourage the use of primary literature. At Austin Community College (Texas), students use research articles to design and write experimental protocols. At Shoreline Community College (Washington), students in the Molecular Biology course give presentations on research papers. I also refer students to the primary literature in my bioinformatics courses. And I draw extensively on primary literature when I design instructional materials and learning activities. \n Our educational practices will be severely impacted by restricting access to the literature. If we’re required to purchase individual articles, often priced at $30 each, we will either have to end these practices or consider becoming Internet pirates sailing on the good ship Napster.pdf. \n \n Some of my experiences with the problems of accessing primary literature \nTwenty years ago, as a new college instructor, I was thrilled when PubMed became free and my students could start reading abstracts on-line. I still spent hours photocopying and organizing papers for student presentations and research projects but having access to abstracts was a great beginning. \n \nNot only did I want students to learn how to scientific papers, I wanted them to understand the difference between the primary literature and the articles you might read in the newspaper or popular magazines like Discover or Wired. I wanted students to see for themselves how some details might get left out, how the same details could be presented in different ways and multiple groups might arrive at different conclusions. \n My instructor colleagues and I were especially happy when NIH began to require that NIH-funded research be open to the public. Now, we could get papers ourselves and we could start requiring our students to read papers, too. Even some of the high school teachers I know started asking students to use PubMed and skim papers on topics like genetic disease. \n  \n Doing the hard thing isn’t always easy \nIn the days when research papers were pay per view, many of us shied away from assigning primary research. After all, it’s not realistic to expect students to spend $30 to download a single article, when we know large numbers of students skip buying textbooks because of the cost. \n What? Why didn’t our students go to the library? Community colleges don’t carry many journals since subscriptions are often too expensive. As a faculty member, we were told not to request journals since our library was prohibited from ordering them. \n \nA science instructor’s task is made even harder since research articles are notoriously hard to read. Nevertheless, as instructors, we have an obligation to help students develop their reading skills. When our students don’t have access to the materials we want them to ready, this goal gets all the harder to achieve. \n  \n \n \n An unequal education for all? \nRestricting access to the primary literature will have a negative impact on access to science education. According to the American Association for Community Colleges, 43% of all undergraduates attend community colleges. For the minority students, who attend college, these numbers can be even higher (2). Consider as well, that students, including those who become science teachers, take many of their science courses at community colleges. \n \nWhat benefit could there possibly be to society for congress to take away what might be the only chance these students have to learn how to read and critique scientific papers? \n \nIf we want to promote STEM education, why handicap faculty and students by prohibiting access to the tools? \n \n References : \n 1. Bernie Trilling and Charles Fadell, 2010 21st Century Skills \n  See http://vimeo.com/17092060 for a great talk on STEM by Charles Fadell. \n 2. American Association of Community Colleges 2011 fact sheet (pdf) \n \n More information : \n Learn more about the role of community colleges in science education: \n 1. Linnea Fletcher and V. Celeste Carter, 2010, The Important Role of Community Colleges in Undergraduate Biology Education . CBE Life Sciences Education. \n 2. George Boggs. Growing roles for science education in community colleges . Science 2010;329:1151-1152.\n \n Jonathan Eisen has a nice summary of links regarding HR3699. \n And the White House has a request for information (RFI) on public access. If you want to respond to this, please hurry. The deadline for commenting is Jan. 12, 2012. \n You can find a summary of the RFI here . \n And the entire RFI here . \n \n Added : \n - Janet Stemwedel has posted a great article at #SciAmBlogs summarizing the meat of the bill: \n “ The Research Works Act: asking the public to pay twice for scientific knowledge. ” \n \n - An interesting conversation on the bill between @timoreilly and congressman @DarrellIssa was posted by Alex Howard (digiphile) at Storify."], "link": "http://scienceblogs.com/digitalbio/2012/01/06/raising-the-barriers-restricti/", "bloglinks": {}, "links": {"http://storify.com/": 1, "http://www.lifescied.org/": 1, "http://blogs.scientificamerican.com/": 1, "http://scienceblogs.com/": 4, "http://www.taxpayeraccess.org/": 2, "http://www.sciencemag.org/": 2, "http://www.21stcenturyskillsbook.com/": 1, "https://docs.google.com/": 1, "http://www.gpo.gov/": 1, "http://vimeo.com/": 1}, "blogtitle": "Discovering Biology in a Digital World"}, {"content": ["In simple Mendelian genetics, a single change in one gene can produce a large change in mortality. The National Human Genome Research Institute (NHGRI) will be funding genomics studies on Mendelian traits using a similar strategy. \n NHGRI will fund a small number of centers, dominant centers you might say, and look for large changes. The sequencing centers that will benefit are the Broad Institute, Washington University, and Baylor College of Medicine. For the next four years, the big three will be dividing $86 million a year according to a press release from NHGRI . I’m not sure what algorithms predict a larger return from funding a smaller number of researchers, but the future looks like fun for those on a small budgets who can figure out how to slurp up the data and quickly spit out results. \n Studies on Mendelian disorders will benefit from the proposed funding plan as well. According to the NIH press release, only half of the estimated 6,000 rare diseases, inherited in a Mendelian pattern, have been linked to a genetic cause. Although each disease is rare, in combination, these diseases affect approximately 25 million Americans. Today’s DNA sequencing technologies offer an unprecedented ability to find the basis for these diseases, particularly when the genomes of entire families are compared. \n Which brings us to clinical sequencing and new interesting issues. \n Earlier genetic tests raised all kinds of ethical controversies. Does everyone have a right to be tested? Should test results be shared with one’s family? Should parents be allowed to test children? Should someone have a right to know, to not know, etc. Identifying all the stakeholders and their issues can make your head spin. \n And those tests typically looked at single genes. \n Today, when we sequence a genome, we will find much more information about many thousands more genes whether we want it or not. Genome sequencing is like remodeling. A simple quest to check out a foundation always goes along with the chance of finding water leaks or ant colonies. \n We could sequence a genome from a cancer patient for example, to determine the best drug for treatment, and uncover an undiagnosed predisposition to some other bad news of kind of trait. What doctor wants to share the news that they can cure someone’s cancer but that early Alzheimer’s gene they found, uh sorry, maybe you want to look into assisted living? \n Many of us see enormous potential in genomic sequencing. But, in the end successfully using genomics will require us to go well beyond the work of developing the technology to prepare genome sequencing for the clinic. We’re going to have to prepare the clinic for genome sequencing."], "link": "http://scienceblogs.com/digitalbio/2011/12/06/genomic-funding-goes-mendelian/", "bloglinks": {}, "links": {"http://www.genome.gov/": 1}, "blogtitle": "Discovering Biology in a Digital World"}, {"content": ["Like everything else, if we want to know what’s going on, we have to ask. \n So, it’s time once again for the 2011-2012 National Biotechnology/Life Sciences Program Survey. \n Yes, indeed. \n Federal and state agencies will use the results to determine how best to support programs like yours. This study will also help prospective students and industry employers find your program. Survey results will be available to you to help with program planning, grant activities, and more. \n We only want one person from each biotechnology / biomanufacturing / bioscience program to complete the survey. If you are not the right person to complete the survey, please get your college’s biotechnology/life sciences program administrator to spare 15 minutes and fill this out. \n We think the survey will take 15 minutes or less to complete. \n Your participation is crucial to ensuring that the results accurately represent this important industry. Whether or not your college currently offers a biotechnology/life sciences program, your input is essential. The survey includes programs that are in the planning stages, as well as ways that colleges incorporate these subjects into other courses. \n The survey asks about: \n·   Program characteristics, \n·   Student demographics, and \n·   Degrees and certificates awarded. \n To start the survey, please click on the link below. \n https://www.surveymonkey.com/s/BioLinkNationalSurvey \n This survey is being conducted by Bio-Link’s Independent Evaluator, the Social and Economic Sciences Research Center at Washington State University (WSU-SESRC). To request a paper version of the survey or to complete the survey via telephone, please contact Candiya Mann, Project Director, at candiya@wsu.edu"], "link": "http://scienceblogs.com/digitalbio/2011/11/28/biotechnology-education-what/", "bloglinks": {}, "links": {"https://www.surveymonkey.com/": 1}, "blogtitle": "Discovering Biology in a Digital World"}, {"content": ["What roles should community colleges play in training the bioeconomy workforce of the future? \n Send your answers to bioeconomy@ostp.gov by Dec. 6th. \n One night towards the end of October, we happened to meet with someone who could tell us more. \n We asked him about a request for information (RFI) soliciting input on the bioeconomy, that some of us saw posted on the Federal Register web site. \n “What could information could we provide?,” We asked (a little skeptically). \n “Does the Whitehouse really want our input on ways to stimulate the bioeconomy and build the bioscience workforce?” \n \n“ Yes ,” he said. \n To paraphrase: The Whitehouse wants input from as many community college faculty as possible. The government wants information to better leverage our national investments in biological research and grow the jobs of the future. \n The RFI even addresses community colleges. The section on workforce development, in particular, point 10, asks: \n (10) What roles should community colleges play in training the bioeconomy workforce of the future? \n What might we tell them? \n And, why should we share this information? \n Here are some notes from our discussion: \n 1. Community colleges play a unrecognized role in post-baccalaureate education. \n Many students who attend community colleges have degrees from four-year institutions and universities. These students come to community college programs to learn job skills. Sometimes they’re recent graduates from a four year institution. Sometimes these students have already been in the work force and wish to upgrade their training or learn new skills. \n Although, community college instructors are universally aware that we have large numbers of students with four-year degrees, it turns out that the role of community colleges in educating already-degreed students is not common knowledge. \n No one (except, perhaps, community college instructors) captures data about the number of students with degrees who attend community colleges, in any kind of systematic fashion. Four year colleges and Universities don’t have these data and community colleges don’t ask. \n We can help. \n If we have been collecting these data, the Whitehouse would like us to share this information. They want to learn more about the number of students at community colleges with bachelors degrees. I always survey my students, I have these data for the classes that I teach. I’m sure I’m not the only instructor who does this. \n Describing our role in post-baccalaureate education is also important in combating the myopic definition of success currently promoted by the Gates Foundation, and others, that students are not successful unless they get a degree or certificate. It’s ludicrous to consider a student, with a bachelors degree who takes a few classes at a community college and gets a job as a failure because they didn’t get an additional degree or transfer to a four year school. We need to address this narrow viewpoint and help these groups expand the definition of success by sharing our data and experiences with post-baccalaureate students. \n 2. Community college Biotechnology Education programs are experts in developing and maintaining innovative public-private partnerships. \n Many community college biotech programs work closely with their local industry and contribute to the bioeconomy in numerous ways. Some colleges have small business incubators on campus. Other colleges have agreements with biotech incubators in terms of internships and staffing. The colleges agree to equip students with the proper skills and the incubators agree to provide internships. \n Some colleges have even started their own contract research organizations and small non-profit businesses to assist local companies and provide internship opportunities for their students. \n Some colleges have been able to purchase costly high-tech equipment through grants from the National Science Foundation’s Advanced Technology Education program. Not only do some colleges use the equipment to train their students, they allow small companies to use the equipment in off hours. \n Some colleges work very closely with their state trade organizations. A skilled workforce is an asset when communities are trying to lure business to their area. If a trade organization works with a college, that trade organization will be better prepared to answer questions about the number of skilled alumni, and the educational capacity and training facilities at the school. \n Many of us, in Bio-Link , know how entrepreneurial community college programs can be, but these activities are unknown outside of the biotech education community. \n If your college is engaged in these kinds of activities, or other related activities, the Whitehouse wants that information. \n They need to know that almost every community college biotech program, and certainly every Bio-Link program has an industry advisory board, and works closely with industry to ensure that graduates are learning the skills that they need. \n 3. We need to share the fact that our community colleges have programs that specifically assist veterans and that many of them end up in biotech and medical device education programs. \n No one can fix laboratory equipment like a vet. And all small biotech companies and college science labs have broken equipment that needs fixing. \n Why should we respond to the RFI and share what we know? \n As many of us know, the biggest contributor to improving the abilities of community colleges to educate students and provide them with job skills in bioscience has been the Advanced Technology Education program at the National Science Foundation. \n Recent news reports have mentioned that the National Science Foundation plans to cut its education budget by almost 4%. ( Science magazine, Nov. 15, 2011 ) \n If we expect to be able to continue to educating students in advanced technology, and helping them get jobs, we need to let the world know what we do and share our ideas with the government. \n Send your answers to bioeconomy@ostp.gov by Dec. 6th. \n Responses to the RFI, including the names of the authors and their institutional affiliations, will be posted at http://www.whitehouse.gov/ostp/bioeconomy ."], "link": "http://scienceblogs.com/digitalbio/2011/11/25/community-colleges-and-the-bio/", "bloglinks": {}, "links": {"http://bio-link.org": 1, "http://www.federalregister.gov/": 1, "http://news.sciencemag.org/": 1, "http://www.whitehouse.gov/": 1}, "blogtitle": "Discovering Biology in a Digital World"}, {"content": ["For the past few days I’ve been avidly following Daniel MacArthur’s tweets from the Personal Genome Conference at Cold Spring Harbor( @dgmacarthur #cshlpg ). \n The Personal Genomics tweets aren’t just interesting because of the science, they’re interesting because MacArthur and others have started to take on the conventional dogma in genetic ethics. \n For years, there has been a strong message from the clinical genetics and genetics education community that genetic information is dangerous. \n \n Unlike the other medical tests we’re continually urged to get ( mammograms, blood pressure readings, sugar, colonoscopies ) genetic tests are presented, at least in teaching materials, as risky . According to many teaching materials, you should not get a genetic test, until you’ve identified all the stake holders, and weighed all the pros and cons. Imagine if doctors used followed these procedures before reading someone’s blood pressure or taking their temperature. The implication isn’t stated, but the underlying message is clear: Genetic tests are different and more dangerous than conventional medical procedures . \n Ironically, much of the negative atmosphere around genetic information seems to have originated from ELSI. ELSI was a commitment on the part of the NIH to use 1% of the money allocated to sequencing the human genome to fund studies on the ethical, legal, and social implications of the human genome project. \n Instead, ELSI has produced several curricular materials that present genome sequencing as a “bad idea.” The biggest consequence of ELSI has been to turn the desire for one’s own genomic information into something shameful. \n People who get their DNA sequences are equated with skydivers, speed racers, and winners of the Darwin awards. All the signs say “ Warning!! You are engaging in risky behavior that could endanger your family, job, and insurance policy .” \n \n The top reasons for discouraging genetic testing \n The usual reasons that geneticists give for discouraging people from seeking genetic testing are: \n - the results are too complicated for most people to understand ( most people are too stupid? ) \n - the risks outweigh the benefits ( This could be true, but we rarely talk about the benefits, and we obsess about the risks. ) \n - it’s expensive ( According to Atul Butte, by way of Daniel MacArthur’s tweets, a colonscopy costs $6000. This is now 6x more expensive then having 23andme sequence your exome, plus you would get far more information .) \n \n It’s not just the education community \n Some of tweets from MacArthur were on stories from Gholson Lyon on being unable to share findings from Next Generation DNA sequencing studies with patients. \n Patients in clinical studies must give their consent and acknowledge that they understand the risks of the study in order to participate. The forms that are used for consent are designed to protect patients and minimize risks. \n \nA problem with some clinical studies is that occasionally the researchers find medical problems in the participants that weren’t known before the study. These kinds of findings are becoming more common with studies that sequence the entire genome. Unfortunately, the common practice has been to avoid returning this kind of “ incidental ” information back to the patients. After all, they didn’t give their consent to receive it. \n \nMacAthur tweeted one story from Gholson Lyon where the researchers learned that a woman in a study, who was 4 months pregnant, was a carrier for a lethal disease. They weren’t allowed to tell her this because of the IRB constraints, and the affected baby died. According to MacArthur, ” … this emphasizes the moral horror of blocking return of research findings. “ \n \nOut of the mouths of babes \n \nA teenage conference attendee spurred one of MacArthur’s most intriguing tweets: \n \n“ Anne West (only healthy teenager I know with a genome sequence) asks about consent forms: shouldn’t they include risks AND benefits? #cshlpg “ \n \nAccording to @finchtalk, West, apparently used Next Generation DNA sequencing, to determine the DNA sequence of her own genome and that of other family members as part of a high school science project. \n West makes a good point. \n Why don’t we give equal time to talking about the benefits? \n \nMaybe it’s time to acknowledge that genetic information is just like any other kind of medical information. Deciding not to get a test, never makes a problem go away."], "link": "http://scienceblogs.com/digitalbio/2011/10/02/genomes-with-benefits/", "bloglinks": {}, "links": {"http://twitter.com/": 2}, "blogtitle": "Discovering Biology in a Digital World"}, {"content": ["“It’s all about saving Aunt Millie” \nBob Swanson \nCo-Founder of Genentech \n I just learned today that Jim DeKloe, who wrote this post as a guest author a few years ago is giving a webinar on May 11th on protein purification from industrial enzymes to cancer therapy. \n Jim’s webinar, offered through Bio-Rad, has two sessions at 3 pm Eastern and 7 pm Eastern. Registration is free and you can register HERE . \n Jim is one of the most inspirational educators I know and he’s the sort of person that reminds you why educating students about biotechnology careers is important. His moving story is one that always reminds me that there’s more to biotechnology than just the science. \n \nOne of those is Jim deKloe. A long-time instructor at Solano Community College, Jim is an amazing individual and an accomplished educator. Full of humor and energy, when I first met him, it was shock to see Jim a few years later, when the ordeal (described below) was recent and the pain was fresh. \n No one can tell his story like Jim, so with Jim’s permission, I invite you to read on. \n \n My Story \n By Jim deKloe \n I couldn’t have written this story as a script for Hollywood. No one would have believed it. \n It was the Sunday morning after Thanksgiving, and my 4-year-old son, Jefferson, woke up at 5:30 with a 102-degree fever. He was fine the night before, even a little hyper in his happy-go-lucky way. He was sleeping in our bed and we did notice that he had some fever during the night, but Motrin easily brought it down. \n Then morning came, and the fever persisted. \n “ Should we take him to the emergency room? ” my wife, Laura, asked me that Sunday morning. \n “ I don’t know ,” I answered. “ Trust your instincts, what do your instincts say? ” \n “ My instincts say take him in ,” she said. “ He just doesn’t look right. ” \n Kids get fevers of 102 degrees often, and you don’t want the triage officer at the emergency room to think you’re a hypochondriac. But in this case, he didn’t look right. His complexion was ashen. He spoke, but didn’t make sense. \n We decided to take him to the ER. Had we hesitated, he would have been dead within hours. \n Staring into the abyss \nIt was a move that marked the beginning of a walk through darkness for my family, with days spent staring into the abyss. Jeff hung near death, infected with a deadly bacterium until a miracle drug developed by Genentech brought him back to us. A few years earlier I had helped make the drug for Genentech, which helped convince me it might work for Jeff. \n NorthBay Medical Center emergency room staff took the fever seriously and administered antibiotics. Jeff went in and out of consciousness. Laura pointed out a small rash on his chest to the doctor on duty, Dr. William Peterson. He immediately ordered a helicopter to airlift Jeff to Oakland Children’s’ Hospital. Had he not done that, Jeff would have died. \n Jeff had meningococcemia, an infection where bacteria enter the bloodstream. It’s due to the same bacterium that’s responsible for meningitis, but in this disease the bacterium jumps into the blood rather than into the fluid surrounding the spine. Textbooks report that it has a mortality rate of somewhere between 50 and 80 percent (with death often occurring within hours of outset). \n Jeff’s grandfather, a pediatrician in practice for 40 years, had not heard of any kids surviving this. When he got the call with the diagnosis that afternoon, he drove from Orange County to Oakland. He assumed he was driving to his grandson’s funeral. \n The bloodstream is one of the only places on the planet that is bacteria-free. There are live bacteria atop the highest mountains, in the deepest part of the ocean, in volcanic hot springs, and in Antarctic snow banks. If there are bacteria in the blood, a condition called septicemia, it is always life threatening. And these particular bacteria are bad news. \n Antibiotics kill them easily, but that’s when the real trouble begins. \nWhen you treat them with antibiotics, you go from the frying pan into the fire. You’ve got to do it; you can’t stay in the frying pan. As the bacteria die, they throw a component of their outer membrane into the bloodstream. This is called endotoxin, and it has a couple of dramatic and awful effects. \n It isn’t that the molecule itself is toxic, but it triggers the immune system to go wild. It induces shock and blood pressure crashes. Science writer Lewis Thomas describes the immune system as containing munitions and this condition as an explosion in the munitions factory. \n ‘Your son is very sick – prepare yourself’ \nAs Jeff was airlifted, his blood pressure crashed. The helicopter paramedic team from REACH, and the Intensive Care Unit at Oakland, set up an IV, began fluids and started epinephrine (adrenaline) that props up blood pressure. The intravenous fluids also boost the blood pressure as fluids leak out of the blood vessels into the surrounding tissues. \n Jeff had a net gain of 5 liters of liquid on that first day – more than 10 pounds. And this in a boy who doesn’t even weigh 40 pounds – a 25 percent gain in weight. Jeff had the fulminate form of this disease, which means that his blood began to clot. \n The rash that Dr. Peterson saw was the beginning of the clotting process. The broken down pieces of bacteria trigger clotting. And they clot everywhere. The condition is called DIC, diffuse intracapillary coagulation. The clotting spread to Jeff’s head, and down his body. By the time he reached the hospital’s intensive care unit, his body looked like it had been taken to the top of Everest and rolled down to sea level. By the time we reached Oakland, a social worker met us. He said, “Your son is very sick – prepare yourself.” \n Dr. Vivian Newman and her colleagues were in a flurry of activity over Jeff’s purple body on the table. \n “ First we’ll try to save his life, then we’ll worry about saving limbs ,” she told us. And then she said, “ We would like to try something experimental. We’ve tried it once before. It has some risks and we would need informed consent. I would like our hematologist to discuss it with you .” \n By the time I saw Jeff, the clotting DIC had already spread everywhere. He was purple with bruises from head to tail, except for the ends of his fingers and toes which were beginning to look like they where black with dying flesh. We were in big trouble. \n ‘Yes, I know the risks ,” I said. “ Do it .” \n Dr. Singer, the hematologist, poked her head in and told me, “ we would like to try a thrombolytic agent .” \n “ tPA?” I asked. \n “ Yes ,” she said. “ You know it? ” \n “ It’s a Genentech product. I spent my sabbatical in the department where it is made .” \n Tissue Plasminogen Activator is an enzyme that dissolves blood clots. \nFor the past three years I have been working with Genentech to develop a program to train technicians to manufacture this drug and others. In this program, we use tPA, or Activase, as a case study to represent how a typical biotech product comes to market. We discuss tPA’s discovery, research and development, economics of production, marketing, effectiveness in treating the diseases for which it was approved, and the risks of using it. \n I had never heard about anyone using tPA to treat meningococcemia or DIC. No one at Genentech had either. It seemed at the time to be logical – that an enzyme that digests blood clots would be a good treatment for a boy who had blood clots choking all of his blood vessels, but the staff at Children’s were pioneering this new application. \n The law on a new use for a drug is well-defined. The law wisely gives physicians wide discretion to use a drug in a way that isn’t formally approved by the Food and Drug Administration, as long as they receive informed consent. In this case, tPA is approved to treat heart attack and stroke, where it digests the blood clots that block the coronary artery in the heart or the blood vessels in the brain. It made intellectual sense that an enzyme that digests blood clots could help Jeff, whose entire body was filled with blood clots. But would it work? \n “ Should we go ahead? ” Dr. Singer asked. “ There are risks .” \n “ Yes, I know the risks ,” I said. “ Do it .” \n I calculated that they would be the same as the risks in administering tPA to stroke victims. If there are any small holes in the blood vessels in the brain, the patient dies from bleeding. With the tPA digesting blood clots, there are no clots to seal any hole. It was a bit worse in this case since all of the clotting in Jeff’s body had used up all of the clotting factors. I calculated that the blood vessels in the brain of 4-year-old would be intact. \n A Medical Miracle \nThey gave him some platelets and blood, and then started the tPA infusion which would drip in over a 4-hour period. In a little while, the purple visibly had started to clear. The clearing wasn’t instantaneous; it was more like clockwork. You couldn’t see it clear, but if you looked away from his body, by the time you looked back, the color seemed lighter. A second four-hour treatment improved the condition even more. His brain blood vessels held, and there seemed to be no complications. \n Amputations are a big problem with this disease, since the clots that it produces cut off blood flow to the limbs. Several of the workers in Oakland’s rehabilitation unit told me “I’ve had five or six kids who survived this, but I’ve never seen one who didn’t have at least one limb amputated. \n Many children lose all of their limbs. \nDr. Newman was watching Jeff’s right leg. On day two she said, “ This limb is compromised .” It was turning purple and cold. She ordered one last round of tPA. Although this third treatment didn’t produce results quite as dramatic as the first two, it began to work immediately. The border of the purple area on the foot began to recede, and a star of white pushed into the area. \n The cold areas began to feel warmer. His leg was saved. I had prepared myself mentally that he would lose the fingers on his right hand and his right leg, at least below the knee. A medical miracle saved them. \n With life and limbs restored, the next question arose: “ Is there any brain damage? ” We would have to wait until they stopped the intravenous drugs and brought him around. A week on his back had caused fluid to pool in his lungs. They stopped the drugs, pulled out the respirator tubes, and began to suction out the fluids. In the middle of a suction treatment, Jeff opened his eyes, looked at the nurse, and said “ Stop it ” and “ do this to my brother .” Since I believe that sibling rivalry represents higher brain function, I then knew that he would be all right. \n Jeff remains hospitalized, recuperating from some skin damage on his leg that the temporary loss of blood produced. These areas of skin damage will need grafting, and he has some muscle and neurological damage to his legs. \n Mentally he’s as sharp as ever; sharp enough to correct me on my Pokemon misidentifications. It will take a bit of time and physical therapy to know how well he can heal – but I haven’t forgotten where we were two months ago. \n A series of fortunate events all broke our way. We took him in. The bacterium wasn’t an antibiotic resistant strain. The NorthBay emergency room staff recognized that the disease was serious enough to order an airlift. The staff at Oakland was familiar with tPA and willing to pioneer a new technique. That particular staff happened to be on duty. \n The drug they chose turned out to be the drug that I knew the most about, so I could give a quick approval. The helicopter pad had been closed and only recently reopened. And it all worked. \n No one knows how children get this killer bacterium. A significant number of people carry it in the back of their throats with no ill effect. For a reason that isn’t clear, in a few it jumps into the bloodstream to cause this deadly disease. \n Until recently, the shock produced by this disease killed most of the children who contracted it. The blood clots of the DIC condition make it even worse. \n In his four decades of medical practice, my father-in-law had never seen a child with this condition survive. New developments in critical care techniques allow physicians to give the kids a fighting chance. \n The pioneering use of tPA by Oakland Children’s’ Hospital prevented disaster in this case. It isn’t hyperbole to call this event a medical miracle. \n technorati tags: Bio-Link , biotechnology , Genentech , education , biotechnology education , tPA , meningococcemia"], "link": "http://scienceblogs.com/digitalbio/2011/05/06/its-all-about-aunt-millie/", "bloglinks": {}, "links": {"http://technorati.com/": 7, "http://secure.elabs7.com/": 1}, "blogtitle": "Discovering Biology in a Digital World"}]