[{"blogurl": "http://eagereyes.org\n", "blogroll": [], "title": "eagereyes"}, {"content": ["I gorged myself on talks, panels, and tutorials last week. And parties, oh the parties. Time to digest all of it and, um, extract the most important bits. Since there is so much to talk about, I have split this up into three parts. Parts 1 and 2 will discuss individual papers and events, part 3 will add some more general observations. \n VisWeek has been growing quite steadily over the last years, but this year hit a particularly interesting milestone: more than 1,000 attendees. The final number was 1,058, almost 100 more than last year. \n Large-Scale Data Analysis and Visualization \n The Symposium on Large-Scale Data Analysis and Visualization (LDAV) was a mixed bag. While I enjoyed Pat Hanrahan’s keynote , I was shocked when I saw the best paper. There were some redeeming papers, but the quality overall was quite low. \n Rainbow colormaps are a constant source of scorn from people who care not only about putting data onto the screen, but actually being able to read the information without unnecessary distortion. The best paper at LDAV, Gaussian Mixture Model Based Volume Visualization by Shusen Liu, Joshua Levine, Peer-Timo Bremer, and Valerio Pascucci, used not just a single rainbow, but multiple ones in its color map. The effect is breathtaking. \n  \n The color choice is never explained in the (very short) paper, and Shusen was quite apologetic during his presentation about the choice of color. Then why do it? I don’t get it. Whatever redeeming qualities this paper may have, it destroys information by assigning the same color to multiple values. How can this even be considered the best paper? \n On the bright side, Kenneth Moreland presented his paper Redirecting Research in Large-format Displays for Visualization in a fantastic talk. He questioned the way large displays are currently built, how they are (and are not) used, and how interaction works with them. He was quite critical of the state of the art, but at the same time made concrete suggestions about how to improve the situation. One of the many interesting points he made was about the value of presenting enormous amounts of detail and our inability to find small irregularities, which came up several more times at the conference in entirely independent places (like the best paper at InfoVis). \n VisWeek is already overwhelming. Instead of adding ever more sessions, I think it’s time to consider making some tough decisions. Why not cut a low-quality two-day workshop down to one day and only accept the really worthy stuff? A 53% acceptance rate drags everything down, including the good papers that make it there. \n Keynote: Mary Czerwinski \n A keynote is meant to inspire people and get them to think. It’s often a good idea to bring people in from somewhat different fields to talk about topics somewhat, but not entirely, unrelated to the conference. \n Mary Czerwinski is a well-known researcher at Microsoft Research who has done a lot of interesting work in human-computer interaction. She gave a fine research talk, but entirely lacked any kind of big idea or inspiration. There were plenty of good starting points for some bigger ideas in her talk, too: her work on emotional state tracking could have made for some interesting and controversial points, and there were several other things that almost begged to be expanded into something bigger. \n It’s disappointing to see somebody of her caliber give a keynote in front of almost 1,000 people and just take the safe route of presenting her research. Luckily, the capstone made up for it. \n InfoVis Best Paper \n How Capacity Limits of Attention Influence Information Visualization Effectiveness by Steve Haroz and David Whitney was the deserved winner of the Best Paper award. Not only is the paper highly interesting and relevant, Haroz also gave one of the best talks all week. Instead of dwelling on small details, he presented his findings clearly and talked about concrete lessons learned from his work. Talk about basic research being useful. \n The paper describes a series of experiments that looked into our ability to find outliers (unusual values) among noise, depending on whether the values around them were grouped or not. Grouping helps considerably, though there are certainly limits. Finding unusual values and patterns is a common task in visualization, so this work is quite significant. Understanding the limitations of human perception and cognition is important to know which tasks we’re actually capable of, and which we cannot do. \n Among the useful advice were such things as reducing the number of colors through binning, or graying out items that are not currently of interest. Also, finding a few anomalies on an enormous display is close to impossible, as was also mentioned in Kenneth Moreland’s LDAV talk. \n Soon after the presentation, a Twitter user called viscritic (whose account seems to have been deleted in the meantime) started attacking the paper on an anonymous webpage. Haroz responded by posting a brief but clear comment with some demo videos . \n There was some discussion about the fact that the criticism was anonymous, but I don’t see an issue with that. The key is whether criticism is valid and fair, and whether it is delivered in a reasonable tone. Anonymous criticism should certainly be possible, even if I’d argue that it’s really not necessary in this community. \n More InfoVis Papers \n Design Study Methodology: Reflections from the Trenches and the Stacks by Michael Sedlmair, Miriah Meyer, and Tamara Munzner describes a framework for conducting successful design studies. While design studies are technically a paper category, they are fairly rare and often get shot down in the review process. This paper presents a great overview of successful studies as well as lessons learned from a large number of them (Tamara Munzner is probably a co-author on at least half the design studies published in InfoVis) \n Visual Semiotics & Uncertainty Visualization: An Empirical Study by Alan M. MacEachren, Robert E. Roth, James O’Brien, Bonan Li, Derek Swingley, Mark Gahegan was perhaps my second-favorite paper at the conference. It describes an experiment to assess simple glyphs to display uncertainty as just three levels, rather than the quantitative approach that is usually used. Reducing the number of possible values makes it easier to understand the display and spot outliers (see Haroz above). The results of the study are not all that surprising to anybody who has done any work on uncertainty, but it’s good to see these things studied in depth. There are also broader lessons learned here about the role of semantics and categorization in visualization. \n Comparing Clusterings Using Bertin’s Idea by Alexander Pilhöfer, Alexander Gribov, Antony Unwin describes a simple idea for clustering values in categorical displays such as parallel sets, Circos, and others to improve legibility. Cleaning up the visualization makes patterns much more apparent and provides another case study for Haroz’s work. Focus and decluttering seems to be something that people are realizing as important for effective visualization, and I think we’ll see more of that in the coming years. \n Perception of Visual Variables on Tiled Wall-Sized Displays for Information Visualization Applications by Anastasia Bezerianos and Petra Isenberg is another look at large displays. The authors were more interested in collaboration here, but also found some interesting perceptual issues, like the fact that comparing colors over large distances is problematic, and that the lower displays tend to be much less accurate. Among the surprises is the finding that the bezels between screens can actually be useful for some tasks because they provide reference lines. \n Assessing the Effect of Visualizations on Bayesian Reasoning Through Crowdsourcing by Luana Micallef, Pierre Dragicevic, and Jean-Daniel Fekete has perhaps the most intuitive explanation of Bayesian reasoning I have ever seen. The paper describes a study of visual aids for exactly this problem, but depressingly shows no effect from the visualization. It does help when there are no numbers in the accompanying text, but apparently numbers in the text make people ignore the visualization (or spend too little time on it). Both the topic of the study and the way it was set up are very interesting, and point to another huge but largely unstudied problem: how to effectively support reasoning using visualization. \n A First Wrap-Up \n There were some very thought-provoking papers and discussions at VisWeek this year. It’s difficult to compare, but I found the good parts to be better than in previous years. There were some really unique papers, which hopefully will be taken up as models for further work in the future. \n Lane Harrison, Roman Pyzh, and Drew Skau have written up some great notes for many of the sessions, with additional comments and links."], "link": "http://feedproxy.google.com/~r/EagerEyes/~3/lUndZsSu1Is/visweek-2012-digest-part-1", "bloglinks": {}, "links": {"http://www.sandia.gov/": 1, "http://hal.inria.fr/": 2, "http://steveharoz.com/": 1, "http://ldav.org": 1, "http://steveharoz.com/blog": 1, "http://eagereyes.org/": 1, "https://docs.google.com/": 1, "http://eagereyes.org/blog": 1, "http://www.psu.edu/": 1, "http://research.microsoft.com/": 1, "http://www.ubc.ca/": 1}, "blogtitle": "eagereyes"}, {"content": ["VisWeek 2012 started today, and it started with quite a bang. Here are some observations and highlights from the first day. \n A great milestone is that as of a few hours ago, there were over 1,000 people registered. Surprisingly, over 700 people picked up their badges yesterday night and today, which probably makes this the busiest first VisWeek day ever. \n Keynote Pat Hanrahan \n Pat Hanrahan gave a great keynote at LDAV. He talked about a new approach to dealing with large data, which he calls divide and recombine . I’m not sure I understand it completely, but the idea seems to be to break data up into smaller chunks depending on different criteria, in order to essentially conduct experiments on the data. He argues that this is a more flexible way of dealing with large data, and a more efficient way of computing statistics than using pure Map/Reduce. Along the way, he showed some fascinating work on making R faster by implementing a just-in-time (JIT) compiler for it , and/or running R on top of Hadoop . \n An interesting point Pat made in front of this audience that is traditionally very heavy on scientific computing was that high-performance computing (HPC) would soon be driven by business analytics rather than by scientific computing (which is what has been driving the field for many years). He also argued for looking over the fence and combining new ideas from cloud computing with HPC. This may seem obvious from an outsider’s perspective, but the two communities are currently completely disconnected, attend different conferences, etc. \n BELIV \n There were some good discussions in the BELIV sessions today, on a variety of different topics. While they were all interesting, very little was really new. It’s not a new insight that we need to engage psychologists more, and there have been papers on evaluation methodology in the past. What is lacking is a bold next step that will move the field forward not just in terms of evaluation, but the way we think of visualization in the broader context of perceptual and cognitive research. \n BioVis \n I only saw a small number of papers in BioVis today. What I found really interesting are the short primers at the beginning of every session. Since a large part of the audience have little or no background in microbiology, genomics, etc., these provide some background to understand what many of the papers are about. Even in other sessions, I can imagine a brief introduction being useful to provide some context, in particular ones on evaluation, etc."], "link": "http://feedproxy.google.com/~r/EagerEyes/~3/D6C89umU7mA/visweek-2012-day-one", "bloglinks": {}, "links": {"http://www.datadr.org": 1, "https://github.com/": 1}, "blogtitle": "eagereyes"}, {"content": ["What good is a blog if it doesn’t serve the noble goal of self-promotion? Here are a few pointers to papers I’m involved in at VisWeek, as well a job posting that’s kind of my fault. \n Papers \n Aritra Dasgupta and I have a position paper at BELIV , titled The Importance of Tracing Data Through the Visualization Pipeline . The idea is to extend the rather limited traditional visualization pipeline by also considering the user side, as well as turning it into a closed loop. I will present this paper in the second morning session on Sunday. \n Also on Sunday, and unfortunately at the same time, Adam Price will present a paper he wrote with Cynthia Gibas and me at BioVis , Gene-RiViT: A visualization tool for comparative analysis of gene neighborhoods in prokaryotes . It’s a neat tool that does what many horribly clunky, text-based things are currently trying to do, but in a sleek and fast visual interface. It’s written in D3, runs in the browser, and talks to a server backend created with node.js and an OLAP-style database. \n To round out the tour of workshops, Aritra and I have a paper in LDAV on Meta Parallel Coordinates for Visualizing Features in Large, High-Dimensional, Time-varying Data . We were hoping to have all three presentations in parallel, but this one was unfortunately pushed to Monday, the session after the keynote. The paper turns parallel coordinates on themselves by using them not to visualize the data, but metrics about what parallel coordinates would look like if they showed the data. Meta! \n Tenure-Track/Tenured Professor at UNC Charlotte \n So apparently somebody recently left UNC Charlotte , and they’re now looking for a replacement. This is a tenure-track or tenured faculty position in the computer science department at UNC Charlotte . If you’re curious about the department, the college, the Charlotte Visualization Center , etc., talk to me at VisWeek. Also, make sure to find the other UNC Charlotte folks there (there will be quite a few); in particular, you should talk to Bill Ribarsky , who is not only running the visualization center, he’s also the chair of the computer science department. \n VisWeek Coverage \n I will be tweeting from VisWeek a bit, but only occasionally and only real highlights. It’s really difficult to tweet and follow what’s going in any meaningful way, and I also know that tweet torrents can be annoying to read (because of the lack of context, among other reasons). \n Just like with EuroVis , I will try to write daily summaries here. Given the number of parties and other events planned at night, I might skip a day or two, but I will do my best to keep you informed about the most important stuff."], "link": "http://feedproxy.google.com/~r/EagerEyes/~3/o9csifdkmNw/visweek-pointers", "bloglinks": {}, "links": {"http://cs.uncc.edu/": 2, "http://biovis.net/": 1, "http://ldav.org": 1, "http://kosara.net/": 3, "http://eagereyes.org/blog": 5, "http://www.beliv.org/": 1, "http://twitter.com/": 1, "http://viscenter.uncc.edu": 1}, "blogtitle": "eagereyes"}, {"content": ["When Alberto Cairo first told me about the book he was writing, called The Functional Art , he warned me that only a small part of it was going to be about visualization. I have no idea what he was talking about, the book I read was a visualization book from start to finish. It is one of the most interesting and insightful books on the topic I have read in a while. \n This book is really three books in one, plus a bunch of video lectures. Two books are obvious from the way it is structured, the third one is the collection of visual examples Cairo uses to illustrate his points. \n Book 1: The Introduction to Visualization in Journalism \n The book’s title is a great description of visualization, and Cairo makes ample use of it to map out the space between making things more informative and making them prettier. He is not against making things pretty, and for good reason. A visualization that looks bad will not attract any readers and so won’t have much of an impact. But the information has to be there, and it can’t be covered up by the decoration. \n The writing is generally very good, it flows easily and all his anecdotes help illuminate the process and questions journalists face when designing information graphics. The only exception is a lengthy discussion of Lamarckian evolution in Chapter 2 that could have been cut by two thirds (or entirely). I get the point, but that discussion just feels pointless and out of place in an otherwise very well structured book. \n The point he makes in the rest of the chapter, that function constrains form rather than form following function, is an excellent one. In fact, if you take anything at all away from this book (and there’s a lot to take away), this should be it. \n Cairo talks about the process and the kinds of questions you need to ask to make an effective information graphic or visualization. As simple as this sounds, he points out how often the wrong questions lead to the wrong priorities and consequently pointless visualizations. \n He also connects perceptual and cognitive research with the practical aspects of building static and animated graphics in a more accessible and useful way than I’ve seen done anywhere else. Perception can be fun to show off (look, invisible gorilla!), but how do you make use of that information? This book builds that bridge quite effectively, and should be required reading for anybody teaching visualization (or even writing a book about it). \n One of his recurring themes is the question how much information to pack into a piece. Just as the writing is geared towards adults, he argues , so should be the graphics. There are a lot of assumptions about what readers will and will not understand. But good newspapers gently challenge their readers in their writing, so why not do the same in the graphics? \n All this is illustrated with many good examples, quite a few of them Cairo’s own work. He writes from his own experience, enriched by a critical eye towards the world of newspaper graphics. Cairo not only has an impressive work history (including The New York Times and El Mundo ), he is also involved in Malofiej as one of the leaders of the Show, Don’t Tell! workshop. He knows what he is talking about. \n Book 2: The Interviews with Journalists \n Roughly a third of the book is taken up not by Cairo’s writing, but interviews he conducted with a number of interesting people from different backgrounds, including such information graphics greats as John Grimwade (one of the most respected and seasoned people in the business), Juan Velasco (graphics director at National Geographic ), journalist Hannah Fairfield (who turned a humble scatterplot into an informative graphic ), Truth and Beauty Operator Moritz Stefaner, Hans Rosling (yes, that Hans Rosling), and a number of others. \n If you think you’re going to skip that part, think again. These interviews are very well structured and focused, and are illustrated with complete information graphics or visualizations as well as process sketches of how they got there. Process is really underappreciated in visualization, and it’s quite enlightening to learn about how these things were developed, what questions they were after, to what absurd lengths National Geographic goes to get things right, etc. \n Quite frankly, I did not expect the interviews to be quite that interesting. But there were lots of interesting insights like the way people talk about data, how much data to show, etc. There are also very different styles, from very InfoVis-like representation of pure numbers to 3D illustrations of Gaudí’s Sagrada Familia cathedral in Barcelona, and several things in between. \n Book 3: The Information Graphics Collection \n While this is not a coffee table book by any stretch of the imagination, it still lends itself to browsing. Cairo has collected a large number of great examples that show how information is communicated effectively. His own sketches and the ones his interview partners share add to the wealth of visual information. The print is very good, making the graphics very easily readable despite their relatively small size. \n Most of his examples are print graphics, and for good reason. There are many fantastic pieces of work that are only slowly starting to be matched by equally good online ones. Malofiej also gave me a new appreciation for the size and density print graphics can have, which are still unmatched by what we can do on screens (where we have either the size or the density, but not both). If you haven’t spent much time lately studying information graphics in print, this book will let you catch up with some well-chosen examples. \n The only missed opportunity, given the book’s topic and Cairo’s background, is that he did not include a discussion of Jaime Serra’s La Ballena Franca , which won the Most Influential Information Graphic of the Last 20 Years award at Malofiej. There is practically no information available about Serra or the piece in English, which feels like a serious gap in knowledge. It’s not Cairo’s fault, of course, but I had hoped to see a discussion of this highly-regarded piece in the book. \n Bonus: The Video Lectures \n The paper version of the book also includes a round silvery plastic disc, which after some research effort on my part turned out to be a so-called Digital Video Diskette (DVD). It stores videos as computer files, rather than in the cloud, so it’s basically like YouTube only you have to be in possession of the necessary hardware to read the bits from the DVD Diskette. \n I may just be the wrong audience, but I did not find that the videos added much to the book. The content is delivered much more effectively in the writing, IMHO, where I can spend as much or as little time on each graphic as I want. \n Conclusion \n Read It. There is really nothing else to say. If you care about how visualization is used to communicate to people, this is the book for you. If you’re a journalist, you need to read it. If you’re an academic doing visualization research, you really, really need to read it. This is the stuff we’ve been missing in visualization for the last 25 years. \n Don’t trust my opinion? Nick Diakopoulos thinks it will be the standard text for visual journalists going forward , and even Stephen Few likes it . \n \n Alberto Cairo, The Functional Art . New Riders Press, 2012. Cairo has a website and blog related to the book , is incredibly active on Twitter , and is going to teach the first massive online course on infographics and visualization ."], "link": "http://feedproxy.google.com/~r/EagerEyes/~3/x08ogWEkWU4/review-alberto-cairo-functional-art", "bloglinks": {}, "links": {"http://www.thefunctionalart.com/": 1, "http://www.nickdiakopoulos.com/": 1, "https://twitter.com/": 1, "http://www.perceptualedge.com/blog": 1, "http://eagereyes.org/": 2, "http://www.amazon.com/": 1, "http://www.thefunctionalart.com": 1, "http://open.journalismcourses.org": 1}, "blogtitle": "eagereyes"}, {"content": ["Less than two weeks to go until VisWeek 2012 , so it’s time for the crucial second part of the survival guide. There are tons of things to see and do in Seattle, it’s easy to get distracted. \n Climate, Weather \n While the last three months have been a solid streak of sunshine, I’m told that it does rain occasionally in Seattle. Like multiple times a year. Yes, it happens. \n The key to basic survival in Seattle is to dress in layers. Temperatures change dramatically from the chilly early morning to the warm mid-day to the cold night. Also, the conference rooms at the Sheraton are kept at the industry standard temperature, which is just below freezing. \n As I’m writing this, the sun is shining, the sky is clear and blue and there is not a cloud in sight (and I’m sitting on a hill!). The forecast for the next week is all sun, sun, and more sun. We’ll see what happens beyond that, but I’m keeping my fingers crossed that we’ll get another ten days of this awesome weather to prove all the people wrong who think that it always rains in Seattle. Because it doesn’t. \n Getting Around \n Seattle has a pretty decent bus system that covers all the main parts of town and is quite reliable. Seattleites will disagree on the this, but compared to many other American cities, Seattle’s public transportation is fantastic. \n The key to riding the bus (or the light rail, for that matter) is loading the wonderful OneBusAway app onto your iPAQ or PalmPilot. It tracks all the buses and tells you when the next one arrives at your stop, lets you see the bus routes on a map, etc. It doesn’t win any prices for beautiful design, but it is incredibly useful. \n Like all American bus systems, King County Metro buses only want exact change if you’re paying cash (though you’re always welcome to donate the rest of your $20 bill if you don’t have anything smaller). Put that twenty on an Orca card instead and it will last you much longer. You just tap the card against the reader as you’re entering the bus, while nodding knowingly at the driver (paying cash marks you as a tourist). The Orca card also lets you pay the light rail ride to the airport, even after you’ve spent all your money on Sleepless in Seattle t-shirts and Space Needle snow globes. \n Things to See \n The Space Needle , obviously. It just had its 50th anniversary, and it’s well worth checking out. Heck, it’s even painted Galaxy Gold (aka orange) to mark the occasion. Just look at it and imagine the flying cars docking at the rotating restaurant. It’s such a fantastic embodiment of the 1960’s view of the future. Get on the monorail and spend 15 minutes in a future that will never be. A future where Barbarella and Flash Gordon fight aliens. A future where orange is called Galaxy Gold . \n But the present is even more interesting, and you need to see some of the things beyond downtown. Yes, Pikes Place Market is nice, but it’s also overrun with tourists and just pushes all the wrong buttons on my tourist trap detector. \n So check out the fun parts of Seattle that are beyond downtown. The Jimmy Hendrix statue on Broadway, for example. Or the ten-foot Lenin statue in Fremont. Or the Fremont Troll. Or the Locks in Ballard. Or the Arboretum. Or the wonderful Elliott Bay Bookstore in the Oddfellows Building on 10th and Pine St. Or the Museum of Flight and Boeing Field if you want to get away from the conference for an entire day. \n Food \n There’s plenty of food around the Westin. One place in particular I want to point out is FareStart , which is a restaurant where former convicts, homeless people, and others are trained to be chefs and waiters. Their food is fantastic, the restaurant is modern and beautiful, and it’s a great cause. \n Other than that, I’d steer clear of the tourist traps in downtown and check out the Real Seattle. Take the bus 10, 43, or 49 up Capitol Hill and check out the area between Pike and Pine streets between Broadway and 12th Street ( Molly Moon’s Ice Cream , Poquitos , etc.), Broadway itself between Olive Way and and Mercer St ( Samurai Noodle is a personal favorite, best noodles in town), and the area on Denny Ave and Olive Way southwest (downhill) from Broadway. The latter is perhaps the only place in the U.S. to out-gay San Francisco, though you’ll find gay bars and an active gay scene all over Capitol Hill. \n Further up on the Hill, 15h Ave between Thomas St and Mercer St is another hot spot with great restaurants and bars. If you don’t make it back to your hotel, 15th St also has great cafes where you can get reanimated before heading back to the conference. \n Since you have to check out Fremont anyway, you might as well get some food there. Buses 26 and 28 take you there from downtown. There are plenty of restaurants right after you cross Fremont Bridge into the heart of the beast. Jai Thai and Homegrown are some of the best places there, but you can’t really go wrong. \n The Asian influence in Seattle is very apparent in the restaurants here. This is perhaps the best place outside of Asia (and San Francisco) to get Thai, Vietnamese, and Japanese food. There are lots of small restaurants with great food that are worth checking out, and much more interesting than the big chains you can find everywhere. \n Coffee \n Yes, Seattle is the home of Starbucks, but no self-respecting coffee snob would be seen dead with a mermaid cup. Check out some of the local mini-chains like Ladro or Victrola, or find one of the few independent places. You won’t have much luck with that in downtown, where a city ordinance requires at least two Starbucks locations per city block, but there are plenty of charming cafes on Capitol Hill and in Fremont (like Milstead and Co , right across from the Tableau Global Headquarters). \n If you’re adventurous, ditch the latte and try a cold-brewed coffee. It’s the latest thing on Capitol Hill, and the next best thing after geeking out with the barista over the relative qualities of different single-origin coffees and whether shade-grown is really better for taste or just a sustainability thing. \n Parties \n This year continues the venerable, if recent, tradition of conference-related parties. \n The Seattle Visualization Group is hosting a party at the Hard Rock Cafe on Tuesday, October 16, from 7pm to 10pm. You don’t even have to attend VisWeek to come, if you’re in town, you’re invited. You do have to register for it, though (it’s free) . This party is sponsored by Tableau, and there will be food, booze, and ignite talks. \n There are also at least two other parties, though I don’t know if those are invite-only, and there’s nowhere to link to. But I’m sure those will be advertised at the conference or by the old word-of-mouth technique our ancestors used before EventBrite. \n Enjoy! \n It will be awesome!"], "link": "http://feedproxy.google.com/~r/EagerEyes/~3/n4v_2EdE9lc/visweek-survival-guide-part-2", "bloglinks": {}, "links": {"http://www.orcacard.com/": 1, "http://seavisatvisweek.eventbrite.com/": 1, "http://www.vivapoquitos.com/": 1, "http://www.mollymoonicecream.com": 1, "http://www.farestart.org": 1, "http://visweek.org/": 1, "http://onebusaway.org": 1, "http://www.milsteadandco.com": 1, "http://en.wikipedia.org/": 1, "http://jaithairestaurant.com": 1, "http://www.eathomegrown.com": 1, "http://www.samurainoodle.com": 1}, "blogtitle": "eagereyes"}, {"content": ["I have decided to quit my job as Associate Professor at UNC Charlotte and join Tableau Software. Monday (September 17) is my first day of work as a full Tableau employee. Why give up the job security of a tenured university professor for the treacherous prospects of a startup? There are many reasons, but here are the main ones. \n \n First, there’s a very simple reason: I like doing stuff, but at the university I spent most of my time telling other people what to do instead of doing things myself. This is called “advising” and “teaching,” and it’s part of the professor job; and I generally enjoy it. But when it takes up almost all my time and leaves me next to none to do things myself, it becomes a problem. \n My other issue is that I’ve struggled to see my work have an actual impact. It’s incredibly difficult to set up meaningful working relationships with industry when you’re in academia. The things people need and the work you want to do never quite align, and the different expectations cause the projects to fall apart sooner or later. My stance on theory and the need for good foundations in visualization has not changed, but I also don’t believe in doing conceptual work that never gets put into practice. And practical applications are another area where visualization research is severely lacking. \n But… But… Tenure?! \n I should probably have the feeling of jumping off a cliff in slow motion right now, but I don’t. Getting tenure is nice, but having tenure isn’t all it’s cracked up to be. In fact, once tenured, you’re expected to do more administrative work, rather than less. Why work your ass off showing your ability to do new and exciting research only to be turned into an administrator as a reward? \n Tenure is a good idea in principle, but the way it works in practice is just backwards in many ways. A lot of young people are scared of not getting tenure if they do risky work, but once they’re tenured they’re too old and settled in their ways (and swamped with teaching and committee work) to take those risks. \n There has been growing criticism of higher education in the U.S. lately, and in particular of the tenure model. I don’t have a solution, but I think a lot of the criticism is valid. People leaving academia for industry is not a new thing, but it seems to become more common. Terran Lane of the University of New Mexico recently switched to Google and wrote a very interesting blog posting about his reasons for leaving . I don’t agree with all of his points, but the kinds of issues he mentions certainly resonate with me. \n Why Tableau? \n Jock Mackinlay is currently building up a research group inside Tableau Software, so the timing for this switch was perfect. In fact, a number of things had to align for this to happen. At the beginning of this year, I had no intention of staying at Tableau (my sabbatical contract has some significant penalties in store in case I don’t come back after the year). \n The work that is done at Tableau, right now and what is planned for the next few years, is very exciting and aligns very well with my interests. I am already part of several very interesting efforts, and hope to help push those and others forward over the next months and years. \n Research is in Tableau’s DNA. That is partly because of its origin as a Ph.D. thesis at Stanford, but either way it informs how many things are done at Tableau. People are not driven by the product or by specific features, but by a mission that is much larger than that. \n And I’m not going to pretend that Seattle had nothing to do with it. As a place to live, it just fits me much better (I just sold my car, which I had left in Charlotte), and the weather isn’t nearly as bad as people like to pretend; in fact, summer has been amazing. \n The Road Ahead \n This site will not turn into a collection of Tableau informercials. I will keep posting, and my topics and frequency will largely stay the same. There will continue to be a cryptic connection between what I am working on and thinking about and what I’m writing here, and it will stay just as cryptic as before (except when there are papers or similar to announce). The site will keep evolving and changing, of course, just like it has so far. \n I am, and always will be, a researcher. But going forward, my focus will be on solving more applied problems, and on testing how well things actually work in practice, with real people."], "link": "http://feedproxy.google.com/~r/EagerEyes/~3/SdhNv5r3p24/goodbye-academia-hello-again-tableau", "bloglinks": {}, "links": {"http://highereducationquestionmark.com": 1, "http://cs.unm.edu/": 1}, "blogtitle": "eagereyes"}, {"content": ["There are many differences between data analysis and presentation. One that is often overlooked is the need to focus a story to just the essential points, and not overload it with unnecessary detail. Minard’s famous map is a great example of reduction to the bare minimum. \n Minard’s famous map of Napoleon’s invasion of Russia summarizes the fate of some 420,000 men over more than six months. They were not alone, either: roughly the same number of Russian soldiers died, and untold numbers of civilians were killed and many atrocities committed. \n Did Minard leave things out? Well, let’s see. Perhaps we can compare his elegant and simple chart to two that Vladimir Volkov  created for Wikipedia (click the images for larger versions). The first one captures the march to Moscow, and roughly the first leg of Minard’s chart. \n  \n The second one describes Napoleon’s retreat, with the time period again mirroring Minard’s chart (the black, second leg this time). \n  \n And now compare to Minard: \n  \n Minard, having lived during the Russian campaign (though he created the map much later), certainly knew quite a bit about it and the wars that followed. However, he chose to focus on one particular issue and on essentially one measure that he apparently felt told the core of the story. That is also helped by the graphical style: compare Volkov’s much more detailed maps that not only show a lot more troop movements and other data, but also much more geographical detail. \n When analyzing data, focus is not typically the first thing. Quite the opposite, when exploring data, you want to go broad, ask many different questions, and try out many different approaches. While it can sometimes be useful to present a lot of data (a historian would have little use for Minard’s simplified view), it is usually much more compelling to figure out the key message and focus on that."], "link": "http://feedproxy.google.com/~r/EagerEyes/~3/ekpbts1IFG8/storytelling-focus", "bloglinks": {}, "links": {"http://eagereyes.org/": 4, "http://en.wikipedia.org/": 3, "http://commons.wikimedia.org/": 2}, "blogtitle": "eagereyes"}, {"content": ["VisWeek 2012 will be held October 14 to 19 in Seattle, WA. The conference keeps growing, and this year is adding a new industry track. If you consider going, you should register by Friday to get the early registration discount. \n The full program has just been posted  (thought it’s still missing a lot of the details), but I do not recommend planning too much beforehand: there will be a lot of interesting sessions, and there is a lot of serendipitous discovery if you check out sessions you might not have thought were interesting. Also, it’s generally a good idea to come for the entire week, not hand-pick a few days. VisWeek also encourages this by making one- and two-day registrations way more expensive in comparison to the full week. \n The new industry track is meant to make the conference more attractive to people outside of academia. There will be tutorials, panels, and other sessions that have been picked specifically for this track. Seattle and the area around it is home to a number of large technology companies, like Microsoft, Amazon, Adobe, and companies like Google and Facebook have offices. There are also numerous tech startups, and of course Tableau Software (which is somewhere in between a startup and a big player). If you’re trying to connect with industry people, or looking for a job, VisWeek will be the place to be. \n In addition to the paper sessions, there will be a number of workshops , panels , tutorials , as well as the compass events for grad students . The indefatigable Liz Marai is focusing the Meet The Leaders event this year on industry and national labs, and yours truly will be one of the leaders you can meet for lunch on Tuesday (more on that later). The keynote talk will be given by psychology researcher  Mary Czerwinski  of Microsoft Research, the capstone by science photographer and visual thinker  Felice Frankel . \n I will post a bit more on local attractions later, but just in case you’re still looking for a hotel: the ones in Downtown Seattle are rather expensive, but there are ones around Seattle Center and Belltown that are much more affordable. If you’re adventurous, you might also try a bed&breakfast on Capital Hill. It’s easy to get around Seattle on foot or using the pretty good bus system, so you don’t have to stay right next to the conference venue."], "link": "http://feedproxy.google.com/~r/EagerEyes/~3/7CQoIRV8r8k/visweek-survival-guide-part-1", "bloglinks": {}, "links": {"http://visweek.org": 1, "http://research.microsoft.com/": 1, "http://visweek.org/": 5, "http://www.felicefrankel.com": 1}, "blogtitle": "eagereyes"}, {"content": ["There is a lot of confusion about storytelling and what tells a story. I have argued previously that stories do not tell themselves . Rather, we tell the stories given raw materials. Some of these materials lend themselves better to ad-hoc storytelling, so we tend to say that they actually tell the story, when it’s really us who do it. \n Exhibit A: Minard \n A particular example of the easy storytelling genre are maps, and a particularly famous example is Charles Minard’s visualization of Napoleon’s Russian campaign in 1812/13. While not immediately obvious if you haven’t seen it before, this is really a map, with the Polish border in the west and Moscow in the east. The width of the ribbon shows the number of men in Napoleon’s army: he starts out with 422,000, loses a lot of them before he even reaches Moscow, where he arrives with 100,000; turns around and makes it back with all of 10,000 men. \n  \n What makes this such a compelling visualization? There is more to it than just the width of the ribbon. The line graph at the bottom shows temperatures, with the highest one being freezing, and most of the way being considerably colder. There is not just space, but time. Of course, time and space are tied together, they are not independent here. But the temporal dimension is what draws us in and makes this into a sort of road movie: we can follow along a journey. \n Exhibit B: Nightingale \n Another famous chart is Nightingale’s depiction of deaths of British soldiers in the Crimean War in 1854-56 (often wrongly referred to as a  coxcomb plot ). The depiction here is more abstract because there is no map, but the amount of information is comparable. There are 24 months of data, with three values each (one for each cause of death). Reading the visualization is a bit more challenging: you start in the nine-o’clock position on the right chart, go around clockwise and then follow the line to the left chart where you again start at nine o’clock and follow the circle segments in a clockwise direction. \n  \n So we have time here, and we have suffering: this is about soldiers being wounded or killed in combat, and dying from horrible infections and disease (the red part shows deaths from wounds, blue shows infectious disease, and black shows all other causes). But the depiction is clearly less compelling than Minard’s, and much harder to turn into a story. \n Storytelling Affordances \n The key difference, I believe, is the map. It makes it easy for us to turn the temporal sequence into a story. It’s the analog of drawing out a path on a map with your finger, a kind of virtual journey. It also helps that the first leg of Napoleon’s march is going left to right on the map, the natural reading direction in the West. Movement is progress, and it pushes the story along. We are used to these kinds of stories, many of the oldest stories in existence ( The Odyssey , for example) are based on journeys (even if not on roads). \n It’s also a kind of lazy storytelling. Of course you can make people see a story when you give them a map. But what if there is no map? What if location doesn’t mean anything? I don’t know if Minard was interested in telling a story, or if he considered not using a map. I do know that Nightingale’s goal was not to tell a story, but to convince an audience that had barely heard of statistics, much less understood what numbers could tell them. But whether those decisions were based on the intent to tell stories or not, the outcomes are vastly different. \n We are so hard-wired for causality and stories that it’s difficult to look at something like a map and not tell a story. We are incredibly creative at filling in the blanks. That can be useful when we are given hints and we revel in the creative act of making up a story (good photography evokes that kind of storytelling), but it can also lead to misinterpretation and wrong conclusions. The key to storytelling with data is not only to be able to convey a story, but to make sure that it’s the intended one."], "link": "http://feedproxy.google.com/~r/EagerEyes/~3/FlbKxk9w6Hw/storytelling-minard-vs-nightingale", "bloglinks": {}, "links": {"http://eagereyes.org/": 2, "http://eagereyes.org/blog": 1}, "blogtitle": "eagereyes"}, {"content": ["Last Monday, I got to attend Edward Tufte’s one-day course . I was looking forward to a day of interesting examples, ideas, and discussions, but was disappointed by the amount of rambling and largely historical examples, with little connection to real, current visualization (or presentation) work. \n \n The Setting \n The course took place in the large ballroom of the Westin Seattle, which was set up for around 500–600 people. Maybe it was naive to assume a more intimate setting, but I had imagined around 100 people there. There was, consequently, no interaction with the audience of any sort, other than people lining up to get their books autographed before the course started or during lunch break. \n As part of the course, you get his four books in a little cardboard box with a handle. With the box, you are handed a sheet of paper with a reading assignment: one or two chapters from each book in the first hour. Unfortunately, he does not actually make use of that reading in his presentation, presumably because he knows that only a fraction of attendees actually read everything they’re supposed to before he gets started. \n The Good \n It’s no secret that Tufte likes paper. His sparkline technique is meant to be a high-resolution, high-density data display that communicates a lot of data in the same space as a number (or maybe a few numbers). His relentless pounding on PowerPoint is also mostly focused on the fact that slides tend to break information up into small chunks, rather than laying it all out so it can be taken in. \n His suggestion is to hand people the information, in printed form, at the beginning of the meeting and give them 10 minutes to read. That way, everybody can get a sense of what is there, and skip the parts that are not relevant. This makes a lot of sense, though it does assume a certain type of presentation. This will not work for presentations where a certain amount of theatrics is actually important, like a product presentation or even some strategy discussions. For a data-heavy presentation, his method is undoubtedly a good one. \n There is also something to be said about the density and size of a sheet of paper. You can fit a lot of information onto a piece of printed page, much more than a typical projection screen or slide (recent high-resolution screens are slowly getting there). However, to make that truly useful, you have to spend a lot more time laying out the information in a meaningful way. Done well, this can be incredibly effective, however. \n Tufte also has amassed a huge wealth of historical examples of data visualization, some going back many hundreds of years. The presentation in his books is also incredibly well structured and designed, and he is a good speaker. Some parts of it, such as the beginning, were perhaps a bit overly dramatic, but it was never dull. \n Where he is also certainly right is his motto of Do whatever it takes! to get the job done. The point here being that you don’t want to pre-specify the tool, but pick it based on requirements. His rant on how academics tend to work the other way around had a lot of truth in it, though it was of questionable relevance to the audience. \n The Bad \n Tufte likes to ramble. A lot. I’m not opposed to a good rant every now and then, quite the opposite. But everything in moderation! It seems that he spent half of the entire course time on wild tangents and rants about things, most of which he really does not know all that much about. \n One particular example was his long half-joking dismissal of big data. This being Seattle, he undoubtedly had people from Microsoft, Amazon, Google, and probably a dozen big-data startups in the audience. I doubt that they came to hear him dismiss big data analysis as mostly self-correlation. I don’t think he’s entirely wrong about that, but he didn’t exactly offer anything useful, either. He claimed that the scientists of the 16th and 17th century had been the original big data people, because they had to turn their observations into theories. \n Some of his other rants included his current sculpture work and how he is now more interested in 3D these days, how people are getting unnecessary medical test because ‘the money is in the false positives,’ proprietary vs. open technology (which hilariously ended with him praising PDF), how administrators are taking over universities, Apple, and of course PowerPoint. \n Tufte’s scholarship of old visualization examples is interesting, but unfortunately he is also stuck in the past. He showed off an original printing of one of Galilei’s books, as well as the first translation of Euclid’s work into English. What was the point of that? Blinding us with impressive artifacts? \n He had some good points about how Galilei presented some of his observations, like the sun spots he saw and that kept moving in a way consistent with a rotating sun. That made for an interesting history lesson, no doubt, but what can we learn from that? \n The Ugly \n The rambling is one thing, but the 15-minute sales pitch was quite another. Books! Posters! Yes, Tufte told us to buy his books, his posters, and even his mother’s book on grammar , the only non-ET book Graphics Press sells. You really don’t expect that when you’re paying $380 for the day. \n He also seemed very worried about people realizing how important he was. He listed the things he had done, including not only his recent presidential appointment, but also the importance of sparklines, etc. For the latter, he kept citing the fact that Google had returned more results for the query “sparkline” than “Steve Jobs” – as of July 2011 . \n One of the videos he showed was of his wavefields idea, which he describes as an extension of sparklines. What it is, though, is a bizarre claim about HD movies and data representation that is either a prank (as one poster on his forum also noted) or just shows a complete failure to grasp human perception. \n Throughout the course, Tufte seemed out of touch, both with his audience and with the real world. At least three times, he said something along the lines of “We as real scientists …” to an audience that was hardly a group of scientists. His recommendation of tools also included LaTeX, which may still be the academic choice for writing papers with lots of math, and which have to follow strict formatting guidelines, but hardly a practical suggestion for most business users. \n Conclusion \n My advice? Buy his books. Read them. They’re good. Just realize that you’re getting a historical perspective on data visualization, not the cutting edge. Understand that Tufte’s ideas are a good starting point, not a religion. There are many things that Tufte doesn’t know, including pretty much anything related to visual perception and cognition, recent work (less than 30 years old), and interaction. \n Once you’re done with Tufte’s books, read Stephen Few’s or Colin Ware’s or something else that’s recent. But by all means, skip the course."], "link": "http://feedproxy.google.com/~r/EagerEyes/~3/_PLr6nzaPpM/edward-tufte-one-day-course", "bloglinks": {}, "links": {"http://www.edwardtufte.com/": 5}, "blogtitle": "eagereyes"}]