[{"blogurl": "http://ubseblz.wordpress.com\n", "blogroll": [], "title": "Economics and Statistics Confuse Me"}, {"content": ["I’ve been listening to the discussions of this report by the IFS on the Today programme this morning and have had time to really read and think about it but what it does illustrate is that, perhaps, the problem with recession is that some people suffer more; if all incomes fell by 5% maybe that’s okay but in this case it seems that middle incomes are worst affected (falling by 7%). If memory serves, middle incomes are those of 35,000 or less. \n http://www.bbc.co.uk/news/education-15242103"], "link": "http://ubseblz.wordpress.com/2011/10/11/the-problems-of-recession/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://www.co.uk/": 1}, "blogtitle": "Economics and Statistics Confuse Me"}, {"content": ["http://www.bbc.co.uk/news/mobile/business-15213447"], "link": "http://ubseblz.wordpress.com/2011/10/09/180/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7}, "blogtitle": "Economics and Statistics Confuse Me"}, {"content": ["Lots of basic concepts in Economics have being swirling round in my mind over the last few months and I’ve be re-thinking what I understand. Though, I haven’t written it here, yet, I’m clearer in how I think of the balance of trade but over the last few weeks I’ve been thinking about the benefits of growth. \n The thought that occurred to me was how the improvement in my material well being had improved my standard of living when I compare it to my life as a boy in the 1970s and how I perceived my parents’ lives at theat time. \n It occured to me that the only benefit that I really would miss, were I returned to the 1970s would be central heating; my bedroom was cold at night (getting out of a warm bed into a cold room was a challenge). Thinking a little more deeply, IT has been of some benefit to me and I suspect will be even more so in the future. Most practically, mobile phones. I recall waiting for my wife at various places in the early 90s and becoming very grumpy when she was late. Now of course, she can send my a text and say “sorry, held up on bus” and I can safely sit in the pub for a while. Mr Storey pointed out to me that the quality of goods has improved; cars being the main example, which are now safer and more efficient. and, of course, buses that go pssshhhhh. \n The trouble is lots of things which appear to be better, well, may not be much better. TV is a good example, there were three channels in the 70s and my (maybe rose tinted view) is that there was a better chance of finding something decent to watch that now, when we have hundreds of channels churning out pretty dismal progamming (exception being sports broadcasting which is certainly better). Healthcare’s better, yes, sure, but the doctors my cure our diseases more often but, on average we’re fatter than in the 70s (much fatter). Is education better? My instinct is that it is not. \n Before anyone accuses my of being to nostalgic for childhood, I promise I am not, in fact, I have just as much fun now as I did then. My point is that the improvements in my material well being haven’t made that much difference to my quality of life especially when we consider just how much richer we are now than in the 1970s (three times richer). \n I leads me to think about recession; so what, if there were a recession?  If incomes all fell by 10%, we could afford less stuff, it’s true but would that be so bad. The simplistic answer is no but, a recession is likely to hit some people much worse than others. While people in a job might see their real incomes drop and suffer without too much pain, others will lose their jobs and this, I think is very serious for them. \n I’ve just been listening to another excellent podcast by Russ Roberts who casts doubt on the perception in the states that those on the median income have seen no rise in living standards since the 1980s. \n http://www.econtalk.org/archives/2011/10/bruce_meyer_on.html"], "link": "http://ubseblz.wordpress.com/2011/10/09/growth-and-equality/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://www.econtalk.org/": 1}, "blogtitle": "Economics and Statistics Confuse Me"}, {"content": ["Some links that might help http://timetric.com/   \n http://www.bbc.co.uk/news/uk-15141327  the story on food poverty. \n Stories about inflation recently: \n http://www.bbc.co.uk/news/uk-england-15157723 \n http://www.bbc.co.uk/news/business-11331052 \n http://www.bbc.co.uk/news/business-11331052"], "link": "http://ubseblz.wordpress.com/2011/10/05/inflation-essay/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://timetric.com/": 1, "http://www.co.uk/": 4}, "blogtitle": "Economics and Statistics Confuse Me"}, {"content": ["A brief note to help you find some materials. \n Lesson notes from Friday 23rd are here  and the More or Less podcast on GDP is here ."], "link": "http://ubseblz.wordpress.com/2011/09/19/remove-reflections/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://ubseblz.wordpress.com/": 1, "http://downloads.co.uk/": 1}, "blogtitle": "Economics and Statistics Confuse Me"}, {"content": ["I commend to your attention: \n http://news.bbc.co.uk/sport1/hi/rugby_union/welsh/14811173.stm \n and \n http://www.bbc.co.uk/blogs/bendirs/2011/09/dysfunctional_england_in_need.html \n One team suffers a marginal defeat by the world champions the other scrapes a marginal victory over a second rate team."], "link": "http://ubseblz.wordpress.com/2011/09/11/weekend-disappointments/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://news.co.uk/": 1, "http://www.co.uk/blog": 1}, "blogtitle": "Economics and Statistics Confuse Me"}, {"content": ["There are a couple of points to  make with regards to my previous, rather silly example of trade between Wales and England. The good thing is that it reflects the position of countries which trade within the Eurozone, Greece and Germany for example. It is a pretty good illustration, too, of trade between the USA and China (the latter having fixed its currency against the dollar). In this post I want to explore the effect of trading between two countries with independent currencies. \n Before I do so I have to confess to a deficiency in my earlier models (a deliberate simplification honestly). It emerged that a country with a trade surplus is either lending money to the country with the deficit or buying its assets (land or company shares). There will be an additional flow of money from those lendings or assets. Surely, if England has a surplus and is lending money to Wales is charging interest.  Also, if they own land in wales they will be able to collect rent from it or likwise dividends from the company shares they own. The Welsh deficit will be even worse. \n Considering Different Currencies \n Consider now trade between the UK and the US and the trade again in two goods; cowboy boots and bowler hats, ignore everything else. We have to introduce here another market; foreign exchange. For what ever reasons, some people, whether British or American, hold or want either dollars or pounds and they trade them (let’s imagine a boat in the middle of the Atlantic where people trade the currencies). Again, for simplicity’s sake, suppose that the prevailing exchange rate is £1 buys $2. \n Initially trade is balanced with the US exporting $20million dollars worth of cowboy boots. The British importers go to the forex market; spend £10m to buy $20m and then use this cash to buy the boots. American pay for their bowler hats in dollars, being charged $20m and the British importers exchange these for £10m to take home. Everything is balanced; £10m is taken to the forex market by British cowboy boot importers and £10m is taken away by the British bowler hat exporters. The value of the goods imported and exported by both countries is equal. \n Let’s now suppose that demand for cowboy boots in the UK increases and people want to buy £15m or $30m worth but there is no corresponding increase in the demand (among Americans) for bowler hats. And let’s suppose too that the British can fund this spending (more on this soon).  So, now, £15m will enter the forex ‘boat’ (in exchange for $30m) but Americans only need £10m ($20m) to buy the bowler hats. £5m will be unsold – supply of sterling exceeds demand. At the same time the Americans will only be bringing $20m to the forex market when $30m is actually demanded by the British – demand for dollars is excessive. Surely, traders who are holding sterling will have to cut the price at which they are selling to the Americans in an attempt to increase the amount of sterling they are willing to buy. This amounts to the same thing as the traders holding dollars to demand a higher price for their currency. The deficit, surely, means that the exchange rate must fall for the pound (£1 buys fewer dollars) or equivalently that the value of the dollar rises ($1 buys more pounds). \n More soon"], "link": "http://ubseblz.wordpress.com/2011/09/08/trade-resumed-3/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7}, "blogtitle": "Economics and Statistics Confuse Me"}, {"content": ["I mentioned a website called Timetric , this has easy to access time series ecnomic data. Much easier to navigate that the Office for National Statistics . Another excellent source is the CIA Worldfactbook . \n I’ve marked your work on Keynes and Hayek and it’s pretty good though a few of you are keen on using ‘fancy long words’. Remember, I’m not very bright and long words bother me. I haven’t seen the work of Wai Yim yet; probably because of the disruption of the photographs. These marks are available on line. I’ll print you an access code or you can email me and I can grant you access. \n For what it’s worth….. \n Keynes addressed the problem of persistent, mass unemployment which classical economics had failed to account for adequately. He said that labour markets would see high unemployment during recessions when wages failed to adjust to the prevailing conditions. This he says is made worse by households and business being especially cautious and not spending enough to create economic growth. During such times he said that government needed to intervene and spend more money through borrowing.  Such spending could be on schools or hospitals or even by paying a man to dig a hole in the ground only the refill it later. \n Hayek considered that economic problems were caused by governments, particularly by making money cheaply and easily available. This would result in a boom during which time people would make bad investment decisions; for example, buying a house which was too expensive for them with a large loan. When the economy corrected itself and money became expensive the value of those investments would collapse leading to falling confidence and higher unemployment. If governments avoid intervening, markets create ‘true’ values for assets and a boom and bust will not occur. Intervention is like giving an alcoholic another drink to help him recover."], "link": "http://ubseblz.wordpress.com/2011/09/05/dc-remove-reflections-2/", "bloglinks": {}, "links": {"http://www.gov.uk/": 1, "http://feeds.wordpress.com/": 7, "https://www.cia.gov/": 1, "http://timetric.com/": 1}, "blogtitle": "Economics and Statistics Confuse Me"}, {"content": ["I enjoyed my first macroeconomics lesson with the you today gents, I really enjoyed the willingness of the you to contribute and I’m sorry I made such a rubbish effort to learn your names but I thought figuring out what had happened in Latvia over the last thirty years was pretty interesting. You can find the slideshow here and the video I mentioned here . Remember, your mission by Monday is to write 100 words (exactly) on the ideas of Keynes (for whom Winston Churchill had a great line) and 100 words (exactly) on Hayek. \n I’m not too sure about the best guides to Keynes but Robert Skidelsky (not sure about the spelin) is Keynes’ biographer. As for Hayek, try cafe Hayek or Russ Roberts’ Econtalk pages. \n I like being asked questions that I can’t answer straight away (or even at all) and Oliver (I think) asked; is the availability of cheaper labour a possible reason for Latvia’s growth? I think the answer is no but I have to fumble my way to either an explanation or contradiction of my view. \n Let’s just transfer the idea to the UK. Suppose all workers took a 10% pay cut and carried on working at the same rate (they weren’t pissed off cross and continued to work just as hard). Okay, so business costs would fall (by 10%?) but people’s incomes are lower so they would buy less stuff (probably not 10% less, maybe 7% less – that’s an idea called the marginal propensity to consume, you might like to look it up – it’s an A2 idea). So, even though more is being produced who is buying this stuff? \n Well, maybe foreigners. Exports might rise, enough to compensate for the lower UK sales? Maybe. Maybe more. But doesn’t that depend on the foreigners, suppose they’ve all taken a pay cut or still aren’t convinced British stuff is any good. \n Okay, I have some sympathy with Oliver’s idea that producing goods more cheaply means that exports should increase but if this comes at the expense of people’s incomes falling what’s been gained? On the other hand, if people in the UK (or Latvia) get better at producing stuff (increased productivity) then incomes and output should increase? \n Two things. Get the podcast for planet money. Get the podcast for “more or less”. \n See you Monday."], "link": "http://ubseblz.wordpress.com/2011/09/02/dc-remove-reflections/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "https://skydrive.live.com/": 1, "http://www.youtube.com/": 1}, "blogtitle": "Economics and Statistics Confuse Me"}, {"content": ["So, let’s make the situation marginally less simple by considering the real Wales and England both of which have many breweries and chip makers. Suppose that trade exists and is initially in equilibrium. \n However, militant unions in Wales call frequent and long lasting strikes in the chip shops and chip supplies to England (and domestically) are disrupted. The English chip shops increase production to make up for the disruption to supplies and take advantage of the higher price (fall in supply, increase in price). Chip exports to England are collapsing and sales in Wales have fallen. Welsh GDP has also fallen; less production and lower incomes. However, the Welsh continue to eat chips and drink beer (much imported from England). They can do this if individual Welsh consumers start using their savings or selling their assets to (ultimately) the English. \n I just want to pause a moment to think about this step. Think about two Welsh consumers; Dai and Llew. Dai lost his job at the chip shop after organising many strikes but Llew still has a job at the chip shop. Dai’s savings are almost finished but Llew still has plenty of savings. Being Dai’s friend, Llew lends money to Dai, allowing him to continue drinking beer and eating chips. If Llew and Dai are to continue consuming at their current rate, Llew’s savings will dry up. Eventually the Welsh will have to borrow from the English. The same ideas works with Dai borrowing from the Taffy Banking Corporation. \n \n Wales has a trade deficit with England; they are buying more from England than they are selling. England has a surplus and money and ownership of Welsh assets is flowing from Wales to England. These assets might be property or shares in Welsh firms. Moreover, the Welsh will be issuing IOUs, borrowing from the cash rich English. Another, problem is that, due to the recession the Welsh Government is struggling to fund itself; tax revenues are down and it has to pay unemployment benefits (formally doing what Llew did for Dai). What is worth is that it is finding it difficult to issue bonds in Wales; as we have seen the Welsh are running down their savings already and have little inclination to save with (lend to) the Welsh Government. In fact, Welsh Government bonds are some of the assets Welsh people are selling to the English to fund their consumption \n How does this look from England? Mostly pretty good; they are building up Welsh assets. Instead of exchanging beer and chips with them, they are exchanging beer and chips for property, company, shares, IOUs from Welsh people and the Welsh Government. Also, cash, Welsh citizens’ deposits in Welsh banks are being transferred to English deposits in English banks. Though it pains me to say it, they are funding Welsh idleness and lack of productivity."], "link": "http://ubseblz.wordpress.com/2011/08/28/trade-resumed-2/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7}, "blogtitle": "Economics and Statistics Confuse Me"}]