[{"blogurl": "http://www.edgebio.com/blog\n", "blogroll": [], "title": "EdgeBio blogs"}, {"content": ["It’s been quite some time since my last blog post. We’ve been rather busy over the summer, so let me fill you in on what has happened. At Edge, we have been diligently working on our CLIA certification and offering , with our latest test offering a CLIA exome on our Illumina HiSeq2000 platform using either the Agilent SureSelect capture or Roche Nimblegen capture. Over the coming weeks the staff at Edge will be releasing a series of blog posts relating to targeted resequencing methodologies. They will relate specifically to Project Design, Research & Clinical applications, “Tools of the Trade”, Data Delivery and then a summary “Cheat Sheet”. They will be information heavy, with lots of tables and data to digest, so try not to read them right after a large meal. \n We have also recently acquired a MiSeq instrument so you can bet that as we put it through its paces you will see some blogs about data quality and utility surrounding that instrument.  In additioln to new MiSeq data, we will also be releaseing a comprehensive analysis of the new casncer and mendelian panels from Ion Torrent. \n So, what’s with the title of the blog? Well, while we are all waiting for the $1,000 genome (sans interpretation) to become widely available, the $1,000 exome seems to have found a spot in the marketplace. EdgeBio has now joined others in making available whole exome sequencing for as little as $1,000 per sample . We see quite a bit of utility in exome sequencing for the foreseeable future and this price point should make it quite attractive to use exome sequencing when interrogating tens, hundreds or even thousands of samples. If you are still convinced that you just can’t do without whole genome sequencing (WGS) we’ve been working on that as well. Now, here at Edge, you can have WGS done for as little as $6,500 per sample. Not quite as low as $1,000 but progress is being made. \n Speaking of progress toward a $1,000 genome, the Archon Genomics X Prize presented by Express Scripts (NASCAR is very proud of the name) is now officially a contest! In case you missed it, the first contestant to officially sign on to compete was Life technologies, which will compete using their ion torrent technology. Last month George Church announced that he will also lead a competing group , which will leverage multiple technologies for the competition. So, with two contestants, we now have the stage set for some head-to-head competition.  \n Stay tuned everyone as the EdgeBio blog is about to get revved back up for the fall. \n   \n Dean \n \n  \n \n  Tags: \n  \n   MiSeq \n   PGM \n   clia \n   Exome \n   wgs \n   wes \n   agxp \n  \n \n  Posted in: \n  \n   General Information"], "link": "http://www.edgebio.com/while-you-were-waitingthe-1000-exome", "bloglinks": {}, "links": {"http://www.edgebio.com/": 9, "http://www.edgebio.com/blog": 1, "http://www.bio-itworld.com/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["One of the most important factors in determining the ultimate success of a next generation sequencing project is the initial project design.  There are many things to consider when designing a project based on project goals, sample type, budget, timeframe etc.  At EdgeBio we spend a great deal of time up front with our clients discussing and planning the best approach to meet their specific needs.  For many clients this will be their first foray into the world of next generation sequencing and as the range of options continues to expand at a rapid pace it can be a daunting task in figuring out where to start.  Decisions will need to be made regarding application type, sequencing platform, library/capture method, read length, coverage, and data analysis needs.  In our effort to make this process as smooth as possible we provide clients with technical project managers and access to our expert lab and bioinformatics teams. \n In addition to providing our technical expertise via phone or site visits, we look for other methods of sharing information in easy to access and easy to understand ways.  With the launch of our new website earlier this year, http://www.edgebio.com/welcome-our-new-website , we gained the ability to easily integrate social media outlets, blogs and other tools that can be used to disseminate a variety of information. \n For example, we have recently launched a pair of tools on our site related to our Ion Torrent Sequencing service to help in the project design process.  The first is our interactive Ion Torrent Decision Tree .  This allows users to easily visualize the options we offer on the Ion Torrent platform.  By starting with your particular application of interest users can navigate their way through the tree in order to design a project based on their needs.  Users can determine which chip, read length, fragmentation method, library method, capture kit, level of multiplexing and data analysis will be appropriate for their project. \n In several spots on the decision tree you will see a link to our second Ion design tool, the Sequencing Project Price Calculator .  This allows you to enter information such as application type, sample material, sample number and genome/target size in order to determine chip type and number needed to reach a desired coverage level.  Once all of the information is entered it will also provide an estimated project price and allow you to, with the click of a button, submit the information for a formal quote. \n   \n   \n \n  \n \n  Tags: \n  \n   Ion Torrent \n   price calculator \n   sequencing design \n  \n \n  Posted in: \n  \n   Project Design & Management"], "link": "http://www.edgebio.com/ion-decision-tree-price-calculator-project-design", "bloglinks": {}, "links": {"http://www.edgebio.com/": 6, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["Here at Edge we have designed our next generation sequencing lab from the ground up, with the goal of providing top quality, scalable services in a highly controlled environment.  We utilize the latest technologies in order to maintain our position at the cutting edge of next generation sequencing.  This virtual tour will take you through our various laboratories to give you a look inside our operation.  In each room there are clickable icons that provide details about the various instruments and products that we use.  Please take a minute to look around and see what we have built. \n  \n \n  \n \n  Tags: \n  \n   CLIA lab \n   Lab \n   ngs \n  \n \n  Posted in: \n  \n   General Information \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/tour-edgebio-labs-0", "bloglinks": {}, "links": {"http://www.edgebio.com/": 4, "http://www.edgebio.com/blog": 2}, "blogtitle": "EdgeBio blogs"}, {"content": ["This is a guest post contributed by Dr. Brad Chapman from the Harvard School of Public Health. Original post can be found here . \n \n \n\tBackground \n \n \n The Archon Genomics X Prize, presented by Express Scripts , is a 10 million dollar competition to establish highly accurate clinical grade sequencing and variation detection methods. Our group at Harvard School of Public Health works with the EdgeBio team on developing the infrastructure for the competition: identify variations in the grading genomes and provide software to compare these reference variation sets against a competitor's list of variations. \n The exciting aspect of the Genomics X Prize is that it enables open comparisons between sequencing technologies and variant calling methodologies. Sequencing genomes to the high degree of accuracy sufficient for clinical usage is a difficult, open, problem. Here I'll present detailed numbers comparing variants called by different sequencing technologies and variant callers. \n The public phase of the Genomics X Prize starts today, August 15th. The goal of this six month period is to have an open dialog with everyone working in the sequencing and variant calling communities. We want to refine our methods to provide the most accurate and fair variant calling for the reference genomes. To start the discussion we've prepared: \n \n\t\t\t\tVariant calls for a HapMap individual: NA19239, a Yoruba male from Ibadan, Nigeria . We sequenced haploid fosmids from NA19239 with two technologies: Illumina and SOLiD ; and called variants with three different methods: GATK Unified Genotyper , FreeBayes , and SAMtools mpileup . We combined these calls into a unified final call set, NA19239 version 0.1, that I discuss in detail below. \n \n\t\t\t\tFully documented methods, access to all data files used, and a public scoring site. The X Prize Validation wiki contains detailed information about sequencing, variant calling, validation and scoring. The validationprotocol.org website provides a simple way for anyone to compare their variant calls against the public reference genomes. It encourages submission and analysis in public tools like Galaxy through transparent interoperability with GenomeSpace . \n \n\t\t\t\t An automated variant analysis infrastructure built on top of the Broad's Genome Analysis Toolkit (GATK) that performs comparisons as well as variant unification. This is a generally useful toolkit of functionality to manipulate variants, and we presented an overview at the Bioinformatics Open Source Conference last month. This is an open-source community developed project, and has received great contributions from the Genome in a Bottle Consortium at the National Institute of Standards and Technology . \n The goal of this writeup, and the X Prize public phase, is to iterate over calling and unification methods to improve our algorithms and approaches. Rather than promoting or disparaging any particular technology or calling method, we're instead providing full transparency and a good-faith effort to combining approaches. Our hope is that this will help engage the community, encourage feedback, and result in a unbiased and accurate set of reference genomes for the competition. \n \n \n \n \n\t\tUnification of variant calls \n \n For the August 15th public phase kickoff, we prepared a reference data set of NA19239 based on pooled sequencing of haploid fosmid clones . The callable regions of these clones totaled 129,513,026 total bases, covering ~4% of the 3.1 billion bases in the human genome. We use fosmid clones to obtain complete regional haplotype coverage and focus on partial genome coverage to achieve high coverage depth and accuracy for assessed regions. \n Version 0.1 of the NA19239 reference set uses variant calls from two technologies: Illumina and SOLiD; and three callers: GATK's Unified Genotyper, FreeBayes and SAMtools. To move from these data to a unified call set we: \n \n\t\t\t\tAlign to GRCh37 reference genome with Novoalign . \n \n\t\t\t\tPerform post-processing and indel realignment with GATK's IndelRealigner . \n \n\t\t\t\tPerform variant calling with GATK's UnifiedGenotyper, FreeBayes and samtools mpileup. \n \n\t\t\t\tDo pairwise comparisons between all technology/caller approaches. \n \n\t\t\t\tGenerate the union of all possible calls and merge with initial GATK calls, recalling any no-call positions at expected sites. \n \n\t\t\t\tUse validation information on variants found in multiple technologies, plus metrics associated with common variants, to filter the full call set to a final set of trusted calls. \n The challenging decisions begin when merging and filtering the final call set. This requires careful bookkeeping and variant representation to ensure identical variants are directly comparable, followed by setting cutoffs for variant inclusion. \n \n \n \n\t\t\tComparison details \n \n The details of variant comparisons introduce an additional layer of complexity during assessment. The approach we've taken is create a normalized set of variants so all comparison differences are due to actual call differences rather than variant representation. We split multiple nucleotide polymorphisms into individual calls, split complex indel-variant combinations, and left-align remaining variants. \n For haploid/diploid comparisons, we establish haplotype blocks for the diploid sequence based on phasing provided in the input variant file, and then compare the best matching haplotype to our fosmid reference. Single nucleotide polymorphisms and indels less than 30bp require exact machines between two comparison genomes. Larger indels and structural variations receive more flexible matching with confidence intervals around start and end coordinates. \n The goal of the normalized, compared variants is to reflect real underlying differences in calling approaches relative to how well we can currently resolve variation endpoints. \n \n \n \n \n\t\t\tComparisons between variation callers \n \n For a concrete example of two different variant calling approaches, below is a table comparing GATK variants against samtools calls for the NA19239 sample, using identically aligned and post-processed BAMs: \n   \n\t\t\t\t\t\t\tconcordant: total \n \n\t\t\t\t\t\t\t160851 \n \n\t\t\t\t\t\t\tconcordant: SNPs \n \n\t\t\t\t\t\t\t136146 \n \n\t\t\t\t\t\t\tconcordant: indels \n \n\t\t\t\t\t\t\t24705 \n \n\t\t\t\t\t\t\tGATK discordant: total \n \n\t\t\t\t\t\t\t13925 \n \n\t\t\t\t\t\t\tGATK discordant: SNPs \n \n\t\t\t\t\t\t\t1315 \n \n\t\t\t\t\t\t\tGATK discordant: indels \n \n\t\t\t\t\t\t\t12610 \n \n\t\t\t\t\t\t\tsamtools discordant: total \n \n\t\t\t\t\t\t\t25368 \n \n\t\t\t\t\t\t\tsamtools discordant: SNPs \n \n\t\t\t\t\t\t\t17247 \n \n\t\t\t\t\t\t\tsamtools discordant: indels \n \n\t\t\t\t\t\t\t8121 \n   \n The number of discordant variant calls is high, making up 8% of the GATK calls and 14% of the samtools calls, and samtools calls almost 16,000 additional SNPs compared to GATK. As a result, a large percentage of variants require making hard decisions: are those additional calls interesting, real variants in samtools and false negatives in the GATK calls? Or conversely, are they false positives in samtools that GATK correctly excludes? \n \n \n \n \n\t\t\tComparisons between sequencing technologies \n \n There is a similar level of discrepancy when comparing variant calls between Illumina and SOLiD sequencing. Below is a comparison between GATK Unified genotyper calls on the two technologies: \n   \n\t\t\t\t\t\t\tconcordant: total \n \n\t\t\t\t\t\t\t135263 \n \n\t\t\t\t\t\t\tconcordant: SNPs \n \n\t\t\t\t\t\t\t122267 \n \n\t\t\t\t\t\t\tconcordant: indels \n \n\t\t\t\t\t\t\t12996 \n \n\t\t\t\t\t\t\tIllumina discordant: total \n \n\t\t\t\t\t\t\t39491 \n \n\t\t\t\t\t\t\tIllumina discordant: unique \n \n\t\t\t\t\t\t\t7079 \n \n\t\t\t\t\t\t\tIllumina discordant: SNPs \n \n\t\t\t\t\t\t\t15188 \n \n\t\t\t\t\t\t\tIllumina discordant: indels \n \n\t\t\t\t\t\t\t24303 \n \n\t\t\t\t\t\t\tSOLiD discordant: total \n \n\t\t\t\t\t\t\t16022 \n \n\t\t\t\t\t\t\tSOLiD discordant: unique \n \n\t\t\t\t\t\t\t3800 \n \n\t\t\t\t\t\t\tSOLiD discordant: SNPs \n \n\t\t\t\t\t\t\t3908 \n \n\t\t\t\t\t\t\tSOLiD discordant: indels \n \n\t\t\t\t\t\t\t12114 \n   \n Unique coverage explains some differences: 4% of the Illumina variants (7079) and 2.5% (3800) of the SOLiD variants were uniquely covered by the technologies. However, the remaining variant discordant calls are on the order of those seen in the technology comparisons. Adding to the complexity, we find only 84% of the total concordant variants compared to the Illumina only GATK/samtools comparison. \n \n \n \n \n\t\t\tUnified call set \n \n The level of discrepancy between calling methods and sequencing approaches introduces complexity in the preparation of the final call set: How much evidence does a variant need for inclusion? Can single calls be true positives if supported by high confidence values? This will require extensive refinement throughout the public phase. For the initial version 0.1 release of NA19239, we took the following high level approach to filtering: \n \n\t\t\t\t\tRetain variants found in 4 out of 6 calling/technology methods (including genotyping data). \n \n\t\t\t\t\tRetain variants identified across multiple technologies. \n \n\t\t\t\t\tRetain variants found in both more stringent (GATK) and more lenient (FreeBayes, samtools) callers. \n \n\t\t\t\t\tAssess remaining variants using a Support Vector Machine with quality score, read depth and variant distance from read ends metrics, training the classifier on likely true and false positives from the pairwise overlap comparisons. \n The result is a unified call set of 171,009 variants derived from all technologies and callers, that we're releasing as NA19239 version 0.1. \n \n \n \n \n \n\t\tComparisons with whole genome datasets \n \n To assess the quality of the unified call set, we compared to two public genomes: \n \n\t\t\t\t Complete Genomics's NA19239 variants from their public whole genome datasets , \n \n\t\t\t\tAn Illumina whole genome dataset for NA19239 at 30x coverage. \n This provides us with three independent call sets to assess variability between approaches. To provide a baseline, here is the comparison of the Illumina and Complete Genomics calls in our assessment region \n \n   \n\t\t\t\t\t\tOverall genotype concordance \n \n\t\t\t\t\t\t98.47 \n \n\t\t\t\t\t\tconcordant: total \n \n\t\t\t\t\t\t205868 \n \n\t\t\t\t\t\tconcordant: SNPs \n \n\t\t\t\t\t\t186365 \n \n\t\t\t\t\t\tconcordant: indels \n \n\t\t\t\t\t\t19503 \n \n\t\t\t\t\t\tIllumina discordant: total \n \n\t\t\t\t\t\t31267 \n \n\t\t\t\t\t\tIllumina discordant: SNPs \n \n\t\t\t\t\t\t19334 \n \n\t\t\t\t\t\tIllumina discordant: indels \n \n\t\t\t\t\t\t11933 \n \n\t\t\t\t\t\tComplete Genomics discordant: total \n \n\t\t\t\t\t\t15174 \n \n\t\t\t\t\t\tComplete Genomics discordant: SNPs \n \n\t\t\t\t\t\t9586 \n \n\t\t\t\t\t\tComplete Genomics discordant: indels \n \n\t\t\t\t\t\t5510 \n   \n We see familiar discordance rates: 13% of the Illumina calls and 7% of the Complete Genomics calls differ. Since it's diploid versus diploid, this comparison includes all heterozygous variant matches. As a result the numbers in this comparison will be higher, but it is a good order of magnitude approximation for looking at our fosmid reference set versus each individual technology. \n \n \n \n\t\t\tIllumina \n \n The comparison against the Illumina whole genome variant calls contains 12% discordant calls in our fosmid reference set, with 79% of those being indel differences. Indels are notoriously more difficult to identify and assess, so this will be an area of increased focus as we move forward: \n \n   \n\t\t\t\t\t\t\tconcordant: total \n \n\t\t\t\t\t\t\t150420 \n \n\t\t\t\t\t\t\tconcordant: SNPs \n \n\t\t\t\t\t\t\t132604 \n \n\t\t\t\t\t\t\tconcordant: indels \n \n\t\t\t\t\t\t\t17816 \n \n\t\t\t\t\t\t\tfosmid discordant: total \n \n\t\t\t\t\t\t\t19624 \n \n\t\t\t\t\t\t\tfosmid discordant: SNPs \n \n\t\t\t\t\t\t\t4165 \n \n\t\t\t\t\t\t\tfosmid discordant: indels \n \n\t\t\t\t\t\t\t15459 \n \n\t\t\t\t\t\t\tIllumina discordant: total \n \n\t\t\t\t\t\t\t5475 \n \n\t\t\t\t\t\t\tIllumina discordant: SNPs \n \n\t\t\t\t\t\t\t2952 \n \n\t\t\t\t\t\t\tIllumina discordant: indels \n \n\t\t\t\t\t\t\t2523 \n \n \n \n \n\t\t\t  \n \n\t\t\tComplete Genomics \n \n The Complete Genomics comparison has 17% discordant calls including 2x more discordant SNP calls. This highlights another key area of call set refinement: identifying and correcting for technology specific calls. \n \n   \n\t\t\t\t\t\t\tconcordant: total \n \n\t\t\t\t\t\t\t139559 \n \n\t\t\t\t\t\t\tconcordant: SNPs \n \n\t\t\t\t\t\t\t126296 \n \n\t\t\t\t\t\t\tconcordant: indels \n \n\t\t\t\t\t\t\t13263 \n \n\t\t\t\t\t\t\tfosmid discordant: total \n \n\t\t\t\t\t\t\t29883 \n \n\t\t\t\t\t\t\tfosmid discordant: SNPs \n \n\t\t\t\t\t\t\t10162 \n \n\t\t\t\t\t\t\tfosmid discordant: indels \n \n\t\t\t\t\t\t\t19721 \n \n\t\t\t\t\t\t\tComplete Genomics discordant: total \n \n\t\t\t\t\t\t\t7571 \n \n\t\t\t\t\t\t\tComplete Genomics discordant: SNPs \n \n\t\t\t\t\t\t\t5542 \n \n\t\t\t\t\t\t\tComplete Genomics discordant: indels \n \n\t\t\t\t\t\t\t1965 \n \n \n \n \n \n\t\t  \n \n\t\tSummary \n \n The initial NA19239 public genome for the Genomics X Prize provides unified variant calls based on two sequencing technologies and three calling methods. I've delved into a lot of details on our approaches, challenges and goals with the hopes of encouraging suggestions from other researchers working on these problems. We're especially interested in feedback on these areas of ongoing research: \n \n\t\t\t\tDigging deeper into potential false positives and negatives: By combining comparison information between the unified callset and external resources, we can identify 17654 fosmid variants (10%) not found in both the Complete Genomics and Illumina datasets. These require additional in-depth analysis to classify as uniquely identified fosmid calls or potential false positives. Similarly, Illumina and Complete Genomics combine to call 1228 variants (0.7%) that are not in the fosmid call set. These need examination to classify as fosmid false negatives, or false positive calls in the individual technologies. \n \n\t\t\t\tAdditional public genomes: We're actively working with teams like the Genome in a Bottle Consortium and Genome Research Consortium to compare with their reference sets and approaches. Our next target public genome is NA12878, used in both of these projects and widely studied. \n \n\t\t\t\tImprove variant representation and assessment: The variation software framework works hard to make variant representations as uniform as possible. Indels are especially challenging and we welcome practical examples of regions that need additional standardization. \n \n\t\t\t\tRefine approaches to unifying variant calls: What we learn from the additional inspection of discordant variants can help inform improved approaches to filtering. This is a great opportunity to develop generalized, reusable methods for combining variants from multiple approaches. \n The call sets used here are available as public data folders on GenomeSpace : \n \n\t\t\t\tPublic/chapmanb/xprize/NA19239-v0_1 – The combined final call set along with training true/false positives and Illumina/Complete Genomics comparison based potential false positives and negatives. \n \n\t\t\t\tPublic/EdgeBio/PublicData/Release1 – All of the raw input data, including fastq files, BAM alignments and individual variant calls. \n Combined with the open source code and configurations, we hope this will provided interested researchers with all the raw materials needed to reproduce and extend these analyses. Your feedback and suggestions are very welcome. \n \n \n   \n \n  \n \n  Tags: \n  \n   agxp \n   illumina \n   complete genomics \n   solid \n   Ion Torrent \n  \n \n  Posted in: \n  \n   Bioinformatics"], "link": "http://www.edgebio.com/genomics-x-prize-public-phase-reference-genome-preparation-and-comparisons-illumina-and-complete", "bloglinks": {}, "links": {"http://usegalaxy.org": 1, "https://en.wikipedia.org/": 4, "https://validationprotocol.org/": 1, "http://www.novocraft.com/": 1, "http://www.edgebio.com": 2, "http://www.genomespace.org/": 2, "http://chapmanb.github.com/": 1, "http://www.edgebio.com/": 6, "http://ccr.coriell.org/": 1, "http://bcbio.wordpress.com/": 1, "http://www.genomeinabottle.org": 1, "http://compbio.harvard.edu/": 1, "http://www.nist.gov/": 1, "https://github.com/": 4, "http://www.nih.gov/": 3, "https://edgebio.atlassian.net/": 1, "http://open-bio.org/": 1, "http://www.completegenomics.com/": 1, "http://www.edgebio.com/blog": 1, "http://www.broadinstitute.org/": 3, "http://genomics.xprize.org/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["Recently, we participated in a case study with Genologics.  The focus was on us, EdgeBio, a growing sequencing and bioinformatics services business. Given we work in an expanding lab environment that includes three different sequencing platforms and associated, highly configurable workflows - we needed something to solidify project management and organize sample data and metadata.  Implementing the LIMS has enabled us to eliminate sources of manual, human error and improve overall lab efficiency, goals that have supported the company as it has applied for and successfully attained CLIA accreditation.  We hope in sharing this case study with our constituents and offering them a chance to peer inside our operation, it gives them piece of mind that their samples are in safe hands with EdgeBio. \n   \n  \n \n  \n \n  Tags: \n  \n   clia \n   lims \n   whitepaper \n  \n \n  Posted in: \n  \n   Project Design & Management"], "link": "http://www.edgebio.com/lims-case-study-edgebio-and-genologics", "bloglinks": {}, "links": {"http://www.edgebio.com/": 4, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["As a provider of next generation sequencing services, our laboratory and bioinformatics teams must keep abreast of a rapidly expanding range of new technologies.  From the latest library prep protocols and capture kits, to emerging sequencing platforms and latest analysis software, we need to be able to provide technological expertise to our clients.  As we continue to monitor the latest developments, we are always interested in hearing from other groups about their experiences with technology comparison and development. \n We wanted to highlight and summarize one such comparison that we found particularly informative.  The Wellcome Trust Sanger Institute recently published a platform comparison of the Ion Torrent PGM, Illumina Miseq, and Pacific Biosciences PacBio RS.  For the comparison, four microbial genomes were sequenced with a GC content ranging from 19 percent to 68 percent.  Datasets generated from each platform were down sampled to represent an average coverage of 15X and were aligned to the 4 microbial reference sequences.  For analysis they used a SAMtools pipeline for Illumina, SAMtools and the Ion Torrent variant calling pipeline for the PGM and the SMRT portal pipeline for PacBio.  To examine SNP calling accuracy, the researchers aligned the datasets from Staphylococcus aureus to a closely related strain and then compared the SNP calls to those found after aligning the S. aureus genome to the related strain.  These platforms were compared in terms of genome coverage, GC-Bias, error rate, SNP calling, and cost.  \n Regarding genome coverage, they found that the PGM failed to cover about 30% of the AT-rich Plasmodium falciparum genome and produced more uneven coverage of the GC-rich Bordetella pertussis genome compared to the other platforms .  However, the researchers found that they were able to greatly reduce the bias in the P. falciparum sample by using a different enzyme, Kapa HiFi for library prep amplification.  The PacBio was able to generate relatively even coverage for AT and GC-rich samples but was found to provide somewhat uneven coverage in the S. aureus sample.  For the GC-neutral Salmonella pullorum genome all three platforms performed well in terms of even coverage and GC representation. \n The PGM had a raw error rate of 1.78% and did not generate any reads for hompolymer stretches longer than 14 bases.  In terms of SNP calling rates, the PGM performed the best just edging out the MiSeq by calling 82% of true SNPs compared to 76% with the MiSeq, however the false positive rate for the PGM was higher than the MiSeq.  They found the MiSeq had the highest raw read accuracy with an error rate below 0.4%.  It made very few errors in short homopolymer regions, only producing errors after tracts of more than 20 bases. \n PacBio produced the highest error rate at 13% and issues were found with SNP calling as current software is optimized for short read data rather than PacBio’s long read data.  The researchers noted however, that variant calling is highly subjective because the process depends on software and parameters used so optimizing SNP calling algorithms is very important. \n Application type should also be considered when comparing the three platforms.  For example, the researchers noted that the current size of a PGM library (up to 250bp) is probably not suitable for accurate de novo assembly of mammalian genomes whereas the Illumina platforms have demonstrated problems with sequencing monotemplates where most of the fragments are the same sequence.  In general, the researchers noted that many of the applications developed for Illumina would translate well onto the PGM. \n When it comes to pricing, the researchers found that the MiSeq comes out on top with a cost of $502 per gigabase.  The PGM came in second with a cost of $1,000 per gigabase using the 318 chip followed by the PacBio at $2,000 per gigabase.  In comparison to the Illumina GAIIx ($148/Gb) and HiSeq 2000 ($41/Gb), all three platforms had a higher per gigabase cost. \n In an interview with In Sequence , Sejal Sheth, VP of strategic marketing for PacBio said that this study looked at standard metrics used to evaluate short-read technologies “which are not necessarily as relevant for long read technologies”.  After noting that the release of new chemistry and algorithms address some of the issues found in the study, Sheth stated that “for the purposes of comparing platforms, it is consensus accuracy, not raw read accuracy that is the relevant metric”.  Consensus accuracy was not addressed in this study. \n \n  \n \n  Tags: \n  \n   Ion Pgm \n   MiSeq \n   pacbio \n   ngs \n  \n \n  Posted in: \n  \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/ion-torrent-pgm-miseq-pacbio-rs-comparison-1", "bloglinks": {}, "links": {"http://www.biomedcentral.com/": 1, "http://www.edgebio.com/": 6, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["The most important step in confident downstream variant analysis of next generation sequencing data is aligning the massive number of short input reads accurately to the reference.  Today there are numerous aligners that do a fairly good job of that, but it is always a challenging task to detect true biological variants from those arising due to sequencing errors and unspecific mappings, especially in the repeat regions.  To address these issues, the bioinformatics team here at Edge evaluated multiple aligners and zeroed in on Novoalign for all of our re-sequening alignments.  Novoalign was chosen after careful consideration of various factors such as its ability to provide sensitive alignments which are very important for accurate SNP and INDEL detection, accuracy, speed, scalability and convenience of use. Several of these tools are already being used as components of diagnostic workflows in the CLIA setting . Scientific findings demonstrate the widely varying abilities of common read alignment tools and their impact on downstream variant calling, which begs for careful and thorough evaluation. We have found Novoalign provides exceptional results while finding SNPs and even Indels where most other aligners lack accuracy.  Several recent publications have reinforced our confidence in building out our exome analysis pipeline based on the combination of Novoalign and the GATK . \n \n\tSNPs: \n A recent article highlighting an optimal exome pipeline does a combinatorial analysis of various aligners and variant callers. They used a series of hash-table based aligners such as Bfast, Ssaha, Smalt, Stampy, and Novoalign as well as Burrows Wheeler transform based aligners such as BWA and Bowtie that are based on efficient reference indexing. They also focus on how different SNP callers implement base quality calculations and posterior probability calculations to reduce the false discovery rate.  In this study by Pattnaik et. al, it was found that Novoalign was able to consistently maintain high quality scores across different variant callers and that the quality of the variants were equally good regardless of the downstream variant caller because of the post-alignment base quality re-calibration method it implements. It is reported that besides alignment, the post-alignment base quality re-calibration plays an important role in true positive variant discovery. Novoalign uses this feature and therfore yields a much better true-positive variant re-discovery rate, Ti/Tv ratio of variants called and higher base quality scores. They report that in aligners where this feature is not enabled, the scores in all the above three metrics were lower. \n Figure from Pattnaik et. al. PLoS ONE 7(1): e30080.  \n \n When assessing alignment speeds, they reported that Bowtie is relatively fast compared to the other aligners because of the version’s inability to map with gaps, and without insertions and deletions. This impeded it from being the top contender as it was only able to capture about 1% of SNP events in the vicinity of the indels compared to Novoalign. Stampy, which follows up with base-calibration of the BWA alignments, comes very close to Novoalign in sensitivity but takes relatively longer time. \n \n Figure from Pattnaik et. al. PLoS ONE 7(1): e30080.  \n   \n Their data on Ti/Tv ratio depicts the consistency of Novoalign and Stampy across variant callers. Among the variant callers evalutated, GATK was found to perform the best in Ti/Tv ratios. They attribute this to their base quality re-calibration.  This is also one of the most popular and rapidly improving variant callers around with wide scientific findings, updates, best practices, and many more attributes. They also report that Samtools (another widely used tool) due to its stringent quality filters, has a higher probability of not detecting true positives.  It was also found to show a bias towards identifying transition events with its > 3.0 Ti/Tv ratio. We have found that using more than one variant caller, and training the raw call set with ones found in majority of them, has removed some of the known variant caller biases. Using multiple technologies and various callers to eliminate either chemistry or algorithm biases has been an active area of research especially in large scale projects like Archon Genomic’s Xprize . \n \n Table from Pattnaik et. al. PLoS ONE 7(1): e30080.  \n Finally, they also show that a lot of their reportings were corroborated by their SNP validations using whole genome SNP microarray from Illumina with 2.5 million SNPs (Omni 2.5 arrays). \n \n   \n Figure from Pattnaik et. al. PLoS ONE 7(1): e30080.  \n   \n \n\tINDELs: \n Another paper by Oliver GR that was published this week also points out the supremacy of Novoalign for this kind of analysis.  This study particularly focuses on the efficiency of detecting indels based on the alignments generated by the various aligners. He demonstrates that, like in the other paper, Novoalign and Smalt were the best performers in achieving the best combination of true positives and low false positive variants.   It was also found that different aligners had various degrees of success with a range of indel sizes and their locations. This is particularly important to define the threshold of the short indel size that your pipeline can actually detect, thereby allowing you to determine if it’s a limitation of the pipeline rather than an indication of its absence in the data. \n The author uses a simulated dataset of BRCA1, a gene known to present several challenges that are often found in real clinical samples such as multiple areas of tandem repeats and high concentration of indels greater than eight nucleotides. Novocraft’s Novoalign software performed fastest and was closely followed by BWA and Bowtie 2 in both single and paired-end mode. The author emphasizes the sensitivities achieved by Novoalign and how such accuracy is the needed for clinical diagnostic analysis especially.  Another interesting point is that  Novoalign doesn’t always find the largest of indels, but has 100% sensitivity when identifying indels <15bps as can be seen in the figure. It should be noted that the alignments used for the paper were done at closest to default settings, but our analysis has revealed that by increasing the alignment score threshold parameter (“-t”) we were able to find indels as large as 23-25 bps. \n \n Figure from F1000 Research ,  1 :2 (doi: 10.3410/f1000research.1-2.v1) \n \n\tConclusions: \n There are several factors affecting the end result of an analysis. With rapid growth in sequencing technologies and the explosion of various tools to analyze them, it is very important for the informatics people to keep up with the latest offerings and know the best combination of tools that work for their study goals. We use Novoalign along with GATK’s best recommended practices on top of several robust QC steps in our Exome Sequencing pipeline and are really pleased with the quality of the variants that we are calling. \n \n\t-Karthik Kota, Bioinformatics Engineer \n   \n \n\tReferences: \n \n\t\t Pattnaik S, Vaidyanathan S, Pooja DG, Deepak S, Panda B (2012 ) Customisation of the Exome Data Analysis Pipeline Using a Combinatorial Approach. PLoS ONE 7(1): e30080. doi:10.1371/journal.pone.0030080 \n \n\t\tGavin R Oliver  (2012) Considerations for clinical read alignment and mutational profiling using next-generation \n \n\t\t Archon Genomic’s Xprize Wiki link \n \n  \n \n  Tags: \n  \n   Novoalign \n   Analysis \n  \n \n  Posted in: \n  \n   Bioinformatics"], "link": "http://www.edgebio.com/exome-data-analysis-pipeline", "bloglinks": {}, "links": {"http://www.plosone.org/": 1, "http://www.novocraft.com/": 1, "http://www.edgebio.com/": 3, "http://www.edgebio.com/blog": 1, "https://edgebio.atlassian.net/": 2, "http://www.broadinstitute.org/": 1, "http://genomics.xprize.org/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["Please join us on June 20, 2012 from 10am-11am PT for \"Towards A Medically Actionable Whole Genome Sequence\" a free webinar with: \n \n\t\tGrant Campany - Senior Director, Archon Genomics X Prize presented by Express Scripts \n \n\t\tJustin H. Johnson - PhD Director of Bioionformatics, EdgeBio \n \n\t\tMarc Salit - PhD Group Leader, Biochemical Science Multiplexed Bimolecular Science, National Institute of Standards and Technology (NIST) \n \n\t\tModerated by Kevin Davies - PhD editor in chief of Bio-IT World \n The Archon Genomics X PRIZE presented by Express Scripts created a \"Validation Protocol\" that is helping to define for the first time what it means to have a complete and accurate medically actionable whole human genome sequence. This webinar will describe the Validation Protocol in detail, as well as present preliminary data on the methodologies employed to reconstruct the fosmid data, compare sequencing technologies to minimize bias, and develop software for whole genome comparison to fosmid data for contestant grading. \n \n\t You can download this webinar here  http://bit.ly/L6wwbH or view it on our Webinars page. \n \n\t About the Archon Genomics X PRIZE presented by Express Scripts: \n The Archon Genomics X PRIZE presented by Express Scripts will award $10 million to the first team to sequence 100 human genomes in 30 days or less at a maximum cost of $1,000 (USD) per genome sequence, attaining an accuracy score of no more than one error per 1,000,000 bases, present each genome as 98% complete and provide accurate haplotype phasing. \n The 100 human genome samples to be sequenced in this competition will provide the research community with an unprecedented opportunity to analyze what will likely be the most deeply sequenced set of human genomes ever assembled.  In addition, the redundant sequencing of the same set of genomes by multiple teams, using different technology platforms, will likely allow subsequent rapid corrections, generating a nearly error-free set of 100 human genomes. \n   \n \n  \n \n  Tags: \n  \n   webinar \n   X Prize \n   Validation Protocol \n   whole genome sequencing \n   ngs \n  \n \n  Posted in: \n  \n   General Information \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/free-webinar-towards-medically-actionable-whole-genome-sequence", "bloglinks": {}, "links": {"http://www.edgebio.com/": 6, "http://www.edgebio.com/blog": 2, "http://bit.ly/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["It’s been a while since I have blogged on Ion Torrent data.  There are several reasons for this. \n First and foremost is that my head has been buried in The Archon Genomics XPrize Validation Protocol in which we were contracted to execute staring at the end of last year.  The AGXP is an ambitious, incentivized prize competition that will award $10 million to the first team to rapidly, accurately, and economically sequence 100 whole human genomes to a level of accuracy never before achieved.  The VP provides an opportunity to test and score current WGS technologies, assist the scientific community in establishing the reference genome(s) for this Competition and the means for analyzing the results of the Competition. \n Second, it was with great anticipation and excitement that we received our Certificate of Compliance recently from the US Dept. of Health and Human Services Centers for Medicare and Medicaid Services. This means we have been deemed a CLIA lab and can begin to offer our Clinical Exome test under CLIA guidelines.  No small feat. \n But, here I am, again, knocking the dust off the blogging boots, and wading into another data set Ion Torrent has publically released.  \n So why I am I excited about this new long read data set.  I think you can call it a cumulative excitement.  400bp is a milestone, much like 200bp , mate pairs , fast turn arounds , and high quality runs .  It is a culmination of effort over the past year to continually improve and stretch the technology.  I discussed in January our road at EdgeBio with the Ion Torrent and how we have seen marked improvements in throughput, quality, cost, and extensibility/usability of the system and bioinformatics tools.  Much of it discussed ACTUAL experience running the machine and analyzing the data.  I think this is very important.  Data sets released by machine vendors should be looked at with a careful eye and a disclaimer that it may be a while until you see those results on your machine.  That being said, as a services provider, we must remain on the edge of the technology and examine data sets before we can choose which of the many new protocols (Mate Pair, Paired End, Longer Reads, RNA-SEQ, AMpliseq, TargetSeq, Nimblgen Exomes, etc) to start through our internal QA/QC efforts to eventually provide to our clients.  \n This 400bp data set release by Ion represents a new protocol that we are anxious to start running internally, but are happy to look at, pre-release, and analyze before we can move it into the wet lab. This dataset , available on the Ion Community , exhibits a modal read-length of 400 bases with the majority of bases at Q30 quality or better through the 400 bases.  \n \n Fig1. FastQC plot of raw read average QV value across each position in the read.  Note that reads maintain an avg. Q30 QV until between 250bp and 300bp and Q20 QV out to 400bp. \n \n Fig 2. The fraction of raw Q30 bases is cumulative up to the positions noted. Considering all the reads, all the bases, up to position 400, 55% are Q30 or greater. \n One would hope that longer reads would yield improved assemblies.  From what we have seen, this is still not the case for the 400bp reads compared to the 200bp high quality reads from 316 and 318 chips.  Although, we make the argument that this is still a very good and cheap draft assembly, and have shown that this combined with some open source cloud based annotation can get you quite a bit of useful data to work within your research.  Also, one could, for more money of course, potentially generate a single scaffolds and larger contig assemblies using mate pairs.  But we haven’t done this here at Edge yet. \n We are delighted Ion gave us this preview of the long read-length products in development at Ion and based off of previous experience, expect continued data quality improvements by the time of release in the second half of 2012. \n \n  \n \n  Tags: \n  \n   Ion Torrent \n   ngs \n   bioinformatics \n  \n \n  Posted in: \n  \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/ion-torrent-hits-400bp-read-length-markwhy-were-excited", "bloglinks": {}, "links": {"http://ioncommunity.iontorrent.com/": 2, "http://www.edgebio.com/": 10, "http://www.ac.uk/": 1, "http://flxlexblog.wordpress.com/": 2, "http://www.edgebio.com/blog": 1, "https://edgebio.atlassian.net/": 2, "http://genomics.xprize.org/": 2}, "blogtitle": "EdgeBio blogs"}, {"content": ["The Life Technologie's Ion Torrnet  Bus stoped at EdgeBio in Gaithersburg, Maryland. Here they talked with President and CEO Dean Gaalaas about how EdgeBio has successfully been using the Ion PGM Sequencer in their service lab for over a year now. The Ion Torrent PGM Sequencer's speed has enabled EdgeBio to dramatically increase sequencing turnaround times, from weeks to days. \n \n\n   \n Do you Agree with Dean?  Let us know. \n   \n \n  \n \n  Tags: \n  \n   Ion Torrent \n   Ion Pgm \n   turnaround time \n  \n \n  Posted in: \n  \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/ion-torrent-pgm-changes-sequencing-turnaround-weeks-days-video", "bloglinks": {}, "links": {"http://www.edgebio.com/": 3, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["We would like to thank Genomeweb for their recent articles regarding the announcement of our CLIA status. If you missed the articles from Genomeweb you can view them here:  Clinical Exome Sequencing and EdgeBio Recieves CLIA Certification \n A few weeks ago we received our CLIA certification for next generation sequencing and will offer clinical exome sequencing for large labs and hospitals that can do their own in-house analysis. We will supply aligned sequencing data and leave the interpretation to the customers themselves. \n We are currently in the process of negotiating and finalizing agreements with several labs to provide the sequencing portion of their clinical exome tests.  “What we’re not going to do is have the capability to provide genetic counseling or the ability to interpret data to make clinical or therapeutic recommendations,” CEO Dean Gaalaas said.  \"Say you have a genetic group or a lab group that has that capability but doesn't have access to a sequencer, or doesn't have bioinformatics. They want to be able to send out samples, get exome data and have an aligned file. But [they] know how to mine [the data] and when [they] see mutations, [they] know how to deliver that result either back to the attending physician or to the patient themselves,\" he explained. \n We can provide services on multiple platforms including SOLiD and Ilumina HiSeq. However, we anticipate that the majority of our clinical sequencing will be done on the Illumina  Gaalaas stated “I think it's fair to say that the market has spoken, particularly with exome sequencing, and the norm is doing paired-end 2x100 base pair sequences, and unfortunately the SOLiD platform just doesn't have that chemistry availability.\" \n As we move forward, EdgeBio will be focused on building relationships with labs looking for clinical sequencing data and have the ability to interpret and make decisions based on that data.  In addition we will be looking to expand our clinical sequencing capabilities and offer new services based on which areas of need develop in our customer base.  Managing Director of GeneDx, Sherri Bale, will serve as the clinical laboratory director for EdgeBio. \n \n  \n \n  Tags: \n  \n   CLIA lab \n   Clinical Sequencing \n   ngs \n  \n \n  Posted in: \n  \n   Bioinformatics \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/clinical-exome-sequencing-services-labs-and-hospitals-house-interpretation", "bloglinks": {}, "links": {"http://www.edgebio.com/": 3, "http://www.edgebio.com/blog": 2, "http://www.genomeweb.com/": 2}, "blogtitle": "EdgeBio blogs"}, {"content": ["It was with great anticipation and excitement that we received our Certificate of Compliance yesterday from the US Dept. of Health and Human Services Centers for Medicare and Medicaid Services. This, paired with our compliance letter from the State of Maryland, means we have been deemed a CLIA lab and can begin to offer our Clinical Exome test under CLIA guidelines. It’s been quite a journey to get here and everyone is quite excited to receive this designation and achieve this milestone. \n When we set out to open our sequencing services back in 2008, we put some milestones in place to track our progress. The first was easy; could we build and operate a next-generation sequencing (NGS) lab and also offer Sanger sequencing services. Initially, as a products company that focused on Sanger sequencing, we thought that would be easy to stand up Sanger services as we slowly built our NGS pipeline and customer base. It was the first of many misconceptions that would unfold over the next three-plus years. We quickly found that the Sanger services market was quite mature and very hard to break-in. We had no customer base, no sample acquisition infrastructure and no economies of scale that would allow us to be competitive. In other words, we had no clue what we were doing while many others had it down to a science, if you’ll forgive the pun. \n Fortunately, NGS as a service was just getting started and all the companies jumping in seemed to have as much (or little) knowledge as we did. We quickly abandoned our focus on Sanger (although we still offer it) and focused our attention on a burgeoning NGS market. We started out by building out what we felt like was, and still do today, a state-of-the-art facility and hiring top notch managers for both the wet lab and bioinformatics. They were able to build fantastic teams on the fly and we set off to build an offering to mirror our best in class consumables for Sanger sequencing. \n Fast forward to the end of 2011 and we felt we had achieved an important milestone: a consistent revenue stream from NGS services focused in the research setting with a strong customer list and repeat business. This we felt was validation that our offering was strong. It was at the end of last year that we set out on our next milestone: achieving CLIA status. This we felt, was important in many ways, not just because we believe that NGS can be a powerful tool in the fight against genetic disease such as cancer or neurological disorders (to name a couple) but also because it was the natural evolution of our company’s mission and vision. \n So today we get to celebrate another important milestone in the three-plus year history of our Services division. Everyone at EdgeBio deserves credit in some form or fashion for helping us to achieve this goal. And rest assured we will celebrate! \n For me, I have already looked out into the next milestone: building a customer pipeline and delivering a product that people will want to refer and return to use. \n CLIA #21D2039005 MD State License 1853 \n \n   \n Best, \n Dean \n \n  \n \n  Tags: \n  \n   CLIA lab \n   ngs \n   Clinical Sequencing \n  \n \n  Posted in: \n  \n   Bioinformatics \n   Business \n   General Information \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/recieving-clia-status-0", "bloglinks": {}, "links": {"http://www.cms.gov/": 1, "http://www.edgebio.com/": 5, "http://www.edgebio.com/blog": 4}, "blogtitle": "EdgeBio blogs"}, {"content": ["One of several areas in which we hope we stand out here at EdgeBio is in our up front project design.  There are many people, from our project managers, to lab personnel and management, to our informatics group and even our SAB (See a presentation on Genomic Study Design from Dr. Michael Zody at the Broad) that all play an active role in helping our clients design their genomic projects.  We try to take in to account several global considerations (timelines, technologies, quality, etc) for tailoring each project to the researcher and their goals.  More often than not though, it comes down to cost.  While cheaper is usually not better, it sure is attractive.  \n Here at Edge, we strive to be transparent and competitive in our pricing, but can’t always the cheapest.  In the spirit of transparency, we have developed an online tool that we hope will give potential (and current) clients insight in to the cost of designing a project.  Obviously, this is only a single step of many toward the final design, but we hope it will give a sense of the feasibility of a project. We can then move into a concerted design phase.  We hope you find it useful.  Please access the EdgeBio Sequencing Project Price Calculator here: http://www.edgebio.com/sequencing-project-price-calculator \n \n We welcome all feedback. \n - Justin \n \n  \n \n  Tags: \n  \n   price calculator \n   sequencing design \n  \n \n  Posted in: \n  \n   Project Design & Management"], "link": "http://www.edgebio.com/sequence-project-study-design-and-price-calculator-0", "bloglinks": {}, "links": {"http://www.molecularevolution.org/": 1, "http://www.edgebio.com/": 4, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["We are excited to introduce the EdgeBio iPad/iPhone app. Stay on top of the latest biotech genomics news/blogs/data. \n \n\tDescription \n The EdgeBio app unifies all digital resources of EdgeBio to deliver a truly enhanced, interactive experience. We bring together all content from the EdgeBio blog (Views from the Edge), our website and online communities in one integrated, easy-to-navigate app. The app is free to download. \n   \n The EdgeBio app allows you to: \n \n\t\tDiscover new articles from “Views from the Edge” \n \n\t\tSee what people at EdgeBio are reading & sharing in “What We’re Reading” section \n \n\t\tWatch videos from EdgeBio on Genomics, Bioinformatics and Biotech topics \n \n\t\tInteract via Email, Facebook and Twitter \n \n\t\tGet directions to EdgeBio through an interactive map and guidance system. \n \n\t Download this sleek biotechnology focused app and discover how EdgeBio delivers the best research and clinical services to our clients. \n \t  \n \n   \n \n  \n \n  Tags: \n  \n   App \n   iPad \n   iPhone \n   sharing information \n  \n \n  Posted in: \n  \n   General Information"], "link": "http://www.edgebio.com/edgebio-app", "bloglinks": {}, "links": {"http://www.edgebio.com/": 4, "http://www.edgebio.com/blog": 1, "http://bit.ly/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["Bio IT is around the corner and we will be present. Our Director of Bioinformatics, Justin H. Johnson, will be the Chairperson and a speaker for Thursday, April 26 Track 4 talk/sessions on Bioinformatics & The Cloud. The session is set to begin at 8:40am and Justin will be giving the opening remarks and introducing  these speakers: Ray Fyhr, Project Lead, MRL-IT, Merck and Chuanbin Du, Ph.D., Post-Doctoral Fellow, Department of Bioinformatics and Genomics, University North Carolina at Charlotte . Our talk begins at 9:45am and Justin will be speaking about The Path Toward a Medical Grade Genome . Please join Justin H. Johnson, Director of Bioinformatics, EdgeBio - Project Lead of Validation Protocol, Archon Genomics X Prize Presented by Express Scripts during this time for some insight on the Archon Genomics X Prize. \n \n\tAbstract \n The Archon Genomics X PRIZE presented by Express Scripts created a “Validation Protocol” that is helping to define for the first time what it means to have a complete and accurate “medical grade\" whole human genome sequence. The primary role of the \"Validation Protocol\" is to enable the X PRIZE Foundation to declare a winner of the $10 Million Competition in 2013 without controversy. This presentation will describe the Validation protocol in detail, as well as present preliminary data on the methodologies employed to reconstruct the fosmid data, compare sequencing technologies to minimize bias, and develop software for whole genome comparison to fosmid data for contestant grading. \n \n \n \n  \n \n  Tags: \n  \n   Bio IT \n   X Prize \n   bioinformatics \n  \n \n  Posted in: \n  \n   Conferences"], "link": "http://www.edgebio.com/path-toward-medical-grade-genome-bio-it", "bloglinks": {}, "links": {"http://www.bio-itworldexpo.com/": 1, "http://www.edgebio.com/": 3, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["It was quite an adventure for my first Trade Show. I got to see the massive amount of people that swarm to AACR to introduce, discuss, and develop new breakthroughs in cancer research! The information was overwhelming! However, from standing in the booth all day, I got to see what it takes to get people interested in doing some Next-Generation Sequencing (NGS). Sequencing has long been an important tool in the investigation of cancer causation, but NGS technologies have enable its use as a tool for diagnosis and treatment. NGS has been on the brink of expanding to the clinic for several years now. At this conference, the consensus seemed to be that we are very, very close to adopting NGS for routine use in cancer treatment. A prerequisite for the use of NGS in the clinic is CLIA certification, which we here at Edge are in the process of obtaining. Sequencing data will help in diagnosing the right treatment for mutations. Here at Edge, we strive towards being one of the top service providers for Next-Gen Sequencing . \n AACR hosted a great conference. Everything was smooth from registration, to setting up booths, to the exhibiting hall, to breaking down everything.  Manning the booth all day is hard on your feet but you get to meet interesting people and showcase your company. Because AACR is a more general cancer conference, and NGS is not yet a routine facet of cancer research, there were a limited number of people who were knowledgeable about next-gen sequencing. However, we had a decent number of people who were familiar with the technology and were looking to our service for their sequencing needs. Our focus was on the Ion Torrent Ampliseq Cancer Panel . \n \n This panel can detect 739 tumor specific mutations in 46 oncogenes down to 5% allele frequency. This process is completed within 10 days from start to finish, ending with your data on a secure, online website in which you can explore mutations, associated annotations as well as download all raw data for further analysis. You can expect up to 500X coverage of KRAS, BRAF and EGFR and 43 other oncogenes with a single run. We can do up to 8 samples on our larger chips to get the needed coverage and can do several chips a day with the same 10 day turn around. One of our scientific advisors, Dr. Samuel Levy, recently posted a guest blog about data detection of Somatic Mutations using this panel. \n The fact that this conference was in Chicago didn’t hurt either. The highlight of the trip was visiting the Hancock Tower Signature Room and seeing the entire city! It was a really nice view of Chicago! I highly recommend you go there if you haven’t already. \n Overall, it was a great experience for my first conference. I am looking forward to the next one and more breakthroughs in science. Thank you to all that came to our booth and visited us at AACR. \n \n\t To keep up to date with the latest biotech & genomics news at Edge, we just relased the EdgeBio app. Download here \n   \n   \n   \n - Steven Davis \n \n  \n \n  Tags: \n  \n   AACR \n  \n \n  Posted in: \n  \n   Conferences"], "link": "http://www.edgebio.com/recap-aacr", "bloglinks": {}, "links": {"http://find.lifetechnologies.com/": 1, "http://www.edgebio.com/": 3, "http://www.edgebio.com/blog": 1, "http://bit.ly/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["Contributed by Dr. Samuel Levy : Director of Genomic Sciences - Scripps Translational Science Institute and Scripps Genomic Medicine, Professor of Molecular and Experimental Medicine - The Scripps Research Institute \n \n\t AmpliSeq Cancer Panel applied to a tumor and blood sample pair for the detection of common somatic mutations \n   \n W e have a clinical research protocol that aims to provide tumor mutation data to oncologists as part of a patient’s cancer care within the Scripps network and we were trying to figure out ways of providing these data in a time sensitive manner to patients and their physicians.  Whilst both exome and whole genome sequencing are good options, we wanted to maximize the use of any large amount of data we generate in an oncologist’s care approach. Consequently we decided that these options were data overkill for what a treating oncologist typically employs. \n For this particular application we turned to the Ion Torrent and the AmpliSeq Cancer panel that provides a rapid manner to assess the presence of a set of mutations in a DNA sample. EdgeBio were able to generate these sequence data to us and we tested this out on a colon tumor sample and the germline DNA from white blood cells from the same patient.  We sequenced 190 amplicons from a single multiplex reaction targeting 46 genes contain 739 known SNVs or indels identified from a variety of cancer samples (Life Technologies AmpliSeq Cancer Panel). Using the Ion Torrent 316 chips we were able to obtain >~5,000 fold average coverage of the 13.3 kb of target sequence from the tumor and normal sample pair.  The uniformity of sequence coverage for the sample pair was high (Figure 1), enabling variant calls to be made in a consistent and comparable manner. \n \n Figure 1. Normalized coverage plot for tumor and normal sample pair. The average coverage across the target regions was normalized to unity enabling comparisons between samples.  For example, 80% of each sample was covered at 2,000x (0.4 x 5,000). Note that all target regions have at least 10x coverage and no PCR dropouts were detected. \n High coverage and appropriately applied variant calling filters provided in the Ion Suite software enabled the identification of somatic mutations in PIK3CA (Q546K - 38% mutation frequency), KRAS (G13D – 54% mutation frequency) and TP53 (R273L – 75% mutation frequency). We verified that these changes do not occur in the blood sample as evidenced by the comparative data from read counting in Figure 2. The data we identified here were fully consistent with the existing data we had on this sample using other sequencing approaches (Illumina – whole genome and whole exome sequencing) and provides a useful and rapidly generated mutational profile on a tumor sample for clinical applications. \n \n Figure 2. Read alignment of tumor sample versus blood in the KRAS gene depicting the G13D mutation. Reads containing the mutated allele have the base “T” depicted in red. \n \n  \n \n  Tags: \n  \n   Oncology \n   ampliseq \n   Ion Torrent \n  \n \n  Posted in: \n  \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/ampliseq-cancer-panel-detection-somatic-mutations", "bloglinks": {}, "links": {"http://www.stsiweb.org/": 1, "http://www.edgebio.com/": 3, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["At EdgeBio we constantly try to extend the applications and services that we can perform utilizing Ion Torrent sequencing.  Recently we have been involved in some projects with microbial annotation. By annotating the results of de novo sequencing with gene predictions researchers can examine the results of the sequencing for biological significance.  With Ion Torrent sequencing the focus is on providing these results quickly and efficiently to our customers.  While there are many tools and options for microbial annotation, one particularly useful and interesting option is CloVR .  CloVR is a tool that packages many commonly used bioinformatics tools into intuitive pipelines.  CloVR is distributed as a virtual machine, allowing users to spin up the environment on a local machine or, even cooler, spin up an instance on Amazon EC2.  Because of its use of cloud computing and its intuitive web interface, CloVR is an attractive tool for many commonly performed bioinformatics tasks.  Pipelines include CloVR-Search that can perform large scale BLAST searches, CloVR-16S for ribosomal RNA sequence analysis, CloVR-metagenomics for taxonomic and functional classification, and CloVR-Microbe that allows for assembly and/or annotation of microbial organisms.  Today I’d like to share our experience using the CloVR-Microbe pipeline for annotation of Ion Torrent data.  Ion Torrent data isn’t yet officially supported, but because 454 data can be used as input to the pipeline, with a little effort Ion Torrent data can be successfully annotated as well. \n We chose to perform the CloVR analysis on EC2.  Spinning up an instance of CloVR is relatively straight forward and documented on the CloVR website .  After the instance is running, pipelines can be configured and run via the web interface.  To run a pipeline, first enter EC2 credentials for the account you are using. \n \n CloVR spins up separate instances for each analysis pipeline and spins these instances down when the analysis completes.   After adding EC2 credentials, upload and tag the data sets to be annotated. \n \n With datasets with large number of contigs, CloVR tends to fail.  While I’m not sure exactly which step is causing the issue, CloVR users have reported in the past that CloVR can fail if it runs out of memory.  By splitting datasets into subsets of more manageable size (about 50 contigs) we’ve been able to successfully run the CloVR annotation pipeline although it does occasionally still fail.  The final step is to configure the annotation pipeline and click submit. \n \n After a pipeline has been submitted its status can be tracked through the web interface.  After the pipeline is complete CloVR results are provided in genbank, sqn format (for submission to GenBank), coding sequence fasta, and polypeptide fasta format for annotated genes.  These are standard file formats that can be converted and manipulated by many programs for additional downstream analysis. \n As a proof of concept we annotated an assembly of an E Coli DH10B dataset freely available on our website (username: edgebio, leave password blank).  Data dataset was split into smaller sets of contigs, ran on a CloVR instance on Amazon EC2, and the results were combined. \n The resulting output files can be downloaded here .  In addition to the four output files provided by CloVR, a gff file of the annotations is also available.  To see if CloVR is accurately predicting genes found in DH10B, the gene predictions from CloVR’s annotation pipeline were compared to gene annotations from the DH10B genbank file .  CloVR predicted a total of 4,883 genes in this dataset.  Of the 4,883 predicted genes, 4,644 unique predictions were found and 2,644 predictions had an actual gene ID.  The 2,000 other genes were predicted hypothetical proteins and did not have an actual gene ID to cross-reference in reference genbank files.  The set of 2,644 genes was then compared to the actual E Coli DH10B genbank file which contained 4,181 annotated genes.  2,262 of the genes predicted by CloVR were annotated in the DH10B dataset.  With CloVR 54% of the genes from DH10B were predicted in our annotated assembly, and 85% of the non-hypothetical annotated genes were found in the DH10B genbank annotation file. \n Because of the ease of spinning up CloVR on Amazon EC2, running a pipeline, and getting the analysis in common accepted formats, we see a lot of potential for CloVR to become a widely used pipeline for bioinformatics analysis.  CloVR is also a good candidate to be made into a plugin for the Torrent that will allow anyone with an EC2 account to annotate assembly results and visualize the output directly inside of the Torrent Browser. \n \n  \n \n  Tags: \n  \n   CloVR \n   Ion Torrent \n   bioinformatics \n  \n \n  Posted in: \n  \n   Bioinformatics \n   General Information"], "link": "http://www.edgebio.com/microbial-annotation-cloud-clovr-and-ion-torrent", "bloglinks": {}, "links": {"http://www.edgebio.com/blog": 2, "http://clovr.org/": 2, "http://www.edgebio.com/": 3, "http://www.nih.gov/": 1, "https://data.edgebio.com/": 3}, "blogtitle": "EdgeBio blogs"}, {"content": ["I attended the Human Genome Meeting last week in Sydney, Australia, due to our involvement with the X Prize. It was my first time at the meeting and I came away very impressed at the level of sequencing being presented during the talks. Many of the talks led off by John McPherson’s talk on Cancer Genomics, and were highlighted by Michael Snyder’s talk on using Omics profiling for assessing disease risk and heath states. Through all of the talks a central theme emerged in my eyes, that the $1,000 genome would lead to widespread adoption of NGS as a clinical diagnostic tool. Much has been written and said about the promise of genomics technology and its impact on personalized medicine. However, that is not the focus of this spot. I would prefer to assess the merits of the premise that the cost alone will lead to rapid adoption sequencing as a clinical assay. \n To me this seems like an overly simplistic view of what is needed to bring NGS to the clinic. I’ve attended many talks over the past few years and most believe that sequencing is essential to learn more about complex diseases such as cancer and neurological disorders. This draws an interesting parallel to sequencing. As a species, we humans seem drawn to the simplistic view of cause and effect. In the case of human health we tend to think that a change in one gene will cause a disease state and that by fixing this one gene, through a variety of methods, we can cure that disease state. However, we know this not to be true for a majority of disorders. \n When it comes to the adoption of NGS, I believe we are falling prey to this overly simplistic model. The current thought is, if we can just make sequencing more affordable like the $1,000 genome, that the adoption curve will start to go asymptotic. To me, it seems that getting NGS into the clinic as a matter of Standard of Care, will be much more complex. Yes, cost plays an enormous role and is a fair enough starting point but there are many more factors that need to be considered. The factor that is most intriguing to me, and the one I have heard least about, is how do we get insurers to reimburse? \n In Australia, many of my international colleagues posited that if sequencing were to only cost $1,000 USD, that many would turn to it as an out of pocket expense as this is a matter of routine for most outside of the US. Fair enough, but what will sequencing your genome once tell you about your disease state? Presumably, you are paying that money out of pocket because you suffer, at the time, from a particular ailment. Michael Snyder’s talk focused on looking at his genome over several time points, referencing his genome at a baseline (relatively healthy state), versus disease state (rhinovirus infection), post-infection, and so on. To me this seems like a very reasonable assessment on how to use sequencing as a diagnostic; to monitor changes in the genome over the lifespan of a patient. This means having your genome sequenced multiple times, which makes it doubtful that patients would be willing to pay out-of-pocket as many times as necessary. \n Certainly in the US, few if any are willing to pay out-of-pocket for medical expenses. So, will the $1,000 genome cause insurers to line up to reimburse? My thought is no. They wouldn’t rush to reimburse even if it were $100 per genome. The health industry in the US tends to move at what could best be described as a gingerly pace. Standard of Care is routinely cited, and Standard of Care tends not to change in lockstep with discovery or technological advances. No, it tends to change based on legal risk and cost. Tort reform in the health industry is a pet cause of mine but not the focus of this post, so let’s just look at cost. \n Insurers are very black and white when it comes to reimbursement, if reimbursing for a test will save them money over what is currently available, they can be convinced to change. Consider, if you will, what is needed to convince insurers that this will indeed save them money. A reasonable scenario may look like this : insurers actuarial tables (and they have reams of data to support them) say that a typical head (term for insured) will stay with the insurance company for an average of 6.8 years and generate $20,000 of revenue for the insurance company over that lifespan. What needs to be shown is that by leveraging NGS as a matter of Standard of Care, the amount of revenue generated per head is greater than $20,000. A very simplistic model to be sure, but should serve to illustrate the point. Clearly a study could be designed to do this, correct? Certainly, but how much power would a study like this need? Over how long of a time period? \n I came away from the Human Genome Meeting more excited than ever at some of the groundbreaking research being done across the globe with NGS technology. Now, if we could just match it with groundbreaking research on the cost impact of leveraging NGS in the clinic we will be much closer to the promise that the $1,000 genome seemingly offers. \n \n  \n \n  Tags: \n  \n   ngs \n   genomes \n  \n \n  Posted in: \n  \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/1000-genome-widespread-adoption-ngs", "bloglinks": {}, "links": {"http://www.edgebio.com/": 2, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["If you are reading the full version of this blog you have undoubtedly found you way to our new and improved website. This is just the first of many changes or new offerings we plan to roll out this year in response to wonderful customer feedback. The new layout was designed to allow first-time visitors and repeat users to find information much more quickly than before. The layout is simpler and much more intuitive. Our navigation bars remain constant ( I know, what a novel concept…) so that you can remember where you are and how you got there. Once you get there, you will see quite a bit of new information regarding the different platforms that we run (Ion Torrent PGM, Illuina HiSeq2000 & Life SOLiD). The data generated off of these platforms are available for download. You can also find a ton of information (and some data to boot!) on the different types of sequencing we do, from ChIP-seq to Whole exome sequencing, to Whole transcriptome sequencing to amplicon resequencing, and everything in between. \n On the products side we have made a lot of improvements to our online ordering system. Now shipping charges are estimated in real-time and tracking numbers for outgoing shipments are sent automatically to the customer. Yes, a lot of these “improvements” been standard fare for many websites, but at EdgeBio we are certainly excited to bring this functionality to our customers. \n \n The website is just the start of some growth we are undertaking as a company. Since the start of the year we have increased our staff by almost 25% as we expand to keep up with growing customer demand for our products and services. We’ve hired lab staff, bioinformaticians, Product technical staff and a digital marketing associate to help us navigate a blog from a tweet and how we can leverage social media to get the word out regarding all the cool things we are doing here in Gaithersburg. \n I’d like to personally thank the team most responsible for this new website. Led by Justin Johnson, managers Alicia Jones and Tara Bennink did a fantastic job of coordinating information that Steven Davis, Liliana Urrego, and Adam Bennett helped generate. They should all be very proud of what I think is a fantastic new image for Edge on the web. \n Tell me what you think. What did we get right? What did we get wrong? How can we improve? What should we do more of? We do all of this to engage you, the community! Thanks for reading the blog and I look forward to your thoughts. \n Best, \n Dean \n \n  \n \n  Tags: \n  \n   Website Improvements \n  \n \n  Posted in: \n  \n   General Information"], "link": "http://www.edgebio.com/welcome-our-new-website", "bloglinks": {}, "links": {"http://www.edgebio.com/": 1, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["Well, it was a whirlwind few days at AGBT, where the talks were great and the after-parties pretty spectacular in their own right. This is my quick summary of some of the highlights of the conference. (DISCLAIMER -  I had to leave the conference early Saturday morning so I am unable to review any of the speakers or parties from Saturday). \n Where to begin…? \n \n \n Thursday started with a bang with talks by Heidi Rehm and Darrell Dinwiddie that highlighted how NGS has already entered the clinic. This was a central theme of the entire meeting and was something I was very excited to see. The meeting seems to be in a transition right now from technology focused to application focused, with the main application being healthcare and sequencing in the clinic. AGBT has seen over its 13 years this ebb and flow between technology and application. I expect many more application talks next year. \n Thursday evening saw the presentation from Jonathan Rothberg and the new Proton platform from Life Technologies. While the talk was light on data presentation, there were some pretty bold claims such as the ability to sequence an entire human genome in a day for $1,000 on the Proton II chip due out by the end of 2012. So far they have hit all of their data generation metrics, let’s hope they make it to this one as well. Also, on Thursday evening Michael Zody from the Broad gave a very interesting talk on the dynamics of Dengue Fever disease severity. The evening was capped off by Caliper Life Sciences 2 nd Annual Up All Night Party from the Presidential Suite. While I personally did not stay up all night, I did talk to a few party-goers who made it to 5:00am. Ouch! \n Friday gave us Rick Myers from Hudson Alpha and some fascinating work they are doing on human gene regulation, as well as Geoffery Smith from Illumina on how the MiSeq is being used in clinical microbiology. Joe Boland from NCI showed us how they are already using the ion torrent PGM to generate a whole human exome in a day using four 318 chips. \n Then came the talk from Oxford Nanopore that set the conference abuzz. You can see my reaction in real time by following my twitter feed here . However, the highlight was the announcement of the minion, a disposable sequencer the size of a USB stick that can plug directly into your laptop for a price around $1,000. I’m not sure how good the data will be but the “cool factor” was off the charts. That said, I suggest a healthy dose of salt with this news. If the announcements from PacBio at this conference over the years can serve as our guide, it shows that no matter the technology, there are likely to remain several viable platforms to choose from over the coming years. To paraphrase, the deaths of Illumina and Life Tech have been exaggerated. \n Friday evenings concurrent session on cancer was the highlight of the tracks presented that evening as Sean Grimmond from Univ of Queensland, David Smith from the Mayo Clinic, John McPherson of OICR, and Samuel Levy of Scripps all gave powerful presentations showing the use and utility of NGS platforms to yield new insights on cancer. The evening closed for me at the Life Tech ion Lounge party which featured a live band and a free Ion Torrent PGM that was raffled off and won by some researchers at NIST. Congratulations! \n Not  a comprehensive list to be sure but hopefully something to whet the appetite of those who were unable to attend. Hoping to see all of you at next year’s meeting. \n Dean \n \n  \n \n  Tags: \n  \n   AGBT \n  \n \n  Posted in: \n  \n   Conferences"], "link": "http://www.edgebio.com/agbt-recap", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://www.edgebio.com/": 1, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["Life Tech \n As always, Jonathan Rothberg did not disappoint and delivered some pretty bold statements about where they are heading with the Proton. \n \n   \n   \n   \n   \n   \n Some highlights: \n \n\t\t500+ bp reads \n \n\t\tBetter accuracy than Illumina \n \n\t\tHomopolymers not really an issue \n \n\t\tGenome for $1000 by end of 2012 \n Once again, we at EdgeBio are excited by the claims and are endeavoring to get our hands on a Proton as soon as they become available. Looking forward to generating data and sharing it with the community through this blog! \n GNUbio Summary \n Beta release mid 2012 \n\tComplete release end 2012 \n \n\t\tClaim 40 seconds prep time and 3.5 hour run \n \n\t\t2 instruments in R&D at this time \n \n\t\tPicoinjector droplet technology - exclusive license Injects gDNA into droplet containing PCR primer library \n \n\t\tPiece together 1kb reads -map sub assemblies to a reference Do local reconstruction \n There are lots of pictures - not sure what they really mean.... \n City of Hope collaboration - Poster 338 \n \n\t\t1000bp read length claim \n \n\t\tPhred 70+ accuracy \n \n\t\tYield/run 1.2 Gb \n \n\t\tCost $200/sample \n Dean \n \n  \n \n  Tags: \n  \n   AGBT \n   Ion Proton \n   GnuBio \n  \n \n  Posted in: \n  \n   Conferences"], "link": "http://www.edgebio.com/agbt-update-2-ion-proton-and-gnubio", "bloglinks": {}, "links": {"http://www.edgebio.com/": 3, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["Here's an update from the conference. As always, AGBT lives up to its reputation. Wednesday evening's festivities were spot on with a personal highlight of being on board the Ion Torrent bus. Designed to be a rolling lab, it is a unique way to highlight the PGM, from form factor to actually doing a run on an instrument on the bus while the bus was parked on the beach... \n Talks so far that have stood out for me have been Heidi Rehm's talk on Supporting Large Scale Sequencing in a Clinical Environment. She has developed a very cool tool called \"GeneInsight\" which they are attempting to integrate into a patient's electronic health  record (EHR). Also, Darrell Dinwiddie gave an interesting talk on building a NGS clinical lab within Children's Mercy Hospital and using NGS as a more cost-effective model for molecular testing of 600 severe childhood diseases. \n \n I've also gotten my first peak at the new Proton instrument from Life Technologies. There is a working prototype here at the meeting. While I have not seen any data, I can say that the form factor is as good as advertised. I'll learn more at their seminar this evening. Be sure to check back for the skinny. I've also spent time with the good folks at Raindance to learn about the progress they have been making. Looking promising! \n The poster session was packed, which was a great sign given the fabulous weather and temptation to head to the beach. \n That's all for now. Another update to follow. \n Dean \n \n  \n \n  Tags: \n  \n   AGBT \n   Clinical Sequencing \n  \n \n  Posted in: \n  \n   Conferences"], "link": "http://www.edgebio.com/agbt-update-1-clinical-sequencing-focus", "bloglinks": {}, "links": {"http://www.edgebio.com/": 2, "http://www.edgebio.com/blog": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["I am currently writing from 30,000 feet as I make my annual pilgrimage to the AGBT conference in Marco Island, FL. I am fortunate in that I have been a regular attendee of this conference and have lived with it through its growth from tiny little rival conference (in the eyes of the very large GSAC meetings of the day) to a conference that now sold out within three minutes of opening their registration! Much has happened during that time, the announcement of the “completion” of the draft of the Human genome, the corresponding lull that followed and then the renewed excitement that 454 brought with the first next-gen sequencer. \n This year, I find myself more excited than ever. Not because we get to hear publicly about the Oxford Nanopore instrument, or if Pacific Biosciences will still be shooting off fireworks over the ocean, but because there are several talks scheduled that plan to illustrate how these new technologies are making an impact in the care and treatment of patients. While learning about the incredible research and development that goes into making an Illumina HiSeq or an Ion Torrent Personal Genome Machine is fascinating, it was always with the slant of how will this affect patient care? \n Well, from a look at the speaker schedule ( AGENDA ) it looks like we are going to learn quite a bit. Some particular talks I look forward to are those by Joe Boland on exome sequencing with the Personal Genome Machine, Oxford Nanopore’s discussion of their progress and Sam Levy’s talk on interrogating tumor-normal pairs with Illumina and Ion Torrent sequencing. (Full disclosure, Dr. Levy worked with EdgeBio to generate the Ion Torrent data so I am a bit biased here – but still really excited to hear his talk!) \n AGBT also distinguishes itself through the atmosphere that is felt throughout the conference. Rita Dunton from G Corp is the Organizer, who has heard from me much unsolicited and solicited advice on how to improve the conference over the years. While we have certainly disagreed on certain things, I have to say that Rita puts on the best conference I have attended in all my years in this industry. She will tell you that it was only possible due to her amazing staff and the sponsors and attendees but I say that it is Rita who has really made this a stand-out event. Rita, keep up the great work! \n This week I am going to try and tweet from certain talks, provided it is allowed, not just a regurgitation of what is being said, but what I think could be important take home points or what it could mean in the future. I am not a prolific tweeter by any means so the tweets could range from inane to undecipherable to just plain awful. My goal is for one tweet that makes people think and look for more information about a topic. Modest but realistic. \n So stay tuned. And if you are reading this and attending the conference, check out our Twitter account and see if you can find Adam at #WhereisAB through his series of tweets and Touts for some fun from EdgeBio. \n Cheers, \n Dean \n \n \n \n  \n \n  Tags: \n  \n   AGBT \n   bioinformatics \n   Ion Torrent \n  \n \n  Posted in: \n  \n   Conferences"], "link": "http://www.edgebio.com/agbt-marco-island-never-gets-old", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://www.tout.com/": 1, "http://www.edgebio.com/": 3, "http://agbt.org/": 1, "http://www.edgebio.com/blog": 1, "http://twitter.com/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["By now you have heard that Roche has submitted a hostile takeover bid for Illumina to the tune of over $5 billion USD. If you have not you can read about the particulars here . \n \n \n   \n   \n   \n   \n Early speculation has it that this will turbocharge the effort to have DNA sequencing used routinely in the clinic given Roche’s distribution channels and partners in diagnostics. My question is, \"Are the clinics, and the clinicians, ready for this very powerful tool to arrive on their doorstep?\" Clearly it would take at least a year for Roche to fully digest the acquisition but they already have been making inroads via their 454 instrument. Having a platform like the MiSeq would only hasten their ability to deliver a truly robust system to the diagnostic marketplace. \n To be sure, it is a very smart play for Roche given Illumina’s proven technology and depressed stock price relative to where it was only six short months ago. It also seems to make sense for Illumina on the surface as they most assuredly want to bring their technology to the clinic. With Life Technologies announcing the new Proton machine form Ion Torrent (which you can read about in our previous blog here ) they needed to find a partner to help them beat Life to this lucrative market. While Life has better distribution channels than Illumina in this segment, there is no doubt Roche is superior to both companies in this space. The only question now seems to be at which price will this deal ultimately happen. \n What does this mean for the consumer? For the research consumer it likely will mean higher prices down the line, as Ion Torrent customers have seen from Life as it looks to pay off its $650 million acquisition of Ion Torrent. For the healthcare consumer, it could be a blessing. I stated before that for it to really gain traction in medical practice the issue of reimbursement needs to be addressed. I am hopeful that Roche’s long-standing partnerships in diagnostics will be useful in getting insurance companies to understand the benefits of DNA sequencing and how it will ultimately lead to reduced healthcare costs over the lifetime of an insured patient. If this were to happen, all of us stand to gain. \n For now it’s wait-and-see on this proposed acquisition. If it goes through, and I believe it will at some point, like all mergers there will be winners and losers. I just hope that one of the winners will be those who can benefit from the power of DNA sequencing in the clinic. \n Dean Gaalaas \n \n  \n \n  Tags: \n  \n   dna sequencing \n   illumina \n   Roche \n  \n \n  Posted in: \n  \n   Business \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/roche-illumina-and-clinic", "bloglinks": {}, "links": {"http://dealbook.nytimes.com/": 1, "http://www.edgebio.com/": 4, "http://www.edgebio.com/blog": 2}, "blogtitle": "EdgeBio blogs"}, {"content": ["So much for a slow journey, huh? I leave the office for a day and I miss the announcement of the improvements to Illumina’s two DNA sequencing instruments, the HiSeq and the MiSeq. In case you missed it, you can learn more here . Now it seems we have a choice of platform, should we want our whole genomes in one day, either the HiSeq® 2500 or the ion torrent Proton machine, which we covered in our previous blog post . \n \n The cool thing about the HiSeq 2500 is that it will have dual running modes. Want a genome in a day? Switch to a mode that will deliver 120 Gb of data in 27 hours, roughly equivalent to a human whole genome at 40X coverage. Need more data? Switch to a second mode and generate 600 Gb of data over approximately 11 days. \n \n \n My first question is, if you can generate 120 Gb of data in 27 hours, why does it take roughly 11 days to generate 600 Gb of data? We will certainly be in touch with Illumina representatives about this one. The next question is price: Will it cost the same on a per Gb basis to generate 120 Gb of data in 27 hours as it does to generate 600 Gb over 11 days? \n Enough about specs, I see something on the horizon that could have a great impact in clinical sequencing. There is a lot of talk about systematic bias in platforms and getting data verified using another platform to supply “orthogonal validation”. The news from both Life Technologies and Illumina seems to address his need. We have been clamoring for a human genome in a day for $1,000. When this happens, rapid adoption of the technique will be seen in clinical settings. Well, what if you could get your genome sequenced in a day on two fundamentally different platforms for $2,000? The power to do this seems well worth the extra $1,000, doesn’t it? \n Life Technologies has already stated their goal of a Human genome in a day for $1,000 by the end of the year. Illumina has just announced the ability to sequence a genome in 27 hours. Let’s hope they follow suit and make the cost $1,000. If this happens, both would be worthy contestants to participate in the Archon Genomics X Prize presented by Medco http://genomics.xprize.org/ . It would also revolutionize the way we look at genomes. \n As always stay tuned to this blog for updates. We will get our hands on a HiSeq2500 as soon as the upgrade becomes available for our HiSeq2000. According to Illumina that should be sometime in the second half of the year. Be on the lookout for more information. The minute we start generating data, you will see it here. \n Dean Gaalaas \n President/CEO \n \n  \n \n  Tags: \n  \n   Hiseq 2000 \n   Hiseq 2500 \n   illumina \n   MiSeq \n  \n \n  Posted in: \n  \n   Business \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/perspective-hiseq2500", "bloglinks": {}, "links": {"http://www.businesswire.com/": 1, "http://www.edgebio.com/": 5, "http://www.edgebio.com/blog": 2, "http://genomics.xprize.org/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["Word came out last night about the launch of a new sequencing platform from Life Technologies, the Ion Proton Machine. There are articles from Forbes , Financial Times , and Life Technologies discussing the announcement of this technology. \n \n\t Ion Proton Machine \n \n If you are a fan of this blog you know that EdgeBio has been an early adopter of the Ion Torrent technology and has walked it through its development curve with rapid and sometimes even surprising success ( Ion Torrent Retrospective ). What has most people excited is the rapid turn-around time and the price to generate sequence. Pathogenomics documents this information in their blog. \n One of the main advancements in the Ion Proton is the increase in total number of sensors per chip.  Currently a 318 PGM chip contains 11.3 million sensors.  The new Proton I chip will extend this to 165 million sensors and eventually the Proton II chip will have 660 million.  With more data comes a need for more powerful data processing and analysis software.  With their quarterly updates to the Torrent Server and dedication to open source tools and technology we are confident both Ion Torrent and the community will meet these steep data processing needs. \n \n\t Larger Proton Chip \n \n If the Ion Proton delivers on its promise, Life Technologies should be hailed for bringing sequencing to the masses faster than anyone dared hope. However, there are some hurdles that remain, such as a looming decision from the FDA as to whether or not they will choose to regulate Next-Gen Sequencing Platforms for use in Clinical Diagnostics. Many are concerned that should the FDA choose to regulate and operate in a manner that is consistent with their history, that the discovery power of whole genome sequencing will be severely limited. There is also a need for clinicians and medical doctors to be educated on the power, and limitations, of incorporating sequencing data into their diagnosis and recommendations for treatment . \n Some thought came about with the arrival of the Illumina HiSeq2000, that the development of sequencing machines may have entered a downturn, given that platform’s utter dominance in market share, eerily similar to when Applied Biosystems dominated market share with their 3730 platform and the lull in development of sequencing technology until the announcement of the initial 454 platform. The good news is that the announcement of the Ion Proton means that sequencers are being developed more rapidly and the ultimate winner will be the advancement of science. We here at EdgeBio are constantly excited that we have an opportunity to be at the forefront of this amazing time. We preach patience, although very promising, as this new platform will have to be vetted and tested under production level workloads. Rest assured that we here at EdgeBio will have one of these machines as soon as possible and the minute we start generating data we will share our experiences here through our blog. \n Stay tuned to what is sure to be the next step (and certainly not the last) in this journey that has been dubbed “The Genomic Revolution”. \n \n  \n \n  Tags: \n  \n   Ion Proton \n   Ion Torrent \n   ngs \n   PGM \n  \n \n  Posted in: \n  \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/ion-proton-intensifies-competition-benchtop-sequencing", "bloglinks": {}, "links": {"http://www.forbes.com/": 1, "http://www.edgebio.com/": 5, "http://www.edgebio.com/blog": 1, "http://www.genomeweb.com/": 1, "http://www.ft.com/": 1, "http://pathogenomics.ac.uk/blog": 1, "http://www.lifetechnologies.com/": 1, "http://www.cap.org/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["We’ve come a long way in 6 short months.  The beginning of a new year is a great time for retrospectives.  Keith Robison over at Omics! Omics! has done just that with his “ Reflecting on a Year of Ion Torrent ”.  I want to do something similar, but will use this opportunity to revisit one of our first Ion posts and draw some comparisons. \n I came across one of the original posts in our Ion series “ Ion v. MiSeq – Is There a Competition, And If So, Why? ”  I will stay away from the Miseq v. Ion debate in this post.  Rather, I would like to highlight the growth of the platform in throughput, quality, cost and usability.  I may even do a little bit of looking forward…though Keith has done sufficient prognostication - I would just be reiterating. \n \n\tThroughput \n In May/June we had run a 314 chip of E. coli that clocked in at a whopping 24Mb.  At the time, Ion had just released some internal data they generated amounting to 175 Mb raw sequence data.  As you can see now, we are routinely generating over 250 Mb of data, “ EdgeBio Posts 414.31MB Ion Torrent Run ” But, you say, “Anyone can generate massive amounts of data…Is it correct?”  This run is 372.97 Mb of Q20 data and 335 Mb of PERFECT data when comparing back to a known reference.  With this increased throughput, and the introduction of barcode sets this summer, we continue to build out a flexible offering on the system for our clients. \n \n\tQuality \n 6 to 9 months ago our quality histograms looked like this:  \n \n Now they look like this: \n \n The run is holding its quality longer and the high quality data is higher quality than before.  With higher quality, comes high accuracy in calling variants.  You can check out some detailed information of us picking apart the Ion and Miseq in our post “ Variant Calling on Ion Torrent Data ”. \n \n\tRead Length \n One can also see the evolution of the read length from these graphics.  From 100 to 200 to 300.  Our latest runs are looking even better.  Here is a Read Length histogram from a human sample we sequenced a couple days ago. \n \n In June we compared the ability of the Miseq and the Ion to perform de novo assembly of a microbial genome.  It was obvious that the MiSeq was producing a higher quality assembly compared to the Ion.  The N50 contig length was almost double (50K v. 98K), with a maximum contig size of 232K for Miseq and 211K for Ion.  Our latest run, still with no paired end data and still at 100bp, generated N50s of 85K and a largest contig size of 247K with an average consensus quality of 62. \n \n\tCost \n 6 months ago a run at EdgeBio of a 314 chip cost $2500 for ~25Mb of sequence.  That a buck for every 10,000 bases.  Now we charge $2350 for a 316 chip (the 314 is discounted to $1550) and generate on average 250Mb.  That’s a buck every 106,000 bases.  So, for the same price, we have doubled the assembly metrics in de Novo assemblies above. All done in less than 7-10 business days.  For more detailed service pricing, please see our Ion Torrent Website . \n \n\tExtensibility and Usability \n Everyone knows, or should, that it’s not reagents or machines that are expensive over the long haul - it's people.  Ion has introduced time saving mechanisms in both the lab and on the informatics side.  The One Touch has cut down our preps times, and the introduction of the Torrent Suite of Software right from the initial launch of the platform have saved us cold, hard cash.  With the open architecture of the Torrent Suite and Server, we have been able to quickly integrate plug-ins such as FastQC , SnpEff , MIRA , etc to quickly QC, analyze and assemble our data.  No other new machine in my 10 years of working in this field has so simply just worked – straight out of the box. \n We have had our issues, and the platform isn’t perfect.  We understand the limitations of the system in terms of cost per base, homopolymer accuracy, etc – but understanding the limitation allows you to make smart decisions on how and when to use the platform or an alternative.  Something a service provider SHOULD be expert at.  I know that past performance doesn’t guarantee future success, but as we have seen the trajectory of the machine, we are confident that we will continue to use and push this machine as much as we have over the past 6 months – 300 runs to date… \n \n\tNow/Future \n We have recently been validating the long read chemistry further, have done our first 2 Ampliseq Cancer panel runs, are gearing up to validate the mate pair protocol, and are piloting the 318 Chips.  Look for a few blog posts over the coming weeks about the mate pair data, our custom SnpEff plug-in,  and our progress with capture and 318 chips (maybe Exomes you say???) \n Very exciting time around Edge, and we look forward to what 2012 may bring. \n \n  \n \n  Tags: \n  \n   ampliseq \n   Ion Torrent \n   retrospective \n  \n \n  Posted in: \n  \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/ion-torrent-retrospective-2011", "bloglinks": {}, "links": {"http://chevreux.org/": 1, "http://www.edgebio.com/": 7, "http://www.ac.uk/": 1, "http://www.edgebio.com/blog": 1, "http://omicsomics.blogspot.com/": 1, "http://snpeff.sourceforge.net/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["In November Ion Torrent announced the “ Torrent Suite Plugin Development Challenge ” to invite Ion Torrent users to show their programming skills and provide additional functionality for the Torrent Server.   I’d like to take you through our submission to the contest, a plugin that predicts variant effects and annotates vcf files through the snpEff tool. \n Predicting variant effects is an important part of an analysis pipeline. By annotating variants it is possible to quickly identify and separate variants based on the predicted effect they will have on associated genes. If an identified variant will result in a gain or loss of a stop codon this variant will likely have a 'high' effect on the gene in which it is located. Conversely, if a variant occurs in an intergenic region or causes a synomous codon change, this variant would have a lower predicted effect. \n \n\t \n Effects by Type and Region from snpEff \n \n We chose snpEff as an ideal candidate with which to create a plugin because it outputs an annotated vcf file and an html formatted report. Since both the Germ-line Variant Caller and the AmpliSeq Variant Caller produce vcf files, the plugin can simply check for the existance of these vcf files, and create snpEff reports and annotated vcf files for each complete analysis that will show up seamlessly at the end of any report. \n Because of the open nature of the Ion Torrent code and pipeline, creating plugins for the Ion is actually pretty straightforward for people with some shell scripting experience.  Essentially a Torrent Suite plugin is a shell script preloaded with some useful variables (results directory, fastq file path, etc) that is submitted to the SGE on the Torrent Server after the analysis pipeline is complete.  Plugins can either be started automatically after each analysis or be started manually by a user.  Additionally, plugins can take in user input through a html popup before the plugin executes, although I haven’t experimented with this quite yet.  More information about plugin development is available on the Ion Community here . \n One slight inconvenience with the plugin architecture is there is no direct way to run plugins in a specific order.  For example since we want to utilize the results of the Germ-line Variant Caller and AmpliSeq Variant Caller in this downstream analysis, these plugins have to complete before the snpEff plugin can be run.  Because plugins can utilize the Torrent Suite API to check the status of other plugins, it is possible to check whether not other plugins are in the \"Completed\" state and it's even possible to call a plugin again if other plugins aren't complete. \n Our snpEff plugin first checks that the Germ-line Variant Caller and the AmpliSeq Variant Caller have been run and are in the “Completed” state, and outputs annotated vcf files for the plugins and html reports for each vcf file. If a plugin has been run but is not in the \"Completed\" state, or if the plugin was not run, the plugin will skip this analysis. If this occurs simply run the snpEff plugin again after the other plugins are listed as \"Completed\". For each vcf file run through the plugin a bgzipped vcf file, a tabix index of that vcf file, and a snpEff html report.  We ran the plugin on the long read data we released this week and the results are below: \n To access these links use the username 'edgecommunity' and leave the password blank \n Germ-line Variant Caller Annotated Variants (VCF) \n Germ-line Variant Caller Annotated Variants Index (TBI) \n Germ-lineVariantCaller_summary.html \n The plugin currently only supports vcf files from runs aligned to the ‘hg19’ reference and does not support barcoded runs, though we may add these features in the future.  Additionally the plugin has only been tested on Torrent Suite 1.5.1, so we can't guarantee that it will work with previous versions of the Torrent Suite. \n The plugin is available on the Ion Torrent Community for anyone to download and test here .  Please let me know if you find the plugin useful and are able to successfully install and run it.  Additionally if you like the plugin you can vote for it to win the Plugin Development Challenge. \n \n  \n \n  Tags: \n  \n   Ion Torrent \n  \n \n  Posted in: \n  \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/snpeff-plugin-ion-torrent-plugin-development-challenge", "bloglinks": {}, "links": {"http://www.1000genomes.org/": 1, "http://www.edgebio.com/": 2, "http://www.edgebio.com/blog": 2, "https://data.edgebio.com/": 3, "http://lifetech-it.jivesoftware.com/": 4, "http://snpeff.sourceforge.net/": 1}, "blogtitle": "EdgeBio blogs"}, {"content": ["EdgeBio is committed to testing and validating the latest technologies from Ion Torrent to provide the latest sequencing services to our clients as soon as possible. Recently we successfully performed some pilot runs using the new long read chemistry. Although we haven't yet achieved the high loading we used to achieve with short read chemistry, we are pleased with the run quality and throughput from our pilot runs and want to share some of the data with the community. \n Many of the sequencing runs released so far from Ion Torrent (with the exception of two new HuRef 318 chip datasets available here ) have been resequencing of DH10B. While E. coli is a good organism for validation and testing, we see human sequencing as the main Ion Torrent application for us in the future. For this reason we typically run both DH10B and hg19 pilot runs when testing new technology. The run we are releasing today is shotgun resequencing of Craig Venter HuRef DNA. While the mean coverage depth and percent coverage are quite low and aren't really useful for variant calling, the high throughput of AQ20 data from this run shows the Ion's potential for targeted human resequencing. \n Per base predicted sequence quality (from FastQC ) is similar to previous short read chemistry runs analyzed with Torrent Suite 1.5.1, with average predicted quality staying above Q20 until about base 75. \n  \n Another metric we like to track is homopolymer start positions across reads. If reads are randomly sampled from the genome, a uniform percentage of 1-mers, 2-mers, ... n-mers should start at each position across all reads. Using a script from http://flxlexblog.wordpress.com/ I created the following graph for this data. \n  \n Homopolymer enrichment stays consistent out to around 250bp. After that 2-mers and larger homopolymers begin to appear more than we would expect. This 250bp of nice uniform sequencing is really promising. A longer quality portion of the read means better mapping, better assemblies, and less homopolymer miscalls.  We invite the community to download, test, and experiment with this new dataset.  Let us know what you find. \n To access the run report, click the following link: \n Auto_2EB-53-0118001C3A_Craig_IonPlus_Pilot_185_228 \n Use the username 'edgecommunity' and leave the password field blank.  The data can also be downloaded via sftp at data.edgebio.com over port 22 using the same username. \n You can also download a PDF of the report here: \n Auto_2EB-53-0118001C3A_Craig_IonPlus_Pilot_185_228.pdf \n \n  \n \n  Tags: \n  \n   Ion Torrent \n  \n \n  Posted in: \n  \n   Next Gen Sequencing"], "link": "http://www.edgebio.com/ion-torrent-long-read-pilot-projects", "bloglinks": {}, "links": {"https://data.edgebio.com/": 1, "http://www.edgebio.com/": 2, "http://www.edgebio.com/blog": 4, "http://www.ac.uk/": 1, "http://flxlexblog.wordpress.com/": 1, "http://lifetech-it.jivesoftware.com/": 1}, "blogtitle": "EdgeBio blogs"}]