[{"blogurl": "http://blogs.forbes.com/naomirobbins\n", "blogroll": ["\n"], "title": "Effective Graphs"}, {"content": ["This week is NYC Data Week , co-produced by the City of New York‘s Department of Information Technology & Telecommunications ( DoITT ) and O’Reilly Media’s Strata + Hadoop World Conference . Multiple events will be held every day this week. Those of you in the greater New York City area may want to attend some of them. Most are free. Wherever you live or work, you can watch live streams of the keynote presentations at the O’Reilly Strata + Hadoop World Conference. Readers of this blog should note that there is a visualization track . \n The schedule for the live video sessions lists the sessions that will be live streamed. They are not-to-be-missed if they are anything like the sessions I’ve heard at previous Strata conferences. \n I’ll be presenting a tutorial, Communicating Data Clearly , at the conference on Tuesday morning and moderating a panel, Data Visualization: Statistical Graphics or Data Art , on Wednesday afternoon. Jon Peltier will represent statistical graphics and Nigel Holmes will represent data art. My problem the rest of the week will be deciding which of the many interesting and exciting sessions and events to attend."], "link": "http://www.forbes.com/sites/naomirobbins/2012/10/22/nyc-data-week/", "bloglinks": {}, "links": {"http://strataconf.com/": 5, "http://peltiertech.com/": 1, "http://www.nigelholmes.com/": 1, "http://oreilly.com/": 1, "http://www.nyc.gov/": 1}, "blogtitle": "Effective Graphs"}, {"content": ["Thanks to Jason Oberholtzer (@ilovecharts) for tweeting about the following graph from the Boston Metro . His tweet just said, “Ugly polls.” \n  Figure 1. Source: http://ilovecharts.tumblr.com/post/33308788744/from-the-boston-metro-oct-10th-hannabeth-well \n How many problems do you see with this figure? \n As a starter, donut charts do not communicate very well. However, that is minor next to the fact that the segments of a donut must add to 100%. This is clearly the wrong chart for the data. If that’s not enough, it is not drawn to scale. I don’t trust my eyes to judge this since I know that dark colors appear smaller than lighter colors. Therefore, to check my assertion, take out your rulers and measure. \n Here is the same data in a simple bar chart. The default in Microsoft Excel did not use a zero baseline for the bars so I needed to edit the figure. \n  Figure 2. The data from Figure 1 is redrawn more accurately. \n Let’s demand more from our news sources."], "link": "http://www.forbes.com/sites/naomirobbins/2012/10/16/conflicting-polls-in-a-flawed-graph/", "bloglinks": {}, "links": {"http://blogs-images.forbes.com/": 2, "https://twitter.com/": 1, "http://www.metro.us/": 1}, "blogtitle": "Effective Graphs"}, {"content": ["Pictographs or unit charts use pictures or symbols to represent the quantities of the variables shown. Figure 1 shows an example. This post shows the disagreement of two graph experts, Gregor Aisch and Stephen Few , on the usefulness of pictographs. \n  Figure 1. An example of a pictograph Source: http://www.icoachmath.com/math_dictionary/pictograph.html \n \n In his recently published, excellent book The Functional Art , Alberto Cairo interviews Gregor Aisch. Cairo asked Aisch, “Among the people you admire, who would you say have influenced you the most, and why? \n Here is part of the reply: \n “I admire the work of Otto Neurath .” …. “Neurath’s work exemplified the power of natural visual metaphors. A plain bar chart, praised a lot for its efficiency in communicating numbers, also has the potential of scaring people away because it’s also a very abstract representation. We should be aware that some people are not able to connect emotionally to highly efficient charts, but do feel attracted to, and understand, displays that include little pictograms, icons, and illustrations. Fun can promote learning.” \n In “ Unit Charts are for Kids ,” Stephen Few points out that unit charts usually require counting while we compare lengths, a much easier task, with bar charts. Comparing lengths is an immediate, pre-attentive task while counting is a slower, sequential task. The article includes a number of poorly designed unit charts with alternatives that are more easily understood. \n With which of these opinions do you agree? Does it depend on the audience? Is Gregor Aisch underestimating the graphical literacy of readers? Use the comment section to share your response."], "link": "http://www.forbes.com/sites/naomirobbins/2012/10/10/two-opinions-on-the-usefulness-of-pictographs/", "bloglinks": {}, "links": {"http://www.thefunctionalart.com/": 1, "http://www.perceptualedge.com": 1, "http://www.icoachmath.com/": 1, "http://okfn.org/": 1, "http://blogs-images.forbes.com/": 1, "http://www.amazon.com/": 1, "http://www.perceptualedge.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Effective Graphs"}, {"content": ["Good Magazine along with Other Means published an interactive graphic discussing if America can be energy independent. A static view of it appears in Figure 1. Immediately you’ll notice that the labels for “Natural Gas,” “Nuclear,” and “Renewable” extend beyond the heights of the bars.  Not only is this design unattractive, but it interferes with our ability to correctly estimate the heights of the bars:  the longer words make the bars appear taller than they really are. \n  Figure 1. Source: http://www.good.is/posts/interactive-infographic-can-america-be-energy-independent/ \n The solution is simple: interchange the axes to use a horizontal bar chart rather than a vertical bar or column chart. Figure 2 suggests what this change would look like, ignoring the interactivity and other design features of the original. \n  Figure 2. Same data as Figure 1 in a horizontal bar chart Click to enlarge \n The horizontal bar chart separates the labels from the bars so that long labels with short bars are no longer a problem. It lets us read the labels from left to right rather than sideways. It is easier to compare the lengths of the bars without the distraction of the labels. I do not mean to suggest that one use a static figure with Excel default colors. Rather, I am illustrating my suggested change and leaving it to the graph designers to add the interactivity and colors of their choice."], "link": "http://www.forbes.com/sites/naomirobbins/2012/10/02/when-swapping-axes-improves-graph-design/", "bloglinks": {}, "links": {"http://www.good.is/": 2, "http://www.othermeans.us/": 1, "http://blogs-images.forbes.com/": 2}, "blogtitle": "Effective Graphs"}, {"content": ["Many people don’t realize that almost ten percent of the male population has some form of color vision deficiency . As a result, graph designers and software vendors regularly produce figures with colors that are difficult for color vision deficits to distinguish. A number of authors write that this problem can be eliminated by merely avoiding red and green. Even though the most common form of deficiency is red-green, red and green are not the only color combinations that cause problems. \n Color vision simulators allow graph designers with normal vision to envision what people with color vision deficiencies perceive.  (Color vision simulators will be discussed more in-depth in a future post.) Lately I have seen more and more figures that use orange and green. Using vischeck for the simulations, we see that this combination is just as problematic as the more well-known red/green combination. \n  Figure 1. Source: http://blogs.sap.com/wp-content/blogs.dir/2/files/2012/01/image2.jpg Click to enlarge. \n \n \n \n  Figure 2. Deuteranope simulation of Figure 1. Click to enlarge. \n \n \n \n Figures 1 and 3 are examples of a current trend in coloring figures: using orange and green. Figures 2 and 4 show simulations of how deuteranope s, readers with a common form of color vision deficiency, see these figures. \n  Figure 3. Source: http://www.significancemagazine.org/details/webexclusive/2527531/Show-me-the-money-Inequality-in-incomes-and-wealth.html \n  Figure 4. Deuteranope simulation of Figure 2. \n Red and green do cause problems, especially if they have similar levels of lightness and saturation. We just saw that orange and green are also difficult to distinguish for those with a common form of color vision deficiency. Other combinations may cause problems as well. I recommend using a color vision simulator to make sure that figures are accessible to as large an audience as possible."], "link": "http://www.forbes.com/sites/naomirobbins/2012/09/25/choosing-colors-for-graphs-that-are-accessible-to-most-viewers/", "bloglinks": {}, "links": {"http://blogs-images.forbes.com/": 4, "http://www.vischeck.com": 1, "http://www.aoa.org/": 1, "http://www.colblindor.com/": 1}, "blogtitle": "Effective Graphs"}, {"content": ["Often we see groups of charts in which the individual charts are fine but the group misleads. In other cases, the individual charts have problems and the groupings make matters worse. The problem with the groups might be inconsistent colors, scales, order or other graphical elements. \n In Figure 1 the meanings of the colors in the map and the accompanying pie chart are not consistent. A reader looking at the map will see that black is used for Kentucky. The reader might assume that the black on the pie chart refers to Kentucky without reading the labels carefully. However, the black on the pie chart refers to Piedmont. Consistency of color is important in groups of graphs. \n \n  Figure 1. Inconsistent use of color. Source: Tobacco and the Economy, Gale, Foreman, and Capehart, Agriculture Economic Report No.789, September 2000. Click to enlarge. \n The graphs in Figure 2 were discussed in Bill Clinton’s Speech in Misleading Graphs as examples of misleading bar graphs without a zero baseline. Another problem with these figures is that the scales are not the same. A reader might compare the heights of the bars in the two figures without noticing that the scales differ. \n  Figure 2. Inconsistent scales. Source: http://www.washingtonpost.com/blogs/ezra-klein/wp/2012/09/06/bill-clintons-speech-in-graphs/ Click to enlarge. \n In Figure 3 both the revenues and the profits of these Fortune 500 companies are ordered by size. The reader might read the labels of one of the charts and assume that the order of the other is the same. This is a case where two principles of effective graphs contradict one another. The first principle is that alphabetical ordering is rarely best and that ordering by size is often more informative. The second is that groups of charts need consistent ordering. My advice when two principles conflict is to choose the principle that is least likely to confuse or mislead the reader. In this case I suggest ordering one of the variables by size and using the same ordering for the other. In this case I would order revenue by size and use the revenue ordering for profits as well. \n  \n  Figure 3. Inconsistent order. Note that the scales of the revenue plot and the profit plot differ since the range of their values is so different. Click to enlarge. \n In the preceding example we said that scales must be consistent and here they are not. There are times when the range of values in each of the charts makes consistent scales impractical since most of the variation in one of the variables would be lost. We used the caption to call attention to the fact that the scales differ. \n When drawing charts and graphs it is important that the individual charts be clear, concise, and easy to understand. In addition, we must consider consistency in groups of charts to make sure that we do not confuse or mislead the reader."], "link": "http://www.forbes.com/sites/naomirobbins/2012/09/19/misleading-groups-of-charts/", "bloglinks": {}, "links": {"http://blogs-images.forbes.com/": 4, "http://www.forbes.com/": 1}, "blogtitle": "Effective Graphs"}, {"content": ["I discussed whether zero needs to be included on all scales in a  recent post , ending by saying, “Not including zero in the baseline is one way to exaggerate a trend for those who don’t read labels carefully.  Can you think of others?” One reader,  Aleksey Nozdryn-Plotnicki , commented that changing the dimensions of the chart can have the same effect. The aspect ratio of a graph is the ratio of the height to the width of the smallest rectangle enclosing the data, so changing the aspect ratio can change the dimensions of the chart. This post shows how we can hide variation or exaggerate trends by changing the aspect ratio. \n We use the number of stop and frisks in New York City as data for the following figures. Figure 1 shows the number of stop and frisks from 2002 to 2011 using the defaults of xyplot in the lattice package of R \n  \n \n Figure 1. The number of stop and frisks over time using the default aspect ratio of R \n \n \n A group that wants to minimize the increase of the number of stop and frisks might mislead by using a smaller aspect ratio as shown in Figure 2. \n  Figure 2. The same data as in Figure 1 is shown with an aspect ratio of 0.15. Click to enlarge. \n A group that wants to exaggerate the increase of the number of stop and frisks can accomplish this with a larger aspect ratio as shown in Figure 3. \n  Figure 3. Again, the same data is shown but this time the aspect ratio is 2.5. Click to enlarge. \n Literature about graphs includes many discussions about whether zero needs to be included on all scales. We just demonstrated that a graph designer can mislead just as much by changing the aspect ratio. The minimum and maximum values are the same for all three figures above."], "link": "http://www.forbes.com/sites/naomirobbins/2012/09/12/misleading-by-changing-the-aspect-ratio-to-hide-variation-or-exaggerate-trends-in-graphs/", "bloglinks": {}, "links": {"http://blogs-images.forbes.com/": 3, "http://www.forbes.com/": 3, "http://www.r-project.org/": 1}, "blogtitle": "Effective Graphs"}, {"content": ["Sarah Kliff wrote a blog post including the length of Republican and Democratic National Convention remarks as prepared for delivery and as actually delivered. The problem is that she used misleading graphs: bar charts that don’t include zero. Here are two of her graphs: \n  Figure 1. Source: http://www.washingtonpost.com/blogs/ezra-klein/wp/2012/09/06/bill-clintons-speech-in-graphs/ \n \n  Figure 2. Source: http://www.washingtonpost.com/blogs/ezra-klein/wp/2012/09/06/bill-clintons-speech-in-graphs/ \n \n Any length begins at zero so the impression one gets by comparing truncated lengths is false. In this example it appears that President Clinton’s speech was more than three times as long as that of Michelle Obama ’s while in fact it was less than twice as long."], "link": "http://www.forbes.com/sites/naomirobbins/2012/09/06/bill-clintons-speech-in-misleading-graphs/", "bloglinks": {}, "links": {"http://blogs-images.forbes.com/": 2, "http://www.forbes.com/": 1, "http://www.washingtonpost.com/blog": 1}, "blogtitle": "Effective Graphs"}, {"content": ["My August 4 th post calls a graph from Fox News misleading since it is a bar graph with a non-zero baseline. The blog  Fallacy Files  credits my post as a source for its entry on graphs with no zero on the scale.  I take issue, however, with their title.  The post is entitled “A ‘Gee-Whiz’ Graph,” borrowing a term coined by Darrell Huff in his classic little book How to Lie with Statistics .  The problem is that Huff’s “Gee-Whiz Graph”–a graph that deceives since it’s missing zero on the scale–is generally a line graph, such as in Figures 1 and 2 below, but the graph from Fox News was a bar graph.  This may seem like a minor point, but it is in fact quite significant.  I disagree with Huff that all graphs require a zero baseline; line graphs do not always require one.  (I should mention here that with the exception of the Gee-Whiz chapter, I am in fact a big fan of most of Huff’s book!) \n  Figure 1. Source: Chapter 5 of How to Lie with Statistics by Darrell Huff Click to enlarge \n  Figure 2. Source: Chapter 5 of How to Lie with Statistics by Darrell Huff Click to enlarge \n \n \n \n Why am I saying that the Fox News’ graph requires a zero baseline but the Huff graphs do not? The Fox News’ graph is a bar graph while these graphs from Huff are line graphs. We judge the value of a bar by its length. Any length begins at zero. We judge the value of a point on a line by its position along a scale. This judgment does not depend on zero. Even if you think you judge a bar graph by the position of the top of the bar, you cannot help but see the length of the bar. \n Most other graph experts I respect also disagree with Huff on this point. In The Elements of Graphing Data, William S. Cleveland calls the graphs with zero in these figures “a waste of space that shows very little quantitative information beyond what could be conveyed in one sentence.” In Edward Tufte’s one day course on Information Design that I attended, Tufte said “Darrell Huff was wrong.” Note that the graphs with zero hide the varying rates of change in these figures, something that may be important for some audiences to know. My position is that whether zero needs to be included on graphs in which we judge position depends on the audience. For educated audiences who can be expected to read tick labels, zero is not needed. Some graphs for the general public might be misinterpreted without zero. \n Not including zero in the baseline is one way to exaggerate a trend for those who don’t read labels carefully.  Can you think of others? That will be the topic of my next post."], "link": "http://www.forbes.com/sites/naomirobbins/2012/08/28/must-zero-be-included-on-scales-of-graphs-another-look-at-fox-news-graph-and-huffs-gee-whiz-graph/", "bloglinks": {}, "links": {"http://blogs-images.forbes.com/": 2, "http://www.forbes.com/": 1, "http://www.fallacyfiles.org/": 1}, "blogtitle": "Effective Graphs"}, {"content": ["A group of statistical bloggers had lunch together at the Joint Statistical Meetings in San Diego. I’ll post links to their blogs for those of you interested in resources in statistics. The luncheon was organized and led by Rick Wicklin. \n Two of the bloggers discuss statistical software. David Smith of Revolution Analytics posts daily on topics of interest to R users at blog.revolutionanalytics.com .  Rick Wicklin of SAS posts about topics in statistical computing, statistical programming, and data analysis. His blog is at http://blogs.sas.com/content/iml/author/rickwicklin/ . Both David and Rick include graphics in their topics. Both have large followings and are very respected. I was aware of their blogs before JSM. \n I learned of the following blogs at the luncheon. \n Yossi Levy’s blog, www.sci-princess.info , is written in Hebrew. However, he tells us he’s planning to write a stat blog in English soon. \n Patricia English is one of a number of bloggers at http://thinksciencenow.com . She discusses clinical trials and drugs. \n John Johnson, blogger at http://realizationsinbiostatistics.blogspot.com/ , writes about a variety of topics in statistics and biostatistics."], "link": "http://www.forbes.com/sites/naomirobbins/2012/08/22/some-useful-statistical-blogs/", "bloglinks": {}, "links": {"http://thinksciencenow.com/": 1, "http://blog.revolutionanalytics.com/": 1, "http://www.sci-princess.info/": 1, "http://realizationsinbiostatistics.blogspot.com/": 1, "http://blogs.sas.com/": 1}, "blogtitle": "Effective Graphs"}]