[{"blogurl": "http://electronsandholes.blogspot.com\n", "blogroll": [], "title": "Electrons and holes"}, {"content": ["This blog is put on indefinite hiatus."], "link": "http://electronsandholes.blogspot.com/feeds/2034198480271218831/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Electrons and holes"}, {"content": ["At Xconomy: SiOnyx Closes $12.5M from Bay Area and Seattle Firms, Goes After Camera Phone Market"], "link": "http://electronsandholes.blogspot.com/feeds/7477363094752747402/comments/default", "bloglinks": {}, "links": {"http://www.xconomy.com/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["The blog will not be updated the coming two weeks due to absence of its owner."], "link": "http://electronsandholes.blogspot.com/feeds/3373987021846278211/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Electrons and holes"}, {"content": ["A few recent papers (some of them open access). First, via Austin's imaging blog , a history of confocal microscopy at Biotechniques.com . At NanoLetters: \" Very Black Infrared Detector from Vertically Aligned Carbon Nanotubes and Electric-Field Poling of Lithium Tantalate \". From the abstract: Vertically aligned multiwall carbon nanotubes were grown by water-assisted chemical vapor deposition on a large-area lithium tantalate pyroelectric detector. The processing parameters are nominally identical to those by which others have achieved the “world’s darkest substance” on a silicon substrate. The pyroelectric detector material, though a good candidate for such a coating, presents additional challenges and outcomes. After coating, a cycle of heating, electric field poling, and cooling was employed to restore the spontaneous polarization perpendicular to the detector electrodes. The detector responsivity is reported along with imaging as well as visible and infrared reflectance measurements of the detector and a silicon witness sample. We find that the detector responsivity is slightly compromised by the heat of processing and the coating properties are substrate dependent. However, it is possible to achieve nearly ideal values of detector reflectance uniformly less than 0.1% from 400 nm to 4 μm and less than 1% from 4 to 14 μm. And finally, seen at Nature Photonics , an open access paper at the Virtual Journal for Biomedical Optics: \" Wavefront image sensor chip \". The abstract reads: We report the implementation of an image sensor chip, termed wavefront image sensor chip (WIS), that can measure both intensity/amplitude and phase front variations of a light wave separately and quantitatively. By monitoring the tightly confined transmitted light spots through a circular aperture grid in a high Fresnel number regime, we can measure both intensity and phase front variations with a high sampling density (11 µm) and high sensitivity (the sensitivity of normalized phase gradient measurement is 0.1 mrad under the typical working condition). By using WIS in a standard microscope, we can collect both bright-field (transmitted light intensity) and normalized phase gradient images. Our experiments further demonstrate that the normalized phase gradient images of polystyrene microspheres, unstained and stained starfish embryos, and strongly birefringent potato starch granules are improved versions of their corresponding differential interference contrast (DIC) microscope images in that they are artifact-free and quantitative. Besides phase microscopy, WIS can benefit machine recognition, object ranging, and texture assessment for a variety of applications."], "link": "http://electronsandholes.blogspot.com/feeds/6884102580166947804/comments/default", "bloglinks": {}, "links": {"http://austinblanco.com/blog": 1, "http://www.nature.com/": 1, "http://pubs.acs.org/": 1, "http://www.opticsinfobase.org/": 1, "http://www.biotechniques.com/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["A recent paper at the open access Sensors Journal : \" Metal-Insulator-Semiconductor Photodetectors \". The abstract reads: The major radiation of the Sun can be roughly divided into three regions: ultraviolet, visible, and infrared light. Detection in these three regions is important to human beings. The metal-insulator-semiconductor photodetector, with a simpler process than the pn-junction photodetector and a lower dark current than the MSM photodetector, has been developed for light detection in these three regions. Ideal UV photodetectors with high UV-to-visible rejection ratio could be demonstrated with III-V metal-insulator-semiconductor UV photodetectors. The visible-light detection and near-infrared optical communications have been implemented with Si and Ge metal-insulator-semiconductor photodetectors. For mid- and long-wavelength infrared detection, metal-insulator-semiconductor SiGe/Si quantum dot infrared photodetectors have been developed, and the detection spectrum covers atmospheric transmission windows."], "link": "http://electronsandholes.blogspot.com/feeds/7981728511163185555/comments/default", "bloglinks": {}, "links": {"http://www.mdpi.com/": 2}, "blogtitle": "Electrons and holes"}, {"content": ["I will make an effort to overlook the issues from the previous post and point to this nice paper at Electronics Letters describing a custom transistor layout for RTS noise reduction in image sensors: \" Custom transistor layout design techniques for random telegraph signal noise reduction in CMOS image sensors \". The abstract reads: Interface and near oxide traps in small gate area MOS transistors (gate area ≪1 μm 2 ) lead to RTS noise which implies the emergence of noisy pixels in CMOS image sensors. To reduce this noise, two simple and efficient layout techniques of custom transistors have been imagined. These techniques have been successfully implemented in an image sensor test chip fabricated in a 0.35 μm CMOS image sensor process. Experimental results demonstrate a significant reduction of the noisy pixels for the two different techniques. I like that the techniques have been \"imagined\" but also measured: Inception paper? :-) One possible problem I see is that their transistors are done in a technology with LOCOS. Advanced technologies use STI, so I don't know how well the techniques translate to e.g. the latest CIS technologies by tsmc and others."], "link": "http://electronsandholes.blogspot.com/feeds/2595959107866929913/comments/default", "bloglinks": {}, "links": {"http://ieeexplore.ieee.org/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["Checking the weekly update of IEEXplore I see the following title for a paper in Electronics Letters: \" nth-order multi-bit ΣΔ ADC using SAR quantiser \". Being something I'm interested in, I follow the link to check what I think is a sigma-delta with a successive-approximation ADC as quantizer. To my excitement I read the following abstract: \"An nth-order multi-bit delta-sigma (ΣΔ) analogue-to-digital converter (ADC) using a synthetic aperture radar (SAR) quantiser is proposed. By exploiting the residue voltage of a multi-bit SAR ADC, the proposed ADC performs as an nth-order noise shaping converter with only one opamp and removes the need for a feedback multi-bit DAC. In addition, the proposed architecture is very reconfigurable and can be implemented as a bandpass ADC.\". Wow! That looks pretty cool, how do they manage to put a radar as quantizer and why don't they send it to ISSCC? :-D Of course, thinking it's a typo that will not appear in the paper itself, I click and lo and behold, the same mistake is repeated in the abstract in the paper. Of course, checking the paper it's obvious it's a successive-approximation register quantizer. Conclusion? Electronics Letters HUGE FAIL!"], "link": "http://electronsandholes.blogspot.com/feeds/8450855766746836272/comments/default", "bloglinks": {}, "links": {"http://ieeexplore.ieee.org/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["This escaped me: \" The first plenoptic camera on the market \". The technology by Adobe in the video was presented in this paper of the IEEE Computational Photography mentioned in the previous post: \" Rich image capture with plenoptic cameras \". The abstract reads: The plenoptic function was originally defined as a record of both the 3D structure of the lightfield and of its dependence on parameters such as wavelength, polarization, etc. Still, most work on these ideas has emphasized the 3D aspect of lightfield capture and manipulation, with less attention paid to other parameters. In this paper, we leverage the high resolution and flexible sampling trade-offs of the focused plenoptic camera to perform high-resolution capture of the rich “non 3D” structure of the plenoptic function. Two different techniques are presented and analyzed, using extended dynamic range photography as a particular example. The first technique simultaneously captures multiple exposures with a microlens array that has an interleaved set of different filters. The second technique places multiple filters at the main lens aperture. Experimental results validate our approach, producing 1.3Mpixel HDR images with a single capture."], "link": "http://electronsandholes.blogspot.com/feeds/6370038837031265668/comments/default", "bloglinks": {}, "links": {"http://www.petapixel.com/": 1, "http://ieeexplore.ieee.org/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["Hasselblad just announced today that they have developed a 200 Megapixel capture device (found via OISblog ). Coincidentally, yesterday the proceedings of the 2010 IEEE International Conference on Computational Photography were put on line at IEEEXplore, and among the papers there was this one by Moshe Ben-Ezra from Microsoft Research Asia: \" High resolution large format tile-scan camera: Design, calibration, and extended depth of field \". The abstract reads: Emerging applications in virtual museums, cultural heritage, and digital art preservation require very high quality and high resolution imaging of objects with fine structure, shape, and texture. To this end we propose to use large format digital photography. We analyze and resolve some of the unique challenges that are presented by digital large format photography, in particular sensor-lens mismatch and extended depth of field. Based on our analysis we have designed and built a digital tile-scan large format camera capable of acquiring high quality and high resolution images of static scenes. We also developed calibration techniques that are specific to our camera as well as a novel and simple algorithm for focal stack processing of very large images with significant magnification variations."], "link": "http://electronsandholes.blogspot.com/feeds/2099395625375222055/comments/default", "bloglinks": {}, "links": {"http://opticalimaging.org/": 1, "http://ieeexplore.ieee.org/": 2, "http://www.hasselbladusa.com/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["A news item at SPIE regarding a new instrument at Sandia National Labs: \" Radiation testing and imaging of micro-electronics \" [...] as technology advances, features in satellites and spacecraft are getting smaller and, therefore, more susceptible to radiation damage. IPEM, once fully developed and validated as a means of testing the radiation hardness of micro-electronics, will contribute to the development of new and emerging radiation-tolerant IC technologies far into the future."], "link": "http://electronsandholes.blogspot.com/feeds/5398994628267489315/comments/default", "bloglinks": {}, "links": {"http://spie.org/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["Most of us with access to it use IEEEXplore to check the latest issues of the IEEE journals. But they've also been busy uploading old issues of journals. This week, for example, they've uploaded several volumes from the late XIX century of the Transactions of the American Institute of Electrical Engineers . It is particularly interesting to see, after each paper, a written critical discussion of the contents of the paper by other experts. Why not bring this back? Worth taking a look, if you have access."], "link": "http://electronsandholes.blogspot.com/feeds/4031766800238421927/comments/default", "bloglinks": {}, "links": {"http://ieeexplore.ieee.org/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["Remember their 56GS/s ADC ? Fujitsu has announced their new version, fabricated in a 40nm CMOS technology. Here's their page with info . Here are some slides about this new version."], "link": "http://electronsandholes.blogspot.com/feeds/1095077443968628773/comments/default", "bloglinks": {}, "links": {"http://www.slideshare.net/": 1, "http://electronsandholes.blogspot.com/": 1, "http://www.fujitsu.com/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["No it's not a typo, it's affective with an \"a\". The IEEE Transactions on Affective Computing start with a very nice introductory paper by Rosalind W. Picard: I did not want to work on or be associated with emotion, yet emotion was starting to look vital for solving the hard engineering problems we needed to solve. A scientist has to find what is true, not just do what is popular. I was becoming quietly convinced that engineering dreams to build intelligent machines would never succeed without incorporating insights about emotion. I knew somebody had to educate people about the evidence I was collecting and act on it. But I did not want to risk my reputation and I was too busy. I started looking around, trying to find somebody, ideally male and established, whom I could convince to develop this topic, which clearly needed more attention than I had time for."], "link": "http://electronsandholes.blogspot.com/feeds/5245581739823116985/comments/default", "bloglinks": {}, "links": {"http://ieeexplore.ieee.org/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["Samsung reports their first BSI image sensors for consumer applications: press release . Samsung's new BSI imagers show 30 percent enhancement in low light sensitivity over conventional front side illumination imagers of the same pixel size. By optimizing process parameters, Samsung was able to efficiently control crosstalk thereby improving the color, electrical and optical performance significantly. The S5K4E5, a quarter-inch optical format 1.4 micron 5 megapixel (Mp) CMOS image sensor, is designed to support full resolution real-time video. By providing 30 frames per second (fps) full resolution frame rates it also enables the user to 'catch the shot' by capturing the frame as the user hits the shutter button thus reducing shot to shot lag time. The 5Mp imager has a wider chief ray angle that reduces the height of the imager package making it attractive for slim, small form factor smartphones with demanding z-height requirements. The S5K2N1, a 1/2.33 inch optical format 1.4 micron 14.6Mp imager, offers 30fps capability at full resolution and leverages Samsung's low-power 90 nanometer logic process technology. Samsung is able to offer a dedicated thermal enhanced plastic lead ceramic carrier (TePLCC) package to more effectively dissipate the heat generated by the high performance device. These imagers also offer the ability to capture full high definition (HD) resolution video images at 60fps. Samples of the 5Mp S5K4E5 are available now with mass production starting in the fourth quarter of this year. The 14.6Mp S5K2N1 is expected to start sampling in the fourth quarter of 2010 with production scheduled in the first quarter of 2011."], "link": "http://electronsandholes.blogspot.com/feeds/5297927746900574120/comments/default", "bloglinks": {}, "links": {"http://www.samsung.com/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["There's nothing yet at the IMS website yet, but EETimes Europe reports on a design by Fraunhofer IMS of an image sensor able to work in an extended temperature range of -40 to 115 degrees Celsius."], "link": "http://electronsandholes.blogspot.com/feeds/8688788487233755499/comments/default", "bloglinks": {}, "links": {"http://eetimes.eu/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["Although microlenses are mostly used at the \"receiving end\", in front of image sensors, they are also used (and useful) at the \"transmitting end\", in front of illuminators. This article at Photonics Spectra , from RPC Photonics, gives an introduction to this application for microlenses."], "link": "http://electronsandholes.blogspot.com/feeds/9060471778474796449/comments/default", "bloglinks": {}, "links": {"http://www.photonics.com/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["The latest issue of the IEEE Signal Processing Magazine , besides a series of interesting articles on algorithms for security video applications, includes also a good article from a research scientist at Google on machine hearing . The abstract reads: If we had machines that could hear as humans do, we would expect them to be able to easily distinguish speech from music and background noises, to pull out the speech and music parts for special treatment, to know what direction sounds are coming from, to learn which noises are typical and which are noteworthy. Hearing machines should be able to organize what they hear; learn names for recognizable objects, actions, events, places, musical styles, instruments, and speakers; and retrieve sounds by reference to those names. These machines should be able to listen and react in real time, to take appropriate action on hearing noteworthy events, to participate in ongoing activities, whether in factories, in musical performances, or in phone conversations."], "link": "http://electronsandholes.blogspot.com/feeds/4235117509520440828/comments/default", "bloglinks": {}, "links": {"http://ieeexplore.ieee.org/": 2}, "blogtitle": "Electrons and holes"}, {"content": ["A somewhat old article which I missed, found at the OISBlog , on electrically tunable lenses . As the predominant method of focusing images for over a century, mechanical lens motion sharply contradicts the biological methods found in nature. By leveraging principles based on these methods, manufacturers are now developing different types of small deformable lenses that can be tuned over various focal distances. Because these lens systems can be miniaturized relatively easily, they are finding applications in smart machine-vision cameras, endoscopy systems, and cell phones. And a review of the Canon Expo 2010 , with references to both their full wafer, 600 micron pixel and their 120Mpixel detectors. Cool stuff."], "link": "http://electronsandholes.blogspot.com/feeds/4678431628867654391/comments/default", "bloglinks": {}, "links": {"http://www.optoiq.com/": 1, "http://opticalimaging.org/": 1, "http://www.imaging-resource.com/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["From Nature Photonics, a nice overview of the applications of graphene in the field of photonics: \" Graphene photonics and optoelectronics \": The abstract reads: The richness of optical and electronic properties of graphene attracts enormous interest. Graphene has high mobility and optical transparency, in addition to flexibility, robustness and environmental stability. So far, the main focus has been on fundamental physics and electronic devices. However, we believe its true potential lies in photonics and optoelectronics, where the combination of its unique optical and electronic properties can be fully exploited, even in the absence of a bandgap, and the linear dispersion of the Dirac electrons enables ultrawideband tunability. The rise of graphene in photonics and optoelectronics is shown by several recent results, ranging from solar cells and light-emitting devices to touch screens, photodetectors and ultrafast lasers. Here we review the state-of-the-art in this emerging field."], "link": "http://electronsandholes.blogspot.com/feeds/3175904020521438894/comments/default", "bloglinks": {}, "links": {"http://www.nature.com/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["A paper at Applied Physics Letters which shows again possible advantages of plasmonics for photodetection. In this case for optical communications: \" Surface plasmon enhanced responsivity in a waveguided germanium metal-semiconductor-metal photodetector \". The abstract reads: The authors report on high transverse magnetic (TM)-mode responsivity in a waveguided germanium Schottky-barrier metal-semiconductor-metal photodetector on silicon-on-insulator substrate for operating wavelength at 1550 nm. The employed aluminum interdigitated electrodes act as a one-dimensional rectangular grating above the depletion layer. By means of properly designed finger dimensions, surface plasmon polariton resonances can be excited at the interface of metal and silicon interfacial layer due to grating coupling. The resulting strong field intensities reach into active region, enabling high absorption under TM injection. At a voltage of 1 V, the TM-mode photocurrent is measured over three times than that of transverse electric mode, in spite of the relatively larger TM insertion loss in the silicon waveguide."], "link": "http://electronsandholes.blogspot.com/feeds/2523944657803781596/comments/default", "bloglinks": {}, "links": {"http://apl.aip.org/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["Unfortunately not much time is left to prepare better entries, so I'm putting together here several topics in one blog entry. Beginning with a short (but very informative) note from Mentor Graphics on the effects of bends in transmission lines for SerDes circuits. Continuing with a series on Zigbee applications from EETimes, extracted from a book. parts one, two , three , four , five , six and seven (so far). Another series from EETimes , extracted from a book on oscillators. And yet another series extracted from a book on antennas."], "link": "http://electronsandholes.blogspot.com/feeds/5226789168903812753/comments/default", "bloglinks": {}, "links": {"http://www.eetimes.com/": 9, "http://www.mentor.com/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["Via seeking alpha . some choice quotes: [...] First, let me share with you our commitment with BSI technologies development. Our commitment to the advancement of BSI technologies is second to none. As the first company to commercialize the use of this technology, our first generation OmniBSI pixel is already in mass production and has begun to ramp significantly in fiscal 2011 and serves as the basic for our entire 5-megapixel product line. With the advancement of BSI-2, the second generation OmniBSI pixel, we have further expanded our leadership in pixel technology well ahead of our competitors. The second generation BSI architecture represents a major milestone in digital imaging technology in an aggressive form factor. Meanwhile, most significantly, these technologies serve the basic for meeting the trend towards ever higher pixel counts and establish a trend towards high quality pixel. Another notable commitment enduring in core sensing technology is our CameraCube technology development. In particular, we remain focused on the development of advanced wafer level optics and packaging solutions for our next generation products and reduce product costs. To this end, we are consistently examining our options and look for solutions to achieve our goal. Last, but not least, through fiscal 2010, our OmniPixel3-HS technologies continued to gain traction with broad market acceptance due to its leading low light sensitivity. Our latest high performance VGA sensor that is built with our popular 3.0 micron OmniPixel3-HS high sensitivity pixel is well accepted in automotive and the security markets, which also demand high definition color applications. [...] Currently, a major trend and expectation in imaging is the increasingly rapid marketplace adoption of high sensitivity, high definition images and video. [...] Our BSI products are proven to be a key differentiator that has enabled OmniVision to secure a range of high value customers and projects. We expect that our proprietary BSI technology will continue to be a decisive factor in securing further design wins during the next several quarters resulting in an increasingly prominent position within our vertical target markets. [...] In regards to technology of BSI, obviously to ship the quantities that we are shipping today, it’s a long learning curve. We regard that as extremely a big advantage to OmniVision, and our competitors will probably face that step when they get to it. And it’s not easy to ship the volumes we have. [...] We have been developing the backside illumination technology with our strategic partner TSMC for many years. This has been a five-year effort for us. And there has been a tremendous amount of intellectual property developed between the two companies in that process. And that’s very hard to reproduce and is very hard to reproduce in a short time period. So if you look at our success and the growth we’ve seen, it’s really been fueled by BSI. So that should give you an indication that a great portion of that learning has already taken place for us. So we think that as a big barrier for the competition."], "link": "http://electronsandholes.blogspot.com/feeds/4890581983480756823/comments/default", "bloglinks": {}, "links": {"http://seekingalpha.com/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["Oops, Image Sensors World beat me to the scoop, and I've been the daily supervisor at imec :-) Cheng Ma's MSc thesis is available: \" Pixel ADC Design for Hybrid CMOS Image Sensor \". Good luck in your new job in Antwerp!"], "link": "http://electronsandholes.blogspot.com/feeds/9130586921439650389/comments/default", "bloglinks": {}, "links": {"http://image-sensors-world.blogspot.com/": 1, "http://repository.tudelft.nl/": 1}, "blogtitle": "Electrons and holes"}, {"content": ["The latest issue of IEEE Transactions on Electron Devices carries three (at first sight) interesting papers. The first one is \" eLeNA: A Parametric CMOS Active-Pixel Sensor for the Evaluation of Reset Noise Reduction Architectures \". The abstract reads: We present a novel complementary metal–oxide–semiconductor (CMOS) active-pixel sensor imager that incorporates different reset schemes to achieve lower reset noise levels. The sensor, eLeNA, features a 448 $times$ 512 array with a pixel pitch of 15 $muhbox{m}$, fabricated using a 0.18- $muhbox{m}$ CMOS process. Fourteen sections and five different reset methods were employed. Without using pinned diodes, we implanted structures for correlated double sampling. A noise of 6 $hbox{e}-$ is measured with a conversion gain of 49 $muhbox{V/e}-$. We will discuss various applications for the reset method that achieved the best overall performance, considering leakage current and read noise. The second one is: \" Simulation and Measurements of Stray Minority Carrier Protection Structures in CMOS Image Sensors \". The abstract reads: Recently, the rapid growth of CMOS technology has made it possible to integrate more periphery circuits into a CMOS image sensor. Although these periphery circuits improve image quality, they also lead to the generation of more stray minority carriers. Because the number of stray minority carriers is proportional to the frequency, the affected region increases with increasing operating frequency. Placing an appropriate absorber between the periphery circuits and the pixel has traditionally been accepted as the best solution for this issue. Four protection tactics were simulated in software and verified in a fabricated CMOS image sensor. The imager was fabricated using TSMC 1-poly 6-metal 0.18-$muhbox{m}$ process technology. On this chip, ten noise sources outside the pixel array were used to verify the effectiveness of the protection tactics in off-array tests, whereas in-pixel noise sources were used in in-pixel tests. To quantify the influence of stray minority carriers in the off-array test, the maximum depth of an affected region (DAR) was measured in a processed binary image. The off-array experimental results revealed that the DAR increased with either an increased operating frequency or a decreased separation between the noise source and the pixel array. The DAR of the affected pixels can be eliminated up to 48.1% and 23.8% by using the N-well and N-diffusion guard rings, respectively. The in-pixel experimental results have shown that the N-diffusion digital pixel implementation reduced the noise by 63.2% while only increasing the area by 10.68%. Detailed information about the effectiveness of different protection tactics in an imager design was collected in this paper. This paper can potentially provide a reference to help imager designers choose an appropriate protection tactic. And the third one: \" Per-Pixel Dark Current Spectroscopy Measurement and Analysis in CMOS Image Sensors \". The abstract reads: A per-pixel dark current spectroscopy measurement and analysis technique for identifying deep-level traps in CMOS imagers is presented. The short integration time transfer gate subtraction experimental technique used to obtain accurate results is described and discussed. The activation energies obtained for molybdenum (≈0.3 eV), tungsten (≈0.37 eV), and the phosphorus-vacancy (E-center) (≈0.44 eV) trap levels in silicon match published results measured with other techniques. The Meyer–Neldel Relationship (MNR) was observed between the Arrhenius preexponential frequency factor and activation energy. The trap capture cross-sectional calculation methodology using the MNR is presented. The cross sections of molybdenum, tungsten, and the E-center were calculated as ≈1 × 10−16 cm2, ≈1.5 × 10−16 cm2, and≈2.5 × 10−16 cm2, respectively, at 318 K. The data obtained suggest electric field enhanced emission, and Poole-Frenkel barrier force lowering of E-center defects occurs in the pinning implant regions. It is proposed that a changing Fermi level results in the correct activation energies being obtained below half the band gap and that the dark current measurement process is affected by the measurement time result of statistical mechanics. It is also tentatively suggested that, in this case, the observed MNR is a geometric relationship and not due to a physical process. In case the abstract is a bit confusing, the authors conclude that: \"The measurement and analysis technique presented could be useful to the image sensor industry for diagnosing fabrication plant contamination. It also has potential applications for the study of radiation induced traps in CMOS and CCD imagers.\""], "link": "http://electronsandholes.blogspot.com/feeds/2993411651037581014/comments/default", "bloglinks": {}, "links": {"http://ieeexplore.ieee.org/": 4}, "blogtitle": "Electrons and holes"}, {"content": ["New paper at Applied Physics Letters: \" Organic heterojunction photodiodes exhibiting low voltage, imaging-speed photocurrent gain \". The abstract reads: We report the demonstration of fast and strong photocurrent gain in organic photodiodes with tailored charge blocking layers. The hole blocking layer between the anode and the photoactive layer leads to accumulation of photogenerated holes at its interface with the active layer, which causes a strong secondary electron injection from the anode and as such a high photocurrent gain. Using a bulk heterojunction of C 60 and copper phthalocyanine as the active layer, we have achieved photocurrent gains up to 500 across the visible spectrum and bandwidths on the order of 1 kHz, well above the imaging-compatible bandwidth (>60 Hz) ."], "link": "http://electronsandholes.blogspot.com/feeds/4663371077225864771/comments/default", "bloglinks": {}, "links": {"http://apl.aip.org/": 1}, "blogtitle": "Electrons and holes"}]