[{"blogurl": "http://compgen.blogspot.com\n", "blogroll": ["\n"], "title": "Epistasis Blog"}, {"content": ["Dear Colleague, ‘Big data in the biological and biomedical sciences: biodata mining challenges and opportunities’, a new cutting-edge thematic series from BioData Mining, is now accepting submissions. The goal of this innovative series is to explore data mining, data science, high-performance computing and software development for the new frontier of big data in the biological and biomedical sciences. Big data, by definition, challenges our ability to move, store, manage, retrieve and analyze information to maximize knowledge generation. These informatics, information technology and data analysis challenges are compounded by the complexity of problems that are of practical importance. Our future success in biodata mining will depend critically on our ability to embrace and confront both the scale and the complexity of big data. Potential topics include, but are not limited to:  Mining high-dimensional data  Visualizing big data  Integrating diverse data  Sharing complex data  Computing big data Please submit your manuscript via our online submission system, and state clearly in your covering letter that it is intended for the Big-data thematic series. For more information about the journal,contact us at editorial@biodatamining.org or visit our instructions for authors. We look forward to receiving your submission, Kind regards, Prof Jason Moore, Editor-in-Chief Dr Jesus Aguilar-Ruiz, Editor-in-Chief"], "link": "http://compgen.blogspot.com/feeds/7998225346697337129/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["Our new R01 with Drs. Li Shen and Andy Saykin from IUPUI has been funded by the National Library of Medicine. Andy and I serve as PIs with Li as the contact PI. The grant started September 1st. More information can be found on the NIH RePORT website. Abstract Today's generation of multi-modal imaging systems produces massive high dimensional data sets, which when coupled with high throughput genotyping data such as single nucleotide polymorphisms (SNPs), provide exciting opportunities to enhance our understanding of phenotypic characteristics and the genetic architecture of human diseases. However, the unprecedented scale and complexity of these data sets have presented critical computational bottlenecks requiring new concepts and enabling tools. To address these challenges, using the study of Alzheimer's disease (AD) as a test bed, this project will develop and validate novel bioinformatics strategies for multidimensional brain imaging genetics. Aim 1 is to develop a novel bi- multivariate analysis strategy, S3K-CCA, for studying imaging genetic associations. Existing imaging genetics methods are typically designed to discover single-SNP-single-QT, single-SNP-multi-QT or multi-SNP-single- QT associations, and have limited power in revealing complex relationships between interlinked genetic markers and correlated brain phenotypes. To overcome this limitation, S3K-CCA is designed to be a sparse bi- multivariate learning model that simultaneously uses multiple response variables with multiple predictors for analyzing large-scale multi-modal neurogenomic data. Aim 2 is to develop HD-BIG, a visualization and systems biology framework for integrative analysis of High-Dimensional Brain Imaging Genetics data. Machine learning strategies to seamlessly incorporate valuable domain knowledge to produce biologically meaningful results is still an under-explored area in imaging genetics. In this aim, we will develop a user-friendly heat map interface to visualize high-dimensional results, adjust learning parameters and strategies, interact with existing bioinformatics resources and tools, and facilitate visual exploratory and systems biology analysis. A novel imaging genetic enrichment analysis (IGEA) method will be developed to identify relevant genetic pathways and associated brain circuits, and to reveal complex relationships among them. Aim 3 is to evaluate the proposed S3K-CCA and IGEA methods and the HD-BIG framework using both simulated and real imaging genetics data. This project is expected to produce novel bioinformatics algorithms and tools for comprehensive joint analysis of large scale heterogeneous imaging genetics data. The availability of these powerful methods is critical to the success of many imaging genetics initiatives. In addition, they can also help enable new computational applications in other areas of biomedical research where systematic and integrative analysis of large-scale multi-modal data is critical. Using AD as an exemplar, the proposed methods will demonstrate the potential for enhancing mechanistic understanding of complex disorders, which can benefit public health outcomes by facilitating diagnostic and therapeutic progress."], "link": "http://compgen.blogspot.com/feeds/5808621423794542230/comments/default", "bloglinks": {}, "links": {"http://projectreporter.nih.gov/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["Great new paper from Dr. Trudy Mackay at NC State. Ask yourself this simple question. If epistasis is so common in flies, why not humans? Huang W, Richards S, Carbone MA, Zhu D, Anholt RR, Ayroles JF, Duncan L, Jordan KW, Lawrence F, Magwire MM, Warner CB, Blankenburg K, Han Y, Javaid M, Jayaseelan J, Jhangiani SN, Muzny D, Ongeri F, Perales L, Wu YQ, Zhang Y, Zou X, Stone EA, Gibbs RA, Mackay TF. Epistasis dominates the genetic architecture of Drosophila quantitative traits. Proc Natl Acad Sci U S A. 2012 Sep 4. [ PubMed ] Abstract Epistasis-nonlinear genetic interactions between polymorphic loci-is the genetic basis of canalization and speciation, and epistatic interactions can be used to infer genetic networks affecting quantitative traits. However, the role that epistasis plays in the genetic architecture of quantitative traits is controversial. Here, we compared the genetic architecture of three Drosophila life history traits in the sequenced inbred lines of the Drosophila melanogaster Genetic Reference Panel (DGRP) and a large outbred, advanced intercross population derived from 40 DGRP lines (Flyland). We assessed allele frequency changes between pools of individuals at the extremes of the distribution for each trait in the Flyland population by deep DNA sequencing. The genetic architecture of all traits was highly polygenic in both analyses. Surprisingly, none of the SNPs associated with the traits in Flyland replicated in the DGRP and vice versa. However, the majority of these SNPs participated in at least one epistatic interaction in the DGRP. Despite apparent additive effects at largely distinct loci in the two populations, the epistatic interactions perturbed common, biologically plausible, and highly connected genetic networks. Our analysis underscores the importance of epistasis as a principal factor that determines variation for quantitative traits and provides a means to uncover genetic networks affecting these traits. Knowledge of epistatic networks will contribute to our understanding of the genetic basis of evolutionarily and clinically important traits and enhance predictive ability at an individualized level in medicine and agriculture."], "link": "http://compgen.blogspot.com/feeds/7351416596823265624/comments/default", "bloglinks": {}, "links": {"http://www.nih.gov/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["There has been a lot of discussion online the last few days about the value of journal impact factors for judging the quality of publications. This is important because faculty promotion and tenure is often measured by impact. The following are several posts calling into question the use of journal impact factors. 1) Nature editorial from 2005 titled \"Not-so-deep impact: Research assessment rests too heavily on the inflated status of the impact factor\" 2) A 2008 note about impact factors from the Editor-in-Chief of Nature title \"Escape from the impact factor\" 3) Another Nature editorial from 2010 titled \"Dissecting our impact factor\" 4) A PNAS editorial from 2010 that says \"placing too much emphasis on publication in high impact factor journals is a recipe for disaster\" 5) 2010 opinion piece in Front. Psychology titled \"Are scientists nearsighted gamblers? The misleading nature of impact factors\" - be sure and read the criticism of this piece in the comments by Pep Pàmies. The numbers presented seem suspect. 6) A provocative blog post by Stephen Curry titled \"Sick of impact factors\" 7) A blog post by Tom Webb titled \"My own personal Impact Factor\" 8) Mendeley page by Jonathan Eisen on papers that discuss impact factors. My personal view is that we should judge faculty based on three measures. These were originally suggested by Dr. John Blangero. 1) Total Citations. This is a good measure of impact. The more your papers are cited, the better your impact. 2) Total Publications. This is a good measure of how hard you work. It takes time to write, submit, revise and publish papers. 3) Competitive Funding. This is a good measure of how your peers view your work. It is tough to get a grant funded from the NIH or NSF if you are not doing timely, innovative and significant work with solid methods."], "link": "http://compgen.blogspot.com/feeds/6593856819947196856/comments/default", "bloglinks": {}, "links": {"http://www.frontiersin.org/": 1, "http://www.pnas.org/": 1, "http://occamstypewriter.org/": 2, "http://www.scilogs.com/": 1, "http://www.nature.com/": 2, "http://xa.yimg.com/": 1, "http://www.mendeley.com/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["Leonid Kruglyak has put his latest paper on arXiv for comment. This is a well-written paper that explores additive and non-additive genetic effects for a variety of traits in yeast. The discussion of the results is comprehensive and informative. I would love to see this work extended to higher-order gene-gene interactions and gene-environment interactions. We need more work like this as we try to understand the complexity of genetic architecture. It is interesting to note that there has been some discussion about putting papers on arXiv for public viewing prior to publication. See this Nature News piece for an introduction to the topic. Finding the sources of missing heritability in a yeast cross Joshua S. Bloom, Ian M. Ehrenreich, Wesley Loo, Thúy-Lan Võ Lite, Leonid Kruglyak Abstract For many traits, including susceptibility to common diseases in humans, causal loci uncovered by genetic mapping studies explain only a minority of the heritable contribution to trait variation. Multiple explanations for this \"missing heritability\" have been proposed. Here we use a large cross between two yeast strains to accurately estimate different sources of heritable variation for 46 quantitative traits and to detect underlying loci with high statistical power. We find that the detected loci explain nearly the entire additive contribution to heritable variation for the traits studied. We also show that the contribution to heritability of gene-gene interactions varies among traits, from near zero to 50%. Detected two-locus interactions explain only a minority of this contribution. These results substantially advance our understanding of the missing heritability problem and have important implications for future studies of complex and quantitative traits."], "link": "http://compgen.blogspot.com/feeds/249283737914957643/comments/default", "bloglinks": {}, "links": {"http://arxiv.org/": 1, "http://www.nature.com/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["There is a great new piece in Science on \"Modular Biological Complexity\". The author argues that without modules biology would be too complex to understand because it would take an eternity to run the experiments on all the many interactions. Note the idea of the \"complexity brake\". Koch C. Systems biology. Modular biological complexity. Science. 2012 Aug 3;337(6094):531-2. [ PubMed ] \"Given the large number of components that cannot be averaged away, any possible technological advance is overwhelmed by the relentless growth of interactions among all components of the system. It is not feasible to understand evolved organisms by exhaustively cataloging all interactions in a comprehensive, bottom-up manner.\""], "link": "http://compgen.blogspot.com/feeds/1790579042955884154/comments/default", "bloglinks": {}, "links": {"http://www.nih.gov/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["My new NIH R01 from the National Eye Institute (NEI) was funded starting August 1, 2012. The details can be found on the NIH RePORT website. The abstract is here: It is now recognized that many visual diseases are influenced by complex interactions between multiple different genetic variants. As a result, our ability to predict susceptibility to visual diseases will depend critically on the computational, mathematical and statistical modeling methods and software that are available for making sense of high-dimensional genetic data. We propose here a bioinformatics research project to develop network modeling approaches for identifying combinations of genetic biomarkers associated with visual disease endpoints. Our working hypothesis is that a systems-based bioinformatics approach using network modeling will play a very important role in confronting the complexity of the relationship between genomic variation and visual diseases. We will first develop and evaluate modeling methods to infer large-scale genetic interaction networks from genome-wide association studies (AIM 1). We will then apply the modeling methods developed in AIM 1 to the inference of genetic interaction networks from genome-wide association data in subjects with and without visual diseases (AIM 2). Next, we will utilize the inferred genetic interaction networks to guide the development of predictive genetic models of visual diseases (AIM 3). Finally, all network modeling methods will be released to the vision research community as part of a popular user-friendly, freely available and open-source software package (AIM 4). We anticipate that the network modeling methods and software developed and distributed as part of this project will play an important role in the development of the genetic tests that will be necessary to identify those at risk for visual diseases."], "link": "http://compgen.blogspot.com/feeds/1047049626553156615/comments/default", "bloglinks": {}, "links": {"http://projectreporter.nih.gov/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["The following list of reasons to do a Ph.D. or postdoc in bioinformatics or computational biology appeared on Casey Bergman's blog . 0. Computing is the key skill set for 21st century biology 1. Computational skills are highly transferrable 2. Computing will help improve your core scientific skills 3. You should use you Ph.D./Post-Doc to develop new skills 4. You will develop a more unique skill set in Biology 5. You will publish more papers 6. You will have more flexibility in your research 7. You will have more flexibility in working practices 8. Computational research is cost-effective 9. A successful scientist ends up in an office [10. You will understand why lists should start with the number zero.]"], "link": "http://compgen.blogspot.com/feeds/5656578324525004454/comments/default", "bloglinks": {}, "links": {"http://caseybergman.wordpress.com/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["I personally think being a professor, researcher and educator is a fantastic career. I wouldn't want to do anything else. Here are two opposing views. Why give up an excellent tenured faculty position for the grind of corporate life? There's been a lot of talk recently about the pressures of higher education. Actually, says one postgrad student, university life is a joy."], "link": "http://compgen.blogspot.com/feeds/1433691470926925704/comments/default", "bloglinks": {}, "links": {"http://cs.unm.edu/": 1, "http://www.co.uk/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["Great new paper on machine learning analysis in human genetics. Kruppa J, Ziegler A, König IR. Risk estimation and risk prediction using machine-learning methods. Hum Genet. 2012 Jul 3, in press. [ PubMed ] Abstract After an association between genetic variants and a phenotype has been established, further study goals comprise the classification of patients according to disease risk or the estimation of disease probability. To accomplish this, different statistical methods are required, and specifically machine-learning approaches may offer advantages over classical techniques. In this paper, we describe methods for the construction and evaluation of classification and probability estimation rules. We review the use of machine-learning approaches in this context and explain some of the machine-learning algorithms in detail. Finally, we illustrate the methodology through application to a genome-wide association analysis on rheumatoid arthritis."], "link": "http://compgen.blogspot.com/feeds/8239118792786323837/comments/default", "bloglinks": {}, "links": {"http://www.nih.gov/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["Machine learning has a very important role to play in human genetics and genetic epidemiology. However, the computer science-based machine learning community has come under fire for writing and publishing papers that lack real-world application and impactful interpretation of results. The following is a must read for anyone interested in developing machine learning methods. Machine Learning that Matters [ PDF ] Kiri L. Wagstaff kiri.l.wagstaff@jpl.nasa.gov Jet Propulsion Laboratory, California Institute of Technology, 4800 Oak Grove Drive, Pasadena, CA 91109 USA To appear in Proceedings of the 29 th International Conference on Machine Learning, Edinburgh, Scotland, UK, 2012. arXiv:1206.4656v1 Abstract Much of current machine learning (ML) research has lost its connection to problems of import to the larger world of science and society. From this perspective, there exist glaring limitations in the data sets we investigate, the metrics we employ for evaluation, and the degree to which results are communicated back to their originating domains. What changes are needed to how we conduct research to increase the impact that ML has? We present six Impact Challenges to explicitly focus the field’s energy and attention, and we discuss existing obstacles that must be addressed. We aim to inspire ongoing discussion and focus on ML that matters."], "link": "http://compgen.blogspot.com/feeds/8613023022448111786/comments/default", "bloglinks": {}, "links": {"http://arxiv.org/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["We are investing more time into understanding the biological basis of epistasis. The following are two recent papers that we have particpated in that help address this important question. Zhang X, Cowper-Sal Lari R, Bailey SD, Moore JH, Lupien M. Integrative functional genomics identifies an enhancer looping to the SOX9 gene disrupted by the 17q24.3 prostate cancer risk locus. Genome Res. 2012 Jun 4. [ PubMed ] Akhtar-Zaidi B, Cowper-Sal-lari R, Corradin O, Saiakhova A, Bartels CF, Balasubramanian D, Myeroff L, Lutterbaugh J, Jarrar A, Kalady MF, Willis J, Moore JH, Tesar PJ, Laframboise T, Markowitz S, Lupien M, Scacheri PC. Epigenomic enhancer profiling defines a signature of colon cancer. Science. 2012 May 11;336(6082):736-9. [ PubMed ]"], "link": "http://compgen.blogspot.com/feeds/8416415045294182238/comments/default", "bloglinks": {}, "links": {"http://www.nih.gov/": 2}, "blogtitle": "Epistasis Blog"}, {"content": ["A great paper from 1999 on the history of reaction norms. A must read for anyone interested in gene-environment interaction. Sarkar, S. From the Reaktionsnorm to the Adaptive Norm: The Norm of Reaction, 1909–1960. Biology and Philosophy 14: 235-252 (1999) [ PDF ]"], "link": "http://compgen.blogspot.com/feeds/148630649700008933/comments/default", "bloglinks": {}, "links": {"http://uts.utexas.edu/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["An interesting new paper documenting how epistasis may change depending on the alleles of a given gene. Xu L, Barker B, Gu Z. Dynamic epistasis for different alleles of the same gene. Proc Natl Acad Sci U S A. 2012 Jun 11. [ PubMed ] Abstract Epistasis refers to the phenomenon in which phenotypic consequences caused by mutation of one gene depend on one or more mutations at another gene. Epistasis is critical for understanding many genetic and evolutionary processes, including pathway organization, evolution of sexual reproduction, mutational load, ploidy, genomic complexity, speciation, and the origin of life. Nevertheless, current understandings for the genome-wide distribution of epistasis are mostly inferred from interactions among one mutant type per gene, whereas how epistatic interaction partners change dynamically for different mutant alleles of the same gene is largely unknown. Here we address this issue by combining predictions from flux balance analysis and data from a recently published high-throughput experiment. Our results show that different alleles can epistatically interact with very different gene sets. Furthermore, between two random mutant alleles of the same gene, the chance for the allele with more severe mutational consequence to develop a higher percentage of negative epistasis than the other allele is 50∼70% in eukaryotic organisms, but only 20∼30% in bacteria and archaea. We developed a population genetics model that predicts that the observed distribution for the sign of epistasis can speed up the process of purging deleterious mutations in eukaryotic organisms. Our results indicate that epistasis among genes can be dynamically rewired at the genome level, and call on future efforts to revisit theories that can integrate epistatic dynamics among genes in biological systems."], "link": "http://compgen.blogspot.com/feeds/2399633518497995788/comments/default", "bloglinks": {}, "links": {"http://www.nih.gov/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["This new piece in Science magazine summarizes nicely some of my concerns about the integration of whole genome sequencing into the clinic. I have tweeted about a number of these issues. A must read. Liam R. Brunham, Michael R. Hayden. Whole-Genome Sequencing: The New Standard of Care? Science 336;1112-1113. [ Science ] Rapid advances in DNA sequencing technology have made whole-genome sequencing (WGS) both technically and economically feasible. WGS has been used with great effect in specific settings to clarify molecular diagnosis and even to guide therapy. But are we ready for the routine use of WGS in the care of healthy individuals?"], "link": "http://compgen.blogspot.com/feeds/1172723198276734935/comments/default", "bloglinks": {}, "links": {"http://www.sciencemag.org/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["A new paper by Oh et al. in BMC Bioinformatics reports on a new method for using our Multifactor Dimensionality Reduction (MDR) method for genome-wide association studies. This approach first tests for within gene interactions as a way to cut down on the number of tests. Seems like a good idea. Sohee Oh, Jaehoon Lee, Min-Seok Kwon, Bruce Weir, Kyooseob Ha and Taesung Park. A novel method to identify high order gene-gene interactions in genome-wide association studies: gene-based MDR. BMC Bioinformatics 2012, 13(Suppl 9):S5 [ BMC ] Abstract (provisional) Background Because common complex diseases are affected by multiple genes and environmental factors, it is essential to investigate gene-gene and/or gene-environment interactions to understand genetic architecture of complex diseases. After the great success of large scale genome-wide association (GWA) studies using the high density single nucleotide polymorphism (SNP) chips, the study of gene-gene interaction becomes a next challenge. Multifactor dimensionality reduction (MDR) analysis has been widely used for the gene-gene interaction analysis. In practice, however, it is not easy to perform high order gene-gene interaction analyses via MDR in genome-wide level because it requires exploring a huge search space and suffers from a computational burden due to high dimensionality. Results We propose dimensional reduction analysis, Gene-MDR analysis for the fast and efficient high order gene-gene interaction analysis. The proposed Gene-MDR method is composed of two-step applications of MDR: within- and between-gene MDR analyses. First, within-gene MDR analysis summarizes each gene effect via MDR analysis by combining multiple SNPs from the same gene. Second, between-gene MDR analysis then performs interaction analysis using the summarized gene effects from within-gene MDR analysis. We apply the Gene-MDR method to bipolar disorder (BD) GWA data from Wellcome Trust Case Control Consortium (WTCCC). The results demonstrate that Gene-MDR is capable of detecting high order gene-gene interactions associated with BD. Conclusion By reducing the dimension of genome-wide data from SNP level to gene level, Gene-MDR efficiently identifies high order gene-gene interactions. Therefore, Gene-MDR can provide the key to understand complex disease etiology."], "link": "http://compgen.blogspot.com/feeds/8380892098509592317/comments/default", "bloglinks": {}, "links": {"http://www.biomedcentral.com/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["There are two papers I would like to call your attention two that provide fuel for a healthy debate about the complexity of the genotype to phenotype mapping relationship. The first, from Eric Lander's group (Zuk et al. 2012), calls into question how heritability is estimated. This is an interesting paper that makes the argument that epistasis or gene-gene interaction is likely to explain a significant amount of the missing heritability. Many heritability estimates are based only on additive effects. My only concern with this paper is that this is not a new observation. My group and many others have been writing about the importance of epistasis for many years and much of this work is not acknowledged. The second paper, from Roberts (2012), calls into question the usefulness of personal genomic sequencing for preditcing disease. This paper shows that it is difficult to predict disease in MZ twins. In other words, twins do not always die of the same diseases. These papers both call into question the assumption made by genome-wide association studies (GWAS) of common alleles and whole-genome sequencing for rare alleles that there will be single loci with big effects that will in turn be useful for personalized medicine. Zuk O, Hechter E, Sunyaev SR, Lander ES. The mystery of missing heritability: Genetic interactions create phantom heritability. Proc Natl Acad Sci U S A. 2012 Jan 24;109(4):1193-8. [ PubMed ] Roberts et al., The predictive capacity of personal genome sequencing. Science Transl Med (2012), in press. [ PubMed ] Here are several other blog posts and new stories that provide positive and negative perspectives on the Roberts/Vogelstein paper. It is interesting to note that a number of geneticists are upset that the paper got published and that it received so much press (e.g. Nature News Blog). I think they are more worried about the negative publicity for genome technology than the actual science (which they claim is flawed). Alzheimer Research Forum Genomes Unzipped Nature News Blog Science News"], "link": "http://compgen.blogspot.com/feeds/45103734092271708/comments/default", "bloglinks": {}, "links": {"http://www.sciencenews.org/": 1, "http://www.genomesunzipped.org/": 1, "http://www.alzforum.org/": 1, "http://www.nih.gov/": 2, "http://blogs.nature.com/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["This is a must read for those of you interested in epistasis and biological complexity. Fabulous paper. Weiss KM, Buchanan AV. Is life law-like? Genetics. 2011 Aug;188(4):761-71. [ PubMed ] Abstract Genes are generally assumed to be primary biological causes of biological phenotypes and their evolution. In just over a century, a research agenda that has built on Mendel's experiments and on Darwin's theory of natural selection as a law of nature has had unprecedented scientific success in isolating and characterizing many aspects of genetic causation. We revel in these successes, and yet the story is not quite so simple. The complex cooperative nature of genetic architecture and its evolution include teasingly tractable components, but much remains elusive. The proliferation of data generated in our \"omics\" age raises the question of whether we even have (or need) a unified theory or \"law\" of life, or even clear standards of inference by which to answer the question. If not, this not only has implications for the widely promulgated belief that we will soon be able to predict phenotypes like disease risk from genes, but also speaks to the limitations in the underlying science itself. Much of life seems to be characterized by ad hoc, ephemeral, contextual probabilism without proper underlying distributions. To the extent that this is true, causal effects are not asymptotically predictable, and new ways of understanding life may be required."], "link": "http://compgen.blogspot.com/feeds/8594208577999136598/comments/default", "bloglinks": {}, "links": {"http://www.nih.gov/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["Great new paper on pathway analysis. Must read. Khatri P, Sirota M, Butte AJ. Ten years of pathway analysis: current approaches and outstanding challenges. PLoS Comput Biol. 2012 Feb;8(2):e1002375. [ PLoS ] Abstract Pathway analysis has become the first choice for gaining insight into the underlying biology of differentially expressed genes and proteins, as it reduces complexity and has increased explanatory power. We discuss the evolution of knowledge base–driven pathway analysis over its first decade, distinctly divided into three generations. We also discuss the limitations that are specific to each generation, and how they are addressed by successive generations of methods. We identify a number of annotation challenges that must be addressed to enable development of the next generation of pathway analysis methods. Furthermore, we identify a number of methodological challenges that the next generation of methods must tackle to take advantage of the technological advances in genomics and proteomics in order to improve specificity, sensitivity, and relevance of pathway analysis."], "link": "http://compgen.blogspot.com/feeds/8324502849982757066/comments/default", "bloglinks": {}, "links": {"http://www.ploscompbiol.org/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["This is a nice overview of network methods for addressing gene-gene interactions. Our recent paper on the topic came out too late to be included. See Hu et al. (2011). McKinney BA, Pajewski NM. Six Degrees of Epistasis: Statistical Network Models for GWAS. Front Genet. 2011;2:109. [ PubMed ] Abstract There is growing evidence that much more of the genome than previously thought is required to explain the heritability of complex phenotypes. Recent studies have demonstrated that numerous common variants from across the genome explain portions of genetic variability, spawning various avenues of research directed at explaining the remaining heritability. This polygenic structure is also the motivation for the growing application of pathway and gene set enrichment techniques, which have yielded promising results. These findings suggest that the coordination of genes in pathways that are known to occur at the gene regulatory level also can be detected at the population level. Although genes in these networks interact in complex ways, most population studies have focused on the additive contribution of common variants and the potential of rare variants to explain additional variation. In this brief review, we discuss the potential to explain additional genetic variation through the agglomeration of multiple gene-gene interactions as well as main effects of common variants in terms of a network paradigm. Just as is the case for single-locus contributions, we expect each gene-gene interaction edge in the network to have a small effect, but these effects may be reinforced through hubs and other connectivity structures in the network. We discuss some of the opportunities and challenges of network methods for analyzing genome-wide association studies (GWAS) such as the study of hubs and motifs, and integrating other types of variation and environmental interactions. Such network approaches may unveil hidden variation in GWAS, improve understanding of mechanisms of disease, and possibly fit into a network paradigm of evolutionary genetics."], "link": "http://compgen.blogspot.com/feeds/4640423650782226693/comments/default", "bloglinks": {}, "links": {"http://www.nih.gov/": 2}, "blogtitle": "Epistasis Blog"}, {"content": ["Great new article by Duncan Thomas that raises a number of very interesting questions about genome-wide association studies (GWAS), Big Science, dominant journals with large influence and the role of consortia in the sociology of sciences. Worth a read. Here is an excerpt: \"Another feature of GWAS having become routine is the emergence of consortia for discovering smaller and smaller risks because of the need for enormous sample sizes [Hunter et al., 2007]. This pressure towards Big Science will doubtless become even stronger as we move into sequence data and look for rarer variants. There are some issues in the sociology of science that are worth attention: How are new investigators to find their niche in such an environment without becoming lost in a list of hundreds of authors? What is the role of investigator-initiated studies and novel or paradigm-shifting ideas? Is the dominance of a single journal, by virtue of its impact factor, in setting the agenda for the entire field a good thing? Is the huge burden of time and effort required to establish these consortia really worth the yield of smaller and smaller effect sizes? Certainly these consortia can be expected to yield more and more—and finer and finer—gold dust, but what about the nuggets? How are we to deal with the requirement of replication when a consortium has essentially the corner on all the available data or in unique situations (e.g., a gene-environment interaction with an unusual or unusually well-characterized exposure)—perhaps by some form of internal cross-validation?\" Duncan C. Thomas. Genetic Epidemiology with a Capital E: Where Will We Be in Another 10 Years? Genetic Epidemiology, in press (2012) [ Wiley ] Abstract: In a commentary on the evolution of the field of genetic epidemiology over the past 10 years, Khoury et al. (2011) highlight several important developments, including the emergence of evaluation of genetic discoveries for their translational utility and of standards for reporting genetic findings. In this companion to their article, I reflect on some of these trends and speculate about the direction of the field in the future. In particular, I emphasize the opportunities posed by novel technologies like next-generation sequencing and the biological insights emerging from integrative genomics, but I also question the utility of large consortia. The basic principles of population-based research and the importance of taking account of the environment remain important to the field."], "link": "http://compgen.blogspot.com/feeds/3775120315091007393/comments/default", "bloglinks": {}, "links": {"http://onlinelibrary.wiley.com/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["Here is a new MDR paper from Kristel Van Steen. Mahachie John JM, Cattaert T, Van Lishout F, Gusareva ES, Van Steen K. Lower-order effects adjustment in quantitative traits model-based multifactor dimensionality reduction. PLoS One. 2012;7(1):e29594. [ PubMed ] Abstract Identifying gene-gene interactions or gene-environment interactions in studies of human complex diseases remains a big challenge in genetic epidemiology. An additional challenge, often forgotten, is to account for important lower-order genetic effects. These may hamper the identification of genuine epistasis. If lower-order genetic effects contribute to the genetic variance of a trait, identified statistical interactions may simply be due to a signal boost of these effects. In this study, we restrict attention to quantitative traits and bi-allelic SNPs as genetic markers. Moreover, our interaction study focuses on 2-way SNP-SNP interactions. Via simulations, we assess the performance of different corrective measures for lower-order genetic effects in Model-Based Multifactor Dimensionality Reduction epistasis detection, using additive and co-dominant coding schemes. Performance is evaluated in terms of power and familywise error rate. Our simulations indicate that empirical power estimates are reduced with correction of lower-order effects, likewise familywise error rates. Easy-to-use automatic SNP selection procedures, SNP selection based on \"top\" findings, or SNP selection based on p-value criterion for interesting main effects result in reduced power but also almost zero false positive rates. Always accounting for main effects in the SNP-SNP pair under investigation during Model-Based Multifactor Dimensionality Reduction analysis adequately controls false positive epistasis findings. This is particularly true when adopting a co-dominant corrective coding scheme. In conclusion, automatic search procedures to identify lower-order effects to correct for during epistasis screening should be avoided. The same is true for procedures that adjust for lower-order effects prior to Model-Based Multifactor Dimensionality Reduction and involve using residuals as the new trait. We advocate using \"on-the-fly\" lower-order effects adjusting when screening for SNP-SNP interactions using Model-Based Multifactor Dimensionality Reduction analysis."], "link": "http://compgen.blogspot.com/feeds/79219021487503948/comments/default", "bloglinks": {}, "links": {"http://www.nih.gov/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["I am collaborating with Drs. Andy Saykin and Li Shen at IUPUI to develop and apply novel methods for the genetic analysis of neuroimaging phenotypes. This is a really hot new area. I will be giving a talk on some of our recent results at the 8th International Imaging Genetics Conference , to be held on January 16th and 17th, 2012 at the Beckman Center of the National Academy of Sciences in Irvine, CA. We have applied some of our recent network science methods (see paper below) to the Alzheimer's Disease Neuroimaging Initiative ( ADNI ) data. Hu T, Sinnott-Armstrong NA, Kiralis JW, Andrew AS, Karagas MR, Moore JH. Characterizing genetic interactions in human disease association studies using statistical epistasis networks. BMC Bioinformatics. 2011 Sep 12;12:364. [ PubMed ]"], "link": "http://compgen.blogspot.com/feeds/5673998051174590525/comments/default", "bloglinks": {}, "links": {"http://www.uci.edu/": 1, "http://www.nih.gov/": 1, "http://www.adni-info.org/": 1, "http://iadc.iupui.edu/": 1}, "blogtitle": "Epistasis Blog"}, {"content": ["January, 2011 Yeast genetics is complex. What about humans? The Meaning of Interaction Model-based multifactor dimensionality reduction for detecting epistasis Application of the Explicit Test of Epistasis to Colon Cancer Real-world comparison of CPU and GPU implementations of SNPrank NIH/NIGMS Funding by Priority Score Layers of Epistasis February, 2011 Gene-Gene Interaction Analysis Using ReliefF and MDR A genome-wide screen of gene-gene interactions for rheumatoid arthritis susceptibility Epistatic Interactions in Genetic Regulation of t-PA and PAI-1 Levels in a Ghanaian Population Dissecting genetic networks underlying complex phenotypes: the theoretical framework A Comparison of Multifactor Dimensionality Reduction and Penalized Regression March, 2011 Interactome Networks and Human Disease Gene–Environment Interactions in Human Disease Model-Based Multifactor Dimensionality Reduction to detect epistasis for quantitative traits in the presence of error-free and noisy data April, 2011 Genetic analysis of complex traits in the emerging collaborative cross Travelling the world of gene-gene interactions May, 2011 Detecting genetic interactions for quantitative traits with U-statistics Transcriptional robustness and protein interactions are associated in yeast The effects of linkage disequilibrium in large scale SNP datasets for MDR Computational Intelligence Using Genetic Programming Microbiome Studies at the 2012 Pacific Symposium on Biocomputing June, 2011 Pathway of distinction analysis Molecular mechanisms of epistasis Two Epistasis Papers in Science July, 2011 Generating data with complex genotype-phenotype relationships Powerful SNP-set analysis for case-control genome-wide association studies  August, 2011 People are inherently biased against creative ideas New Center Grant on Gene-Environment Interactions September, 2011 Gene-environment interaction in psychiatric research Characterizing Genetic Interactions in Human Disease Association Studies Using Statistical Epistasis Networks HyperCube Rule Mining An R Package Implementation of Multifactor Dimensionality Reduction The 24/7 Lab - Does Creativity Suffer? November, 2011 Entropy-based information gain approaches to detect and to characterize gene-gene and gene-environment interactions December, 2011 The Causes of Epistasis"], "link": "http://compgen.blogspot.com/feeds/7155598611397818123/comments/default", "bloglinks": {}, "links": {"http://compgen.blogspot.com/": 11}, "blogtitle": "Epistasis Blog"}, {"content": ["A must read for those of you interested in epistasis. de Visser JA, Cooper TF, Elena SF. The causes of epistasis. Proc Biol Sci. 2011 Dec 22;278(1725):3617-24. [ PubMed ] Abstract Since Bateson's discovery that genes can suppress the phenotypic effects of other genes, gene interactions-called epistasis-have been the topic of a vast research effort. Systems and developmental biologists study epistasis to understand the genotype-phenotype map, whereas evolutionary biologists recognize the fundamental importance of epistasis for evolution. Depending on its form, epistasis may lead to divergence and speciation, provide evolutionary benefits to sex and affect the robustness and evolvability of organisms. That epistasis can itself be shaped by evolution has only recently been realized. Here, we review the empirical pattern of epistasis, and some of the factors that may affect the form and extent of epistasis. Based on their divergent consequences, we distinguish between interactions with or without mean effect, and those affecting the magnitude of fitness effects or their sign. Empirical work has begun to quantify epistasis in multiple dimensions in the context of metabolic and fitness landscape models. We discuss possible proximate causes (such as protein function and metabolic networks) and ultimate factors (including mutation, recombination, and the importance of natural selection and genetic drift). We conclude that, in general, pleiotropy is an important prerequisite for epistasis, and that epistasis may evolve as an adaptive or intrinsic consequence of changes in genetic robustness and evolvability."], "link": "http://compgen.blogspot.com/feeds/3023362335650261218/comments/default", "bloglinks": {}, "links": {"http://www.nih.gov/": 1}, "blogtitle": "Epistasis Blog"}]