[{"blogurl": "http://scienceblogs.com/evolgen\n", "blogroll": [], "title": "evolgen"}, {"content": ["This is the final post ever at evolgen. It was a fun 4+ years, the last three spent at ScienceBlogs, but it has come time for me to close up shop. \n When I first got into blogging , I did it as a way to share what was on my mind to the few people who would read what I had to say (usually in topics related to evolution and genetics, but not always). It was a fun hobby, and my blog gave me a public venue to talk about articles I was reading, concepts that I found interesting, and summarize important areas of research. \n However, the blog has begun to feel more like a burden. I no longer post because I feel like I have something I want to say, but rather out of obligation (to my contract with Seed, to the five readers who read this site regularly, to my own need to keep generating new content because the blog needs new content). It wasn’t fun anymore. This is reflected in the sporadic posting over the past year — small bursts of inspiration surrounded by frequent periods of ennui (what you now call meh ). \n I had a really good time blogging at the ScienceBorg, but the time has come for me to move on. I’m not sure whether I’ll ever start blogging again, but, if I do, it will be at a new venue. I’ll make sure to let y’all know what’s up via obnoxious emails and requests for more highly-trafficked folks to link to my new internet cave."], "link": "http://scienceblogs.com/evolgen/2009/01/16/this-is-a-good-bye-post/", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://evolgen.blogspot.com/": 1}, "blogtitle": "evolgen"}, {"content": ["Mendel’s Garden is the original genetics blog carnival. The next edition will be hosted by Jeremy at Another Blasted Weblog . If you would like to submit a blog post to be included in the carnival, send an email to Jeremy (jcherfas at mac dot com). The carnival should be posted within the next few days, so get your submissions in ASAP. \n Also, hosts are needed for future editions of Mendel’s Garden. If you would like to host, please send me an email (evolgen at yahoo dot com). A new edition is usually posted around the first Sunday of each month."], "link": "http://scienceblogs.com/evolgen/2009/01/02/mendels-garden-27-call-for-sub/", "bloglinks": {}, "links": {"http://wp.jeremycherfas.net/": 1, "http://mendels-garden.blogspot.com/": 2}, "blogtitle": "evolgen"}, {"content": ["John Hawks points out that Eric Lander has been appointed to co-chair Obama’s Council of Advisers on Science and Technology along with science adviser John Holdren and Nobel Laureate Harold Varmus . Here’s how the AP article describes Lander: \n Lander , who teaches at both MIT and Harvard, founded the Whitehead Institute -MIT Center for Genome Research in 1990, which became part of the Broad Institute in 2003. A leading researcher in the Human Genome Project, he and his colleagues are using the findings to explore the molecular mechanisms behind human disease. \n \n \n Wait, Eric Lander teaches? Really? It turns out he does: \n In addition to his research, Eric is an enthusiastic teacher. He has taught MIT’s core introductory biology course for a decade and, in 1992, won the Baker Memorial Award for Undergraduate Teaching at MIT. He has lectured to both scientific and lay audiences about the medical and social implications of genetics, and delivered a special Millennium Lecture at the White House in 2000. [ link ] \n \n But this really points out flaw in how the general public, including journalists, understand academia. If I were to describe Eric Lander’s professional appointment (or nearly any other research professors appointment, for that matter), “teaching” would not be the first item on the list. In fact, a lot of profs don’t teach at all. Research comes first, then advising grad students and post-docs (which is a kind of teaching, but not the in classroom variety that I imagine most people picture when they say so-and-so teaches at a university) and getting grants (which could be bundled, along with writing papers, under the umbrella of “research”), followed by teaching (if they do that at all). However, most folks only saw their professors as undergrads (if they went to college at all), and in that environment they were teaching classes. \n Eric Lander is a professor, not a teacher. And he’s also taking steps into politics under the upcoming administration. This has got me wondering whether he may move into the position of director of the NHGRI (a post vacated by Francis Collins earlier this year)."], "link": "http://scienceblogs.com/evolgen/2008/12/20/eric-lander-teaches/", "bloglinks": {}, "links": {"http://johnhawks.net/": 1, "http://www-genome.mit.edu/": 1, "http://scienceblogs.com/": 1, "http://www.mskcc.org/": 1, "http://belfercenter.harvard.edu/": 1, "http://www.mit.edu/": 3, "http://www.nytimes.com/": 1}, "blogtitle": "evolgen"}, {"content": ["A couple of years ago, there was talk in the bioblogosphere about getting the general public interested in bioinformatics and molecular evolution: \n \n Amateur bioinformatics? \n Lowering the Ivory Tower with Molecular Evolution \n Molecular Evolution for the Masses \n \n The idea was inspired by the findings of armchair astronomers — people who have no professional training, but make contributions to astronomy via their stargazing hobbies. With so much data available in publicly accessible databases, there’s no reason we can’t motivate armchair biologists to start mining for interesting results. \n But how do we train these new comp-bio code-monkeys? The field of bioinformatics requires both some computational skills, as well as an understanding of biology. Finding people with both skill sets (and interests) can be tricky. Well, a framework has been laid out in a recent paper in PLoS Biology for teaching the skills ( doi:10.1371/journal.pbio.0060296 ). The authors present a web-based interface through which students implement standard online tools for DNA sequence analysis ( Annotathon ). \n \n The course described in the paper takes advantage of the vast amount of data deposited in sequence repositories from metagenomic projects (specifically, the Global Ocean Sampling sequences). Starting with these data, the students perform simple molecular evolutionary analysis, including gene prediction, alignment, and phylogenetic construction. Here’s how the authors summarize their course: \n The goal of the course is to teach students how to computationally annotate biological sequences (DNA and protein sequences). The starting point is a short stretch of DNA sequence (such as a single metagenomic sequencing read) that students are asked to study according to two major lines of inquiry: (1) prediction of gene product putative function and (2) prediction of taxonomic group of origin. \n \n The question remains: how can we translate these courses offered at universities to the general public? Can we inspire armchair computational biologists to analyze data outside of the classroom? \n \n Hingamp P, Brochier C, Talla E, Gautheret D, Thieffry D, et al. (2008) Metagenome Annotation Using a Distributed Grid of Undergraduate Students. PLoS Biol 6(11): e296 doi:10.1371/journal.pbio.0060296"], "link": "http://scienceblogs.com/evolgen/2008/12/18/the-implementation-of-molecula/", "bloglinks": {}, "links": {"http://nsaunders.wordpress.com/": 1, "http://annotathon.univ-mrs.fr/": 1, "http://salamandercandy.wordpress.com/": 1, "http://biology.plosjournals.org/": 2, "http://scienceblogs.com/": 1}, "blogtitle": "evolgen"}, {"content": ["Larry Moran points to a couple of posts critical of microarrays ( The Problem with Microarrays ): \n \n Why microarray study conclusions are so often wrong \n Three reasons to distrust microarray results \n \n Microarrays are small chips that are covered with short stretches of single stranded DNA. People hybridize DNA from some source to the microarray, which lights up if the DNA hybridizes to the probes on the array. \n Most biologists are familiar with microarrays being used to measure gene expression. In this case, transcribed DNA is hybridized to the array, and the intensity of the signal is used as a proxy for the transcriptional level of a large sample of genes. Other uses include identifying copy number polymorphism , genotyping single nucleotide polymorphisms (SNPs), and capturing sequences of interest for downstream analysis. \n \n However, many of these uses are much better implemented with next generation sequencing. For example: \n \n Gene expression can be measured using Solexa sequencing ( doi:10.1101/gr.079558.108 ). This digital quantification is far more precise than microarray analysis, which relies on hybridization intensities. \n Copy number polymorphism can be identified by 454 sequencing using paired-end reads ( doi:10.1126/science.1149504 ). \n SNP genotyping can be performed with next-gen sequencing ( doi:10.1016/j.gde.2006.10.009 ). \n Additionally, Solexa sequencing is replacing microarrays in the high throughput identification of DNA sequences in chromatin immunoprecipitation ( ChIP-seq ) \n \n Now, all of these techniques require a completely sequenced genome (or transcriptome). However, so do microarrays. Therefore, the up front needs aren’t very different. Also, using microarrays to capture sequences can’t be replaced by another technology. But it does rely on next-generation sequencing for downstream analysis. \n Okay, so the question “Do people still use microarrays?” is a bit of hyperbole. But will microarrays be obsolete any time soon? Not if people are still using Sanger sequencing ."], "link": "http://scienceblogs.com/evolgen/2008/12/17/do-people-still-use-microarray/", "bloglinks": {}, "links": {"http://www.affymetrix.com/": 1, "http://www.johndcook.com/blog": 1, "http://www.nature.com/": 2, "http://en.wikipedia.org/": 2, "http://sandwalk.blogspot.com/": 1, "http://reproducibleresearch.org/blog": 1, "http://dx.doi.org/": 4}, "blogtitle": "evolgen"}, {"content": ["Over at Wilkins’ cabana, there’s a post ( Some new work on speciation and species ) on a paper by Nitin Phadnis and Allen Orr ( doi:10.1126/science.1163934 ). Phadnis and Orr isolated a gene responsible for both reproductive isolation and sex-ratio distortion between two populations of Drosophila pseudoobscura . Wilkins doesn’t like speciation genes, and he’s rails on the concept in his post. \n \n What I’m interested in are the comments on Wilkins’ post — primarily the confusion over what the speciation gene hunters mean when they talk about different flavors of speciation. Most population geneticists talk about three types of speciation: allopatric, sympatric, and parapatric. Wilkins’ commenters get caught up in the traditional, geographic definitions of those terms. Specifically, allopatry refers to populations with non-overlapping ranges, sympatry refers to populations with completely overlapping ranges, and parapatry refers to populations with adjacent ranges. \n However, when population geneticists use those terms, they do not refer to geography. Instead, they refer to measures of gene flow, using the parameter ‘m’. That parameter is the probability that an individual from one population mates with an individual from another population. If m=0, there is no interbreeding between the two populations (these are allopatric populations). If m=0.5, there is random mating between the populations (these are sympatric populations). And 0 \n Larry Moran was also hanging out in the comments of Wilkins’ post, downplaying the importance of natural selection in speciation. Orr (and Jerry Coyne) have previously argued ( Speciation ) that natural selection is important for all flavors of speciation (ie, all values of m). I hope it’s obvious how selection against hybrids is important for m=0.5 (or close to it). However, many people think that sympatric speciation is rare, if not impossible. Therefore, natural selection may not be important when averaged over all speciation events. \n But Coyne and Orr also argued that if m=0 (allopatry), natural selection may still be important for speciation. They point to laboratory experiments where populations of Drosophila were reared in separate vials for many generations. The vials subjected to the same environment did not evolve reproductive barriers, while those reared in different environments become more reproductively isolated. This goes against the tradition view of allopatric speciation (that of Ernst Mayr), in which it was driven purely by genetic drift."], "link": "http://scienceblogs.com/evolgen/2008/12/16/all-those-types-of-speciation/", "bloglinks": {}, "links": {"http://www.amazon.com/": 1, "http://dx.doi.org/": 1, "http://scienceblogs.com/": 1}, "blogtitle": "evolgen"}, {"content": ["The 26th edition of Mendel’s Garden will be hosted by A Free Man on December 7. If you have written a blog post about any topics in Genetics in the past month or so, send a link to Chris (chris[at]afreeman[dot]org) to be included in the carnival. \n We’re also looking for hosts for upcoming editions. If you would like to host the original genetics blog carnival, send me an email (evolgen-at-yahoo-dot-com). Every month from February onward is available."], "link": "http://scienceblogs.com/evolgen/2008/11/24/call-for-mendels-garden-26-sub/", "bloglinks": {}, "links": {"http://mendels-garden.blogspot.com/": 1, "http://www.afreeman.org/": 1}, "blogtitle": "evolgen"}, {"content": ["Back in the day, you could sequence a genome and get a Nature paper out of it. Pretty soon, the sexiness of genome sequencing wore off, and it took a bit more to get into a vanity journal. You had to sequence something cute and cuddly, something extinct, or a lot of genomes at once. Any other genome sequencing projects were relegated to lower tier journals. \n Now, it appears that even sequencing the genome of charismatic megafauna only gets you a press release. As TR Gregory points out, the sequencing of the Kangaroo genome was announced in such a manner ( Science by press release ). But check out the title on the press release: \n Australian First: Kangaroo Genome Mapped \n They report that the genome was “mapped”. Not sequenced. This is the incorrect terminology . One the positive side, at least they didn’t say the genome was decoded ."], "link": "http://scienceblogs.com/evolgen/2008/11/19/genome-sequenced-published-via/", "bloglinks": {}, "links": {"http://genomicron.blogspot.com/": 1, "http://www.sciencedaily.com/": 1, "http://us.penguingroup.com/": 1, "http://www.google.com/": 1}, "blogtitle": "evolgen"}, {"content": ["Population biologists often want to infer the demographic history of the species they study. This includes identifying population subdivision, expansion, and bottlenecks. Genetic data sampled from multiple individuals can often be applied to study population structure. When phylogenetic methods are used to link evolutionary relationships to geography, the approaches fall under the guise of phylogeography . \n The past decade has seen the rise in popularity of a particular phylogeographical approach for intra-specific data: nested clade analysis ( Templeton et al. 1995 ; Templeton 2004 ). Many of the methods used in intra-specific phylogeography have been called into question because of their lack of statistical rigor, as I have described previously ( How do you really feel, Dr. Wakely? ). Nested clade phylogeographical analysis (NCPA) is no exception. Lacey Knowles summarizes the criticisms of NCPA in the most recent issue of Evolution ( Why does a method that fails continue to be used? ). \n \n The strongest part of Knowles’ critique focuses on one primary issue: NCPA tends to result in false positives. While NCPA does an adequate job of inferring actual demographic events (such as population subdivision), it falsely identifies extra events. Knowles points out that it is especially biased towards inferring isolation by distance when there has not been any. Interestingly, these false inferences occur with both empirical data (for which the demographic history is assumed to be well known) and simulated data (for which the demographic history is known). Alan Templeton (the creator of NCPA and its most ardent defender) argues that the simulation studies are not an adequate test of NCPA because they only offer simple evolutionary scenarios. However, Knowles points out that if NCPA fails with simple scenarios, how can it be trusted with the complicated ones that exist in nature? \n NCPA is a very popular method — Remy Petit identified over 1700 citations as of about one year ago ( doi:10.1111/j.1365-294X.2007.03589.x ). Additionally, Knowles points out that a six year old critique of NCPA ( Knowles and Maddison 2002 ) has been cited 210 times, often by empirical studies that still used NCPA! That raises the question: why do people continue to use NCPA if it hasn’t been shown to work? It can’t be because they don’t know of the limitations of NCPA — they’re citing papers that layout those limitations. \n Finally, I will relate this to previous rants on evolgen. Knowles points out that some of the criticisms of NCPA rely on the inference of historical events from simulation studies of a single locus. As I have mentioned previously, inference of historical demographic events from a single locus is not acceptable (see here and here ). There is so much stochastic noise in evolutionary systems, and trying to identify demographic history using a sample size of one does not take the large variance of the system into account. Templeton and other NCPA defenders argue that simulations using a single locus are not an adequate test of NCPA. But 88% of the NCPA studies Knowles identified used only a single locus. Not only are people using a method that has never been shown to work, but they are also using the method with insufficient data. Double fail! \n \n Knowles and Maddison 2002. Statistical phylogeography. Mol Ecol 11: 2623-2635 [ link ] \n Knowles 2008. Why does a method that fails continue to be used? Evolution 62: 2713-2717 [ link ] \n Petit 2008. The coup de grâce for the nested clade phylogeographic analysis? Mol Ecol 17: 516 – 518 doi:10.1111/j.1365-294X.2007.03589.x \n Templeton et al. 1995. Separating Population Structure from Population History: A Cladistic Analysis of the Geographical Distribution of Mitochondrial DNA Haplotypes in the Tiger Salamander, Ambystoma tigrinum . Genetics 140: 767-782 [ link ] \n Templeton 2004. Statistical phylogeography: methods of evaluating and minimizing inference errors. Mol Ecol 13: 789 – 809 doi:10.1046/j.1365-294X.2003.02041.x"], "link": "http://scienceblogs.com/evolgen/2008/11/16/is-nested-clade-analysis-worth/", "bloglinks": {}, "links": {"http://scienceblogs.com/": 2, "http://www.nih.gov/": 2, "http://en.wikipedia.org/": 1, "http://www.genetics.org/": 2, "http://www3.wiley.com/": 2, "http://www.google.com/": 1, "http://dx.doi.org/": 4}, "blogtitle": "evolgen"}, {"content": ["You would think that geneticists would have a good definition of “gene”. After all, genes are what we study. In introductory biology courses, you may have been introduced to the concept of the gene as the unit of heredity. That’s all well and good, but when you begin to study genes at a molecular level (i.e., looking at DNA sequences), that definition ceases to be practical. The advent of DNA sequencing led to the concept of the gene as an open reading frame, and the post-genomic era has challenged the very idea of the gene. \n I’ve previously discussed the definition of gene ( What is a gene? , What is a gene? — yes, two different posts with the same title), but I didn’t get into very many details. Alas, I don’t feel like spending much time laying out my opinion, suffice it to say I think “gene” is an obsolete, overly generic term that should be replaced by a more specific term whenever possible. Luckily, the New York Times has published an article by Carl Zimmer sketching out some of the possible interpretations ( Now: The Rest of the Genome ). This lets me pick and chose my favorite meaning from a variety of opinions represented in Carl’s piece. \n \n A lot Zimmer’s article deals with the results from the pilot ENCODE project. One part of the project was a careful examination of which DNA sequences are transcribed into RNA. This led to some remarkable findings, including the discovery that a lot of transcripts consist of sequences encoded in different parts of the genome: \n Encode’s results reveal the genome to be full of genes that are deeply weird, at least by the traditional standard of what a gene is supposed to be. “These are not oddities — these are the rule,” said Thomas R. Gingeras of Cold Spring Harbor Laboratory and one of the leaders of Encode. \n A single so-called gene, for example, can make more than one protein. In a process known as alternative splicing, a cell can select different combinations of exons to make different transcripts. Scientists identified the first cases of alternative splicing almost 30 years ago, but they were not sure how common it was. Several studies now show that almost all genes are being spliced. The Encode team estimates that the average protein-coding region produces 5.7 different transcripts. Different kinds of cells appear to produce different transcripts from the same gene. \n Even weirder, cells often toss exons into transcripts from other genes. Those exons may come from distant locations, even from different chromosomes. \n So, Dr. Gingeras argues, we can no longer think of genes as being single stretches of DNA at one physical location. \n “I think it’s a paradigm shift in how we think the genome is organized,” Dr. Gingeras said. \n \n Another highly touted finding from ENCODE was that the majority of the genome is transcribed. This led some people to conclude that much of the genome consists of undescribed functional elements. \n These discoveries left scientists wondering just how much noncoding RNA our cells make. The early results of Encode suggest the answer is a lot. Although only 1.2 percent of the human genome encodes proteins, the Encode scientists estimate that a staggering 93 percent of the genome produces RNA transcripts. \n John Mattick, an Encode team member at the University of Queensland in Australia, is confident that a lot of those transcripts do important things that scientists have yet to understand. “My bet is the vast majority of it — I don’t know whether that’s 80 or 90 percent,” he said. \n \n That would mean the human genome is chock full of genes. However, just because something is transcribed does not necessarily mean that it is functional. Many sequences may be aberrantly transcribed, representing merely background noise. That is, a lot of the potential “genes” aren’t really genes at all. Of all the people quoted in the article, I find myself agreeing with Ewan Birney and David Haussler the most: \n Despite the importance of noncoding RNA, Dr. Birney suspects that most of the transcripts discovered by the Encode project do not actually do much of anything. “I think it’s a hypothesis that has to be on the table,” he said. \n David Haussler, another Encode team member at the University of California, Santa Cruz, agrees with Dr. Birney. “The cell will make RNA and simply throw it away,” he said. \n Dr. Haussler bases his argument on evolution. If a segment of DNA encodes some essential molecule, mutations will tend to produce catastrophic damage. Natural selection will weed out most mutants. If a segment of DNA does not do much, however, it can mutate without causing any harm. Over millions of years, an essential piece of DNA will gather few mutations compared with less important ones. \n Only about 4 percent of the noncoding DNA in the human genome shows signs of having experienced strong natural selection. Some of those segments may encode RNA molecules that have an important job in the cell. Some of them may contain stretches of DNA that control neighboring genes. Dr. Haussler suspects that most of the rest serve no function. \n \n We’re still left without a concrete definition of a gene, which leads me back to my original conclusion: we should simply abandon the term when dealing with anything beyond simple classical genetics. The gene is far too general, and more specific terminology is warranted in most cases. And I haven’t even touched on the importance of epigenetics (i.e., heritable chromatin modifications, DNA methylation, etc.) and how that affects our definitions."], "link": "http://scienceblogs.com/evolgen/2008/11/12/genes-in-the-postgenomic-era/", "bloglinks": {}, "links": {"http://www.genome.gov/": 1, "http://www.nytimes.com/": 1, "http://scienceblogs.com/": 2}, "blogtitle": "evolgen"}]