[{"blogurl": "http://www.eyeondna.com\n", "blogroll": [], "title": "Eye on DNA"}, {"content": ["Quite a line-up of celebrities! \n Eva Longoria, Meryl Streep, Mario Batali, Stephen Colbert, Malcolm Gladwell, Yo-Yo Ma, Mike Nichols, Kristi Yamaguchi, Elizabeth Alexander, Queen Noor and Louise Erdrich have all submitted DNA tests for a new PBS television series FACES OF AMERICA. \n \n   \n Faces of America with Henry Louis Gates, Jr. airs on Wednesdays, February 10 – March 3, 2010 from 8-9 p.m. ET on PBS."], "link": "http://feedproxy.google.com/~r/EyeOnDna/~3/mMX9kZ-DsDk/", "bloglinks": {}, "links": {"http://www.pbs.org/": 1}, "blogtitle": "Eye on DNA"}, {"content": ["FYI. I tweet about genetics and related science topics under The DNA Network Twitter account @DNAnetwork . Are you on Twitter? \n  \n by Tweet Cloud"], "link": "http://feedproxy.google.com/~r/EyeOnDna/~3/H5bz9qJjRr4/", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://tweetcloud.icodeforlove.com/": 2, "http://www.dnabloggers.com": 1}, "blogtitle": "Eye on DNA"}, {"content": ["That’s right, baby! \n via Buzzfeed"], "link": "http://feedproxy.google.com/~r/EyeOnDna/~3/VuFQ6DB896k/", "bloglinks": {}, "links": {"http://www.buzzfeed.com/": 1}, "blogtitle": "Eye on DNA"}, {"content": ["Matchmaking services are adding DNA testing to their list of offers. The DNA test analyzes HLA genes of the immune system that influence a person’s body odor. The theory is that people are attracted to those whose HLA genes and body odor differ from their own so that their potential offspring have the possibility of inheriting a more varied set of HLA genes leading to enhanced health due to a stronger immune system. \n In an Associated Press article , Dr. Rocio Moran, medical director of the General Genetics Clinic at the Cleveland Clinic said: \n They are just trying to make a buck. That if it’s genetic, it must be real science. \n \n That’s the kind of argument some shady companies are making about direct-to-consumer genetic testing. It reminds me of the ruckus earlier this year over companies that offer genetic testing to parents who’re interested in having their children tested for athletic prowess and other abilities . \n If it’s genetic, it must be real science. \n If it’s science, it must be true. \n Anyone living in the real world knows that genetics and science can only carry you so far. In the end, what it comes down to is the kind of person you are in spite of your genes. That doesn’t mean a genetic test is worthless. If you’re the kind of person that thinks a DNA test holds some kind of magic then maybe you will be able to find a mate who thinks the same way. After all, there’s a lid for every pot."], "link": "http://feedproxy.google.com/~r/EyeOnDna/~3/VvujSirW3BI/", "bloglinks": {}, "links": {"http://www.amazon.com/": 1, "http://www.google.com/": 1, "http://www.eyeondna.com/": 2}, "blogtitle": "Eye on DNA"}, {"content": ["Larry David found out last night on Lopez Tonight that he “fails as a European” being only 63% European according to a DNA ancestry test. David seemed genuinely surprised by the remaining 37% of his ethnicity. Watch the video to find out more about the 37% or click on this link from Twitter ."], "link": "http://feedproxy.google.com/~r/EyeOnDna/~3/QT6FSSfyWiA/", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://www.lopeztonight.com/": 1}, "blogtitle": "Eye on DNA"}, {"content": ["Now we know that claim is misleading. Maury Povich and other talk shows have been offering DNA paternity testing for years but I guess those shows are on during the daytime. In any case, Larry David of Curb Your Enthusiam will get the results of his DNA test tonight 11/10c on the Lopez Tonight show on TBS. Probably not as entertaining as the Maury Show but interesting nonetheless. \n \n via Orlando Sentinel"], "link": "http://feedproxy.google.com/~r/EyeOnDna/~3/HtoCSUlN2IE/", "bloglinks": {}, "links": {"http://www.lopeztonight.com/": 1, "http://www.youtube.com/": 1, "http://blogs.orlandosentinel.com/": 1}, "blogtitle": "Eye on DNA"}, {"content": ["Congratulations to Meb Keflezighi of Eritrean descent, who won the New York City Marathon last Sunday and was the first American to do so since 1982! \n Why did I mention that he was born in Eritrea? Because critics say that an immigrant like Keflezighi who moved to the U.S. at age 12 isn’t a legitimate American. \n A post on Letsrun.com said: \n Give us all a break. It’s just another African marathon winner. \n \n How about making that African- American ? \n Silly me. I thought that naturalized American citizens equal American citizens at birth with the same rights and privileges (with the exception of getting to be the President of the United States). Leaving that debate aside, however, the belief that East Africans are genetically endowed for marathon running has also clouded Keflezighi’s celebration. \n The success of distance runners from Kenya and Ethiopia has fostered a lore of East Africans as genetically gifted, unbeatable, dominant because of their biology. Scientists have looked for — but not found — genes specific to East Africans that could account for their distance ability, said John Hoberman, a professor at the University of Texas at Austin who studies race and sports. \n \n Truly American? Debate Dogs a Triumph in the Marathon – NYTimes.com \n No doubt Keflezighi has genes which enhance his physiological capabilities for endurance and other traits found in winning marathoners. This does not mean that Keflezighi is any more or less American than other non-East African runners who have the same genes. \n The Oxford English Dictionary defines “nationality” in two parts: \n nationality \n noun (pl. nationalities ) 1 the status of belonging to a particular nation. 2 an ethnic group forming a part of one or more political nations. \n \n Even though ethnic groups are mentioned, the U.S. is clearly a country of many ethnic groups so genes should not be part of the debate when discussing whether someone is American or not. \n Quite frankly, I’m not even sure what makes a person American and I don’t think anyone else does either. I hold an American passport and spent the years between ages 6 and 26 in the U.S. I’ve lived in six different countries in the past 10 years and as a result, my national identity is slightly muddled. My son is even more confused. He holds an American passport as well but has never lived in the U.S although he’s lived in four different countries in his seven years. He was born in Japan so some days he says that he’s Japanese and now that he lives in Singapore, he sometimes says he’s Singaporean. I’m sure some people would say he’s not American at all. \n It might be simpler to say we’re global citizens with ties to more than one country. Truth be told, I’m proud to say I’m Chinese-American with the accent to prove it. \n Edited to add this video of Meb Keflezighi on David Letterman:"], "link": "http://feedproxy.google.com/~r/EyeOnDna/~3/8nlOqKLN5G8/", "bloglinks": {}, "links": {"http://www.askoxford.com/": 1, "http://www.nytimes.com/": 1, "http://www.eyeondna.com/": 1}, "blogtitle": "Eye on DNA"}, {"content": ["A little over two years ago, I confessed that I was “ just a little scared of genetic testing .” I have two young children and almost every day I see traits in them that I’m pretty sure they inherited from me whether via genes or behavior. If you’re a parent, I’m sure you can imagine that there’s a lot of self-blame going on in our house. \n So when it comes to genetic testing, I should want to know but I don’t. At least not right this minute. Haven’t I got enough to worry about? \n From Middletown Journal’s month-long series on the battle against cancer – Many with cancer gene don’t want to know . \n There are people out there who may not want to know. There’s a subset of people who if they knew would act on the information and benefit and there are others who would rather bury their heads in the sand. \n ~Dr. Michael Watson, director of the American College of Medical Genetics \n \n NIH Director Francis Collins, however, falls squarely in the camp of those who not only want to know, they act on the info. Well done! \n Collins hits the gym following genetic testing from The Great Beyond, Nature blog \n \n Maybe if a genetic test could motivate me to go to the gym and lose weight, it would be worth it."], "link": "http://feedproxy.google.com/~r/EyeOnDna/~3/0EYshQrCTe4/", "bloglinks": {}, "links": {"http://www.middletownjournal.com/": 1, "http://blogs.nature.com/": 1, "http://www.eyeondna.com/": 1}, "blogtitle": "Eye on DNA"}, {"content": ["Hey criminals! Here’s how you get out of taking full responsibility for your dastardly actions: \n \n Fake your DNA sample \n Blame it on your identical twin \n See if you have the genes that predispose you to whatever crime you’ve committed \n \n Murderer Abdelmalek Bayout and his attorneys chose option three. Bayout admitted in 2007 to stabbing and killing Walter Felipe Novoa Perez in Italy. During the first sentencing, he was found to be mentally ill. This year, neuroscientists also found abnormalities in brain-imaging scans and five genes linked to violent behavior, including MAOA . \n Although there have been numerous cases since 1994 in which the defense argued for leniency based on MAOA deficiency, this is the first case in which this tactic has been successful. Based on the scans and genetic testing results, the judge reduced Bayout’s sentence by another year. \n Not everyone agrees with the judge’s decision. \n \"We don’t know how the whole genome functions and the [possible] protective effects of other genes,\" says Giuseppe Novelli, a forensic scientist and geneticist at the University Tor Vergata in Rome. Tests for single genes such as MAOA are \"useless and expensive\", he adds. \n \n Even worse, this verdict could open the floodgates to claims of all sorts the more we know about genetic influences on behavior. That list above is just about to get longer. \n Source: Scientific American \n Image: “Structural (left) and functional (right) MRI scan data shows that subjects with the violence-related version of the MAO-A gene (MAOA-L) had reduced volume and activity of the anterior cingulate cortex (blue area in front part of brain at left and corresponding yellow area in at right), which is thought to be the hub of a circuit responsible for regulating impulsive aggression. The color-coded areas show where subjects with the L gene type differed from subjects with the H gene type.” \n NIMH Clinical Brain Disorders Branch"], "link": "http://feedproxy.google.com/~r/EyeOnDna/~3/a-vZSJ7mDvM/", "bloglinks": {}, "links": {"http://www.scientificamerican.com/": 1, "http://www.nih.gov/": 1, "http://www.eyeondna.com/": 3}, "blogtitle": "Eye on DNA"}, {"content": ["via Medgadget"], "link": "http://feedproxy.google.com/~r/EyeOnDna/~3/KPH6lVduoX8/", "bloglinks": {}, "links": {"http://www.medgadget.com/": 1}, "blogtitle": "Eye on DNA"}]