[{"blogurl": "http://blogs.reuters.com/felix-salmon\n", "blogroll": [], "title": "Felix Salmon"}, {"content": ["Welcome to the  Counterparties  email. The sign-up page is here , it’s just a matter of checking a box if you’re already registered on the Reuters website. Send suggestions, story tips and complaints to Counterparties.Reuters@gmail.com . \n We’re less than a week away from election, and the political media is setting someone up to lose. Oddly, that person is neither of the candidates, but political polling and statistics blogger Nate Silver . Politico’s Dylan Byers is leading the charge, raising the possibility that Silver “could be a one-term celebrity”. Silver puts a 74% chance on an Obama victory, but that makes no sense to Byers, because “polls have [Romney] almost neck-and-neck with the incumbent”. Byers brings in quotes from insiders and pundits to support the idea that the race is a “toss-up” and that Silver is, in Joe Scarborough’s words, a “joke”. \n Silver, however, is completely comfortable with his position, telling Byers: \n If the Giants lead the Redskins 24-21 in the fourth quarter, it’s a close game that either team could win. But it’s also not a “toss-up”: The Giants are favored. It’s the same principle here: Obama is ahead in the polling averages in states like Ohio that would suffice for him to win the Electoral College. Hence, he’s the favorite. \n David Brooks might not be comfortable with that kind of statement, but as Ezra Klein points out, mathematics is : “If Mitt Romney wins on election day, it doesn’t mean Silver’s model was wrong… the model has been fluctuating between giving Romney a 25 percent and 40 percent chance of winning the election”. Brad DeLong goes back and forth with Byers and Silver in defense of statistical modeling, and the results aren’t pretty for Byers. Jason Linkins slams Politico for failing to differentiate probability from prediction, and instead just “trolling the bejeezus out of Nate Silver”. \n Experience, after all, can limit your ability to assess information. Henry Farrell agrees with Paul Krugman that fetishizing inside knowledge and scoops limits what you can learn to what you already know: you become “peculiarly vulnerable to self-reinforcing illusion”. Krugman thinks that in most cases, “careful analysis of publicly available information almost always trumps the insider approach”. — Ben Walsh \n On to today’s links: \n What $4 Billion Buys You \nGeorge Lucas says Disney could make Star Wars films for the next 100 years – MTV \n Billionaire Whimsy \nThe politics and economics of the American austerity lobby – American Prospect \n Old Normal \nVocational training: 15-year old interns working on assembly lines – LAT \n Hunkering Down \nHow Wall Streeters endured Sandy: With $1,000 Bordeaux and board games – Max Abelson \n“I predict my office will never be cleaner than it will be today”, says New York trader – Reuters \n MF Doom \nWoman at the center of the MF Global scandal: “They’ve got the wrong chump” – WSJ \n #Sandy \nThe best time lapse video of what #Sandy did to Lower Manhattan – Jalopnik \nHow the storm brought NYC’s inequality to the surface – David Rohde \nOutrage in the powerless zone: Dispatch from lower Manhattan – Gothamist \n Primary Sources \nChris Christie’s official order rescheduling Halloween – State of New Jersey \nHarvard Business School, deep blue state – Harbus \n JP Morgan \nJPMorgan sues failed whale-tamer in London court – Reuters \n EU Mess \nEurozone unemployment hits record levels, 1 in 4 jobless in Spain and Greece – Guardian \n Sad But True \nPeople living in poverty are twice as likely to be depressed – Atlantic \n Wonks \nWhy Kocherlakota is a hero of rigor and intellectual honesty – Matt Yglesias \n Alpha \nNever mind markets, indices aren’t that efficient – EDHC Risk Institute"], "link": "http://blogs.reuters.com/felix-salmon/2012/10/31/counterparties-the-pundits-vs-nate-silver/", "bloglinks": {}, "links": {"http://blogs.reuters.com/": 1, "https://commerce.reuters.com/": 1, "http://links.reuters.com/": 36, "http://counterparties.com/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["What a difference a day makes: yesterday, the streets of hurricane-devastated New York were largely empty; today, the electrified parts of the city are in a massive state of gridlock. It’s just as well the threatened Obama visit isn’t happening : traffic in Manhattan and most of Brooklyn is bad enough without it. \n New York began as a small town based at the Battery, and slowly expanded northwards towards Wall Street (where the city wall was originally built) and beyond up to City Hall. It then expanded from there to the megalopolis it is today — but the heart of the city has always been, and will always be, downtown, where the East River and the Hudson River meet New York Harbor. \n And right now, that heart — downtown New York — is a black hole. No electricity, no cell service, no heat in most buildings, no subway service, not even after it is restarted on a limited basis tomorrow. The temporary subway map is stark: everything just comes to a sudden halt at 34th Street, and at Borough Hall/MetroTech in Brooklyn. No electricity means no subways, and also no traffic lights. \n In many ways, one of the most heartening lessons of Sandy was the utter lack of chaos in downtown Manhattan after the power went out. When the sun rose on Tuesday morning, cars, bikes, pedestrians, and emergency vehicles navigated the grid of streets efficiently and without rancor, and the amount of time it took to drive across town was if anything lower, with all the businesses shut, than it would normally be with all the traffic lights working. Public-spirited acts were everywhere: volunteers taking it upon themselves to direct traffic at major intersections; people bringing down power strips to the few outlets with generator-powered electricity; restaurants serving up their food for free to the local population; coffee shops jerry-rigging propane-based systems to give the people what they really need. \n It turns out, as students of the Dutch woonerf system could tell you, that when drivers are forced to self-govern, rather than simply following the orders of speed limits and traffic lights, the system generally works extremely well, at least until traffic reaches a certain density. Similarly, the speed-limits-and-traffic-lights system also tends to work pretty well, until it doesn’t. \n The idea is to maximize the number of person-miles per hour, especially during the morning and evening peaks. And there’s a real science to this: up until a certain point, if you add an extra car to the system, that increases person-miles per hour, just because that car contains people who are traveling a certain number of miles. But past that point, adding extra cars doesn’t help; instead, it hurts. You know how on a freeway traffic can be flowing smoothly and then suddenly grind to a halt for no particular reason? At that point, clearly, the capacity of the freeway to generate person-miles per hour plunges. And city traffic works the same way. In extremis , once you reach gridlock, no one is moving anywhere. And a world where people take half an hour to travel five blocks is clearly a world where they all would have been much better off just walking. \n This morning, and this evening too, New York — electrified New York, that is, above 39th Street — suffered some of the worst gridlock it has ever seen; in a press conference, mayor Michael Bloomberg said that “the streets just cannot handle the number of cars that are trying to come in”. This is the context in which cab company Uber is boasting that it is “doing our best to figure out ways to get more cars on the road.” They’re even losing money by doing so — and exacerbating congestion at the same time. Under the Uber model, a lone driver will drive an often-substantial distance to pick up what is usually a lone passenger, will then drop off that passenger, and repeat the procedure over the course of the day. The car rarely has more than two people in it, often only has one, but is driving around the city and contributing to congestion on a continuous basis. (In contrast to private cars, which at least have the decency to park themselves out of the way when their job is done.) \n The city of New York has a much better idea when it comes to cabs. Yellow taxis are being encouraged to get passengers to share rides, while black cars are allowed to pick up street hails (and can also pick up additional passengers). On top of that, the mayor announced today, there is going to be a new rule in effect tomorrow: if you’re driving into Manhattan after 6am using any of the major bridges or tunnels, you’re going to need to have at least three people in your car. Otherwise, you won’t be allowed through. \n There’s a problem with this policy, which is that people are going to find it relatively easy to “ slug ” their way into Manhattan, getting rides with drivers who otherwise wouldn’t be allowed in, only to be stuck when those same drivers happily leave the island without them . But the principle is a good one: there’s no way that private cars can possibly transport everybody who needs to come into Manhattan, and as a matter of public policy, everybody gains if the number of private cars in the city is reduced. This is not the first-best policy, but it is the easiest to implement immediately, and in a situation like we have right now, you can’t have the perfect be the enemy of the good. \n If the East River subway tunnels remain closed for more than a few days, however, this stopgap approach is not going to work. Millions of people commute from Brooklyn to Manhattan every day, and the only way they can be accommodated is with those subway tunnels. Every day those subway tunnels are out of operation is a day that New York City is essentially not functioning. And by one estimate , it could take weeks or even months for those saltwater-flooded subway tunnels to reopen. \n Which means that the bigger-picture lesson of Sandy is the importance of investment in infrastructure. Our electrical utility, unable to find $250 million to spend on things like submersible switches and moving transformers above ground, is making adjustments only gradually — with the results we saw on Monday night. And $250 million is small beer compared to the kind of money it would take to protect New York Harbor from hurricanes, and to protect those subway tunnels from Sandy-level storm surges. Still, $10 billion or even $50 billion spent up-front would not only be a large economic stimulus for New York, but would more than pay for itself if and when global warming means that more hurricanes hit this area. \n Where would that sort of money come from? Cate Long has one suggestion: \n The most obvious source of funding for these projects would be for the Federal Reserve to purchase public infrastructure bonds instead of the $40 billion a month of mortgage-backed securities it has been buying. The housing market is important, and keeping mortgage rates low is useful, but investing in public infrastructure is much more important for the nation now. \n It’s not a bad idea: the Fed would do more long-term good for the country by buying infrastructure bonds than it would buying mortgage-backed securities. But there are problems with it, too: once the Fed stepped in, the chances are that no one else would lend, and private financing of public infrastructure would actually go down rather than up. Maybe some kind of Treasury guarantee would be better, especially since these projects are fundamentally fiscal, rather than monetary, in nature. \n In any case, there’s a clear public interest when it comes to investing in and coordinating our urban infrastructure. America’s cities, including New York, have been suffering from underinvestment for decades. Hurricanes happen sometimes; traffic jams happen every day. And some smart public expenditure could help minimize the damage that both of them cause."], "link": "http://blogs.reuters.com/felix-salmon/2012/10/31/how-resilient-is-new-york-city/", "bloglinks": {}, "links": {"http://brooklyn.ny1.com/": 1, "http://qz.com/": 1, "https://twitter.com/": 4, "http://streetswiki.wikispaces.com/": 1, "http://techcrunch.com/": 1, "http://www.ny.gov/": 1, "http://www.buzzfeed.com/": 1, "http://gothamist.com/": 1, "http://www.politico.com/": 1, "http://blogs.reuters.com/": 2, "http://www.nytimes.com/": 1, "http://updates.gizmodo.com/": 1, "http://www.ediblemanhattan.com/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["Welcome to the  Counterparties  email. The sign-up page is here , it’s just a matter of checking a box if you’re already registered on the Reuters website. Send suggestions, story tips and complaints to Counterparties.Reuters@gmail.com \n Hurricane Sandy has killed at least 30 people , and caused somewhere north of $10 billion in economic damages. Will the next casualty be the US general election, which is scheduled to take place next Tuesday? \n As Ben Jacobs points out, “there is no precedent whatsoever for a natural disaster of this scale before a federal election”, and the result could be a major constitutional crisis. Voting is organized on a state-by-state basis, and New Jersey governor Chris Christie , for one, says he’s got “much bigger fish to fry” right now than worrying about whether he’s going to be able to get his state’s hurricane-struck population to the polls this time next week. (He’s absolutely right about that, as these pictures from Atlantic City testify.) \n If you’re wondering why exactly US elections are scheduled for Tuesdays in November, the most basic answer is “ no good reason ”. The most detailed response is rooted in what now seems like a historical oddity: in 1845, Congress needed to pick a voting day that allowed farmers a day to travel each way to the country seat to vote without missing any religious services or market day (Wednesday). Tuesday was the only option left. \n How to alter that archaic decision in the face of disaster is unclear. A 2007 study by the bipartisan Election Assistance Commission provides suggests looking at “existing State law to determine if the Governor has the power to cancel an election or designate alternative methods for distribution of ballots”. And the Washington Post’s Rachel Weiner has also dug up a 2004 Congressional report stating that “there is also no federal law which currently provides express authority to ‘postpone’ an election”, although states might be allowed to postpone voting under “exigent circumstances”. \n Which raises the possibility, in this very close election year, that both Obama and Romney will fail to get 270 electoral votes on Tuesday, and will have to wait some unknown amount of time before New Jersey’s 14 electoral votes finally get added — to the Obama tally , of course. – Ben Walsh \n On to today’s links: \n Data Points \nSandy estimated to cause $5-10 billion in insured losses and $10-20 billion in economic losses – Reuters \n Economy \nThe broken window fallacy: why natural disasters don’t stimulate the economy – Acton Institute \nWhy I Don’t Love Frederic Bastiat – Matt Yglesias \n Disgusting \nThe real identity of last night’s Twitter villian, @ComfortablySmug – FWD \n Politicking \nRomney refuses to comment on plans to eliminate FEMA, 14 times – Gothamist \n Central Banking \nHow the Fed responded to Sandy – John Carney \n Yikes \nStudy: NYC’s subways could take between 21 days and several months to be restored – Quartz \n Defenestrations \nApple exec responsible for maps flop on his way out – LAT \n Bank Bloodletting \nUBS humanely communicates some of 10,000 job cuts by deactivating office IDs – FT \n Rebuttals \nLook closely at the “prosperity index” – rising inequality is more important than debt – Dan Drezner \n Dubious Conclusions \n$16-30 trillion? Vague assumptions drive industry estimates of regulatory costs – Peter Eavis \n Random \nBofA employee background check reveals unpaid omelet bill from 1998 – Consumerist \n Quotable \n“‘Shut up, nerd’ is not an argument.” – American Conservative"], "link": "http://blogs.reuters.com/felix-salmon/2012/10/30/counterparties-sandy-tuesday/", "bloglinks": {}, "links": {"http://usnews.nbcnews.com/": 1, "http://gothamist.com/": 1, "http://reuters.com/": 2, "https://commerce.reuters.com/": 1, "http://www.slate.com/blog": 1, "http://www.reuters.com/": 1, "http://theamericanconservative.com/": 1, "http://www.tnr.com/blog": 1, "http://www.eac.gov/": 1, "http://www.newyorker.com/": 1, "http://www.washingtonpost.com/blog": 1, "http://latimes.com/": 1, "http://cnbc.com/": 1, "http://drezner.foreignpolicy.com/": 1, "http://counterparties.com/": 13, "http://www.fas.org/": 1, "http://qz.com/": 1, "http://consumerist.com/": 1, "http://dealbook.nytimes.com/": 1, "http://gofwd.tumblr.com/": 1, "http://www.ft.com/": 1, "http://blog.acton.org/": 1, "http://www.whytuesday.org/": 1, "http://www.salon.com/": 1, "http://blogs.reuters.com/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["Welcome to the  Counterparties  email. The sign-up page is here , it’s just a matter of checking a box if you’re already registered on the Reuters website. Send suggestions, story tips and complaints to Counterparties.Reuters@gmail.com \n If you live on the East Coast, we trust you are reading this safe and dry – and from home. New York shut down the largest mass transit system in North America last night, ordered mandatory evacuations in the lowest parts of the city, and is preparing to pre-emptively shut down power in lower Manhattan . Millions more are likely to lose power across the region. \n Banks implemented contingency plans to keep critical businesses running, but stock and options markets were closed today, and will be closed again tomorrow . Bond markets were open for half a day today and will likely be closed tomorrow . The storm may cause $18 billion in damage. The Washington Post’s Sarah Kliff has a great piece explaining why it is getting harder and harder for insurance companies to estimate how much they will have to pay out in losses. \n Productivity loss is murkier still. Industries like travel and cargo shipping are obviously slowed (More than 12,000 flights have been canceled across the country.) But experts note that a backlog isn’t the same as completely lost business: “The cost of the cargo disruptions probably won’t be large…While cargo gets backed up it eventually gets delivered”. \n The economy at large appears at least as resilient. The NYT’s Binyamin Appelbaum takes a look at a 2010 study from the Inter-American Development Bank (full report here ). His summary : \n \n For all the devastation wreaked by natural disasters, economists say that the long-term impact on a nation’s economy is generally negligible — particularly in countries with strong institutions and deep pockets. \n \n Moody’s calls the impact “noticeable but temporary”. Yet, as economist Justin Wolfers tweeted , “Asking what a hurricane does to GDP is about as pointless as asking what a war does. Tells you more about problems with GDP than anything”. Unless you’re a property insurer, you almost certainly have more important things to worry about than the economic, as opposed to human, cost of Sandy. — Ben Walsh \n Taxmageddon \nHow stock pickers are looking to game the fiscal cliff – WSJ \n Size Matters \nWithout too-big-to-fail policies “there is no longer evidence of economies of scale at bank sizes above $100 billion” – Bank of England \n Data Points \nBLS: Friday’s jobs report “will be business as usual” – Huffington Post \n Green Shoots \nWhere the US GDP growth is: housing and defense spending – Matt Philllips \n Oxpeckers \n“Do you know more about Enron’s secret accounting? Tell us IN THE COMMENTS” – Choire Sicha \n Servicey \nNow is the time to overdraw your Chase checking account without those pesky fees – JP Morgan \n25 retailers plan “Bitcoin Friday” – American Banker \n Endorsements \nPersonal finance expert MC Hammer couldn’t make Cash4Gold a success – Dan Primack \n Tax Arcana \nThe “charitable remainder unitrust” – how to get tax breaks for money which is coming back to yourself – Jesse Drucker \n Capers \nA Russian ship with 700 tons of gold ore has gone missing – NYT"], "link": "http://blogs.reuters.com/felix-salmon/2012/10/29/counterparties-the-sandy-economy-2/", "bloglinks": {}, "links": {"http://theawl.com/": 1, "http://professional.wsj.com/": 1, "http://nytimes.com/": 1, "http://investor.shareholder.com/": 1, "http://bloomberg.com/": 1, "http://gothamist.com/": 1, "http://alert.mta.info/": 1, "https://commerce.reuters.com/": 1, "http://www.reuters.com/": 2, "http://economix.nytimes.com/": 1, "http://idbdocs.iadb.org/": 1, "http://bankofengland.co.uk/": 1, "http://www.washingtonpost.com/blog": 1, "http://online.wsj.com/": 1, "http://counterparties.com/": 10, "http://americanbanker.com/": 1, "http://finance.cnn.com/": 1, "http://home2.nyc.gov/": 1, "http://www.bloomberg.com/": 3, "http://qz.com/": 1, "https://twitter.com/": 1, "http://www.huffingtonpost.com/": 1, "http://blogs.wsj.com/": 1, "http://blogs.reuters.com/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["(Picture from Stephen Foley ) \n “When it comes to natural disasters,” says Rob Cox today, “there’s no such thing as too much preparation.” He then goes on to extend the analogy: \n In advance of Sandy’s march through Manhattan, thousands of sandbags have been stacked in front of the downtown headquarters of Goldman Sachs. It is a picture whose metaphorical value should not be lost on regulators, policymakers, shareholders and the bankers themselves: when the flood comes, there can never be too many sandbags, or capital, to prevent a wipeout. \n There are a few problems with this line of argument. Firstly, of course there is such a thing as too much preparation when it comes to natural disasters. Cox praises New York mayor Mike Bloomberg for evacuating Zone A — the lowest parts of the city which are most susceptible to storm surges. But an evacuation of all of Long Island, for instance, or all of Manhattan, would surely be way too much. \n At the same time, three’s a good reason why Goldman Sachs needed to get in thousands of sandbags: it’s in that very-high-risk Zone A. \n A brief history of Manhattan skyscrapers: they were first built in Lower Manhattan, at the highest possible points around there. Look at the Woolworth Building, say, or the New York Stock Exchange, or the Bank of New York building, or City Hall, or even Chase Manhattan Plaza: all of them are on or near Broadway, which runs up the highest part of Lower Manhattan, which means that all of them are in Zone C. And as skyscraper construction moved north in the 1930s, the same thing held true: the Empire State Building, the Chrysler Building, and all the midtown skyscrapers are all well outside the reach of any storm surge. \n But then skyscraper building became more high-tech and scientific, and very tall buildings started to be constructed in Zone A, very close to the water. The architects did lots of clever mathematics, or the actuaries did lots of clever sums, and soon there were dozens of huge buildings in the Manhattan flood zone; the Goldman Sachs headquarters at 200 West Street is merely the most recent. \n Now, with a Frankenstorm approaching, the decision to build so close to the water is coming home to roost, and firms like Goldman Sachs are scrambling to try to protect themselves. Hence the sandbags. Which aren’t really preparation; they’re more like a desperate last-ditch attempt to save a multi-billion-dollar headquarters building from very nasty flooding. \n And the fact is that Goldman’s sandbags, along with all the other sandbags being deployed up and down the east coast (including in my very own apartment building), are very unlikely to be any use at all. They’re meant to be trying to protect property against a huge storm surge, which could reach 11 feet; the chances have to be very slim indeed that the surge will be big and powerful enough to reach the sandbags, but small and weak enough that the sandbags will suffice to keep it at bay. \n Or, to put it another way: when big tail events happen, the old models get broken, and you can’t rely on them any more. That’s true when it comes to building skyscrapers, and it’s also true when it comes to financial crises. In fact, it’s even more true when it comes to financial crises. \n Hurricane Sandy is a known unknown: it’s approaching New York, and the only real question is how high the storm surge is going to get. It could be six feet, it could be nine feet, it could be 12 feet. Bank capital, by contrast, is something which disappears in a much less linear fashion. A bank’s capital is just the difference between two huge numbers: its assets, and its liabilities. Its liabilities are fixed; its assets are loans, and derivatives, and other financial instruments which can fluctuate in value dramatically, especially in a crisis. What’s more, assets which banks think of as being ultra-safe — “quadruple-A”-rated super-senior CDO tranches, for instance — turn out to be precisely the assets which implode in value when a crisis comes along, turning banks insolvent overnight. \n And that’s just the solvency problem: the bigger issue is liquidity, in a world where banks roll over billions of dollars of debt every day. You can protect yourself as much as you like, but if your lenders for whatever reason stop rolling over your debts, you’re toast. Let’s say you needed to sell lots of US stock today, for instance. Well, thanks to Sandy, you can’t: the stock market is closed. When liquidity dries up, everybody, no matter how prepared they are, is affected, and either central banks manage to step in to save the day, or they don’t. No mere mortal, without a printing press, can hold out. \n Financial crises are similar to storms: they require humility, not hubris. Being prepared can be helpful at the margin, but ultimately it doesn’t matter how good your liquidity management teams and risk ledgers and counterparty hedging operations are: if everybody else is blown over by forces beyond their control, then you will be too. \n That’s why skyscrapers always used to be built well above the water level, and that’s why we used to have dumb regulations like Glass-Steagal and Basel I, which weren’t very sophisticated, but which generally did the trick. Buildings like 200 West are a bit like Basel III: they’re built with models, so that they can withstand certain forces. But if an unprecedented storm arises, they’re still more at risk than, say, Trinity Church, built more than 150 years earlier. Sometimes, simple common sense (high ground is safer, huge books of complex derivatives can blow up in unpredictable ways) does a lot more good than any amount of sophisticated preparation."], "link": "http://blogs.reuters.com/felix-salmon/2012/10/29/how-goldman-sachs-protects-itself-from-a-hundred-year-storm/", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://blogs.reuters.com/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["I have to give it to Reynolds Holding on this one: he called it, I was wrong , and today I paid him $5 in settlement of our bet . To the astonishment of almost everybody I know (except Ren), the Second Circuit sided with Elliott Associates and ruled unanimously against Argentina today. It’s a hugely important decision , which will certainly have unintended consequences for many years to come. \n You can see the market reaction most clearly in Argentina’s credit default swaps, which gapped out to a whopping 1,325bp. That’s up 350bp on the day, and it’s a clear sign that the markets are extremely worried the unexpected ruling will cause the very thing it’s ostensibly trying to cure: an Argentine default. \n This isn’t the end of the story — but it is the beginning of the end. Argentina is making noises about appeals, but at this point it’s not obvious that higher courts will even accept the case. And while it’s true that the Second Circuit did end up punting on the one bit of the original ruling which actually had teeth, all of their language implies that they’ll ultimately uphold it. \n Here’s the problem facing the US courts. Everybody agrees — even Argentina is happy to agree to this — that Argentina owes Elliott Associates lots of money. Everybody agrees that Argentina has a contractual obligation, under New York law, to pay lots of money, to Elliott, right now if not sooner. But of course Argentina has made no such payment. And so it’s very easy for Elliott to go to a New York judge (in this case, Thomas Griesa), and get that judge to hand down a judgment telling Argentina in no uncertain terms that it owes Elliott lots of money. And Argentina will in turn treat that judgment with exactly the same respect it gives to the original bond contract. In fact, for tactical reasons, Elliott has chosen not to become a judgment creditor: if it just had a court judgment, and not a bond contract, then it would find it much harder to argue arcane legal points about various bits of legal boilerplate in the contract. \n Which is why, in February, Griesa came up with an order which carried much more force than a simple judgment. The order comes with a real punch: \n Within three (3) days of the issuance of this ORDER, the Republic shall provide copies of this ORDER to all parties involved, directly or indirectly, in advising upon, preparing, processing, or facilitating any payment on the Exchange Bonds (collectively, “Agents and Participants”), with a copy to counsel for NML. Such Agents and Participants shall be bound by the terms of this ORDER as provided by Rule 65(d)(2) and prohibited from aiding and abetting any violation of this ORDER, including any further violation by the Republic of its obligations under Paragraph 1(c) of the FAA, such as any effort to make payments under the terms of the Exchange Bonds without also concurrently or in advance making a Ratable Payment to NML. \n This is very cunning stuff. Remember that Argentina is happily current on its outstanding bonds: what that means in practice is that every time a coupon payment is due, it pays that money to the bondholders’ Trustee, Bank of New York, which in turn divvies it up between all the current bondholders. As you might guess from its name, Bank of New York is very much under the jurisdiction of New York courts. And Griesa, with this order, is taking aim directly at Bank of New York. If Argentina tries to pay its existing bondholders without at the same time paying Elliott Associates and the other holdouts, then Bank of New York will be aiding and abetting a violation of his order. And there’s no way it wants to do that . \n The problem here, from a legal perspective, is that once Bank of New York has the money, the money belongs to bondholders, not to Argentina. And so it’s difficult for Griesa to tell the bank it’s not allowed to remit the money to the bondholders who have every legal right to it. \n In terms of the meat of Griesa’s order, it’s this part about “aiding and abetting” which really gave Elliott hope that it might finally be able to collect on what it was owed. And, just to drag things out a bit longer, that’s the one bit of the order that the Second Circuit felt uncomfortable about: \n We do have concerns about the Injunctions’ application to banks acting as pure intermediaries in the process of sending money from Argentina to the holders of the Exchange Bonds. Under Article 4-A of the U.C.C., intermediary banks, which have no obligations to any party with whom they do not deal directly, are not subject to injunctions relating to payment orders… \n Oral argument and, to an extent, the briefs revealed some confusion as to how the challenged order will apply to third parties generally. Consequently, we believe the district court should more precisely determine the third parties to which the Injunctions will apply before we can decide whether the Injunctions’ application to them is reasonable. \n This gives a sliver of hope to Argentina — but only a sliver. The Second Circuit remanded the case back down to Griesa to clarify his order a bit, and they’re really only asking for clarification rather than evisceration. The whole point of the order is that it includes US actors as well as Argentina itself, and there’s no way that Griesa will reword things so that Bank of New York is suddenly magically excluded. \n Once Griesa’s clarification makes its way back to the Second Circuit, the judges there have made it abundantly clear that they’re well-disposed towards the lower-court judge, and very ill disposed towards Argentina. As JP Morgan’s Vladimir Werning says of the request for clarification: “While this may generate a perception that the Appeals Court can change its mind if the District Court clarifications do not satisfy it, we doubt this is likely to happen.” \n I’m sure that Argentina and its lawyers have been working for a while on contingency plans which they could put in place were the Second Circuit to uphold the lower court’s decision: those plans have now taken on extra urgency, but it’s really not obvious what Argentina can do, especially if it wants to avoid yet another event of default. There’s paying off the holdouts, of course, but that would be politically incredibly dangerous, and it’s hard to imagine Cristina Kirchner ever signing off on such a thing. She might not be the world’s most principled politician, but her hatred for Elliott and the holdouts is real. And as Werning’s excellent note says, none of the alternatives are particularly appealing — or particularly likely to avoid the countries CDSs being triggered. \n Argentina does have time — a fair amount of time, too, if this ends up being successfully appealed to the Supreme Court. After all, the US government argued on Argentina’s side; I’m no lawyer, but I’ve got to imagine that SCOTUS tends to at least hear the cases which would otherwise go against the government’s wishes. \n What’s more, the Second Circuit has given the Supreme Court an interesting third option: rather than completely upholding the original order, or striking down completely, the Supremes could basically go just as far as the Second Circuit did today, and then ultimately reject the extra step of including Bank of New York and/or other blameless intermediaries. \n I don’t think that will happen, however: in many ways it would represent the worst of both worlds. It would still be a huge change to international law, and would amount to a very significant weakening of the Foreign Sovereign Immunities Act . The US government, in other words, would suffer a massive loss. And at the same time it would in practice let Argentina off the hook — and no one has much sympathy for Argentina here, a country which has been thumbing its nose at the US courts for years. \n So the base-case scenario at this point has to be that Elliott will ultimately win. I can hardly believe I’m writing these words: I’ve been writing about holdouts, or vultures, or whatever you want to call them, for a good dozen years now, and although they’ve had victories here and there, there’s been nothing remotely as big or precedent-setting as this. When push comes to shove, governments make laws, and the official sector is generally good at closing ranks and making sure that sovereign rights and immunities are protected. \n Except, that doesn’t seem to be the case any more. The part of the Second Circuit’s argument dealing with sovereign immunity is probably the weakest bit, but the court certainly doesn’t pay much if any deference to the United States and its arguments here: \n The Injunctions at issue here are not barred by § 1609. They do not attach, arrest, or execute upon any property. They direct Argentina to comply with its contractual obligations not to alter the rank of its payment obligations. They affect Argentina’s property only incidentally to the extent that the order prohibits Argentina from transferring money to some bondholders and not others. The Injunctions can be complied with without the court’s ever exercising dominion over sovereign property. For example, Argentina can pay all amounts owed to its exchange bondholders provided it does the same for its defaulted bondholders. Or it can decide to make partial payments to its exchange bondholders as long as it pays a proportionate amount to holders of the defaulted bonds. Neither of these options would violate the Injunctions. The Injunctions do not require Argentina to pay any bondholder any amount of money; nor do they limit the other uses to which Argentina may put its fiscal reserves. In other words, the Injunctions do not transfer any dominion or control over sovereign property to the court. Accordingly, the district court’s Injunctions do not violate § 1609. \n A lot of the oral arguments surrounded this point, and it seemed, to me at least, that Argentina’s side was much more convincing. It’s true that “the Injunctions do not require Argentina to pay any bondholder any amount of money”, but if Argentina wants to stay current on its bonds — and that’s a perfectly reasonable thing to want to do — then they absolutely do require Argentina to pay holdout creditors at the same time. Which seems like an override of Argentina’s sovereign will to me. Conversely, if Argentina chooses not to pay the holdouts, it will be in the odd position that it can do anything it wants with its money — it is a sovereign nation, after all — except give it to the very creditors it made a solemn promise to pay in 2005 and 2010. \n The result is a very weird and scary world, for all sovereigns, including the US — and for the markets, too. Sometimes, markets are secretly cheering the vultures: after all, the more money vultures make, the healthier the bid for bonds when countries tumble towards default. But in this case, the decision is clearly bad for markets. For one thing, by emboldening holdouts, it makes future sovereign debt restructurings much more difficult. (The Second Circuit tries to say that it doesn’t, thanks to something called Collective Action Clauses, but as Anna Gelpern says, that argument doesn’t hold water .) \n More broadly, this ruling is just one more step towards a world where the old verities about sovereign risk simply don’t hold any more. It used to be that sovereigns were sovereign: that was bad news if they unilaterally decided to default on you, but other than that it was pretty good news. Now, however, they’re at the mercy not only of unelected technocrats at places like the IMF or the ECB; they’re also at the mercy of unelected judges in New York. Sovereigns have less freedom of movement now than they have done in a very long time, and we’re only beginning to grok the implications of those constraints. \n As far as Argentina is concerned, it might just have to pay the holdouts. No one knows how much money that might entail spending: the figures range from $1.3 billion at the low end (large, but manageable) to $12 billion at the high end. That would cause real economic damage. Again, Werning is good on this. And whether or not Argentina pays the holdouts, the risk of a credit event in the CDS market are seriously high right now: there’s a hundred ways that things could go wrong and the CDS could get triggered. In fact, this being Argentina, it’s entirely possible that the government could deliberately trigger the CDS, after various important people had loaded up on protection. \n The upshot is a significant rise in uncertainty, in an asset class which could really do without such a thing right now. The Second Circuit’s narrow and constructivist view of some long-ignored legal boilerplate could end up having very profound effects on global markets and economics. Maybe that’s what the letter of the law demanded. But I sure wish it didn’t."], "link": "http://blogs.reuters.com/felix-salmon/2012/10/27/argentinas-stunning-pari-passu-loss/", "bloglinks": {}, "links": {"http://emaillink.jpmorgan.com/": 1, "http://newsandinsight.thomsonreuters.com/": 3, "http://www.businessweek.com/": 1, "http://www.creditslips.org/": 2, "http://blogs.reuters.com/": 4, "http://www.uscourts.gov/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["Welcome to the  Counterparties  email. The sign-up page is  here , it’s just a matter of checking a box if you’re already registered on the Reuters website. Send suggestions, story tips and complaints to  Counterparties.Reuters@gmail.com \n Today, FHFA announced that Fannie Mae and Freddie Mac are expected to cost taxpayers $76 billion through 2014, instead of the previous projection of $142 billion. But that may not be enough to save their regulator’s job. Shahien Nasiripour reports that the Obama administration is pondering a recess appointment to replace Ed DeMarco, who was named the acting director of FHFA in 2009. \n DeMarco may be the most reviled bureaucrat in Washington, thanks to his repeated opposition to principal reduction for struggling homeowners. In January, the Treasury Department tripled the incentives for mortgage companies to offer homeowners such reductions; DeMarco promptly refused to consider them, even when internal company reports suggested principal reductions would actually save  Fannie and Freddie money. As Felix wrote in July, DeMarco’s argument against principal reductions was “less financial than moral”, and DeMarco put his government agency in the strange position of vetoing the same government’s economic policy. \n That wasn’t the first time the agencies have held back efforts to help homeowners. Jesse Eisinger has a fantastic story about how Freddie made it harder for millions of Americans to refinance their mortgages, fearing that it would hurt its profits. Freddie execs worried that the Obama administration’s mass refinancing program — named HARP — would hurt the company’s mortgage portfolio, even as it could help the larger economy: \n Freddie Mac produced a memo in the fall of 2011, which was described to ProPublica, estimating that HARP would cause hundreds of millions of dollars in losses. The memo estimated big losses on the portfolio as well as from giving up the rights to return the loans. It minimized the benefits to Freddie’s insurance business from an improved housing market and improved economy. It also minimized the costs to the company of trapping homeowners in mortgages with interest rates so high they would eventually default. \n Freddie has since stopped blocking HARP refis, but the missed opportunity was immense. One economist told Eisinger that a larger refi program by Fannie and Freddie could have saved homeowners $75 billion and prevented “hundreds of thousands” of delinquencies and foreclosures. — Ryan McCarthy \n On to today’s links: \n Beer \nOne company controls 48% of the American beer market – Businessweek \n Old Timey \nTranscript of the 1944 Bretton Woods conference found at Treasury – NYT \n Taxmageddon \nThe fiscal cliff is already hurting the economy – WaPo \n Defenestrations \nVikram Pandit was given three choices he couldn’t refuse – NYT \nVikram Pandit, “create and capture” victim – Ben Walsh \n Wonks \nWhy financial crises happen – a Q&A with Gary Gorton – Cardiff Garcia \n Plutocracy Now \nWen Jiabao has 2.7 billion problems (if you’re counting in US dollars) – NYT \n Compelling \n“Amazon is a black hole that is threatening to devour corporate America” – Matt Yglesias \nAmazon posts $274 million loss thanks to Living Social – Amazon \n Oxpeckers \nHow the NYT handles reader comments – NYT \n Alpha \nBill Bain defends private equity – Alex Klein \n Green Shoots \nConsumer sentiment is at the highest level in 5 years – Reuters \n It’s Academic \nWhy your brain is trained to think the number 3 is special – MIT \n Housing \nThe massive cost of living next to foreclosures – Center for Responsible Lending \n Primary Sources \nUS GDP growth increases to 2% in the third quarter – BEA"], "link": "http://blogs.reuters.com/felix-salmon/2012/10/26/counterparties-fannie-and-freddies-slow-metamorphosis/", "bloglinks": {}, "links": {"": 1, "http://phx.corporate-ir.net/": 1, "http://businessweek.com/": 1, "http://www.propublica.org/": 2, "http://nytimes.com/": 3, "http://www.housingwire.com/": 1, "http://reuters.com/": 1, "https://commerce.reuters.com/": 1, "http://www.washingtonpost.com/blog": 1, "http://online.wsj.com/": 1, "http://slate.com/blog": 1, "http://washingtonpost.com/": 1, "http://thedailybeast.com/": 1, "http://ftalphaville.ft.com/": 1, "http://responsiblelending.org/": 1, "http://www.bea.gov/": 1, "http://www8.columbia.edu/": 1, "http://www.ft.com/": 1, "http://counterparties.com/": 14, "http://web.mit.edu/": 1, "http://blogs.reuters.com/": 2, "http://publiceditor.nytimes.com/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["Journalists are up in arms about the latest fine to hit Citigroup. In general, journalists tend to like it when banks get bashed for violating rules, but in this case the bashing hits home: Citi was fined $2 million, and two analysts were fired, because those analysts talked to the press — actually, emailed reporters — and got caught doing so. And reporters, of course, hate anything which makes it harder for them to talk to sources. \n But there is something admirable about this fine: it’s a very rare case of Citi being dinged for violating its promises. \n Reading the official consent order , it becomes clear that Massachusetts, here, is doing something which ought to be done far more often. Whenever a bank enters into a settlement, it makes an empty promise to behave itself in future. And with this case we finally see a regulator taking Citi to task for breaking one of those promises. \n The actual violations, here, are pretty minor: they involve analysts talking to the press via Citi’s corporate email system. Oops. In doing so, those analysts were violating internal Citi disclosure policies — and Citi, in a 2003 consent agreement, had promised to get serious when it came to those policies. So Massachusetts found itself in possession of a rare smoking gun, and took full advantage of it. Other banks should be worried too: the state says that it’s investigating “all of them, Morgan Stanley, Goldman Sachs, JPMorgan” on similar grounds. \n This is not, then, an attack on analysts talking to journalists: it’s an attack on banks breaking their promises, and not really caring what they agree to do in legal settlements. \n But the settlement does make it very clear how silly SEC disclosure rules are. As I said in May, sell-side research isn’t inside information, even as settlements like this make it seem like it ought to be treated as incredibly confidential. \n When analysts talk to journalists — especially very plugged-in journalists at places like TechCrunch — it’s basically a way for both sides to bounce ideas off each other. There’s nothing nefarious going on. But the SEC doesn’t like the idea of sell-side analysts bouncing ideas off people, especially if those ideas involve things like forecasts or upgrades or downgrades. The regulatory architecture here is based on the fiction that analysts come up with all of their ideas in a vacuum, and then write those ideas down in the form of a research note. Only once the research note is public can the analysts talk about its contents to anybody else — and even then they can only really parrot what’s in the note. \n The real world, of course, doesn’t work like that. Wall Street ideas, like all other ideas, thrive on conversations and iterations between a large group of people: investor-relations types, analysts, investors, journalists, bloggers, you name it. I would love to see a world where such conversations took place largely in the open, rather than a world where the sell-side is constantly being harried by compliance people, and being told they can’t talk to anybody. \n On the other hand, if a bank makes a series of promises in a series of settlements, it behooves regulators to get serious about holding the bank to those promises. Banks make far too many promises they don’t intend to keep. So even while today’s fine is likely to have a chilling effect on information flow in the markets, the silver lining here is that it might also provide an incentive for banks to take their promises seriously."], "link": "http://blogs.reuters.com/felix-salmon/2012/10/26/why-analysts-got-fired-for-talking-to-journalists/", "bloglinks": {}, "links": {"http://blogs.reuters.com/": 1, "http://www.reuters.com/": 2, "http://www.ma.us/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["It was quite surprising when Jed Rakoff, scourge of Wall Street, sent Rajat Gupta down for only two years on Wednesday. After all, federal sentencing guidelines suggested that Gupta should get a sentence four times longer than that. And Gupta wasn’t some small-time crook grubbing for dollars with inside information, either: he did enormous damage to the reputations of central icons of our capitalist system, like McKinsey and Goldman Sachs. But for all that, said Rakoff, he is at heart a good man: \n “The court can say without exaggeration that it has never encountered a defendant whose prior history suggests such an extraordinary devotion, not only to humanity writ large, but also to individual human beings in their times of need,” Judge Rakoff said. \n This kind of reasoning is found outside the courthouse, too. For instance, Gary Belsky defends Lance Armstrong in New York magazine this week, on the grounds that the ends (raising lots of money for charity) justify the blood-doping means. “If you’re an obsessed sports fan”, says Belsky, then Armstrong’s actions can’t be excused. But for the rest of us, isn’t it great that he managed to use that activity to raise so much money for cancer research? \n Belsky’s column is unconvincing, not least because he seems inordinately impressed by charities’ overhead ratios. Doesn’t he know that cheating on overhead ratios — which mean nothing at the best of times — is a lot easier than sports doping? Especially when it comes to a charity with as vague a mission as Livestrong (“we empower the cancer community”), just about anything can be classed a programmatic expense, rather than overhead. Still, the principle — that the scales of justice can offset despicable behavior with charitable acts — seems to be deeply ingrained. \n There are limits to how far this kind of argument can be taken. The Jimmy Savile scandal in the UK, for instance, is made worse, not better, by the fact that Savile spent nearly all of his career raising huge sums of money for children’s charities. Similarly for Jerry Sandusky here in the US. \n But there’s something that Gupta and Armstrong have obviously in common with other high-profile philanthropists, and that’s their wealth. Poor people, by definition, can’t give millions of dollars to charity. Neither Gupta nor Armstrong ever had to make choices between their own lifestyle and the charities they supported: neither ever had less spending money for himself because he gave so much money away. \n At these levels, when you have a net worth in the eight- or nine-digit range, philanthropy starts to become a consumption good: something you spend money on in order to bolster your reputation and your place in society. That’s not necessarily the only or the primary motivation, of course. But there’s an uneven playing field here: the rich have the opportunity to offset their misdeeds with money, in the way that poorer people don’t. (Exhibit A: Martin Erzinger .) \n I’ve always been suspicious of so-called “transactional philanthropy” — the kind of tit-for-tat deals where I give you $X, and you give me Y. (My name on a building, for instance.) But now Gupta and Armstrong are making a case that all charity is transactional, in a sense: it’s a kind of favor bank, which comes in very useful when you get into trouble. In the case of Gupta, for one, it seems to have saved him six years in the clink."], "link": "http://blogs.reuters.com/felix-salmon/2012/10/26/can-charitable-donations-offset-despicable-behavior/", "bloglinks": {}, "links": {"http://nymag.com/": 1, "http://abcnews.go.com/": 1, "http://dealbook.nytimes.com/": 1, "http://www.cnn.com/": 1, "http://www.outsideonline.com/": 1, "http://blogs.reuters.com/": 2}, "blogtitle": "Felix Salmon"}, {"content": ["Welcome to the  Counterparties  email. The sign-up page is  here , it’s just a matter of checking a box if you’re already registered on the Reuters website. Send suggestions, story tips and complaints to  Counterparties.Reuters@gmail.com \n The routine is simple: four times a year, public US companies release their results ( 54 companies reported today alone). Traders react, analysts weigh in, the media explains and we all move along, ready to repeat the whole thing in three months. How hard can it be? Plenty hard, it turns out. \n First out of the blocks this week was Google . Or, rather, RR Donnelley, the financial printer that accidently filed Google’s earnings release early, incomplete and without authorization; the shares had to be suspended for most of the afternoon. \n Then it was Dow’s turn. As Michelle Leder writes , someone at the chemical giant inadvertently e-mailed Bloomberg News a layoff announcement. Daimler committed a similar, albeit lesser, mistake, when a communications staffer emailed a draft earnings release to reporters: “It was just a mistake. I realized it instantaneously…instead of saving as a draft, I pushed the send button”. \n And yesterday, Factset Research garbled the facts in IAC’s results . IAC said it expected to report a loss in its “media and other” division in 2013 — but as if out of a bad game of telephone, Factset, which offers company analysis and data to investors, somehow heard that the entire company expected to report an overall loss in 2013 and relayed that negative news to clients. Once again, the shares had to be halted. \n In a world of algo-driven high-frequency trading, these quaint screw ups are weirdly comforting. They don’t have much long-term effect on stock prices, but they are a reminder that a large part of the market is still subject to very human errors. — Ben Walsh \n On to today’s links: \n Must Read \nTaxpayer-owned Freddie Mac intentionally made it harder for millions to refinance their mortgages -  Jesse Eisinger \n Official Statements \nCEOs’ deficit manifesto is “gross self-interest masquerading as public statesmanship” – Felix \n Tax Arcana \nCaribbean tax shelters find themselves with crippling deficits – Bloomberg \n Crime And/Or Punishment \nFormer Goldman director Rajat Gupta gets 2 years in prison for insider trading – Dealbook \n Startups \n“What Silicon Valley still calls ‘Disruption’ has evolved into something very sinister indeed” -  Paul Carr \n TBTF \nCitigroup’s biggest challenge: It has one of the least productive workforces on Wall Street – Bloomberg \nSir David Walker is planning a “clean sweep” of Barclays’ board – FT \n Wonks \nThe myth that consumption inequality is a myth – Mark Thoma \nThe nature of UK austerity – Tyler Cowen \nWhy technology won’t kill jobs – Ken Rogoff \n Debt-based systems are inherently inflexible and lead to crises” – Aleph Blog \n Charts \nThere’s one bit of economic data that’s still in recession territory – Tim Duy \n The Greg Smith Files \nGreg Smith shows off his mastery of Control+C – Bess Levin \n Rebuttals \nPublic pensions’ “vital signs are strong” – Pensions & Investments \n Remuneration \nGolden parachutes make acquisitions more likely -  Lucian Bebchuk \n EU Mess \nEurope’s banks are still far too big, by the way – Quartz \n Cephalopods \nLloyd Blankfein: “Nobody can flagellate themselves as well as Goldman” – CNBC"], "link": "http://blogs.reuters.com/felix-salmon/2012/10/25/counterparties-earnings-fail/", "bloglinks": {}, "links": {"http://www.project-syndicate.org/": 1, "http://cnbc.com/": 1, "http://www.pionline.com/": 1, "http://economistsview.typepad.com/": 2, "http://pandodaily.com/": 1, "http://dealbreaker.com/": 1, "http://propublica.org/": 1, "http://alephblog.com/": 1, "http://dealbook.nytimes.com/": 3, "http://www.businessweek.com/": 1, "http://blogs.wsj.com/": 1, "http://www.ft.com/": 1, "http://bloomberg.com/": 2, "http://marginalrevolution.com/": 1, "http://qz.com/": 1, "http://blogs.reuters.com/": 1, "https://commerce.reuters.com/": 1, "http://www.bloomberg.com/": 1, "http://counterparties.com/": 14}, "blogtitle": "Felix Salmon"}, {"content": ["If you haven’t read it yet, you really must read Jessica Pressler’s fantastic Robert Benmosche profile — the man really shines through, in all his blustery glory. \n So how well has Benmosche actually done, as CEO of AIG? He certainly put an end to a misguided fire sale after he arrived in the fall of 2009, and he deserves a lot of credit for that. And over the course of his tenure, the government has managed to unload nearly all of its stake in the company — at a profit, no less. That’s a notable achievement, too: I, for one, didn’t think it could be done and said as much in January 2010, five months after Benmosche took over. \n It’s impossible to know how much of that is thanks to Benmosche, and how much is thanks to the Federal Reserve, which sparked a massive credit-market rally and which also held onto various bits of AIG nuclear waster until it could get a good price for them. \n Either way, the results can be seen in the chart above, which was much harder to put together than it looks, and I’m very indebted to both Ben Walsh and Jonathan Weil for help with it. It shows AIG’s share price, in black, and also the value of the shares available to the public, in red. The green area is the value of the government’s stake in AIG, calculated as the value of the shares that the government ultimately ended up converting its stake into. Go back to the excellent column that Jonathan Weil wrote shortly after Benmosche took the reins, saying that the value of AIG was “either $5.1 billion or $26.5 billion” depending on what you were counting: the first figure is the red area, and the second figure is the combination of the red and green areas. \n AIG’s market cap today is around $60 billion, more than double what the market thought the company was worth back in 2009. So that’s another Benmosche achievement. Then again, both the share price and the market capitalization are lower than they were in early October 2009, and much lower than they were in February 2011. The chart shows the government doing a great job in selling down its stake in the company; but there’s nothing particularly up-and-to-the-right going on here. After all, over the same period, the S&P 500 has risen more than 50%. \n But here’s the thing: AIG might be worth roughly as much now as it was in January 2010. But back then, AIG’s valuation was a weird, fantastical thing, based on extrapolating a share price which represented only the tiny sliver of shares actually traded on the markets. I thought that the valuation was bonkers, most other observers did as well, and there were precious few people standing up to defend it. \n Today, by contrast, AIG is a real company, with a justifiably positive valuation, based on a huge number of shares being traded every day. The company which had arguably the biggest balance-sheet black hole the world has ever seen has managed to come back from that brink, with the help of unprecedented government assistance, and is now a viable stand-alone business. That’s a huge victory for the people who made the decision to rescue AIG, not that they had much choice in the matter. And it’s surely a victory for Benmosche as well."], "link": "http://blogs.reuters.com/felix-salmon/2012/10/25/chart-of-the-day-aig-edition/", "bloglinks": {}, "links": {"http://nymag.com/": 1, "http://blogs.reuters.com/": 1, "http://www.bloomberg.com/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["The WSJ has what it calls “CEOs Deficit Manifesto ” — a copy of the letter, signed by 80-something US CEOs, urging action on the debt and deficit. It’s not a particularly impressive document. It starts like this: \n Policy makers should acknowledge that our growing debt is a serious threat to the economic well-being and security of the United States. \n It is urgent and essential that we put in place a plan to fix America’s debt. \n This is ridiculous. There are lots of serious threats out there to the economic well-being and security of the United States, and the national debt is simply not one of them. Nor is it growing. The chart on the right, from Rex Nutting , shows what’s actually going on: total US debt to GDP was rising alarmingly until the crisis, but it has been falling impressively since then. In fact, this is the first time in over half a century that US debt to GDP has been going down rather than up. \n So when the CEOs talk about “our growing debt”, what they mean is just the debt owed by the Federal government. And when the Federal government borrows money, that doesn’t even come close to making up for the fact that the CEOs themselves are not borrowing money. \n Money is cheaper now than it has been in living memory: the markets are telling corporate America that they are more than willing to fund investments at unbelievably low rates. And yet the CEOs are saying no. That’s a serious threat to the economic well-being of the United States: it’s companies are refusing to invest for the future, even when the markets are begging them to. \n Instead, the CEOs come out and start criticizing the Federal government for stepping in and filling the gap. If it wasn’t for the Federal deficit, the debt-to-GDP chart would be declining even more precipitously, and the economy would be a disaster. Deleveraging is a painful process, and the Federal government is — rightly — easing that pain right now. And this is the gratitude it gets in return! \n The national-security angle is just silly: there’s no evidence at all that the United States is any more vulnerable at times of high debt than it is at times of low debt. And even if it might be essential that we put in place a plan to fix America’s debt, it certainly isn’t urgent: the bond market is telling us that very clearly indeed. When the 10-year bond yields well under 2%, the market is telling America to borrow more, not less. And central banks around the world have made it very clear that these low rates are going to be around for a good while yet. \n The CEOs do concede as much, a little grudgingly, when they say that “this plan should be enacted now, but implemented gradually to protect the fragile economic recovery” — a statement which does rather undercut the “urgent” bit at the beginning. And to their credit, they do say that any successful fiscal plan “must be bipartisan”: I take that to mean that Republican pledges not to raise taxes are idiotic, not least because there’s no way that any such plan will ever get Democratic buy-in. \n But when they try to get to the specifics of tax reform, they start falling into blather, asking that it be “pro-growth” (an utterly meaningless phrase), and asking too that it include lower rates and higher revenues. \n Maybe they should have just asked for a pony for everybody instead: that would be easier. You can’t have lower rates and higher revenues — not without eviscerating pretty much all of the tax deductions which much of the middle class has learned to rely upon. Mortgage-interest tax relief, the charitable deduction, even the deduction for state and local taxes: pretty much all of them would have to go. That wouldn’t just get blocked by Democrats: it would get blocked by Republicans, too. And because most of these tax expenditures go to the middle class, broadly defined, the one group which would see most of the benefits while bearing very little of the costs would be the top 1%: the very CEOs who signed this letter. \n In other words, the letter basically just says “please cut our taxes, raise taxes on everybody else, and cut the benefits they get from Medicare, Medicaid, and Social Security, which are programs we individually don’t rely upon”. It’s gross self-interest masquerading as public statesmanship. \n It’s also the latest example of the absolutely enormous influence of Pete Peterson on the public debate. Peterson’s extremely well-funded and highly-focused concentration on fiscal issues has turned worrying about the national debt into a bipartisan pastime, to the point at which debate moderators can simply assume that the national debt in general, and entitlements in particular, are an enormous and urgent problem, and then ask the candidates how they’re going to fix this huge problem which we can all agree exists. The public just nods along. \n But the fact is that nothing is remotely so obvious. The really huge and important and urgent issue facing the US right now is the problem of unemployment, and specifically of long-term unemployment. A plan to stabilize the debt would be a welcome thing; we could get a lot of the way there by capping deductions, a la Romney, and then putting in a few Pigovian taxes on things we don’t want, like carbon emissions or high-frequency trading. And if you want to strengthen Social Security, Medicare, and Medicaid, then one way of doing that is to go the European route and pay for them with a VAT. But nobody is suggesting that as an option. \n In any case, both the global economy and the US economy are very fragile right now, and every central banker in the world is begging for help from fiscal policymakers. Which is to say, higher deficits, not lower ones. The problem is that Pete Peterson seems to be much more effective at corralling CEOs than Ben Bernanke is. More’s the pity."], "link": "http://blogs.reuters.com/felix-salmon/2012/10/25/ceos-self-serving-deficit-manifesto/", "bloglinks": {}, "links": {"http://articles.marketwatch.com/": 1, "http://online.wsj.com/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["Welcome to the  Counterparties  email. The sign-up page is  here , it’s just a matter of checking a box if you’re already registered on the Reuters website. Send suggestions, story tips and complaints to  Counterparties.Reuters@gmail.com \n The DOJ has filed a $1 billion civil lawsuit alleging that Countrywide committed fraud “ spectacularly brazen in scope” by selling defective mortgages to Fannie Mae and Freddie Mac between 2007-2009. (Full PDF here ). \n Once the nation’s leading subprime lender, Countrywide was acquired Bank of America in 2008, and it has proven to be an epic money pit. Last month, David Benoit wrote that the acquisition had cost Bank of America at least $29 billion in settlement costs in the last 3 years. The WSJ says the bank has dished out something like $42 billion since 2010, if you include reserves and expenses. \n Interestingly, the  DOJ’s lawsuit doesn’t focus on subprime. After the subprime market began to collapse in 2007, the suit contends, Countrywide’s strategy shifted to originating the kind of high-quality mortgages that could be sold to Fannie and Freddie. Countrywide allegedly used a program called the “hustle” to pretend it was originating those kind of mortgages: \n The aim of the Hustle (or “HSSL,” for “High Speed Swim Lane”) was to have loans “move forward, never backward” and to remove unnecessary “toll gates” slowing down the loan origination process. In furtherance of these aims, Countrywide’s new origination model removed the processes responsible for safeguarding loan quality and preventing fraud. \n Instead of adhering to Fannie and Freddie’s mortgage standards, Countrywide allegedly “assigned critical underwriting tasks to loan processors who were previously considered unqualified to even answer borrower questions.” Employees got a one-time bonus for “rebutting” concerns from the company’s internal quality control department. “Even when detected, loan processors manipulating data typically faced no consequences”, the lawsuit says. \n The government is bringing the suit under the increasingly popular False Claims Act and a relatively obscure statute called FIRREA . Earlier this month, the DOJ also brought a similar mortgage-related False Claims action against Wells Fargo; Citi settled its own case earlier this year for $158.3 million . FIRREA, a carry-over from the savings and loan crisis, is relatively unproven , but gives the government more leeway in bringing a civil suit. \n As Matt Levine notes, Bank of America is being sued by the DOJ at the same time that it’s fighting over billions in mortgage put-backs with Fannie and Freddie. The law also could lead to some  mind-boggling penalties for the bank: \n Not only might Countrywide have to pay twice for the same mortgage – once to Fannie/Freddie on a putback, once to the DOJ on this lawsuit – but this lawsuit itself might lead to triple damages plus $1 million per mortgage. If Countrywide was in fact massively fraudy in 2007-2009, there is good reason to make that massive fraud more costly than just buying back all the mortgages that it originated. \n The suit also identifies a former Countrywide executive vice president as a whistleblower, who may soon become quite rich. In July, a contractor hired by Countrywide pulled in $14.6 million for blowing the whistle on  inflated appraisals .  – Ryan McCarthy \n On to today’s links: \n Missed Oppurtunities \nBlame Congress’s fear of immigration for America’s lack of engineers – Evan Soltas \n Facebook \nFacebook mobile revenue has suddenly exploded – Rolfe Winkler \n New Normal \nNeither candidate has discussed America’s biggest challenge: A decade of income stagnation – David Leonhardt \nObesity is up in nearly every age group in the US over the last 4 years – Gallup \n Inefficient Markets \nFactSet misinterprets facts – Businessweek \n Long Reads \nNate Silver and the renaissance of political prediction markets – Chadwick Matlin \n De mographics \nThe housing market will be saved by “echo boomers” – Sober Look \nOn the connection between obesity and debt – Azizonomics \n Defenestrations \nWhite House quietly saying it will oust Fannie’s regulator after election – Shahien Nasiripour \n Strangely Existential \nBehavioral economics suggests that your brain thinks of your future self as a stranger – Cass Sunstein \n Politicking \nObama knows his Reinhart & Rogoff: “Recessions that follow a financial crash…are not regular recessions” – Des Moines Register \n Official Statements \nAmericans misunderstand how much time bankers spend reading to children – Partnership for a Secure Financial Future \n Bubbly \nPrime real estate in Mecca now sells for $18,000 per square foot – Guardian \n Lies of Omission \nAnother Breguet goes missing in Russia – NYT \n Explainers \nMatt Levine on how derivatives help banks get around regulation – Planet Money \n Amazing \nThe politics of Dillon, Texas – The Monkey Cage \n EU Mess \nMervyn King: There won’t be a recovery until banks recapitalize – Telegraph"], "link": "http://blogs.reuters.com/felix-salmon/2012/10/24/counterparties-a-billion-more-reasons-for-bank-of-america-to-regret-acquiring-countrywide/", "bloglinks": {}, "links": {"": 1, "http://dealbreaker.com/": 1, "http://bloomberg.com/": 2, "http://thelede.nytimes.com/": 1, "https://commerce.reuters.com/": 1, "http://www.reuters.com/": 2, "http://themonkeycage.org/blog": 1, "http://youtube.com/": 1, "http://npr.org/blog": 1, "http://soberlook.com/": 1, "http://online.wsj.com/": 2, "http://counterparties.com/": 18, "http://desmoinesregister.com/": 1, "http://guardian.co.uk/": 1, "http://www.businessweek.com/": 1, "http://www.justice.gov/": 2, "http://www.bloomberg.com/": 1, "http://azizonomics.com/": 1, "http://money.cnn.com/": 1, "http://blogs.wsj.com/": 1, "http://www.ft.com/": 1, "http://en.wikipedia.org/": 2, "http://telegraph.co.uk/": 1, "http://gallup.com/": 1, "http://blogs.reuters.com/": 2}, "blogtitle": "Felix Salmon"}, {"content": ["The world divides into people who think of Apple as a company, and people who think of Apple as a brand. The former group includes all stock analysts , of course, but it also includes most technology journalists. The latter group is, well, most of the people who buy Apple products. \n The difference between the two can be seen quite clearly this morning, in reactions to the launch of the iPad mini . The WSJ — which naturally skews to the Apple-is-a-company view of the world — runs its story under the headline “Apple Drops an iPad Mini on Rivals”, and leads by saying that by announcing this new product, Apple was “seeking to blunt an advance by rivals”. They even have a “ Tablet Wars ” interactive graphic, which is based on the implicit assumption that consumers are hyper-rational shoppers, carefully comparing the iPad to various alternatives (Nook HD+, Kindle Fire HD, Galaxy Note 10.1, Google Nexus 7, Microsoft Surface) who are likely to then buy the option which hits their sweet spot when it comes to price and features. \n The NYT coverage, from Brian Chen , takes a similar tack, under the headline “Apple, Facing Competition, Introduces a Smaller iPad”: \n With all the action in the tablet market lately, smaller models have become impossible to ignore. Google, Apple’s fiercest competitor, recently released its 7-inch Nexus 7 tablet for $200. Amazon recently introduced seven new Kindles, including a 7-inch tablet for $160 and an 8.9-inch tablet for $300. Barnes & Noble’s Nook tablet, which starts at $200, has also sold well. Combined, the three companies have sold about 15 million of these smaller, cheaper tablets. \n But if you look at what actual consumers are asking, it turns out that only an ultra-geeky minority is out there weighing up the relative merits of the iPad mini and the Galaxy Note. Note Nick Bilton , today: \n Now that the Apple iPad Mini is here, I’m fielding one particular question from friends, family and readers: Which model should I buy? \n The point here is that Apple has already done the work of persuading people to buy the iPad mini — it’s done it through many years of creating products which are a pleasure to use. \n Which is why the bellyaching about the iPad mini’s pricing is very weird to me. Apple’s job, when it developed this device, was not to create something to compete with the Nook HD+. Rather, it was to build something which fit easily into the existing lineup, right between the iPod Touch and the iPad, and which would delight its customers as much as those two products do. The iPod Touch starts at $300; the iPad starts at $400. And the iPad mini, at $330, is right in between, where it belongs. \n Apple, famously, has the same pricing philosophy as Louis Vuitton: it sells premium products at premium prices, and it never discounts. That philosophy has made it an aspirational brand worldwide: you don’t see vendors in China selling fake Google Nexus 7s. Sometimes, as with the iPhone and iPad, the world beats a path to the company’s door in any case. Other times, as in the case of wireless routers or external displays, Apple’s products are so much more expensive than the competition that only the rich Apple faithful tend to buy them. But that uncompromising devotion to the fundamental philosophy is what has made Apple such a powerful global brand. \n The result is that most of the millions of people who buy an iPad mini will never seriously consider any of the alternatives. They know what works for them, and they trust Apple to deliver. That’s the power of the Apple brand. Amazon also has that power — as a retailer, just not, yet, as a hardware manufacturer. Most Amazon customers don’t bother checking prices elsewhere any more: they’ve happily locked themselves in to the relationship. \n There are three questions, then, which real people will ask about the iPad mini. Do I want it, can I afford it, and which model should I get. The answers to those questions will determine how many iPad minis Apple manages to sell. But the question which most of the press concentrates on — how does the iPad mini compare to its non-Apple competitors — is one which gets asked much less often than the Apple-as-company people tend to think."], "link": "http://blogs.reuters.com/felix-salmon/2012/10/24/why-apple-doesnt-care-about-its-competition/", "bloglinks": {}, "links": {"http://bits.nytimes.com/": 1, "http://online.wsj.com/": 1, "http://www.apple.com/": 1, "http://tech.cnn.com/": 1, "http://www.ft.com/": 1, "http://www.nytimes.com/": 1}, "blogtitle": "Felix Salmon"}, {"content": ["John Paulson lives in a 28,500 square foot townhouse at 9 E 86th Street on the Upper East Side, opposite the Neue Galerie and just steps away from Central Park. He’s invested a lot into his townhouse, which hosted a big fundraiser for Mitt Romney in April. And now he’s given even more to Central Park: $100 million, to be precise. “The park is very large,” he explained to the New York Times , “and its endowment is relatively small.” \n Actually, at $144 million (pre-Paulson), Central Park’s endowment, I’m pretty confident in saying, makes it the most lavishly-endowed park in the world. Half of Paulson’s gift is going to make that endowment even bigger; the other half will be spent on various capital improvements. Apparently the entrance to the southwest corner is going to get spiffed up. \n The Central Park Conservancy has a CEO, of course, named Doug Blonsky; he made $493,462 in 2010. Paulson probably considers that to be a “relatively small” amount as well. Most numbers have a habit of looking small, when you’re a multibillionaire. Blonsky did his job today, hailing Paulson’s money as “transformational”. \n But the fact is that if you wanted to give $100 million to charity while making the barest minimum impact on the world, you’d be hard pushed to improve on Paulson’s performance today. Maybe he was inspired by Ronald Lauder, across the street, who is just waiting for the perfect time to donate the Klimt painting he owns to the museum he founded, where it has been hung since he bought it. \n On the other hand, if you wanted to make a charitable donation expertly calibrated for its helpfulness with respect to your social-climbing ambitions on the Upper East Side, then a splashy gift to the Central Park Conservancy could hardly be improved upon. The gift was announced with great fanfare: a massive press conference and photo opportunity, dozens of park employees, the Mayor, the whole bit. \n Of course, since this is a charitable deduction, it’s a tax expenditure, too. I don’t know what Paulson’s marginal tax rate is, but in any case, if you multiply that by $100 million, you get the amount of money that taxpayers are being forced to contribute to John Paulson’s 843-acre back yard, in the form of foregone tax revenues. Is that the best use of public funds? Almost certainly not, but we don’t have any choice. \n I spent last night learning a lot about the Drugs for Neglected Diseases initiative — an incredibly exciting model of drug development and clinical testing which refuses to deal in any kind of patents and which has already, in its short life, come up with six transformational treatments for diseases which are too rare, or suffered by people too poor, for the market to ever really help on its own. It’s not a particularly sexy charity, and doesn’t have a Halloween ball full of boldface names, but it saves lives, and as a byproduct it’s also helping to open up drug libraries which have been neglected for decades. What’s more, it acts on a tiny budget, mainly acting as a liaison between many other actors, helping them to work in concert with each other. \n After seeing the amazing things that are being done by DNDi, it was a little depressing to wake up to Paulson’s preening performance. He is of course free to spend his money any way he sees fit. He has more money than he could ever spend, so the next thing on his list is acquiring the respect and admiration of his social circle. And he’s going about that in a very effective way. I just don’t see why the coverage should be so glowing, and I certainly don’t see why U.S. taxpayers should be chipping in. \n This gift, in other words, is Exhibit A in any attempt to cap the amount that American taxpayers can deduct in any given year. Foster Friess likes to say that the rich shouldn’t pay any taxes at all, and that instead they should “self-tax” by giving their money to carefully chosen charities. What today’s news underlines is that while such donations are ostensibly in the service of helping others, in practice they tend to be extremely self-serving. The rich can give away more money than the rest of us. But that doesn’t make them any better at it. Quite the contrary."], "link": "http://blogs.reuters.com/felix-salmon/2012/10/23/philanthropic-donation-of-the-day-john-paulson-edition/", "bloglinks": {}, "links": {"http://www.dndi.org/": 1, "http://blogs.reuters.com/": 2, "http://www.nytimes.com/": 1, "http://www.thedailybeast.com/": 1}, "blogtitle": "Felix Salmon"}]