[{"blogurl": "http://fellinlovewithdata.com\n", "blogroll": [], "title": "Fell in Love with Data"}, {"content": ["Being a visualization researcher means a very large body of my work revolves around pushing the boundaries of visualization further. I do that by mostly developing innovative techniques but also trying to better understand how humans interact with this amazing tool we call visualization. \n You might think I have at least a rough idea of what progress means in visualization then, but in fact I don’t. And I guess I am not alone: researchers are trained to dive into tiny details and speculate for ages. The purpose of this post is to explore bigger questions: \n \n What is progress in visualization? \n How do we make progress in visualization? \n And how do we measure it? \n \n I ask that because honestly I don’t see a direction in what we are doing. We researchers are mostly focussed on developing yet another technique, practitioners on (understandably) satisfying their customers. But what is our ultimate goal? Here I propose s few ways we can look at progress in visualization. \n Progress As Real-World Impact \n First and foremost I propose progress in visualization is the extent to which we are able to help people do remarkably useful things with data.  This is for me the gold standard, the holy grail. It is a broad and vague definition but it helps. When I say “ remarkably useful ” I mean: can we say visualization played a critical role in curing or preventing diseases? Reducing poverty? Solving or preventing economic crises? Make people richer or happier? Etc. Think about it, why not? Why do we do visualization if not for these purposes? \n Despite some few isolated cases I don’t see this happening now. We should keep our eyes open and focus more on having an impact in the real world. Visualization has this potential, I am sure, and progress is made, I believe, when we help people do remarkable things. The VisWeek conference used to host a very nice session called Discovery Exhibition  with the specific intent to showcase success stories. Unfortunately, (its hurts to admit it) I think it was quite a failure. I remember a similar frustrating post from Stephen Few some years ago: “ True Stories about the Benefits of Data Visualization “. And I have yet to see persuasive answers to his call. \n Progress As Knowledge Construction \n I have to admit measuring progress exclusively in terms of impact and success stories might be a bit fuzzy, not very practical and ultimately a bit subjective. Another possibility is to define progress as the accumulation of knowledge that permits to build more effective visualization . But what do we need to know that we don’t know yet? Broadly speaking we need to know: \n \n How humans work. \n How to translate knowledge about humans into visualization design. \n \n Are we doing that right now? Partly, in academic environments and a bit outside, but not enough in my opinion. It’s surprising to see how much more foundational work has been done in the past and how little today. We have a rough idea of how visual variables (position, length, color, size, etc.) work in isolation but very little understanding of how they interact in complex environments. We have alternative visualizations for the same kind of data and little understanding of how they influence information extraction (parallel coordinates vs. scatter plot matrix? node-link diagrams vs. matrices? maps or abstract representation? animation or small multiple?) And we have not even started scratching the surface of muddier issues like semantics, influence, persuasion, etc. \n Progress as Technical Achievement \n I don’t even know if I need to comment on this one, it’s pretty straightforward: technical achievement is the development of visualization and interaction techniques that solve unsolved technical problems or improve performance over existing solutions . Typically this takes the following form: \n \n New visualization or interaction design. \n Faster and/or more accurate algorithms. \n Increased scalability in terms of data size and dimensionality. \n Accommodation of new data formats and tasks. \n \n I think it’s safe to say academic research is mostly focused on this. I am not sure whether technical achievement translates into real benefits in real-world applications but from time to time we have really useful stuff coming out. Edge bundling and horizon graphs are the first things that come into my mind. Are we making progress in this area? Yes. Would I like to see more? Yes and no … In a way sometimes I feel like we are spinning the wheel (please note that I include myself into this description and I am not immune to many many faults) so I’d like to see less  spinning-the-wheel technical contributions and more useful stuff. But I also realize we cannot invent a new edge bundling every year. Progress happens with valleys and peaks. \n Progress As Education and Adoption \n Maybe this is the most neglected kind of progress, yet it very much lies at my heart. The last way to define progress in visualization I propose is the extent to which we are able to teach people how to judge and use visualization effectively and how many people will use visualization in their work . We need to reach more people (visualization at school?) but more importantly we need to teach proper visualization. We need courses, seminars, teaching material, web sites, and a whole army of evangelists. I am lucky enough to know quite a bunch of them but we need more. \n I want to measure progress in a few years by counting how many people are able to criticize a chart. I also want to measure progress by assessing whether visualization will be part of the standard toolbox of scientists, business men and decision makers around the world. \n Conclusion \n This is what I had to say about progress. I know it’s not perfect, it’s just a draft. And now it’s your turn. How do you define progress in visualization? Are we making progress? How would you measure progress in visualization in, let’s say, 5 or 10 years from now? \n And by the way, do you care about making progress? Why not? It is not necessary to be “a researcher” to make progress, you can make progress in a thousand ways. The only thing we need is to bring more focus. Or maybe we just have to let things happen and have some fun? I am looking forward to hearing from you guys. Thanks for reading. \n — \n On a side note: I have been out of the scenes with FILWD for a very long while. There are good reasons why that happened (I’ll tell you more about that later) but I want to assure you FILWD is not going to fade away. To the contrary, I have many plans on how to grow it further and offer a better service. If you are still there reading me after so much time well … thank you so much from the bottom of my heart! -Enrico"], "link": "http://fellinlovewithdata.com/reflections/progress-in-vis", "bloglinks": {}, "links": {"http://visweek.org/": 1, "http://www.perceptualedge.com/blog": 2, "http://www.tue.nl/": 1, "http://discoveryexhibition.org/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["I was reading the description of a new data visualization contest coming out today, the Nielsen Data Visualization Contest , and an apparently insignificant sentence caught my attention: “ The challenge is to make data tell a story, conveying what’s most important effectively and efficiently. ” \n There is a lot of attention lately around using visualization to “tell a story” and I can understand why: visualization, when designed properly, has a tremendous effect on people. Not only it has the power to convey a clear message and to make complex concepts very easy to grasp, but it also has the power to persuade. I guess the main reason being that when a statement is backed up by data then people believe it is true(er). \n I have nothing against using visualization to tell stories, to the contrary I am fascinated by this use of visualization and I think it’s very relevant. For instance, raising awareness about important facts or democratizing access to complex information are very noble intents of visual story telling, and I fully support them. \n But, I don’t know, call me old-style, conservative, bigot: I am concerned by an excessive focus on story telling. It’s an itch I cannot scratch. And because I cannot express it in a closed form the only thing I can do is to make a list of concerns I have (hoping your comments will make it easier to dispel the fog). \n There’s no story telling without data exploration.  Creating a story with visualization doesn’t mean there is not role for data exploration in visualization in its making. People looking at the final product might think the power of visualization is exclusively in the effective presentation of the facts. But what people don’t see is the amount of exploratory work behind every story. I know as a matter of fact that many great visualization designers start with a thorough visual exploration of the data at hand using standard tools like Tableau or R. Without this preliminary phase it’s very hard to tell a compelling story and it is also very hard to come up with an enlightening visualization. \n It’s the data that makes the story not the visualization.  I always laugh a bit when people complain about David McCandless’ work. They say that their visualizations are not optimal and that he makes many “mistakes”. In a way I agree but why does he have such a big success then? I think the reason rests in his ability to select amazing stories to tell. The story is hidden in the data. Well, not even in the data, I guess everything starts in his mind, the rest just follows naturally. So, if we are passionate about visualization and dare about its proper use I believe story telling is (maybe) not the most challenging area to test it. \n Many people need visualization to build our future not to tell a story.  While I cannot resist a catchy well-crafted data visualization that tells a compelling story, I also know from my experience how desperately professionals of all kinds need visualization to just do their work best. I am talking about doctors, engineers, biologists, policy makers, etc. Part of our life, or of our future generations, might depend on them and we have the opportunity to help them help us. Don’t you think this use of visualization is a bit under represented on the web when compared to the whole set of story telling visualizations out there? For instance, why don’t we have contests to help these people with their data and have plenty of those asking to vaguely find a story to tell in this or that data set? \n A story is not THE truth.  I have no evidence for that but my feeling is that visualization can be used to more easily persuade people. By the mere fact of being built on top of data people might think it is truer than other kind of stories. Again, you can see that in McCandless’ work. Many of his pieces are evidently conceived to be provocative and touch hot topics. But I bet that for every provocative visualization out there there is the possibility to build a counter argument with another one. I might be proven wrong on that but I haven’t seen any evidence on the contrary so far. \n Not all stories are worth telling.  Since the power of a story resides in the data, it is not always possible to tell a compelling story. Regardless the beauty or inventiveness of your visualization if the data is dull you might not get a compelling story. And I have experienced it so many times that I am almost inclined to say that this is pretty much the standard for any given data set. You can see it in the recent Information is Beautiful Award : there are many cool and pretty entries, some that I really like from the design point of view, but is there anything really interesting there to see? Do we leave the stage enriched by new knowledge? \n That’s all folks. Any ideas, comments, thoughts? There’s no truth carved in stone here and I’d love to hear your opinion. What do you think about visualization as a vehicle to tell stories?"], "link": "http://fellinlovewithdata.com/reflections/telling-stories", "bloglinks": {}, "links": {"http://bit.ly/": 2}, "blogtitle": "Fell in Love with Data"}, {"content": ["As promised yesterday here is the answer I received from Visualizing after sending them a draft of my post. Given their answer and the whole bunch of controversial but constructive comments I received (check them out, they are full of insights) I am really glad to have started this. I have the feeling this can in a way help all of us, regardless our opinions, make the whole field at least a tiny bit better. \n — \n Enrico, \n First, thanks very much for taking the time to share your feedback and for your thoughtful suggestions. We’re all committed to advancing the field of data visualization and healthy debate towards that goal is always useful. \n The aim of the Visualizing Marathon program, which we started in 2010, is to encourage design students around the world to take up data visualization and generally to use design to help improve our collective understanding of complex world issues. The structure and format of the event is constantly evolving in support of this aim based on what is working and not working (we collect surveys from the students, for example) and so we’re most grateful for any and all feedback! \n To your specific points: \n 1. Judging: All Marathons (and challenges) are judged based on three criteria, which we’ve previously shared on Visualizing: \n \n Understanding: How effectively does the visualization communicate? How well does it help you make sense of this issue? (out of 10 points – we agree with you this is most important and that’s why it gets the most weight) \n Originality: Are the approach and design innovative? (out of 5 points) \n Style: Is the visualization aesthetically compelling? (out of 5 points) \n \n Our global jury selected 1 Winner and 2 Honorable Mentions in each of the 5 cities. These are the top 15 projects based on these metrics. \n Importantly, however, the Grand Prize was selected by us out of the top 15 based on a different metric: how well does the project help illuminate new insights to the complex problem the students were given (in this case, sustainable development). Because data visualization is not only a tool for communication but also a tool for exploration, we sought to highlight and amplify the latter with this particular prize. It’s why it comes with a $10,000 grant to support further research and education. We felt the winning project best delivered on this metric (the approach and analysis detailed in their accompanying essay is particularly noteworthy). And as we noted in the prize announcement, we hope very much that the students use the additional time and resources they have been granted to take the visualization further (including putting their 3D shape to work as outlined, and perhaps evolving a simpler overall design). Also, we’re sure they would enjoy hearing suggestions directly. \n We have been exploring how we might incorporate a “People’s Choice” aspect into the program, though there are some potential complications with this format that we are trying to be mindful of. \n 2. Time: There is no question that time (usually) improves quality – and our Visualizing Challenges, for example, typically run 4-6 weeks based on that logic. With our Visualizing Events, like Visualizing Europe and the Visualizing Marathons, we want to create the space and opportunity for people to come together in a shared and collaborative environment where they can meet, learn from one another, and develop new partnerships/relationships. We hope that after each event, the conversation continues in a way that can push forward the field of data visualization. We know from direct feedback from students and their professors that there is a tremendous didactic, creative, and inspirational value in working together with 2-3 of your friends in a common space with other students for 24 hours towards a common goal (we are also mindful that there is a real limitation to the amount of time students can commit to an extra-curricular activity). As you rightly pointed out, there are high quality projects among the entries, so clearly it is possible to produce something of quality in the allotted time. We also believe that overall quality from students will improve year over year as the professional field and its accompanying science mature and codify what works. That said, we are in fact experimenting with time this year to help improve overall quality and welcome any suggestions. \n 3. Training: We agree that training is important. In the spirit of openness, we allow students of all levels and disciplines to participate in the Marathons and learn by doing. As you mentioned, data visualization has become mainstream only recently, especially in some of the cities where the marathons have taken place. To provide greater training before the Marathon, this year we just have started providing registered students with various resources and helpful links (including this one) well in advance to encourage them to learn more about data visualization. And since the beginning of the program, we have been running data visualization lectures and workshops hosted by design professionals during the Marathons to teach best practices (based on feedback, we recently moved these lectures and workshops to the start of the marathon program so lessons can be incorporated from the outset). \n Again, thanks Enrico for all your support. As we are ever committed to developing the best possible Marathon program, we’re very much open to ideas. \n The Visualizing team \n — \n Thanks Visualizing for accepting openly my criticism. I think this is simply great!"], "link": "http://fellinlovewithdata.com/reflections/visualizing-answer", "bloglinks": {}, "links": {"http://bit.ly/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["“Huston we have a problem …” \n I just received this in my inbox: \n We want to again express our sincerest gratitude for your help in making the Visualizing Marathon 2011 such a resounding success. Your participation was instrumental and the 376 students who competed in Sydney, São Paulo, New York, London, and Berlin told us how excited they were to meet you and have their work reviewed by such an esteemed global jury. \n We just announced that the winner of the $10,000 “Imagination at Work” Grand Prize is Columbia University for E-Cube-Librium [...] Out of 15 finalists, the Grand Prize was awarded to the project that “ best illuminates a new insight or solution to a complex problem through data visualization. “ [bold is mine] \n I receive this because I was part of the jury for the Marathon in Berlin . Visualizing Marathon is a series of events (inspired by the more famous hackatons ) organized by Visualizing.org around the world to promote visualization. Groups of students develop a visualization for a given dataset/problem in 24 hours and Visualizing.org gives awards to the best entries. \n Being a juror was fun and and an honor for me, as well as being one of the speakers at Visualizing Europe last year. I am grateful to Visualizing for the great work they are doing in terms of promotion, and also for their commitment to building a solid platform for visualization designers. Nonetheless, I think we have a problem. \n I look at E-Cube-Librium    and I cannot help but think: “ Is this the best 376 students from all over the world can produce? “ It just doesn’t match with my definition visualizations that “ best illuminates a new insight or solution to a complex problem “. \n I am really sorry I have to say that, especially because I am sure the students did their best and are probably proud of their work, and also because I am sure the guys at Visualizing.org have the best intensions in their mind. But I am also concerned that people around the world would look at the best prize winner and think this is the gold standard of visualization. We have to be careful, especially now that visualization is in the mainstream, about what message we give. I have seen too many times visualization dismissed altogether because people think it’s only pretty picture. Our reputation and future is at stake here. \n Now, we have a nice series of events organized around the world and I am all in favor of data visualization evangelism, but why are the results disappointing? Is it an intrinsic problem of marathons and contests or maybe we can engineer the whole thing to make it more effective? Here are some potential explanations I can tell from my experience: \n \n Time is too short to produce quality results.  Every time I complain about the quality of the results there is someone who points out that time is too short. I am not fully convinced time is the main problem however, even though I do think time is too short. Basic design choices do not depend on the amount of time. It doesn’t take time to know a 3D visualization of numeric data should not be your first choice when designing a visualization, it takes knowledge. \n Students are not well prepared.  That students are not knowledgeable enough to produce quality results is not surprising. Visualization has become mainstream very recently and there is not a clear path to follow if one wants to become an expert. Nonetheless, some of the entries I personally reviewed as a juror were more than reasonable, especially given the 24hrs constraints! Also, giving a look to the page with the whole set of winners and honorable mentions it’s surprising to notice how neat solutions coexist together with very questionable ones. \n Jurors select the wrong entries.  Another possibility is that jurors just pick the wrong entries. I don’t know who selected the grand prize winner, I was not involved in the process, but my feeling is that here we might have the biggest mismatch. When I participated as a juror it became clear to me how things can go wrong. Some people put clarity and information throughput before everything else (guess who?), others judge things from their coolness factor. I know, it’s sad but that’s the way it is. \n \n \n How can we make better marathons? A few modest suggestions. \n \n Without pretending to provide all encompassing or particularly clever solutions here are few things that come into my mind: \n \n Give more time.  If time is too short why not giving more time? The marathon format does not lend itself to data visualization. Visualization is a process, a tortuous process actually, with lots of dead ends along the road. Pretending to visualize data effectively in 24 hours might be an unrealistic goal. \n Train students before the marathon takes place.  If students are not good enough why not giving them some training before running the marathon? There are many professionals out there who are able to explain in a concise manner what are the no nos and the good practices of visualization. \n Run marathons without prizes.  Maybe a marathon could be held without giving a prize? I don’t know … is the perspective of receiving a prize that motivate students to do their best? Maybe not. Maybe just knowing that they will have the opportunity to get trained by a professional and to have a certain level of exposure will motivate them enough. I think competition is totally overrated. \n Let people judge in place of jurors.  One option could be to have “better” jurors but then we would have to discuss what we mean by “better”. As an alternative, why not letting people judge? I am not sure the result would be better but at least we could claim it is a democratic process and it wouldn’t embarrass any jurors. \n \n And you? What do you think? Do you have any concerns with contests and marathons? How would you shape your own marathon event? Do you have any suggestion on how to improve the situation? I’d love to hear your voice. \n — \n IMPORTANT NOTE: I had the chance to discuss with some people at Visualizing before publishing this post. Since I totally respect their work and wanted to avoid slashing them with an overly unfavorable post, I decided to let them read it before publishing it. Apart from a few sentences here and there the post is still the same as the original draft. \n Charlene Manuel was also so kind to send me a long reply to this post which I decided to publish soon as a post rather than a comment so that everyone will get the feeling of how Visualizing is handling this criticism. \n I am very satisfied with this process. I think we all have to be happy to see that it is possible to have constructive criticism and make the whole field thrive without unnecessary battles. \n — \n UPDATE: here is the answer from the Visualizing team."], "link": "http://fellinlovewithdata.com/reflections/vis-marathons", "bloglinks": {}, "links": {"http://fellinlovewithdata.com/": 1, "http://invent.ge/": 4, "http://bit.ly/": 2}, "blogtitle": "Fell in Love with Data"}, {"content": ["When I think Visualization and Excel there are two names that come into my mind: Jorge Camoes and Jon Peltier . If you want to do serious data visualization with Excel, stop here, they are the names. Since I was more familiar with Jorge’s work and had more opportunities to discuss with him I decided to interview him to cover the Excel part of this series, but you can give a look to Jon’s web site if you have any additional questions. \n \nJorge had been developing visualization in Excel for a long time now and I still remember the time when I saw one of his dashboards in Excel: “Wow, can Excel do that?” Give a look with your eyes to his dashboard courses . Pretty amazing isn’t it? \n \nI have been following Jorge’s blog for a long time now and I often enjoyed his short and catchy blog posts. If you are not following him, give it a try. It’s worth it. \n \n How did you start using Excel? \n \nI started my professional career as a desk researcher. I had to create information products with lots of charts using market and socio-demographic data, and Microsoft Office was the only tool available. Like everyone else, I had no data visualization training, so you can imagine how bad those charts were. On the one hand, that’s very depressing, from a personal point of view. On the other hand, this proves that data visualization skills are easily acquired, once you become aware of what data visualization is all about. \n \n What’s the best and worst aspect of Excel? \n \nWe must emphasize that Excel is not a data visualization tool, so you cannot directly compare it to other tools. That said, you can learn and practice sound data visualization principles using Excel. Its chart gallery is poor, but you can make new charts using some more or less clever tricks. Check Jon Peltier ‘s site to see how you can extend the Excel chart gallery. So, its flexibility and general availability are the best aspects. \n \nUnfortunately, defaults that emphasize marketing and sales pitch are responsible for a generation of users that don’t really know what a chart is. That’s the worst aspect of Excel. Also, because of it’s flexibility, many users do not recognize that they need stronger data management skills. \n \n How is the learning curve vs. return-on-investment of Excel? \n \nMost business users have access to Excel training. They just need to be brainwashed to remove all they think they know about charts. :) Corporate data visualization culture is so poor that applying simple rules can greatly improve insights and ROI, and you can do it using Excel. \n \n Ok, I am a beginner and I want to learn Excel, where do I start? \n \nChances are, you already know Excel. If you don’t, I’d recommend Chandoo’s Excel School or Daniel Ferry’s Excel Hero Academy . And Jon Peltier’s site , mentioned above. \n \n What other tools would you recommend other than Excel? \n \n90% of all charts you need in a business environment can be done in Excel. But if it takes a full day to code a chart that you can do in minutes using a different tool you have a good argument to make the switch. I would recommend Tableau , Qlikview or Spotfire . They are well-aligned with currently accepted data visualization best practices and they force you to learn more about structuring your data. \n \n— \n \n Some comments from Jorge … and my answers: \n \n J: Business users hate programming. You can’t explain a product manager that a simple recorded Excel macro can make all the difference. You can’t tell them that they need programming skills to make a chart. \n E: I think this is totally fine and probably a reason behind the big success of Tableau. \n \n J: If it can be done in Excel managers will not spend more money getting a new tool. \n E: Ok, but then they have to be ready to pay someone to let Excel do the job right? I see a great potential for consultants here. \n \n J: But managers are becoming aware that they need a serious (visual) reporting tool; Tableau is one of the options; traditional BI tools are moving fast. If a BI tool supports sparklines that’s a good starting point. \n E: I think managers will feel more and more pressure as visualization becomes mainstream. I think we just have to wait a little to see some stuff flourishing. I am not too pessimistic. \n \n J: I believe tools matter, and matter a lot. Tools are not neutral (Tufte says that regarding Powerpoint). If you have to fight them they’ll make your life miserable. Try to apply Tufte’s principles to Crystal Xcelsius. I already wrote about this in my blog using fable about the scorpion and the frog (“it’s in my nature”). \n E: Sure, tools matter. Especially if you know how to switch from one to another according to your needs. Nonetheless, I still believe principles come first. And in order to select the “right” tool and understand its limitations you have to have a clearer idea of what you want to achieve. \n \n J: Life is short: I would argue that it’s better to learn about perception, statistics, data management and graphic design. Delegate the programming part. I’ve been making some dashboards and I spend more time programming than exploring better ways to show the data. Hate that. \n E: Cannot agree more. Eve though I think we are still in a phase where it’s really really hard to split between the designer and the implementer. The two things are so intertwined that trying to outsource the implementation may very easily lead to unsatisfactory results. But sure, the real skill is in the design IMO. \n \n J: If you don’t include R in your list you’ll get into troubles :) \n E: Sure! It’s in the pipeline :-)"], "link": "http://fellinlovewithdata.com/guides/tftp-jorge-camoes-excel", "bloglinks": {}, "links": {"http://www.qlikview.com/": 1, "http://spotfire.tibco.com/": 1, "http://www.excelcharts.com/blog": 2, "http://www.tableausoftware.com/": 1, "http://peltiertech.com/": 3, "http://bit.ly/": 3}, "blogtitle": "Fell in Love with Data"}, {"content": ["Yesterday I wrote this on twitter: “ I must confess I very rarely read data visualization blogs, most are depressingly predictable and shallow .” Yes, it’s not the nicest sentence I could write, but it’s true: most data visualization blogs suck. They do not inform, they do not entertain. \n At VisWeek, last month, we organized a pretty successful Birds-of-Feathers (BoF) titled “Blogging about Visualization”. I and Robert advertised the thing a bit and we managed to gather a pretty cool bunch of people around a table. We spent at least a couple of hours all together and then we enjoyed a wonderful dinner at a Greek restaurant . \n During the BoF we discussed several aspects related to blogging (check the nice summary wrote by Dominikus to know more) but what struck me the most is the following: (1) people desperately want to know how to succeed with blogs; (2) people think it is a sort of black art when in fact it’s only a matter of mindset and hard work; (3) there are endless possibilities to open new blogs. \n Yet, the decent blogs around can be counted with the fingers of one hand. And I want to see more great stuff, because either we grow as a community or nobody will grow. Here are some personal thoughts about blogging and a number of tips I want to share with you, hoping they will convince some among you to open the best data visualization blog ever. \n The Data Visualization Showcase is Dead \n When I think about why many data visualization blogs are so useless, the reason number one that comes into my mind is that they try to replicate a dead model: the data visualization showcase (I fell into this trap twice before creating FILWD, so I know what I am talking about). The showcase model is this: “ Hey folks, look how cool this is “. Stop. Iterated x-times per week. \n You don’t need a blog for this. It was maybe true 5 years ago but with the advent of Facebook and Twitter it’s totally useless. Also, and even more important, there’s no way for you (and for me) to compete with Infosthetics and Flowing Data (@Andrew: I know you don’t agree with me on the death of the data visualization showcase, but what can I do? This is what I think ). \n Let me clarify. I don’t think these two blogs are useless. Andrew and Nathan did an enormous service to our field and we all have to thank them from the bottom of our heart, but it’s foolish to believe we need more of that. \n Three key reasons why (vis) blogs suck \n I could name a hundred, and by the way if you buy a book on blogging (like the classic mainstream ProBlogger ) you will find millions, but here I’ll focus on those I believe are especially troublesome for vis blogs (apart from the data visualization showcase which is the most troublesome). \n Trouble #1 – Taking it as a hobby. This is the most problematic. People write blogs casually, once in a while, when they have nothing special to do or when they feel something is so cool they have the urge to share it with the world, that is, three friends. Amateur blogs are everywhere and pollute the whole web. If you want to succeed with your blog it’s important for you to realize that you have to sweat your damn shirt. On the contrary, if you don’t want to succeed, why polluting the web with your blog? Think about it, it’s an ecology thing: every piece of information you put on the web may decrease the already feeble signal to noise ratio we have. Do you want to contribute to the noise? \n There’s no other way to succeed than taking it as a serious endeavor, believe me. Blogging takes a lot of planning and work. Every single post may take many hours distributed across days, weeks, or even months. And that’s just the effort needed to create content, without counting administration and marketing. You might not see it, but behind every single post here there is a huge amount of work, and I know it’s the same for other fellow bloggers. \n Being serious about your blog then it’s not only a matter of content but also of being committed to have a somewhat regular schedule, especially at the beginning. People hate dead trees and for a good reason. Please do me a favor: if you are considering opening a blog, take the whole thing very seriously. You need a good reason for opening a blog and if you don’t have one, sooner or later you will give up. I don’t want to discourage anyone, to the contrary, I want to see more great blogs! But I am also tired of shallow blogs and dead trees. \n Trouble #2 – Providing limited value. What is *special* about your blog? I know, it’s a tough question. But, if you are not totally honest with yourself about that, you will have problems. People stop by and read your blog only because you are able to deliver some kind of value. What value? I don’t know … you name it. As a general rule people read for two main broad reasons: to learn or to be entertained (or both). Are you able to deliver unique knowledge that other people cannot deliver? Or do you have a special irresistible style that people love so much they are eager to see what’s next? That’s the trick, that’s the obsession you have to have to succeed. \n Many, many, many vis blogs are shallow just because they do not give in, they do not have anything special to offer. They don’t even try to differentiate themselves from the rest. It’s a game in which you lift the bar 1 inch higher every single time you write. The web is a jungle, people jump from one web page to another in a matter of seconds, how do you plan to let someone stop and read through what you write? Let’s take the data visualization showcase mentioned above: do you think you can attract people by showing new visualizations every day? Do you think you are more skilled than the current main players in finding new stuff? I have several doubts. \n When I opened FILWD it was clear to me I could not compete with the big guys (and I didn’t want to anyway) so I asked myself: “ what skills or knowledge do I have that I can use to gain a competitive advantage? ” And my answer was that I have direct access to vis research and researchers and that I know vis theory better than the average geek. I am sure you have your own uniqueness so try to think hard how to use it. \n Trouble #3 – Forgetting to show a real face. People are too busy to absorb the bare information, and information by the way is not a scarce resource anyway. Many blogs are plain dry, it looks like the writer does not exist or hides behind the curtains. Where are the emotions, opinions, and fun? Writing about scientific stuff does not imply being serious, objective or dry. The best bloggers show their face and risk their reputation every single post. Sometimes I feel a pain in the stomach before hitting “publish”. I happened to think: “ people will kill me for this one “. \n Similarly, many bloggers don’t spend any time thinking whether they have a style or not. But *your* style matters a lot and you’d better know what it is. There are a million styles and be careful not to fake it. Your style has to be natural but it also has to shine through your words and visual design. Take for instance Stephen Few: Oh boy … I hate the way he expresses his opinions, he makes me cling my teethes at times, but you rest assured I read every single line of what he writes. What is your style then? \n How do you create (or revamp) a successful vis blog? \n Hey this is slippery terrain: every single blogger has his own formula and you can find a million sources on the web on how to make your blog successful. I don’t pretend to be a blog guru, but I can share with you the things that really worked for me, with the hope they will assist you in case you want to open your blog. \n Tip #1 – Find your final cause. How do you plan to change the world? Why do you want to open a blog? Once you put aside all the legitimate ego trip we all make what is left for the others? Successful blogs are centered around the readers, they want to make the world better. They strive to provoke shifts in people’s mind. How do you plan to be ridiculously helpful for people? With FILWD I planned from the very beginning to help people become visualization experts, then I discovered I could sometimes help them think in unconventional ways. What’s your cause? I’ll give you an example: do you know anything about Data without Borders ? That’s a cause folks! \n Tip #2 – Study a lot. Before starting FILWD I read an endless amount of material about blogging, I trashed many and kept some. I studied the strategies of many many successful bloggers in many other areas out of visualization. I could name hundreds of sources but you have to do your own research. Among the thousands things I read, there are two gems that really shine: Trust Agents , a must read even if not an easy read, and Think Traffic , the best blog about blogging ever. \n Tip #3 – Plan ahead and find your style. Before starting FILWD I wrote down a thousand plans and eventually came up with two key pieces of information: (1) my target posting schedule; (2) a very few number of post categories. The posting schedule does not have to be very tight but it has to be somewhat regular, especially before your blog is established; people hate guessing when you are going to post the next article (and of course I am still struggling with it). Having a number of predefined post categories is the best piece of advice I can give, it helped me being totally clear about what I wanted to write and especially what I did not want to write. For instance, I very rarely write about other people’s work unless it is an inspiration for a broader argument. You can check my categories on the blogs and you will see they are very few. When I write a new post I think: “ what category do I want to write in today? ” \n Tip #4 – Be ready to walk through the dark and deep valley of loneliness. Blogging reminds me when I started learning how to play guitar many years ago. At the beginning it’s so frustrating, it looks like you will never be able to play two chords one after another. With blogs the problem is that at the beginning you have zero readers and you have to spend a lot of time preparing these stupid posts nobody will ever read. Very painful. But it’s totally transitory: if you keep doing the good work, people will come and will love your post written to nobody in the past. That’s a very key element of blogging: being able to go through the deep valley and wait until it blossoms. You have to have faith: it will be great. \n Tip #5 – Find your own buddies. What is life without friends? I don’t have to tell you how to use twitter, Facebook, or Google plus right? Plus I don’t think there is a unique formula. But hey, make sure to build a thriving environment around your blogs and your ideas. Somebody said “No man is an island”, well this is especially true in this business. Find some buddies, share your ideas with them, test your ideas before writing a post, be exceedingly generous and genuine and people will gather around you. \n Tip #6 – Experiment. Blogging is a constant experiment. You write a very successful post with a given strategy, you try to replicate it and it doesn’t work. I like to think about blogging as a radio knob you have to manipulate to find the right frequency to tune with your audience. The frequency is always shifting and your work is to be able to seek the right spot all the time. Sometimes it works, sometimes it doesn’t. But it’s not a big deal as long as you keep trying. Blogs, for instance can accommodate very different media and it’s a good idea to experiment with them. I experimented a few times with video and I was scared shitless because of it. \n There are of course many other things you can do to make your blog successful, many of which I don’t know yet. Everyone has his own path, you have to find yours. I know one thing for sure: hard work always pays off. Always. \n Need a good reason for opening a blog? \n Hey, I hope I did not scare you too much up to this point. There is one thing I want to make sure you get out of this blog post: opening a blog may be one of the smartest choices you can make in your life. Again I could name hundreds of reasons why blogging is great but for me the most important one is that it feeds my mind in a way I could not get with other means . Blogging so far helped me, at least, in these many ways: \n \n I became a much better writer \n I became a sharper thinker (thanks to having to write what I think) \n I know much better how the web works \n I know many more great thinkers … and they know me \n My ideas are debugged by a large crowd of people \n If I have a burning question I have lots of people to whom I can ask \n I get invited for talks \n It feeds my research and my research feeds it \n I might write a book one day thanks to it \n … \n \n I can testify that all the effort is definitely repaid by the myriad of benefits you can get. Some people do blogging for the money, and some are pretty successful, and some other for the glory. But whether you do it for the bling bling or not, the formula is always the same: you have to write epic shit . There are altruistic and egoistic benefits from blogging and they are all fine as long as you have a good balance. Blogging makes you grow internally, you find yourself improving in many ways, and it helps you having a powerful interface with the world. But it also helps people thrive thanks to your work, and that’s absolutely priceless. \n Start a kick-ass visualization blog today! \n Let me add one final remark. If you are thinking of opening a data visualization blog, a good one, please do it! We have a desperate need for quality content and I want to have my inbox filled up with exciting ideas. If you need more help send me a line or ask to professional bloggers. I do think there is a huge space for new blogs in this area, you just need to find your niche. For instance, I am looking forward to data visualization blogs related to one specific application area. Or, another great one I’d love to see is a blog with a frequent posting of interesting little visualization experiments. It’s up to you now, let’s make data visualization better together!"], "link": "http://fellinlovewithdata.com/reflections/kick-ass-blogs", "bloglinks": {}, "links": {"http://andreasri.com/": 1, "http://fellinlovewithdata.com/": 1, "http://eagereyes.org/": 1, "http://amzn.to/": 2, "http://bit.ly/": 4, "http://dwb.cc/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["Hi There, \n VisWeek is approaching! This is just a short notice to let you know I am organizing a Birds-of-Feather with Robert Kosara titled “Blogging About Visualization” at VisWeek. The goal of the BOF if to meet people who are interested in data visualization blogs (bloggers and readers) and have a chat about current practices and future developments. \n Here is the information about where and when: \n Blogging about Visualization \nTime: Tuesday 4:15-5:55pm \nLocation: Bristol \nDescription: A meeting of visualization bloggers, readers, and anyone interested in discussing visualization on the web. We will discuss experiences, uses, purpose, benefits, and future goals of blogging about visualization. \n If you are a regular reader of this or other data visualization blogs and has something to say or just want to meet us and join the conversation please drop by, I am sure it will be fun. Me and Robert plan to give some advice on blogging, in case people want to hear it, and the BOF will be totally informal. It could also be the starting point of new endeavors, collaborations, ideas, etc. \n Cocktail & Dinner. \n Another good reason to participate is that we will have a cocktail and dinner just after the BOF. We still have to fix the location but we plan to meet at 7pm at the lobby and go there together. If you are interested, even if you cannot come to the BOF, please sign in the google group I created for this purpose: Vis Blogging Dinner . We are already a good bunch of people. \n Take care and hope to see you soon. \n P.S. In case you are reading this and will not be able to come to visweek don’t worry I plan to provide plenty of information from the conference this year. Stay tuned!"], "link": "http://fellinlovewithdata.com/news/blogging-about-visualization", "bloglinks": {}, "links": {"http://eagereyes.org/": 1, "https://groups.google.com/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["When I saw for the first time a visualization developed by Jan, the Ghost Counties , I was totally fascinated. It’s brilliant. It took me a while to understand how it works, but once I got it I could not help but admiring the strange mix of complexity and simplicity it provides. \n Despite he looks so serious in this picture on the left, he has a big smile and he is fun. I met him for the first time at Visualizing Europe and since then we exchanged many emails. Plus, he is a regular commenter here (and everywhere) and I love him for that. \n I don’t know how much I have to add to convince you his advice is a valuable one. Just give a look to his portfolio  and judge yourself. He is IMO one of the most interesting data visualization freelancers recently appeared on the scene. \n I know, by talking with him, he is proficient with several technologies but he has a passion for D3. \n How did you start using Protovis/D3? \n I’ve always been someone interested in the latest technologies. So, since I follow the data viz community very closely, I was aware of Protovis very early on, and I was aware of the development of D3 even before it was released to the public. I have a software development background, so I don’t have too much trouble finding my way in new programming languages, and since it excites me to work with new technologies and frameworks, I just started playing with Protovis and D3 as soon as it became available. \n What’s the best and worst aspect of Protovis/D3? \n The best aspect of Protovis is that it is a domain specific declarative language, which means that is fairly easy to start writing code, using visualization related keywords and functions. The best aspects of D3 is it’s flexibility (more direct integration with SVG) and better performance. The worst aspect of both D3 and Protovis is that it’s hard or impossible to get it working on older browsers, and the learning curve for D3 may be somewhat harder than for Protovis. \n Ok, I am a beginner and I want to learn Protovis/D3, where do I start? \n I think Protovis is easier to start with than D3, but Protovis is no longer under development. I also see that the Protovis mailing list is not very active anymore, while the D3 mailing list is very active. But, I guess Protovis would be a very good way to start if you’re a beginner. Basic Javascript programming skills would be recommended, both for Protovis and D3. For some great Protovis tutorials you should check out Jerome’s blog: http://www.jeromecukier.net/blog/category/protovis/page/2/ (part 1 – 5: working with data in protovis). Also, the Protovis website has quite some examples that are pretty good. For D3, documentation, examples and tutorials are still under development: http://mbostock.github.com/d3/api/ so, with D3 you’re more on your own right now (and of course the mailing list). But things are improving rapidly. \n How is the learning curve vs. return-on-investment of Protovis/D3? \n Protovis is really a good way to learn visualization and programming at the same time. Protovis is a language that is really geared towards the visualization (and diagrams) domain, so it really makes sense to talk about axis, marks, lines, bars, pies, etc. Also, there are really quite some good examples on the Protovis website, so it’s fairly easy to get started. However, right now Protovis is not supported anymore, and people are really moving to D3 now, so getting support may become a little tricky. Also, Protovis does not perform as well as D3 with very complex graphs for instance, and also, compared to D3, in Protovis you’re a little bit limited to the animations you can achieve. So, overall, a good way to start and also good to make some nice standard diagrams and visualizations, but if you really want to do ‘heavy’ visualization stuff, you might consider moving on to D3. \n D3 is more powerful, more flexible and seems to have more capabilities (and better performance) than Protovis. The flip side is that in order to have a more flexible programming language, the language is also more abtract. Though many concepts of Protovis are also implemented in D3, and there are also quite some predefined visualization layouts, it’s also more useful (compared to Protovis) to gain some knowledge of SVG, since it’s more likely that you might do some low level stuff. D3 does give you much better animation capabilities, better performance, more flexibility, so, once you get the hang of D3 and some SVG, you’re able to create some very compelling interactive visualizations. \n What other tools would you recommend other than Protovis/D3? \n The tools you mention are some of the best right now. I also think that Raphaël is a fairly good alternative if you want to do Javascript-based visualization that works in older browsers as well. Personally I don’t have much experience with Raphaël yet. Also Processing now has an Android mode, which is great if you want to create visualizations that run on Android phones, and the upcoming Processing 2.0 also has a Javascript mode, so you can easily create HTML5 canvas based visualizations with the Processing development tool. \n A recommendation I’d like to add: when I work on Protovis or D3 visualizations, I use TextMate on the Mac. This allows you to open a preview window which renders your visualization near real-time when you are typing in your code. I’m sure that are similar tools that do this. This is really great for getting immediate feedback while you’re coding."], "link": "http://fellinlovewithdata.com/guides/tftp-jan-willem-d3-protovis", "bloglinks": {}, "links": {"http://www.janwillemtulp.com/": 2, "http://www.jeromecukier.net/blog": 1, "http://fellinlovewithdata.com/": 1, "http://mbostock.github.com/": 1, "http://www.visualizing.org/": 1, "http://raphaeljs.com/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["This is a short notice to all FILWD readers who are going to VisWeek 2011 . I will be there the full week starting from Sat Oct 22th and I would love to meet some of you guys. There are two main events you might be interested in. \n Data Visualization Blogging Dinner \n If you are going to visweek it would be just awesome to spend some time together in front of a hot meal and a good drink. I’d love to see your faces in real flesh! \n If you are interested (even if you are not sure to come) please sign up to this google group I just set up -  Vis Blogging Dinner – VisWeek 2011  - and we’ll find a suitable place and time to spend some time together. Ok?  Please sign up as soon as you can so that I will be able to reserve a place to stay. \n Blogging about Data Visualization BOF \n I am trying to set up together with Robert Kosara ( EagerEyes ) a Birds-of-Feathers during visweek to meet people interested in data visualization blogging. Everyone is welcome (bloggers, aspiring bloggers, blog readers, etc.) The meeting will be totally informal and we plan to give advice on how to blog about vis (in case you want to hear it from us of course :-) and to hear from you guys whatever idea you have on how to make data visualization blogging better/funnier/stronger/etc. \n Catch me! \n Apart from that we can always meet in the hotel during the week if you feel like. If you see me around and want to have a chat or share a drink or just say hi please catch me! I added a picture of myself here below so that it’s easier for you to recognize me (I hope). \n  \n If you are not going to VisWeek … \n I plan to record a video from visweek at the end of each day to provide a summary and thoughts. I also plan to write more about what will happen at visweek later this week. Stay tuned!"], "link": "http://fellinlovewithdata.com/uncategorized/lets-meet-at-visweek", "bloglinks": {}, "links": {"http://eagereyes.org/": 1, "http://visweek.org/": 1, "http://fellinlovewithdata.com/": 1, "http://bit.ly/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["I wanted to title this post “giving constructive feedback about visualization and its long-lasting effect” but it didn’t sound as good as this one. \n The Story \n I was about to write my next long post (don’t worry, almost done) when I received an email from a guy working for Hotels.com: \n “ Hope you’re well. I’ve seen you’ve covered infographics in the past and thought you might be interested in a new one from Hotels.com that looks at how people from around the world eat and sleep when staying in hotels. The research was conducted among 3,339 people in 20 countries. You can view, download and embed the infographic at:  http://press.hotels.com/en-gb/infographics/ “ \n Here is the infographic (click on it to see the details): \n  \n I gave a quick look to the image, read the findings, and just discarded it as crap. I said to myself: “Here we go again … another email with crappy infographics”, pushed delete, and moved on to the next task. After a while, my sadistic brain could not resist and I wrote a quite cryptic message on twitter trying to see if I could catch some fish: \n “ From hotels.com: “I’ve seen you’ve covered infographics in the past and thought you might be interested in a new one”  http://bit.ly/nGiUiC “ \n A few people replied and again I moved on to the next task. \n Some other people like Stephen Few would have maybe started a long rant about all the reasons why this was crap, while some others, maybe, would have taken it seriously and tried to analyze it in details. Me, I just shook my head a never replied to the guy. \n Here is where the true story begins: after a few minutes I receive an email from Andy Kirk of visualisingdata.com (bold is mine): \n “Enrico – I received the same  Hotels.com  email today and had a good exchange of emails with the guy promoting them.   \n To be fair after our conversation he was really appreciative of the advice and said he will do his best to try and affect a change in approach. Really interesting how this particular market has erupted though isn’t it – the fact  Hotels.com  has a dedicated Infographics section under its PR pages…” \n And later on: \n “… it is becoming more and more difficult to stay on top of these type of requests but I’m taking the longer view that if I can offer constructive feedback it might in the smallest way have an impact on improving practice “ \n Let me repeat this sentence from Andy: \n “If I can offer constructive feedback it might in the smallest way have an impact on improving practice”. \n The Lesson \n What a lesson have I learned! It was like a diamond in my head. Thanks Andy. \n If you have been reading this blog for a while, you might have noticed I tend to be quite pacific, but at the same time when it’s time to say crap, I say crap. \n We in the community have learned to have an automatic reflex: we look at some crappy visualization and in the best case we shake our head , in the worst, we write long rants a la Stephen Few. \n I must confess I use to shake my head more often than writing long rants, also because otherwise FILWD would only host such type of big-ego content which I don’t like. \n After reading Andy’s email I completely changed my mind. It’s way too easy to look at some stuff and think  ”oh yes, the usual crap”. I did it so many times! And it’s even funnier when you share the “crappyness”  with some friends or tweet about it “hey look … how could they be so idiotic to draw this and that in this and that way”. And we fill our mouth with words of wisdom. \n Question: Do we make visualization any better by ignoring or, worse, mocking people who design bad visualization? \n I know some of you might say that publicly criticizing bad stuff with big words will make people notice and be more cautious about what they publish. True. But will this strategy pay off in the long-term? I am not sure. \n What do you think? Is it more beneficial a loud voice or a humble and cheerful suggestion? Especially, when people ask for an opinion. Do we need both? Do we have to treat different people with different strategies? Or should we just ignore everybody and do our work the best we can? \n A few months ago I wrote in my post on Visualization Consumerism : \n “ I think we have to acknowledge the problem and do our best to educate people. But wait a moment …. educating people is a dangerous idea! I agree. But let me explain what I mean. When I say educating people I mean doing it bottom-up; by giving the right examples and striving for creating a thriving environment “ \n It looks to me like if these words had been written by someone else! The words are good, my behavior just does not match. We will build this thriving environment only if we learn to shake our head less and learn to help people in every possible way to make great visualization. \n Sorry, now I have to go … I have to write a reply to the guy from Hotels.com. \n Thoughts?"], "link": "http://fellinlovewithdata.com/reflections/shaking-heads", "bloglinks": {}, "links": {"http://press.hotels.com/": 1, "http://fellinlovewithdata.com/": 2, "http://hotels.com/": 2, "http://t.co/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["Ok guys, here we are with a new interview of  Tools from the Pros , the series in which I interview data visualization professionals about their favorite tools.  This time we have Joe Mako talking about his experience with Tableau.Before I start telling anything about Joe, let me tell you how I ended up  interviewing him. I was looking for an expert to interview with proven experience in designing advanced visualizations with Tableau, so I decided to ask to some twitter friends. Result? Lots of names but only one always there: Joe Mako. If this is not enough give a look to the impressive list of video tutorials he has in his blog.Joe is employed at S2 Statistical Solutions  where he does data integration and visualization. This is what Joe wrote when I asked him to send me a short bio: \n \n I have used Tableau extensively since 2008, creating interactive viewpoints of data to enable people to get answers to their complex questions easily. Currently, I specialize in integrating complex databases from health insurance companies, hospital networks, and the government to enable better evidence-based decision making. I am active on the Tableau user forum, solving a variety of situations for many Tableau users ranging in skill from beginning to advanced. \n \n I really enjoyed reading his interview. He provides lot of interesting references and links. If you are thinking about using Tableau I am sure his tips will help you a lot with your final decision. \n How did you start using Tableau? \n About three years ago in 2008, I had been reading FlowingData for a few months when I noticed Tableau was a sponsor and decided to check out their software to see if it could help with some projects I was working on. I felt like I was decent with formulas and VBA in Excel, but always had trouble making a decent chart. When I first saw Tableau in action, I knew it would make my job of making sense out of numbers easier because a good chart was easy to make. The first big project I used Tableau on was reporting on data quality and monitoring the cleanup of the records. With the guided analytics Tableau enables, I was able to make interactive dashboards allowing a view to see what records were wrong, why we knew they were wrong, how much revenue was lost because of the error, and then tracking what records got fixed and the increase in revenue. The project was a success, and I knew creating visualizations in Tableau was my passion. In the past three years, I’ve rarely gone a day without using their software, being a part of the Tableau user community has become a big part of my life. The many great people I have meet, and the friendships I have gained by participating in the community are most valuable. \n What’s the best and worst aspect of Tableau? \n The Tableau Data Engine is the single most valuable feature I would miss the most if Tableau was removed. I don’t know if there is a specific term that can fully describe it, because it is unique, and it has a long list of benefits: bulk text loading, super fast aggregations, incremental appends, and just all around seamless experience. Suffice to say, if I am working with data, and I don’t need a real-time feed, I’m loading it into the Tableau Data Engine (TDE) every time. It has been called an “in-memory” database , but that may not be the most accurate term for it because it is not like other “in-memory” databases. Instead of loading the entire data set into RAM, the TDE intelligently selects what data to load into RAM, so that we can work with data sets larger than our available RAM. So I am not sure if there is a good way to compare it to other data storage systems other then knowing that the TDE was created specifically to work with Tableau, and it is a beautiful thing. \n Tableau is a focused and opinionated piece of software, meaning it is not a complete solution, but for what it does enable, it does great job. The number one thing I believe is lacking from Tableau is easy to use and fast statistical functions. Currently, with custom table calculations, and data preparation, I have found that Tableau can compute nearly any calculation, but it is too much of a work-around to force the software to do something it was not designed for, because it adds unnecessary complexity, and commonly makes the interaction slow. There is already a built-in delay with published workbooks (waiting for the Server generated images to download), and the additional delay of waiting for the computations to be evaluated becomes a major drawback. \n Ok, I am a beginner and I want to learn Tableau, where do I start? \n Tableau provides phenomenal training resources for free . Their On-Demand training and Live Online would be the first place to check out. There is no shortage of interesting workbooks that you can download and inspect or try to re-create from places like the Visual Gallery , their Blog , and there are live workbooks embedded throughout their website (I don’t think I’ve found them all yet). Their Knowledge Base with over 300 step-by-step guides on how to accomplish useful tasks. Then with the Q&A Forum there is no shortage of interesting situations and people like myself eager to help you accomplish what you want in Tableau. \n How is the learning curve vs. return-on-investment of Tableau? \n I remember learning Tableau was real change in my approach to data, and I still feel like I learn something new about Tableau every day. My experience in learning Tableau has been like playing a game, the first things are easy, and some really amazing analysis can be created with just the use of the mouse. I think of it like “ The Princess Rescuing Application “, specifically slide 16, where it is a series of short learning leaps, and each one brings joy with accomplishment. \n While Tableau on the surface has a clean interface, many complex operations are just under the surface, a click away, and once you know how to do something in Tableau, it becomes simple and fast to perform. The main exception is custom table calculations where there are a multitude of non-obvious factors effecting their evaluation. I believe an understanding of SQL would make Tableau more understandable and less mysterious. If you need to make sense of numbers, the return-on-investment is easy to see, things that take hours, or require programming, take minutes and drag-and-drop inside of Tableau. I consider it having a conversation with my data when I use Tableau, because as quickly as I or the person next to me can ask the question, Tableau enables me to provide the answer. \n What other tools would you recommend other than Tableau? \n Once you understand Tableau’s approach to data, I am sure it will be clear that Tableau does not stand alone as a complete data solution. While Tableau is fantastic at the human-centric tasks, it does not perform tech-centric tasks (see “ BI Has Hit the Wall ” by Stephen Few), and you will need software to help you prepare your data for Tableau. Every few months I am changing my tech-centric applications as my needs change and I try new things, but I think Pentaho Data Integration (Kettle) is wonderful for ETL. There are many ETL applications out there, and I recommend trying them all to find the ones that fit your style and needs best."], "link": "http://fellinlovewithdata.com/interviews/tftp-joe-mako-tableau", "bloglinks": {}, "links": {"http://kettle.pentaho.com/": 1, "http://www.perceptualedge.com/blog": 1, "http://fellinlovewithdata.com/": 1, "http://joemako.tumblr.com/": 1, "http://www.tableausoftware.com/": 6, "http://www.s2stats.com/": 1, "http://www.lostgarden.com/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["Oh gosh, I was almost going to miss it: Fell in Love with Data turns one! One year has passed and so many things happened in the meantime. Where do I start? Well, let me start with the obvious but important: \n Thanks to all of you guys who are reading, commenting, re-tweeting, sending messages, etc. You gave to me much more than what I gave to you. I owe you something. \n Numbers have been growing fast during this year but FILWD is not my personal toy to boost my ego (even though it helps in these regards), it’s a tool to advance data visualization. It’s for you, it’s for me, it’s a work in progress made to help us making this whole business damn better … with some fun in between if possible. \n Lessons Learned. \n There are many things I learned during this year, far more than I am able to write in this blog post. Here are a few that come to my mind right now as I am writing: \n \n Blogging is a fantastic platform and I cannot think of doing without it anymore. Now, after one year, I cannot think of how one can pretend to be influential without a blog  (especially in academia my dear fellows). \n Writing blog posts helped me far beyond my expectations towards clarifying ideas to me and taking all these vague concepts I had in my brain and transform them into something concrete. What is really surprising to me is to notice how not only my research work helped me writing blog posts, but also writing blog posts has had a strong positive influence on my own research (one more reason for blogging my dear friends). Far more than I expected. \n Blogging is at the same time much harder and much easier than people think. It’s harder because you have to spend a lot of energy and thoughts to make a blog successful. It’s a damn serious job, it doesn’t happen by chance. For me everything changed when I realized that it was totally nonsense trying to compete with Infostethics and Flowingdata and that I had to offer something different. But blogging is also much easier than people think because it just takes you to come up with a solid concept, set up a blogging account anywhere, and write, write, write an let it flow. I am surprised by how many people are scared by it. \n What matters is not success in terms of numbers (even though numbers count), but influence. At the end of the day if you have only 100 readers but you are blowing their mind it’s a lot better than having 100.000 casual readers passing by and say: “hey cool” and then they go back to their own stuff. It reminds me a notable statement from Tufte: “differences that make a difference”. \n No matter how much planning you put on your blog and how many blog posts you have in the pipeline, a blog is a living entity with its own dynamics and you cannot anticipate how people will react . This means being always ready to adapt and write about what matters now. What people need to read in this very moment, not the idea you had three months ago. \n The space for the data visualization showcase is shrinking (and thanks god!) The only way to be successful in data visualization is to do solid stuff that people need. Yes, there are still a couple of consumerist visualization  readers out there but who cares? Do they make any difference at all? \n It doesn’t matter how clever and innovative the things I write are, the biggest value of the blog is YOU . In innumerable instances the real value of my posts came from my readers and their comments. I especially enjoyed those with opinions alternative to mine. They helped me re-think my ideas and make them more solid. Thanks a looooot! \n The best posts I wrote are those that scared my butt off , those where I felt I was stretching my intellectual capabilities. Often with this kind of posts I experienced the tension between trying to be as accurate and informed as possible, with the realization that I just don’t have enough time and means to study everything in every single detail. That’s hard but it’s also very very rewarding. \n Data visualization is a huge trend, far beyond the close knit of academics I was used to deal with. Plus, people out there are in desperate need of solid information because the Internet is a chaos and the field is not mature enough. Also, we people in academia have the responsibility to lead the way (did you hear that guys?) \n \n Retrospective. \n In retrospective what could I have done differently? I don’t know … maybe you can tell me what you think. I don’t think I could have done anything too differently, I am pretty satisfied of how things evolved. \n If I have to mention one single thing I would like to do better, it’s to achieve a much more regular posting rate. But in the end it’s a compromise, what is better: to write more often but more crappy stuff or write only when I have something to say? Dilemma. \n I am proud of the following posts: \n \n How to Become a Data Visualization Freelancer | Interview with Moritz Stefaner : Because it blends surprisingly well useful knowledge and fun (thanks Moritz!) \n Visualization Consumerism : Because it came from my gut and I managed to let some people think. \n Data Visualization is NOT Useful. It’s Indispensable : Because it’s a little manifesto about how important visualization is to me. \n Do visualizations need to be “accurate”? : Because I overcame the fear of questioning the most fundamental theory we have in vis (and it hurt). \n Can visualization influence people? I mean can we prove it? : Because I managed to leverage on an apparently insignificant personal life event. \n 7 Classic Foundational Vis Papers You Might not Want to Publicly Confess you Don’t Know : Because it spread some fundamental knowledge around (it’s the most successful post I’ve ever written so far). \n \n Things that blew my mind. \n \n That my post on the 7 classic foundational vis papers  had almost 4000 visits on the date of publication. People are thirtsty for knowledge! \n That some renown researchers in the field are reading my blog and contact me for the things I write. \n That some people invited me to talk for my blog and not for my research work (though a bit disappointing! :-)) \n \n Special thanks to … \n \n Robert Kosara: for showing me  with his blog that it was possible to write a blog like FILWD. \n Andrew Vande Moere: for instilling in me some doubts before I started. \n Prof. Tamara Munzner and Prof. George Grinstein for giving me so much fuel. \n The Data Visualization Cartel: you guys know why. \n \n Plans for the future? \n I always have plans for the future which I regularly abandon and the list is so full of stuff that I know I will never do it all. So what can I say? Maybe you have something to suggest: \n \n How do you see FILWD evolving in the future? \n What are the posts you liked the most and would like to see replicated in the future? \n Is there anything useless in FILWD that I should definitely stop doing? \n \n I can anticipate a few things I’d like to do: \n \n Do more videos, especially if they are fun. \n Create the FILWD Newsletter to have a more intimate communication channel with some of you. \n Create an e-book out of the Beginners Toolkit . \n \n What do you think? Do you like these ideas. Do you have anything to suggest to make them better? Thanks. \n — \nWith Love, \nEnrico."], "link": "http://fellinlovewithdata.com/reflections/happy-birthday-fell-in-love-with-data", "bloglinks": {}, "links": {"http://fellinlovewithdata.com/": 10}, "blogtitle": "Fell in Love with Data"}, {"content": ["I am really excited to announce my first interview for the “Tools from the Pros” series! We start with a very good one: Miriah Meyer talks about Processing . \n Miriah is assistant professor at University of Utah. I met her only briefly during a couple of conferences but I am a huge fan of her research work on interactive visualization systems for biological data analysis  (be sure to check them out!) Her tools are a rare example of well-crafted design studies in interactive data visualization and, as far as I understand, they are all developed in Processing. \n I really like this interview because it covers many of the things beginners (and more advanced users) need to know. One above all: the rapid prototyping approach Processing makes possible and the whole mindset behind copying and pasting code to explore alternative designs. \n Thanks Miriah! I think people has a lot to gain by reading this interview. \n — \n How did you start using Processing? \n I started using Processing in 2008 when I helped design a new undergraduate visualization course at Harvard. We chose Processing as the language for the course, and I learned the core bits of the language putting together homework assignments. I quickly came to appreciate how Processing got rid of all the annoying parts of graphics programming — setting up a rendering window, registering callback functions, dealing with linking and libraries and compiling to multiple platforms, that ridiculous gluPickMatrix, and not to mention the headache of type. \n We had Ben Fry come to the class to give a guest lecture that spring, after which we went out to lunch. I’ll never forget his answer to my question of why he created Processing. He said (well, I’m paraphrasing here) that he wanted a sandbox to play in, to quickly develop prototypes without getting bogged down in the architecture of the code. He emphasized Processing as a language to try different designs, with real data and with real interaction. And that cutting and pasting code in Processing is totally cool if it gets a design up and going faster. He wanted a language that lets people totally focus on the visualization concept and design without having to think too hard about the code underneath. \n Well, that sounded great to me. And I quickly became a total convert, cutting and pasting code until things got so messy that I had to just rewrite an entire project. I found this philosophy totally liberating and that my work benefited immensely from rapid prototyping. Processing is a language that supports this style of development. \n What’s the best and worst aspect of Processing? \n In short, the best aspect of Processing is the amount of code it takes to get a simple scene with callbacks going — it is a small fraction of what it would take with OpenGL. Simple primitives like circles, squares, text, etc. are nicely abstracted into one-line function calls. Mouse and keyboard callbacks are automatically handled. There is a wide variety of common graphics helper functions available, like lerp-ing colors. Full-screen apps work without having to grab weird OS handles. The PDF library that exports the current scene as vector-graphics has forever changed figures for papers for me. And the ability to export an application to a variety of operating systems in a single go is absolutely invaluable when working with users on a variety of platforms. \n Despite all the simplification of the underlying graphics library, Processing still feels like you are in complete control of every mark you make on the screen. I almost never feel like I need to find a way around a function to get the sort of control I want. The design decisions that went into creating the Processing API are fabulous. Really. \n As for the drawbacks, there aren’t any really great libraries (yet) for basic user interface widgets. Which for me is ok because I’m kinda neurotic about how my scroll bars look and act. But for graphics beginners this can be a real time-sink. Same goes for more sophisticated types of visual representations like basic charts, maps, and networks. Other languages like Protovis provide built-in algorithms for handling these very common types of representations. In Processing, you’ll have to implement your own graph layout algorithm (or, find one on the web). Again, this can be a hurdle for people with less programming experience. \n And as a small gripe — Processing has implementations of Bezier and Catmull-Rom curves … but where is the love for b-splines??? \n Ok, I am a beginner and I want to learn Processing, where do I start? \n Go to www.processing.org . Click on the Learning tab. Explore. \n On the Learning page you’ll find a whole series of tutorials and examples that can walk you through the basic functions of Processing. The next step is to peruse the inspiring demos in the Exhibition , many of which will include example code. When you see a function you don’t understand, the Reference page has wonderful documentation for the language. \n If you are new to programming or graphics programming the two books I recommend are: \n \n Getting Started with Processing , by Casey Reas and Ben Fry \n Learning Processing , by Daniel Shiffman \n \n You can work through the Getting Started book in a day. It’s short and sweet. If you find that you need more help, the Shiffman book includes more details on how to program and lots of paper and pencil, and coding, exercises. Daniel Shiffman wrote this book from course notes he created in teaching design students at NYU about coding and Processing. It’s intro to programming via Processing. \n If you are an experienced graphics programmer all you need is what you can find on the Processing website. \n How is the learning curve vs. return-on-investment of Processing? \n If you know OpenGL and are familiar with Java, the learning curve is super short and shallow. If you are new to graphics, it will take you less time to wrap your head around Processing than OpenGL. And if you are new to programming, Processing is a really fun way to learn the basics. \n With that said, it is still a programming language. Reading in data from a file requires basic coding skills, as does just about any interesting interactive visualization. You have to be comfortable with for-loops and arrays. Processing makes graphics programming way easier, but it doesn’t automatically generate visual representations of data. You have to code that. \n If you want control over every aspect of your visualization and interaction designs, then you really just have to program. Processing is one of the best languages to use for that. If you just want to see what your data looks like, then there are other tools that can do this quickly with built in visual representations (like Tableau, ManyEyes, Matlab, R, etc). \n What other tools would you recommend other than Processing? \n I’d recommend any of the tools and languages I’ve mentioned previously. Another gem is ColorBrewer for selecting great colormaps. \n Still, nothing beats OpenGL for truly understanding how graphics works. If you are serious about developing interactive visualizations, I think that taking an intro to graphics course that uses OpenGL is invaluable. Understanding the rendering pipeline and how it is implemented in a computer will make the seemingly quirky aspects of even a language like Processing make sense."], "link": "http://fellinlovewithdata.com/guides/tftp-miriah-processing", "bloglinks": {}, "links": {"http://colorbrewer2.org/": 1, "http://fellinlovewithdata.com/": 1, "http://www.processing.org/": 1, "http://benfry.com/": 1, "http://www.amazon.com/": 2, "http://www.utah.edu/": 2, "http://processing.org/": 4}, "blogtitle": "Fell in Love with Data"}, {"content": ["Hallo everyone! I am happy to introduce a new series nested in the Data Visualization Beginners Toolkit : “Tools from the Pros” . \n In my last post on data visualization tools I suggested a number of strategies to choose the best tool for you and I provided a list of those I think are the best bets currently available. Now, while I think this list is already very useful, I decided to give you more and I interviewed one data visualization expert for each tool mentioned in the list. \n I will be publishing the interviews during the next weeks. Some of them are still in preparation and the list might be expanded in the future as comments and requests come in (please feel free to ask!) What I can tell you from now is that I have the following interviews in editing stage and that the first one will come very very soon: \n \n Miriah Meyer on Processing. \n Joe Mako on Tableau. \n Jorge Camoes on Excel. \n Jan Willem Tulp  and Jerome Cukier on Protovis and D3. \n Drew Conway on R. \n \n Each one is a real pro in his area and knows very well the tool he or she uses to make effective visualization. I am sure you will get a lot of useful information out of them. \n To each one I asked the following questions: \n \n How did you start doing visualization with X? \n What’s the best and worst aspect of X? \n Ok, I am a beginner and I want to learn doing visualization with X, where do I start? \n How is the learning curve vs. return-on-investment of X? \n What other tools would you recommend other than X? \n \n I hope you’ll enjoy it. Stay tuned! The first one is coming very soon. \n Important: if you are an expert and are willing to answer these questions about your favorite tool I’d be happy to include you in the list! \n More important: specific request for other person/tool interviews are welcome! Who else would you like me to catch? About which tool? I cannot assure you anything but I’d love to receive your requests. \n Take care guys, and have fun."], "link": "http://fellinlovewithdata.com/guides/tools-from-the-pros", "bloglinks": {}, "links": {"http://www.drewconway.com/": 1, "http://www.excelcharts.com/blog": 1, "http://fellinlovewithdata.com/": 3, "http://joemako.tumblr.com/": 1, "http://www.utah.edu/": 1, "http://www.janwillemtulp.com/": 1, "http://www.jeromecukier.net/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["( Note: if you are new to this series, the DVBTK doesn’t teach you how to do visualization. Rather it is meant to help people find a less chaotic and more effective path towards the acquisition of the necessary skills  to become a data visualization pro. To know more, make sure to read the introduction to the series first . ) \n The DVBTK #1 introduced books and study material to make sure you acquire the right knowledge in the right order. Studying is the first step and there’s no level of practice that can substitute for it. \n That said, it is extremely important to realize that good visualization cannot happen without practice . It’s not only that practice is a necessary complement to theory, but also that you will understand the theory only once you apply it for real. \n But if you want to do visualization you need some tools right? Right. And again the web is a jungle and you might have troubles understanding what is the tool for you. You probably have heard a thousand names and acronyms but you cannot really decide; there are too many choices and too little guidance. \n Here is the guidance. In the following, I propose a number of rules and factors you need to take into account when choosing a visualization tool . Furthermore I introduce a number of “staple visualization tools”: established tools which you can make great visualizations with. \n And there is more to come! \n I felt you needed to know more about each tool, so I decided to interview (at least) one data visualization professional with proven and long-lasting experience with it. Be sure not to miss these interviews, I will be posting them during the next weeks. And of course be sure to send your remarks or questions in the comment below, so that I will be able to address them in the upcoming posts. \n Golden Rules of Visualization Tools \n First of all you need some fundamental rules. \n Rule #1: No tool will turn you into a pro. I think I stressed this point already in the past but it’s worth going over it again. Given the rapid development of visualization technology you might be tempted to adopt the latest technology thinking that it will turn you into a pro. This is not the case. There is no tool that can make you a pro, unless you develop your theoretical and design skills accordingly and organically. A visualization designer is a great designer regardless the tool of choice. It’s basically the same as photography. The last digital reflex may take crisper shots but it won’t turn you into the next Ansel Adams. \n Rule #2: First learn one single tool very well. Again, given the vast amount of choices you may make and the endless production of new technologies, you might be tempted to go after all of them. Don’t get me wrong, experimentation and exploration are great but what you need first is a tool that make you feel home, a safe place where you know you can always express yourself regardless the complexity of the idea you have in mind. Choose one tool (see below how) and learn it very well first, you won’t regret it. \n Rule #3: Choose tools you are totally in love with. Don’t choose a tool because it’s cool and everybody use it, choose the one that makes you feel great, the one you can have an affair with. People give their best with tools when they are totally in love with them and just cannot stop exploring all their capabilities. If a tool doesn’t click, if you don’t crave to use it (at least at the beginning) it’s a bad sign, move on to the next one. \n Let’s clear this out now: do you need to be a programmer? \n Damn it!  I was almost going to take the safe route and write down a politically-correct and well-balanced answer but … sincerely? Yes, I think you need to be able to write code. I mean, of course you can get away without coding, and below I propose tools which do not require you to write code, but why the hell do you want to limit yourself to such an extent? \n I get asked this question quite often and I came to the conclusion that the cost-benefit ratio is so skewed that I cannot see a reason why not coding . And the reason is not only in the benefit part of the ratio but also, and more importantly, in the cost. If you are scared by code it’s time for you to realize that writing code is nothing special and it’s not too difficult either. We all learned to write essays at school, and writing good ones is much more difficult than writing a few lines of code. \n A large segment of our culture promoted this view that writing code (together with science and engineering in general) is the sole right of engineers and geeks. Hey you know what? I am terrible at technical things and yet I managed to get a PhD in Computer Engineering and I can write with code the things I have in mind. If I can do it, you can do it. \n You don’t need to become a software engineer. The most complex stuff comes when you want to design and develop full applications with lots of interaction and many interconnected modules. But in most cases this is not what you are required to do, and in any case you can always acquire more advanced skills one you find that you need them. \n So, choose a language, grab a copy of a good tutorial or book, and learn to code. And hey, why not learning it by doing visualization?! Some of the tools outlined below are just perfect for this purpose (especially Processing and its sketchbook approach). That’s a win-win situation. \n How to choose the “right” tool \n There is no absolute “right” tool. The best tool is the one you can do great thing with, the one you love. However, there are a number of factors to keep in mind when making your choice. \n \n Maturity. Is the tool one of the latest fancy and coolest technology on the market with uncertain future or it has been used consistently and with success for quite some time? It’s not a strict rule, but if you bet on the latest technology chances are it will be abandoned in the future. This is especially true for visualization where technology is evolving very very rapidly. In doubt, go for the proven and trusted. \n Community. If your tool doesn’t have a large and stable community of enthusiastic visualization people, it’s a bad sign. Every great tool has a big community and a community is the most important factor in learning. It doesn’t matter how good the documentation is, you are going to need some help (and inspiration) from others. \n Documentation. That’s a very relevant and critical one. Good documentation is notoriously rare. To some extent a good community can alleviate the problems due to limited or bad documentation, but you don’t want to wait for a reply in a forum to move on in your project, especially at its very early stage. \n Examples. There are two main reasons why examples are important. First, you can use examples as a reality check: if people are not producing great visualizations with your tool of choice there must be a reason. Second, having great examples around you is a perfect method to learn fast. Learning by example is extremely powerful and should always be used in conjunction with more structured material. I know people who learn only through examples and they are great! \n Cognitive Fit. I cannot stress this one enough. You have to choose the best tool for YOU and this is a little bit like buying a suit: you have to feel comfortable and cool with it. If not, it’s not for you. The best tools are those with a low “friction factor”, that is, it is natural and easy for you to translate your ideas into pictures. \n Target Platform. Not all tools are created equal in the way they produce their output. Some are specifically targeted to the web, some allows easy conversion to static documents, some allow for the creation of full desktop applications. You’d better make sure to clarify what kind of output you want to produce before making a decision. \n Interaction and Performance. If you want to create interactive visualizations you have to make sure the tool you select allows for rich interaction. Also, when large data is involved you have to make sure your environment performs smoothly. \n \n Staple Data Visualization Tools \n Staple data visualization tools are tools with which you cannot go wrong. These are the tools I feel confident to suggest, especially if you are starting out. Of course, this list is very personal and you might find other tools you like. As I said above, if you are in love with a tool go with it. But if you don’t know where to start this list is a very safe bet. \n Processing \n \n Processing is the mother of all data visualization environments. Ben Fry and Casey Reas created it in 2001, out of their work at MIT, to help data designers create visualization sketches. Today it is one of the most established tool I can think of, maybe the most established. It has a huge user base and it has been used for every conceivable data visualization project (a lot for artistic purposes but for “serious” stuff too). The library is based on Java and this means that in order to use it you would need to learn at least bits of it. But, given the handy functions Processing provides this could also be considered a gentle introduction to the language itself. \n If you are willing to write code, you want total freedom in terms of design, and a solid platform, I cannot think of anything better than Processing. You just need to download the software (it is totally free), give a look to the amazing learning material, and start writing code. \n Processing does not have a rich set of user interface widgets but frankly I don’t think this is a too limiting factor. Interaction can be very smooth and if you need high performance you can always use OpenGL which is nicely integrated into the library. If you want to generate output for the web you can also use processing.js , which generates browser readable javascript code. \n \n \n Big Pluses: totally free, lots of learning material, very flexible, lots of examples, can be extended with any java library available, can generate many kinds of output, can afford high performance through the OpenGL integration. \n Few Minuses: it takes learning a new language if you don’t know Java, need to write code even for very simple charts, limited support for advanced user interface components, not conceived for the web. \n Notable Examples: any project from Ben Fry | amazing “serious” bio-applications from Miriah Meyer . \n \n R \n \n If you have never heard of R, you are in trouble. I think there’s no way for a data professional to ignore it today. R is a programming language and environment and it is the de facto standard for anything concerning data crunching; visualization included. R is not a visualization tool, it is much much more. It comes with a standard and comprehensive library of data manipulation and statistical functions, plus a huge set of ever growing libraries available on the web. \n Data visualization can be done by writing very simple statements with the standard graphics library it comes equipped with or with any of the additional libraries people use, like the fantastic ggplot2 . \n Normally people use it through the standard console where you write your statements to process data and generate graphics. While R certainly requires programming skills, technically you don’t necessarily need to write full programs, rather your need to write a few statements in the console. But the difference may become blurred. \n If you are not too inclined to learning a full programming language like Java, going with R could be a good compromise. The big plus of learning R is that with a single tool you are able to cover the full data manipulation and transformation pipeline, which is not true with other tools mentioned here. Plus, knowing R for data manipulation is a terrific skill you would need anyway. \n On the downside, R gives to you less flexibility in generating exactly the visualization you have in mind, if you are thinking of anything too fancy. Also, as far as I know, it is extremely limited if you want to generate custom interactive visualizations. As far as I know R is best to generate static charts out of your data. \n It’s worth noticing that several people use to post-process the charts generated with R with programs like Illustrator to make the whole output a bit prettier (check out Visualize This from Nathan Yau if you want to know more). But don’t worry I have seen people doing incredible things with R and I am sure you can do the same with a bit of practice. \n \n \n Big Pluses: the most established tool for data manipulation in the world, integrated statistical and data manipulation functions, can handle very big data, huge library for additional functions, huge community, good visualization defaults. \n Some Minuses: need to write statements in a console to “draw” visualizations, not as flexible as a general-purpose programming language. \n Notable Examples:   Drew Conway’s vis projects  |  The New York Times Graphics Department \n \n \n D3 \n D3 is the creation of Mike Bostock and Jeff Heer from Stanford. Its primary feature is to permit the creation of complex interactive data visualizations through very compact code that can be delivered through a web browser. It is based on javascript and svg and provides a number of handy functions that make constructing visualizations a lot easier. \n Some of you might be surprised to see such a young technology included in my list of staple visualization tools, but D3 is not as new as you might think. Jeff Heer and Mike Bostock (later) are top-class researchers and they have been developing visualization libraries for a long time, always pushing the technology further ( Prefuse , Flare , Protovis , D3 ). D3 in particular was born on top of the ashes of Protovis, a first attempt to create a visualization library in javascript. \n A data visualization language that permits to design custom visualizations with a few lines of code, at the right level of abstraction yet powerful, with very good performance, and specifically designed to run directly on the web, is something that is going to stay with us for a while and it deserves a lot of consideration. \n D3 already has aficionados everywhere, they just love the technology, and the documentation is pretty amazing. Also, people start showing off examples here and there so learning from others won’t be a problem. \n If you are inclined to web programming, you like javascript (I personally have a strong idiosyncrasy with it), and are familiar with web technologies like css and svg, D3 could be just the right choice for you. I don’t have any experience with it but all my geek visualization friends are super-excited about it and they swear it is the best data visualization technology ever created. \n \n \n Big Pluses: visualizations delivered directly through a web browser, compact code, good community size and excellent documentation. \n Some Minuses: the code is a bit tricky and it requires some getting used to, it is not as diffused as other technologies (but this is going to change soon), it might be discontinued in the future the same way as Protovis was. \n Notable Examples:   Jan Willem Tulp’s Urban Water  |  D3 Examples Page \n \n \n Tableau \n Finally an advanced data visualization tool that non-programmers can use! Let me tell it right away: Tableau is one of the biggest things happened in visualization during the last years and I love it. It permits to load and display data in a number of seconds simply by dragging data fields in the view and pushing a few buttons here and there. \n What is striking about Tableau is that, while it is not as flexible as a programming language, it allows for pretty sophisticated visualization designs. Also, thanks to its powerful interface it is possible to explore a very large number of designs in a snap. \n It takes some times to get used to its internal model and mechanisms, but once you understand how it works it is incredibly fast and powerful. I have been using it for a while and it amazes me how easy it is to go from one view to another; which is especially important in the early stages of a visualization project. \n Sure, the level of customization you can achieve with alternatives based on programming is not reachable with Tableau but you can do pretty sophisticated things and I cannot think of a single better tool if you decide not to write code. \n Other features I love of Tableau are the possibility to export static and interactive dashboards and the ease with which it loads a very large number of data formats. \n There is one huge spot however: Tableau is not free and it’s quite expensive. However, you can still use Tableau Public , which is a somewhat limited version of Tableau, devised to create visualizations that go directly on the web and it’s free. I know a lot of people who are using Tableau only through the public version and they seem to be happy with it. \n \n \n Big pluses: can create visualizations in a snap, very easy to explore many alternative views of the same data, does not require programming, very large user base. \n Some minuses: not as flexible as using a programming language, it’s expensive, takes some time to understand how it works. \n Notable examples:   Tableau Software’s visual gallery  |  Clearly and Simply’s Tableau Posts \n \n \n Excel \n Excel?! Yes Excel. You might be surprised to see it in the list of staple data visualization tools. I took me a long time to decide whether to include it or not. I’ve been consulting with trusted friends and pondered over it for a while and I came to the conclusion it deserves its own spot. \n Why? \n Because Excel is a standard and it’s everywhere. Plus, people have been doing pretty amazing stuff with it. \n If you happen to work in an organization of any kind, chances are Excel is what everyone use and trust (I have seen it everywhere, especially working with my fellow biologists). This means that this is the material you have to work with, whether you like it or not. People are naturally skeptical about changes (and for a good reason!) so they won’t like you introducing a new technology just because you want to spread the data visualization wisdom. \n Plus, Excel is a pretty amazing piece of software, which probably unfairly inherited the overall bad light Microsoft products have. Being able to use Excel to draw effective charts can be a tremendous asset for you; with the advantage of using an almost universal platform. \n The main and biggest problem with Excel is getting rid of the defaults. They are crap, a perfect gallery of junk charts. But, once you lean how to bypass them you are in the realm of affective and advanced charts. You don’t believe me? Give a look to what Jorge Camoes  and  John Peltier are able to do with it. And hey, if you want to learn something about Excel be sure to read their web sites from top to bottom. \n I think the choice of whether to invest on Excel or not is very much dependent on your situation. If you are totally free and independent, it might not be the right choice, but if you expect to work within the constraints of your organization or with clients in the BI area or similar, being able to work in the context of their comfort tool can be a huge advantage. \n \n \n Big pluses: universal platform, everybody understand excel, practically free, easy to go from data to chart, integrated with the spreadsheet functionalities. \n Some minuses: the defaults are crap, harder to go beyond standard charts, slow with big data. \n Notable examples: anything from Excel Charts gurus  Jorge Camoes  and  John Peltier . \n \n \n There is more to come: interviews are on the way! \n I hope the information I provided above will be sufficient to make a well-reasoned decision. In any case there is more material to come: I conducted for each tool at least one interview with a real expert who has a proven track of successful visualizations with the target environment. Stay tuned! I will be posting them in the upcoming weeks. \n This series is meant to help you guys, so whatever doubt or question you have, feel free to ask by writing a comment below or sending a message on twitter or writing me an email directly. And please, if you find this post and the series useful don’t forget to share it with your friends. Thanks! \n Take care, \nEnrico."], "link": "http://fellinlovewithdata.com/guides/data-vis-beginners-toolkit-2", "bloglinks": {}, "links": {"http://reas.com/": 1, "http://www.r-project.org/": 1, "http://vimeo.com/": 1, "http://processing.org/": 1, "http://www.clearlyandsimply.com/": 1, "http://mbostock.github.com/": 4, "http://benfry.com/": 2, "http://www.utah.edu/": 1, "http://bost.ocks.org/": 1, "http://hci.stanford.edu/": 1, "http://fellinlovewithdata.com/": 4, "http://www.tableausoftware.com/": 3, "http://prefuse.org/": 1, "http://flare.prefuse.org/": 1, "http://www.amazon.com/": 1, "http://peltiertech.com/": 2, "http://www.drewconway.com/": 1, "http://flowingdata.com/": 1, "http://www.excelcharts.com/blog": 3, "http://had.co.nz/": 1, "http://processingjs.org/": 1, "http://twitter.com/": 1, "http://www.janwillemtulp.com/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["I kept my promise: the interview with Moritz Stefaner on data visualization freelancing is finally here! And I am really excited. \n As I said in my introductory post , I think data visualization freelancing is one of the most exciting trends in visualization; even though it’s a little bit hidden. After recording the interview, I must say I am really satisfied. I learned something out of it and I am sure the same will be totally true for you. \n The video is a bit long (see the content breakdown below) but it’s really worth it: we covered a very large number of questions and they all came directly from the readers (thanks to all of you guys)! \n Any comment, question, or suggestion for me and Moritz is more than welcome. You can write a comment here below or contact us directly on twitter ( @FILWD , @moritz_stefaner ). Have fun! \n \n Video content breakdown with timing: \n \n [01:00] Starting Out (building a portfolio) \n [08:30] Design Practice (iterative approach, designing 20 prototypes!) \n [16:18] Skill Building and References (books, tools and libraries, doing without programming?) \n [27:47] Dealing with Clients (what clients want vs. what is right, freelancer vs. agency) \n [34:08] Pricing (billable time, tracking yourself, strategic prices, the “pain coefficient”) \n [39:44] Time Management (avoid working 24/7, have kids!, having a rhythm) \n [41:55] The Freelancing Market (gaps in the market) \n [44:05] The Role of Research (searching and reading papers) \n [47:24] Summary of Tips for Wannabe Freelancers \n \n Additional versions of the interview \n \n Download mp3 file to listen on your own player. \n Interview transcription (if you want to read it) – coming soon. \n \n Do you want more? Let us know. \n As you can see in the interview, me and Moritz are thinking of recording additional videos . Who knows … this might even become a regular meeting. We would love to have your opinion on that. Especially we would love to know: what else would you would like to hear? Is there anything we missed? How can we help you further? For sure, we would like to record a new one with a more extensive discussion of design practices and the overall data visualization process. Stay tuned and let us know! \n Notes \n \n  First of all thank you guys for sending all your questions for Moritz! This was very useful and I am sure the interview is much much better than what it would be without your help. \n A big big thank to Moritz. I really enjoyed talking with him (as usual) and I think the end-result is really helpful for people who want to know more about freelancing. \n The quality of the video is not perfect, I apologize. There is so much to learn! My phone started ringing at some point, the line dropped because I forgot to plug the power plug, and there’s no video editing apart from very basic stuff. Nonetheless, I think that content is king and what matters is that you are going to learn something. This is work in progress and it will get better. \n \n As usual, I’d love if you could help me spreading the word. Please retweet the post if you like it and add comments below. There’s more to come. \n Enjoy it and take care, \n Enrico."], "link": "http://fellinlovewithdata.com/interviews/data-visualization-freelancin", "bloglinks": {}, "links": {"http://twitter.com/": 2, "http://fellinlovewithdata.com/": 1, "http://moritz.stefaner.eu/": 1, "http://dl.dropbox.com/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["One of the main goals of this blog, other than challenging the status quo with reflections at the intersection between academics and practitioners, is to help people become data visualization experts. It’s not rare for me to receive emails from people who are enthusuastic about visualization but have little guidance about how to become an expert. \n I have been posting some few articles in the past with this specific goal but I realized that they are too scattered and not organized in a way to represent an organic resource for the readers. \n For this reason, I decided to create a series specifically designed to help those of you guys who are excited about visualization but really don’t know how and where to start. The series is meant to be part of a permanent collection in FILWD and it’s my first serious attempt to react to my own call to action: “ When will we decide to provide lots of value? “. \n Introducing the series \n The Data Visualization Beginner’s Toolkit will function as an orientation guide for poeple who need guidance in finding the right resources to become data visualization experts. In the guide I will not be teaching visualization directly, nothing technical or theoretical about it (I have plans for this later), but I will show you the resources and one path. \n Having such a guide is particularly important today because data visualization is really just like a jungle. There are plenty of opinions, blog posts, research papers, consumerist visualizations , books, etc., and it’s very hard to separate the wheat from the chaff. \n When reading this series please keep in my this is my very personal view and, as such, is limited to my own experience. Also, whatever list I will propose is certainly neither unique nor exhaustive. If you are looking for an exhaustive list of resources I highly recommend you Andy Kirk’s  collection of data visualization resources . \n Here is a tentative list of topics I am planning to cover in the series (subject to changes): \n \n Books and Other Resources \n Programming Languages and Tools \n Sources of Good Examples \n Research Papers \n University Courses \n \n Please if there is anything else you would like to be covered let me know! Send me a message or add a comment below. \n Books about Visualization \n There is a reason why I start the series with a list of books: if you don’t know the basics of data visualization you will always be an amateur. And what’s worse, visualization experts will notice it and will not take your work seriously. \n Also, orienting yourself in the mess we have right now might prove discouraging and prone to errors. If you type “data visualization” in Amazon the result is a disaster, believe me. \n Finally, even if you end up picking up very good books, it is definitely possible they are not the right ones given the amount of knowledge and expertise you currently have. Here I suggest the following path (in order). \n  Show Me the Numbers: Designing Tables and Graphs to Enlighten  ( To acquire solid foundations ). This book teaches the basics of visualization by using only tables and simple charts. You won’t find fancy and colorful visualizations, only scatter plots, bar charts and stuff like that. But that’s the way to go! If you understand the basics then it’s a lot easier to spot the limitations of basic graphs and go beyond them. Plus the book contains the best summary of visual perception applied to visualization I know. It really is a true gem. Don’t make the mistake to be attracted by fancy stuff and skip the basics, start here and you will have very solid foundations. \n  Readings in Information Visualization: Using Vision to Think  (Chapter 1 only) ( To go beyond simple charts ). Once you understand how charts work and you have learned the basics of visual perception, you are ready to explore fancier stuff. Yet you need some guidance on how to explore the huge data visualization space. The first chapter of this book is the best self-contained piece of work I know. It’s able to provide all it’s needed to start thinking more creatively, but in a structured manner, about advanced visualizations. The book also has a strong emphasis on interaction which is important. If you want to go beyond the first chapter fine, but the book itself is a collection of papers and many of them are totally outdated. But wait a moment, this doesn’t means you cannot find useful material there! In the collection you can find fundamental papers that are totally worth a read: the work of Jacques Bertin above all. \n  The Visual Display of Quantitative Information and the rest of Tufte’s books  ( To learn what “graphical excellence” is ). People go crazy with Tufte’s book and I understand why: they are totally beautiful , the cover, the format, the colors, the contet, everything. But regardless their beauty, I have always thought it’s really hard to learn something out of them; they require you to think really deeply about what you see. Basically they are “just” a collection of images. The Visual Display of Quantitative Information is the first one and is the only one I truly recommend because it give more guidance than the others. The others are wonderful but you will have to spend more time on them to translate their content into design practices. \n  Information Visualization: Perception for Design  ( To know what happens in our brain when we see a visualization ). If you have read all the books cited above congratulations! You have learned really a lot. Now, information visualization is deeply rooted in visual perception and cognition. If you want to master the art of visualizization, at some point you will have to know these basics; especially if you aspire at designing innovative visualizations that fit people’s needs . This book starts from the very basics of human vision (e.g., how the eyes work) up to how we think with visualizations. It’s a tough read but it’s totally worth it. You will have to spend quite some time thinking how these theories apply to your specific projects, but believe me, it’s a true investment. I experienced countless situations where a visualization design problem was deeply rooted in one of the issues discussed in this book. You will find yourself referring back to it all the time. \n More Books about Visualization \n Important: Are the books not mentioned above bad or not worth it? Absolutely not. \n It is important to consider two factors: (1) there are several books I have never read or even skimmed through which might provide some additional value to you; (2) there are extremely valuable book I’ve not included just because they are either too advanced or don’t fit the progression of readings I am proposing here. Please keep in mind: I am suggesting you to read these books in the order I gave above. \n A few additional books that come into my mind, which need at least a short mention are: \n \n Any other book written by Stephen Few . \n Any other book written by Edward Tufte . \n The statistics-flavored and super-classic Visualizing Data and The Elements of Graphing Data by William Cleveland. \n The monumental Semiology of Graphics by Jacques Bertin, which I did not include because it is still hard to get despite a new edition came out and because it’s really a hard read for non-experts. \n The extremely beautiful and information rich Visual Language for Designers  by Connie Malamed, which I did not include because I haven’t finished reading it yet. \n The deep and dense How Maps Work by Alan MacEachren, which despite the title teaches visualization and makes you think deeply about it. \n The not known enough and little gem Designing Visual Interfaces  by Kevin Mullet and Darrel Sano, which teaches aesthetics in a functional and systematic manner. \n \n Books NOT about Visualization \n It’s important to acknowledge that not all the knowledge a visualization expert needs comes from data visualization books . I have no intention to write another long list of related disciplines’ books, but it’s important for you to know that a good data visualization expert may have strong foundations in areas such as: statistics and data mining, data management and manipulation, human-computer interaction and cognitive science. \n I don’t want to scare you: you can start doing visualization without these, but little by little you likely will find yourself digging more into these areas. \n Also, let me stress the importance of human-computer interaction and related areas. While the rest is normally acquired, at least on a superficial level, by using various technologies you encounter along the way, human-computer interaction has a less technical flavor and you might not learn anything of it unless you seek it. \n Knowing how people reason and interact with user interfaces is a crucial skill, the real differentiatior, that you’d better acquire if you want to become a pro. I cannot stress this point enough. Visualization, as any other user interface, happens in people’s mind, not in the computer! And if you want to design great ones you’d better learn how people’s mind work. \n There is only one book I feel like suggesting as a starting point: the brilliant, super-practical, and freely-available  Task-Centered User Interface Design . \n Other Learning Resources \n Unfortunately, other than the books I mentioned above, there are not many other sources from which you can really learn something. But luckily there are some few notable exceptions! Tamara Munzner and Jeff Heer , top-researchers in the field, share the material of their courses freely on the web and you should not miss them for any reason: \n 1) Tamara Munzner’s InfoVis Course Slides at University of British Columbia \n 2) Jeff Heer’s InfoVis Course Slides at Stanford University \n These are university courses, with a specific target, but I cannot think of a more carefully and better organized set of information covering the whole theory and practice of information visualization. What is really unique in these courses and their material is the way this information is organized. Information visualization is still a young discipline and nobody really agrees yet on the content and order to use when teaching it. These two courses found in my opinion the perfect balance between coverage and organization. \n Another great source for learning data visualization are Stephen Few’s articles and white papers , which teach a whole lot of fundamental data visualization skills with his usual concise and effective style. \n Can I get all the knowledge I need with these books? No. \n And there are two main reasons. First of all, one of the biggest and surprising gaps I see in the current literature is a book that teaches systematically how to design a visualization from scratch. I am really surprised.  Ben Fry  in his  Visualizing Data  has a few elements of it, but since the book essentially teaches also how to use  Processing  the whole thing is a bit too diluted. Apart from that, I am not aware of any book that fills this gap (please let me know in case you know one). \n A second issue is that there is no book that can really teach you to be a great data visualization designer. The only way to become an expert is to actually design your own stuff and iterate over and over on it  until you perfect your skills . Studying and reflecting is important, but doing is equally, if not more, important. The two things complement and enrich each other. \n Conclusion \n That’s all folks. I really hope this series will be useful to you. Let me know what you think and if it helps. Also, I’d really love if you could enrich it with your suggestions. You can write comments below or send message to me on twitter at  @FILWD . \n Please do not forget to share this with your friends or people who might benefit from it. Its main purpose is to let you guys become better data visualization experts. Help me to spread the word around. \n — \n Take care, have fun, \nEnrico. \n &amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;img src=”http://www.assoc-amazon.com/s/noscript?tag=ebertininet-20″ alt=”\" /&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;br /&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;"], "link": "http://fellinlovewithdata.com/guides/data-vis-beginners-toolkit-1", "bloglinks": {}, "links": {"http://hci.stanford.edu/": 1, "http://fellinlovewithdata.com/": 2, "http://benfry.com/": 1, "https://graphics.stanford.edu/": 1, "http://amzn.to/": 12, "http://twitter.com/": 1, "http://www.amazon.com/": 5, "http://www.visualisingdata.com/": 1, "http://www.ubc.ca/": 3, "http://bit.ly/": 1, "http://processing.org/": 1, "http://www.perceptualedge.com/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["One of the most exciting and silent phenomenon I have seen developing during the last years/months in data visualization is the growing number of people who are transitioning or already succeeded to make a living by being a data visualization freelancer. \n Who is a data visualization freelancer? Basically a self-employed person who sells data visualization services to companies and institutions. What kind of services? I don’t know … the sky is the limits. \n There are people like Jan Willem Tulp , who designs pleasurable and accurate visualizations and is just turning into a full-time information visualizer. There is Andy Kirk, who writes the notable blog visualisingdata.com  and  teaches visualization in 1-day workshops . There is of course a veteran like  Stephen Few who consults big BI companies like Tableau Software and writes among the best books in the field. And people like David McCandless who designs insanely popular (and discussed ) beautiful visualizations. \n Finally, there is Moritz Stefaner who works from home and seems to have the pretty rare ability to conjugate aesthetics with function and make everyone happy ; as with the lately acclaimed OECD Better Life Index . \n The brief story of me and Moritz at the airport. \n And it’s exactly by discussing with Moritz that I came up with the idea of digging deeper into this fantastic world. The thing went more or less like that: I met Moritz at the airport, when we were both invited for a panel at Visualizing Europe , and during a casual chat he told me something along these lines: “ You know Enrico … academia and research are cool but at some point I wanted to make real stuff for real people “. Yeah sure I understand. “ … I always had small consultancy jobs during my studies so I had some experience … at some point I decided to become a data visualization freelancer “. Cool! “ … so you know what? I work from home, I can plan the time myself  and make sure I play with my kids and talk with my wife ” Uh!? “ … and of course I am being successful and I am invited here and there so I am travelling a bit around the world and meeting interesting people “. \n Ok, are you salivating already or what? I must admit it, despite I really love my academic job, I felt a bit jealous. \n Send your questions! I will interview Moritz next week. \n Ok so … I will be interviewing Moritz next week about data visualization freelancing. I started collecting a number of questions for him but I need your help! What would you like to ask to Moritz? What are you curious about? Is there a nasty question no one has the courage to ask? I think it would be much much better if you guys tell me what *you* want to know. So, don’t miss this opportunity. You could realize that being a data visualization freelancer is not a dream. It’s definitely possible! And Moritz can tell you how or at least provide some indications. \n (On a side note, I will be experimenting with skype-based video interviews for the first time. I am totally excited by this new format and I’d love to have your feedback once it is done. The only video I currently host here is my interview with JD Fekete on Jacques Bertin , but the quality is really bad. I did some initial tests and the results look amazing. I really hope you will like it.) \n Few additional reflections. \n 1st – Freelancing and working from home is not exclusive to data visualization, it is part of a bigger trend and it’s in my opinion absolutely awesome. The web is full of bloggers and small entrepreneurs that make a living by writing their blogs and giving their services by working from home. If you want to know more give a read to the super-successful 4-hour workweek . Note: some people love it and some people absolutely detest it, but no one can deny it captures a strong trend in our society. You can decide to ignore it or to read it and take the risk to have your life changed. You decide. \n 2nd – Being a professor used to be one of the best jobs in the world for the amount of freedom professors have (and still has a large degree of benefits in my opinion) but being a freelancer and working from home is a good competitor. Academia has its glow of knowledge and a little bit of mystery on its side but this whole segmentation of professions is going to disappear anyway. I see academia and freelancing somewhat similar as they both feature really special amounts of freedom. Academia maybe gives more opportunities to really do whatever comes to your mind but freelancing, as far as I can understand, has a considerable reduction in the amount of bureaucracy you have to bear with. \n 3rd – Most importantly, I believe freelancing is just a perfect fit for data visualization. I am not a big fan of generalist visualization because I think people get the best out of it when it meets the specific needs of a project. And this happens when you have a competent person able to listen, understand, and offer a tailored solution. For this reason I am a strong proponent of data visualization freelancing. It pisses me off that nobody is talking about it because it’s really a great trend. Plus, the more competent visualization designers we will have around, the more we will be able to show people great examples to take inspiration from. \n Again: send  your questions! \n Ok, let me repeat it again. I will be interviewing Moritz some time next week. This means the interview will appear here no sooner than about 10 days. I will be able to take your questions into account only if they come during the next few days. Don’t miss this opportunity, send your questions or ideas to me and Moritz. The easiest way is to add a comment here below. Otherwise you can contact us on twitter @FILWD and @moritz_stefaner or send me a private message . \n Take care, have fun. We are waiting for your input!"], "link": "http://fellinlovewithdata.com/guides/ever-dreamed-of-becoming-a-data-visualization-freelancer-ask-to-moritz-how", "bloglinks": {}, "links": {"http://www.perceptualedge.com/blog": 2, "http://moritz.stefaner.eu/": 1, "http://www.visualizing.org/": 1, "http://www.oecdbetterlifeindex.org/": 1, "http://fellinlovewithdata.com/": 2, "http://www.fourhourworkweek.com/": 1, "http://www.davidmccandless.com/": 1, "http://twitter.com/": 2, "http://www.visualisingdata.com/": 2, "http://www.janwillemtulp.com/": 1, "http://www.perceptualedge.com/": 1}, "blogtitle": "Fell in Love with Data"}, {"content": ["A few days after my post on indispensable visualization I received an email from Prof. Georges Grinstein (what an honor! he is one of the fathers of visualization) asking for explanations about my use of the word “visualization consumerism”. I defined visualization consumerism as visualizations found on the web, used solely for communication purposes: mostly static, with little interaction and digested information. \n Georges rapped a bit over my knuckles, and I understand why: ” The largest applications involves mapping. Can you drive without some form of a map? Yes, but even GPS dependent individuals look at the images most often. That’s great consumerism. ” \n Sure I see the point. I was a little too hasty in defining the whole set of visualization for communication “visualization consumerism” and I am ready to amend and apologize. But  ”visualization consumerism” does exist and in this post I intend to explain what I mean. \n Defining visualization consumerism \n I define visualization consumerism the careless production and shallow consumption of visualization . Consumerist visualizations are pre-digested depictions of data with the only effect of generating an “how cool!” effect. They do not inform, they do not let you think. They do not even pretend you to spend some time thinking. At best they entertain, but only for a few seconds: the time to click, give a look, say “cool”, and leave. \n Visualization consumerism is an interplay between the consumer and the producer. It’s an attitude. It’s a feedback loop between the two, like consumerism in general. Eventually, you don’t know whether companies produce crappy products because consumers want them or the other way around. \n Consumerist designers don’t spend too much time thinking or simply lack the knowledge, culture and attitude necessary to build “sophisticated” artifacts. \n Consumerist consumers are people surfing the web, maybe with a slight interest in visual things, who stumble across a visualization and just say “cool!”. Again, they lack the knowledge, culture and attitude necessary to appreciate good design and to distinguish it from crap. \n The origin of visualization consumerism \n Am I a dogmatist, fanatic, orthodox, conservative visualization theorist? No, because I don’t blame anyone for visualization consumerism . I just think we have to recognize it and act in a way to let a larger portion of our society be able to make beautiful stuff and appreciate it. \n Visualization consumerism is not different from many other effects we observe today, especially in the way we consume information on the web. Reading full articles has become a luxury, we just skim over everything, and of course we do the same with visualization. Finding good articles has become a luxury (by the way, this is why I strive to write long quality articles instead of a kaleidoscope) and again visualization is no exception. \n Who’s to blame for that then? No one. Really, I firmly believe the large majority of people are honest and well-intentioned . It’s only the system we live in that produces these effects. And by the way I have no intention to write a long rant against modern society because I totally love the 21st century. \n It’s also not my intention to point my finger to this and that designer so that I can generate a lot of voracious comments between two gangs: the purists and the creatives. I am personally annoyed by Stephen Few’s crusade against David McCandless , I think it’s detrimental, narrow-minded and, more importantly, disrespectful. \n What is to be done? \n Said that, what can be done? Should we just accept it and passively complaint about how mistreated “pure” visualization is? No. I think we have to acknowledge the problem and do our best to educate people. But wait a moment …. educating people is a dangerous idea! I agree. But let me explain what I mean. When I say educating people I mean doing it bottom-up; by giving the right examples and striving for creating a thriving environment: \n \n Providing people with excellent study material \n Showing people sophisticated and enlightening visualizations \n Providing people with professional (and gentle) criticism \n Showing our  radical passion for excellence \n \n I know. It’s tough. But that’s the deal guys if we want to do something. I know very well from my own experience how many moments in life lead us to produce and diffuse sub-optimal stuff. I don’t deceive myself with impractical ideals, and I am not ingenuous, but I am convinced we have to lean towards doing great stuff. Always. And this makes a difference in the long run, I am sure. \n Is visualization for  presentation consumerism? \n Going back to the initial question and Geoges’ email, a clarification is due. No, I don’t think using visualization for communication purposes is consumerism. My initial reaction is due to the fact that I see a disproportion between the use of visualization as an exploratory tool versus a presentation tool . Up to the point that people might get an impression that communication is the only purpose of visualization. This is what Georges had to say: \n “ Visualization really fits into 3 classes which are exploratory, confirmatory, and presentation (see data vis book). Now exploratory visualization is only as good as the tool AND the analyst. A great analyst will be able to use visualization to generate many hypotheses. Once these are there then the next step of course is confirmatory and most often stats is the only too used. However combining stats and visualization provides a more grounded explanation of the variations in the numbers, more context, more connection with other hypothesis. Finally the presentation is what I would call your consumerism and we’ve not had many tools to make that fluid (from the exploration onto the presentation). “ \n Totally agree. What is missing is the connection between communication and exploration. \n “ We all encounter daily, daily, presentation visualizations. Most encounter confirmatory ones rarely as that’s the realm of researchers and statisticians. Very few encounter exploratory ones. But most often the presentation ones are the result of a great deal of exploration. “ \n So true! I’ve heard so many visualization designers talking about the painful exploratory process needed to produce a visualization for communication. And I can testify myself that this is always the case. \n But again, what kind of impression do we want to give to people? Do we want to send the message that the main purpose of visualization is communication? Do we want people to only consume visualizations made by others? Or do we rather want to empower people with powerful “ tools for thoughts “?  I still believe we have to help people discover how visualization can be an indispensable tool for them. I want to realize the big vision of augmenting the human intellect not to making it flatter. \n Is visualization for the masses consumerism? \n In his email Goerges mentions “visualization for the masses” as one of the main challenges for visualization. It’s a buzzword that started circulating a few years ago when ManyEyes was launched and, as far as I understand, it means giving people easy access to visualization and enabling collaboration through visualization. \n I must confess “visualization for the masses” does not make my heart beat faster (I am sorry Georges). I think the word “masses” is really unfortunate and resonates too well with consumerism. Who are these masses? Do we really want to give visualization to the masses? No. I personally want to give visualization to Paul, Cindy, Frank, and Anne … people with a real face and a specific need. I think it’s very dangerous to think of a generic audience in need of visualization, because there’s nothing like visualization for everyone. \n My opinion is supported by the large failures we have seen in developing general purpose visualization services on the web like ManyEyes and Swivel . Even big and successful product like Spotfire and Tableau, which seem to provide general purpose solutions, started with a very clear target population in mind. The way I see visualization used most successfully is when it is designed and targeted to a specific population (often a small one) not for a general audience. Even less for the masses! \n But if visualization for the masses means trying to push for the diffusion of tools that can support the full data visualization process and allow some people learn to use visualization and not only  consume it, that’s definitely great! I am not against it. But I just won’t call it “for the masses”!"], "link": "http://fellinlovewithdata.com/reflections/visualization-consumerism", "bloglinks": {}, "links": {"http://eagereyes.org/": 1, "http://www-958.ibm.com/": 2, "http://fellinlovewithdata.com/": 2, "http://www.uml.edu/": 1, "http://bit.ly/": 3}, "blogtitle": "Fell in Love with Data"}, {"content": ["( This blog post is the result of a talk a gave a few days ago at Visualizing Europe. You can give a look to the program , you can give a look to  my slides directly, or you can see a preview of the pictures taken during the event. Also, this is a quite long post, I am sorry. But I really needed this space to turn my slides into a blog post. If you don’t have time to read it now keep it for later . ) \n Background \n I just came back from Visualizing Europe , a great event organized by Visualizing.org in Brussels to gather several key data visualization actors in the European scene and discuss the state of the art and potential future of visualization. \n I had the honor to be invited in the panel session organized by Andrew Vande Moere to discuss the power and potential of visualization together with a bunch or great data visualization designers like Santiago Ortiz , Moritz Stefaner and David McCandless . \n To tell you the truth I felt a bit like being the black sheep; but not with a bad feeling! I was the only one in the panel with a core CS visualization research background and the audience too was not to “researchy” as the usual audience I am used to talk to. What a wonderful occasion I thought! \n So, when I got the invitation I started thinking about a talk that could send a strong message and stick into people’s mind. And suddenly I recalled I blog post I wanted to write since a long time about the questioned usefulness of information visualization; a complex that afflicts many of us. \n I was originally inspired by a message I received from Jorge Camoes ( ExcelCharts ) in which he pointed me to a couple of interesting blog posts on visualization usefulness. \n The first one is from Jorge and is titled: “ Is Data Visualization Useful? You’ll Have to Prove It “. In this post he argues that believing that data visualization is useful is an act of faith and that we have no scientific evidence of its usefulness. Along similar lines the second post is from Stephen Few who in his blog post “ True Stories about the Benefits of Data Visualization ” confesses he has a hard time convincing people of visualization’s usefulness. \n After reflecting a little bit about their content and their frustration I recognized the same frustration in me and decided it was time to react. And my reaction, I decided, had to be a strong one. I realized in fact that the whole problem of visualization usefulness can be removed if we change our mindset. I realized that one of the reason why we ask ourselves whether visualization is useful or not is because we don’t have a clear focus on those problems in which visualization is not just useful, but plainly indispensable . \n In the rest of the post I’ll try to articulate this idea further, with the hope I will convince you it is important to change our mindset and focus more on problems where the net gain of introducing visualization is extremely high. But let me start by providing a few examples of problems I have personally experienced where I think visualization is clearly indispensable. \n Examples of indispensable visualizations \n In the following I provide three example of indispensable visualizations. I hope this will convince you that when visualization is indispensable it is evident. \n Example #1: Bart and his moving animals \n Bart is a biologist and he studies animals. More precisely he wants to understand how animals move and how contextual factors influence their behavior. Think birds migrating from one place to another exploiting the right wind at the right moment or lions searching for a prey and trying to optimize their energy expenditure. \n Problem is that animal movement analysis today is a very technological endeavor. Animals have GPS and other sensors attached and can be tracked continuously around the world and generate enormous amounts of data. Plus, this data can be enhanced with contextual factors like weather conditions, making the whole thing more difficult. How do you deal with that? Can you do it without visualization? The problem is that not only they want to test some hypotheses and assumptions they have, but they also want to be able to come up with new ideas. \n My colleague and dear friend Florian Mansmann (together with his valuable students) helps Bart and his colleagues understanding how these animals move, and developed a nice tool to visualize traces in time and to correlate them with contextual factors. \n  \n Again my question is: do you think it is possible to do that without visualization? I think this is another case of indispensable visualization. \n Example #2: Joachim and his hidden molecules \n Joachim is a chemist at the University of Konstanz, where I work, and his job is to study small molecules that inhibit a fundamental process in cellular division called “cytokinesis”. I am not going to give any biology lesson here, I am totally inadequate, but it suffices to know that  Joachim studies this stuff because it has implications on understanding cancer. Yes, cancer. Serious stuff. \n Problem is that modern biology is done with computational tools and robots and he has to deal with tens of thousands of chemical reactions at once. He uses a technology called High-Throughput Screening by which a biological target can be tested with thousands of molecules in parallel in a matter of few hours. Isn’t it crazy? \n But these data must be analyzed then and again there are no clear-cut preconceived hypotheses. Joachim has to delve through long excel spreadsheets and make sense of them. How primitive is this? And how indispensable is visualization here? \n So we developed a simple tool to let him explore the association between the activity level of these molecules (how much they react to the given target) and their molecular structure. Nothing too complicated from the visualization point of view: a very interactive and flexible scatter plot with well-designed mappings. \n  \n When I showed the capabilities of visualization to him he was blown away, he couldn’t believe this was possible. Won’t you call this indispensable? \n Example #3: Security officers keeping us safe \n Even if we don’t notice it in our daily life, there are a number of people around us whose job is to monitor our infrastructures to keep us safe and to ensure that we have a steady delivery of fundamental services. We just started a new project here at the University of Konstanz to develop visual analytics tools to help this people monitor big amounts of information in real-time. These are for instance the guys who monitor the power grid infrastructure, a monster with millions of nodes spitting data 24hrs a day, and ensure that you can always recharge your PCs, switch your TV on, or heat up your food with your microwave. These guys do their job in control rooms like those depicted in this picture. \n  \n Of course, this data monster is by no means tractable by visualization alone, data analysis and reduction algorithm, as well as complex simulations are needed, but do you think it is possible to do without visualization here? Do you have the feeling it is conceivable to make sense of what is going on there without visualization? I don’t think so. \n But that’s a handful of highly skilled people! \n A common objection I get when I explain this theory is something along these lines: “ok Enrico this is true, but how many people are in the condition of desperately needing interactive visualization up to the point it is indispensable? The people you describe here are a few very skilled knowledge workers which represent a tiny proportion of the overall population! Visualization has the power to affect a much much larger group” \n  \n I agree. It’s actually true that these are a few skilled workers if we reason in terms of proportions. Nonetheless, we have to realize two things: \n \n The “tiny” proportion is millions of people. It’s not small! Jerome Cukier from OECD approached me after my talk and suggested: “You know what? I think you underestimated these numbers. There are 500 millions Excel users around the world!” Good point. \n The “tiny” proportion are those who work to make our life better. There is a whole army of skilled professionals who study to:\n \n find solutions to cure our diseases \n find solutions to reduce poverty \n find solutions to make our planet cleaner and safer \n find solutions to provide innovative and pleasurable products \n find solutions to keep our cities safe \n … add another thousand rows \n \n \n \n Shouldn’t we spend some time to help these people? I think we certainly have to. If we have the tools with the potential to expand their mind and do great things we have the responsibility to do it! \n Visualization use and the cartography cube \n Finally, I think it’s necessary to reflect on how we are using visualization today, how we could use it in the future, and how this is related to indispensable visualization. \n Fortunately, while thinking about the idea for this talk I stumbled upon a very useful diagram of visualization use. I found it in Alan MacEachren’s “ How Maps Work ” (by the way, this book is blowing my mind, it’s not at all only about maps and if you are very serious about visualization you should read it). \n  \n The model describes visualization use according to three main dimensions: \n 1) Private vs. Public: Is the visualization targeted to one person or a restricted group of people to solve a specific problem or it is more intended to address public audience? \n 2) Static vs. Interactive: Is the visualization a static representation or an interactive tool that people can use to explore alternative views? \n 3) Revealing Knowns vs. Revealing Unknowns: Is the goal to communicate a number of findings or messages to an audience or to provide people ways to explore the data and make sense of it? \n My feeling is that visualization today, especially if seen under the lens of what the web and similar media offer to the average reader, is largely used as a communication tool, that is we are at the upper corned of the cube: largely public, mostly static or with little interaction, and mostly to reveal information that has been digested by someone else . \n  \n I call this use of visualization “visualization consumerism” (I hope nobody is offended by this name, it’s not my intent), that is, the visualization is prepackaged by someone in a format that can be easily and quickly digested by a large number of people. To be clear, I am not against it, as long as it is done well. Visualization Europe was full of fantastic designers and I love their work. But I think we should do more. Visualization is not only something to consume, we need to look at it in a different way. \n What I propose is that we take more care of the knowledge workers I mentioned above and provide them with the indispensable tools they need. I call this: cognitive cyborgs . I think we have the great chance here to help people become cognitive cyborgs. Visualization, as I explained in an older post, has the power to make us more intelligent and we should strive to do that. \n And looking at the cube I think we have to shift our attention to the opposite corner of the cube if we want to help people become cognitive cyborgs. \n  \n We have to build visualization for private use, highly interactive, to allow easy exploration and focus on revealing unknown, that is, help people generate new knowledge. \n Conclusion \n I will be totally candid with your here. It’s evidently a bold statement to claim that visualization is not useful but indispensable. To some extent it is provocative on purpose. And it is also dangerous to claim that visualization is indispensable, because some problems might benefit from it but still be solved without it. But I really think it is important to change our mindset and focus more on the impact we might have. \n I confess I believe it’s not a totally black and white here, there are several shades of gray in between. But I see a huge opportunity cost here: the more we spend our energies on communication issues, the less we can spend on putting these tools directly in the hands of the people who need them. I see an army of incredibly skilled visualization designers that could do a lot more if only they had the opportunity to work on projects where visualization is really indispensable . \n The problem is that this opportunity is not easily visible because many of the people we could empower with our tools don’t know it! That’s the real challenge. \n I know, this is a very personal point of view and I am ready to accept some criticism, but that’s it. That’s the way I think and I would love to hear your opinion if you do not agree with me. \n I personally don’t want to see visualization trivialized to a mere communication tool of digested data . I want to see cognitive cyborgs all over the place. They are everywhere guys! They are waiting for us but we have to chase them. Let’s make this happen, there are several opportunities at stakes here! Good luck."], "link": "http://fellinlovewithdata.com/reflections/indispensable-visualization", "bloglinks": {}, "links": {"http://www.perceptualedge.com/blog": 2, "http://moritz.stefaner.eu/": 1, "http://www.uni-konstanz.de/": 1, "http://amzn.to/": 1, "http://www.excelcharts.com/blog": 2, "http://fellinlovewithdata.com/": 7, "http://slidesha.re/": 1, "http://de.wikipedia.org/": 1, "http://www.davidmccandless.com/": 1, "http://moebio.com/": 1, "http://www.visualizing.org/": 2, "http://bit.ly/": 3, "http://www.jeromecukier.net/": 1}, "blogtitle": "Fell in Love with Data"}]