[{"blogurl": "http://flowingdata.com/\n", "blogroll": [], "title": "FlowingData"}, {"content": ["Political analyst and statistician Nate Silver has gotten some flack lately for consistently projecting a 70-plus percent chance of a Barack Obama win this election. But as Jeff Leek explains, the criticism doesn't spawn from Silver being wrong. Rather, it comes from the critics' misunderstanding of statistics. Leek provides a quick lesson on how Silver makes his predications and how the methods apply to other things, like the weather. \n Now, this might seem like a goofy way to come up with a \"percent chance\" with simulated elections and all. But it turns out it is actually a pretty important thing to know and relevant to those of us on the East Coast right now. It turns out weather forecasts (and projected hurricane paths) are based on the same sort of thing — simulated versions of the weather are run and the \"percent chance of rain\" is the fraction of times it rains in a particular place. \n So Romney may still win and Obama may lose — and Silver may still get a lot of it right. But regardless, the approach taken by Silver is not based on politics, it is based on statistics. \n Don't fear the black box."], "link": "http://flowingdata.com/2012/10/31/a-quick-lesson-on-making-predictions/", "bloglinks": {}, "links": {"http://www.politico.com/blog": 1, "http://simplystatistics.org/": 1}, "blogtitle": "FlowingData"}, {"content": ["The New York Times provides a detailed look at the Sandy aftermath , across states and locally. With millions of people losing power in a short amount of time, the outages map and chart is the most dramatic. \n More than six million customers lost power Monday as Hurricane Sandy felled trees, downed power lines and flooded substations. The storm led to power failures in at least 17 states, including more than a million customers in Pennsylvania and New Jersey and about 660,000 in New York City."], "link": "http://flowingdata.com/2012/10/30/sandy-aftermath-power-outages-and-flooding/", "bloglinks": {}, "links": {"http://www.nytimes.com/": 1}, "blogtitle": "FlowingData"}, {"content": ["Electionary , the new iPad app from TargetPoint Consulting, lets you browse national election data, from 1976 through 2008. \n Electionary is an election resource center that grants users access to over 30 years of county, state, and national election data. Electionary transforms election results into an easy to understand, interactive, and visual format. Users are able to see detailed election results and voter turnout percentages from across the country. Users can compare election results side-by-side and see how one county or state has changed over time or see how two counties or states are different. \n There were a few spots interaction-wise when it didn't do what I was expecting, such as pinch or double tap to zoom, or when I switched years, the map would re-center on the selected state or county instead of staying where I had panned. But if you're interested in historical elections data, Electionary ain't bad, and I can only imagine there'll be un update after elections night."], "link": "http://flowingdata.com/2012/10/30/browse-elections-data-back-to-1976-with-electionary-app/", "bloglinks": {}, "links": {"https://itunes.apple.com/": 1}, "blogtitle": "FlowingData"}, {"content": ["The New York Times has an updated version of their hurricane tracker up with map, satellite, and radar views. Stay safe, east coasters. \n See also the live wind map by Martin Wattenberg and Fernanda Viegas, which has proven useful a couple of times this year."], "link": "http://flowingdata.com/2012/10/29/hurricane-tracker-for-sandy/", "bloglinks": {}, "links": {"http://hint.fm/": 1, "http://www.nytimes.com/": 1}, "blogtitle": "FlowingData"}, {"content": ["Some days you take a whiff it's easy: \"Yep. Definitely had asparagus last night.\" Other times though, it's not so clear. This urine wheel by Ullrich Pinder from 1506 , provides possible diagnoses based on color, smell, and taste. [via kottke ]"], "link": "http://flowingdata.com/2012/10/29/urine-wheel-to-diagnose-disease/", "bloglinks": {}, "links": {"http://www.nature.com/": 1, "http://kottke.org/": 1}, "blogtitle": "FlowingData"}, {"content": ["By designer Stephen Wildish , a taxonomy of arse. No comment necessary."], "link": "http://flowingdata.com/2012/10/26/a-taxonomy-of-arse/", "bloglinks": {}, "links": {"http://stephenwildish.tumblr.com/": 1}, "blogtitle": "FlowingData"}, {"content": ["In the Atlas of Design , published by the North American Cartographic Information Society, Timothy Wallace and Daniel Huffman argue for beautiful maps that are a joy to examine. \n Design and aesthetics matter, because form is not secondary to function; form is integral to function. A map cannot function if it remains unread. To truly engage map users requires that we present them with something worth looking at. Something that they will want to spend time studying. Something that acknowledges the human need for beauty. Something that causes the user to think about the map in terms beyond whether or not it simply \"works.\" \n Yep."], "link": "http://flowingdata.com/2012/10/25/insisting-on-beautiful-maps/", "bloglinks": {}, "links": {"http://atlasofdesign.org/": 1}, "blogtitle": "FlowingData"}, {"content": ["Driven by his love for Lord of the Rings, Emil Johansson explores the many facets of the world in charts and graphs . For example, the above chart is the declining lifespan of man . \n It is explicitly stated by Tolkien that the longevity of Men once granted to the Númenóreans decreased over the years. In Letter 156 Tolkien writes that \"a good Númenórean died of free will when he felt it be the time to do so\". With the Shadow and the Downfall of Númenor this grace was taken away from them and they died involuntarily with a decreasing lifespan. \n The decreasing life span is seen clearly in the graph. The most dramatic change is shortly before the Downfall of Númenor. The rulers are shown in order. Their number should not be confused with how many generations from Elros Aragorn is since there were more than one line of rulers. \n There's also a geographic map of where characters traveled, a family tree, a timeline, and even an Android app. I think Johansson might be a superfan. A hunch."], "link": "http://flowingdata.com/2012/10/24/lord-of-the-rings-visualized/", "bloglinks": {}, "links": {"http://lotrproject.com/": 2}, "blogtitle": "FlowingData"}, {"content": ["USA Today launched a redesigned logo last month. It's a circle that reflects the day's news in each section. Stephen Colbert reports. \n \n [via @ albertocairo ]"], "link": "http://flowingdata.com/2012/10/23/stephen-colbert-on-the-usa-today-infographic-logo/", "bloglinks": {}, "links": {"http://twitter.com/": 1}, "blogtitle": "FlowingData"}, {"content": ["The Los Angeles Times released nearly 5,000 records of allegations from the Boy Scouts of America as a browseable map and searchable list. You can also download the data. \n This data­base con­tains in­form­a­tion on about 5,000 men and a hand­ful of wo­men who were ex­pelled from the Boy Scouts of Amer­ica between 1947 and Janu­ary 2005 on sus­pi­cion of sexu­al ab­use. The dots on the map in­dic­ate the loc­a­tion of troops con­nec­ted in some way to the ac­cused. The timeline be­low shows the volume of cases opened by year; however, an un­known num­ber of files were purged by the Scouts pri­or to the early 1990s \n The interactive map helps you narrow down by city, but it's kind of hard to see cases on a country-wide perspective. Here's a quick look. \n  \n The worst part is that a lot of the cases went unreported."], "link": "http://flowingdata.com/2012/10/22/data-on-decades-of-boy-scout-expulsions-released/", "bloglinks": {}, "links": {"http://spreadsheets.latimes.com/": 1, "http://flowingdata.com/": 1}, "blogtitle": "FlowingData"}]