[{"blogurl": "http://blogs.williams.edu/Morgan\n", "blogroll": [], "title": "Frank Morgan"}, {"content": ["“ Analysis and Geometry in Metric Spaces ” is one of a number of new open access journals to be funded by author fees, such as the Gowers-Tao Forum of Mathematics . The idea is that long-term it will be much cheaper for institutions to pay author fees than subscription fees, but the transition will be difficult, since while the major journals are on the old model, institutions cannot drop their subscriptions and may not pay author fees, and authors would rather publish for free in established journals. \n “Analysis and Geometry in Metric Spaces” provides a journal for an important and rapidly growing modern area of mathematics and to its credit it does it on this new open access model of the future. I wish my good friend and the editor Manuel Ritoré  of the extraordinary Department of Geometry and Topology  at the University of Granada every success."], "link": "http://sites.williams.edu/Morgan/2012/09/03/new-journal-analysis-and-geometry-in-metric-spaces/", "bloglinks": {}, "links": {"http://www.versita.com/": 2, "http://en.wikipedia.org/": 1, "http://www.ugr.es/": 2, "http://terrytao.wordpress.com/": 1}, "blogtitle": "Frank Morgan"}, {"content": ["This morning I found the Sara Tenney loop to complete my favorite RRR Brooks Trail. The trail heads right off Bee Hill Road, just past a bridge, about a block above where it forks right off Routes 2/7 South out of Williamstown. \n .     \n You follow a stream for a while: \n   \n It’s in pretty good shape, though there are some trees down: \n  \n Then you head up into the pines: \n  \n And finally emerge into a meadow: \n   \n From where you can hear and barely see Route 2 to the left: \n  \n Continuing on into the forest, you come onto a dirt road with Route 2 a block to the left and the RRR Brooks Trail you just took marked as well: \n  \n \n Instead you go right and follow the trail out of the forest, into a pasture, and up a hill: \n  \n Although poorly marked, this is the Sara Tenney trail, which descends into the pines to a signed intersection: \n      \n You continue towards Flora Glen to the bottom of the Sara Tenney Trail on RRR Brooks, close to where you started: \n  \n The whole loop is about four miles and takes under two hours. I did it in an hour and a quarter, but I move pretty fast and don’t take water or rest stops."], "link": "http://sites.williams.edu/Morgan/2012/07/22/my-favorite-rrr-brooks-trail/", "bloglinks": {}, "links": {"http://sites.williams.edu/": 15}, "blogtitle": "Frank Morgan"}, {"content": ["I just spent four enjoyable days at the ACBL Bridge Nationals in Philadelphia , playing with five pick-up partners from the partnership desk and one old friend. The most memorable hand for me involved a squeeze play for a small slam in Notrump. I was North. When the dummy came down, it looked like the contract depended on the Club finesse, but East was looking suspicious. I asked myself if there was any way to make it if East had the Club King, and I realized he could be squeezed. To keep that option open and rectify the count, I let the Spade King take the trick. He puzzled over the continuation, convincing me he had the Club King. When he finally led a red card, I ran the nine red winners, ending with Spade A and Clubs Q 3 in dummy and Spades J 8 and Club A in hand. On the ninth trick, East, holding Spades Q 10 and Clubs K 6 agonized over the discard as hoped. I turned to him and mumbled quietly, it doesn’t matter. When he finally discarded the Club 6, I came to the Club A in hand and watched him play his Club King under my Ace, leaving the dummy’s Spade A and Club Q good for the last two tricks. Of course if he had discarded the Spade 10, I would have played the Spade Ace dropping his Q, leaving the Club A and Spade J in my hand good. What he should have done was discard the Club 6 2 early on, leaving some doubt when he could have discarded the Spade 10 at the end, keeping the Spade 6 with his Q. \n It could have been easier. At other tables East bid, pegging him for all the missing cards. And of course if he doesn’t lead the Spade, it is easy to set up a Club trick even if the finesse loses. At one table East discarded so poorly (all his Clubs) that North made 7 without any squeeze."], "link": "http://sites.williams.edu/Morgan/2012/07/17/bridge-at-philadelphia-nationals/", "bloglinks": {}, "links": {"http://www.acbl.org/": 1, "http://sites.williams.edu/": 1}, "blogtitle": "Frank Morgan"}, {"content": ["Steve Zottoli and I, in attempting to model biological cells, came up with the following theorem on the shape of planar double cells in which the tension of an interface is a strictly convex function of the linear density. One could conjecture a similar result in 3D. \n  Theorem . For a double planar cell of prescribed areas A1, A2, consisting of three interfaces of prescribed mass meeting at two points, the configuration of least energy, computed for each interface as the integral of the tension with respect to arclength, is given by three circular arcs of constant density, as in Figure 1. The angles at which they meet are determined by tension equilibrium and their curvatures k i and tensions t i satisfy \n                     k 1 t 1 = k 2 t 2 + k 3 t 3 . \n This is the same as the energy minimizing cluster for two immiscible fluids inside a third. \n  \n Figure 1. An energy-minimizing double cell consists of three circular arcs in equilibrium. Figure from Slobozhanin and Alexander . \n Remark . Even if the enclosed masses instead of areas are prescribed, the minimizer will still be minimizing for whatever areas it has and will hence have the stated form. If total mass rather than the mass of each interface is prescribed, then each interface will have the same density and tension and the double cell will be the same as the energy minimizing soap bubble cluster, with angles of 120 degrees. \n Proof . A minimizer has constant density on each interface (because on any fixed curve of prescribed mass, constant density uniquely minimizes energy, because tension is a strictly convex function of density). Circular arcs are best. A fortiori , the minimizer minimizes weighted length, with a different weighting constant for each interface, which is the immiscible fluids problem. \n Remark . The immiscible fluids problem can be posed in great generality in geometric measure theory [M1, Chapter 16], allowing very general, disconnected regions. That the minimizer still takes the above form can be proved by the same simple argument that Hutchings [M2] provided for the case when all weightings are equal, the “double soap bubble problem,” as was pointed out by Cotton and Freeman [CF, §2.1]. \n [CF]  Andrew Cotton and David Freeman, The double bubble problem in spherical and hyperbolic space, Intern. J. Math. Math. Sci. 32 (2002) 641-699. \n [M1]  Frank Morgan, Geometric Measure Theory: a Beginner’s Guide , Academic Press, third edition, 2000. \n [M2]  Frank Morgan, Proof of the double bubble conjecture, Amer. Math. Monthly 108 (March 2001) 193-205."], "link": "http://sites.williams.edu/Morgan/2012/06/22/energy-minimizing-double-cells/", "bloglinks": {}, "links": {"http://biology.williams.edu/": 1, "http://store.elsevier.com/": 1, "http://www.sciencedirect.com/": 1, "http://sites.williams.edu/": 1}, "blogtitle": "Frank Morgan"}, {"content": ["Seeing my old friend A. R. Gurney , the illustrious playright, at his 60th Reunion here at Williams College and addressing the 25th Reunion dinner at MIT, all last Saturday, brought back many happy memories. \n Gurney and I taught a freshman seminar at MIT on “Math and Literature,” in which he had to do all the homework I assigned on the Euler characteristic and I had to do his assignments in literature, including a parody of Dante’s Inferno which I call  Dante’s MIT . \n At the MIT 25th Reunion Dinner, in the dazzling new Media Lab  with its breathtaking view of the Boston skyline and the Charles River, I began with an old segment from the nationally syndicated PM Magazine from May 30, 1984, referred to in some old exams . My old students followed my talk on “Soap Bubbles and Mathematics” with their old enthusiasm and acuity. I’m very proud of them and all that they have accomplished."], "link": "http://sites.williams.edu/Morgan/2012/06/12/dantes-mit-2/", "bloglinks": {}, "links": {"http://www.mit.edu/": 1, "http://youtu.be/": 1, "http://en.wikipedia.org/": 2, "http://argurney.com/": 1, "http://sites.williams.edu/": 3}, "blogtitle": "Frank Morgan"}, {"content": [], "link": "http://sites.williams.edu/Morgan/2012/06/06/madison/", "bloglinks": {}, "links": {"http://sites.williams.edu/": 1}, "blogtitle": "Frank Morgan"}, {"content": [], "link": "http://sites.williams.edu/Morgan/2012/06/06/my-transit-of-math/", "bloglinks": {}, "links": {"http://sites.williams.edu/": 1}, "blogtitle": "Frank Morgan"}, {"content": ["Undergraduate STEM Education Report by the President’s Council of Advisors on Science and Technology ( PCAST ) \n  \n On February 7, PCAST released Engage to Excel: Producing One Million Additional College Graduates with Degrees in Science, Technology, Engineering, and Mathematics .  ”This report provides a strategy for improving STEM education during the first two years of college that we believe is responsive to both the challenges and the opportunities that this crucial stage in the STEM education pathway presents. Economics projections point to a need for approximately 1 million more STEM professionals than the US will produce at the current rate over the next decade if the country is to retain its historical preeminence in science and technology. To meet this goal, the United States will need to increase the number of students who receive undergraduate STEM degrees by about 34% annually …” \n Response by the Mathematical Association of America \n \n Note added 19 June 2012 . In his Launchings , David Bressoud concluded that, “In short, the problem is not with attracting students to STEM fields. The issue will be to retain them.”"], "link": "http://sites.williams.edu/Morgan/2012/05/31/pcast-report-to-the-president/", "bloglinks": {}, "links": {"http://launchings.blogspot.com/": 1, "http://www.maa.org/": 1, "http://www.whitehouse.gov/": 3}, "blogtitle": "Frank Morgan"}, {"content": ["The Weaire-Phelan soap bubble foam counterexample to Kelvin’s Conjecture is the latest art exhibit on the roof of the Metropolitan Museum of Art in New York City (photo from New York Times article ). It is conjectured to divide space into unit-volume chambers with the least amount of material. It was also used for the Beijing Olympic Water Cube . For more on the Kelvin Conjecture, see my blog at the Huffington Post. \n \n \n \n \n \n  Note added 8 July 2012.   Rob Kusner pointed out this canopy, designed by Giancarlo Mazzanti, in Bogotá, Columbia, reported by Michael Kimmelman in  The New York Times."], "link": "http://sites.williams.edu/Morgan/2012/05/29/soap-bubbles-on-the-roof-of-the-met/", "bloglinks": {}, "links": {"http://www.huffingtonpost.com/": 1, "http://www.nytimes.com/": 2, "http://en.wikipedia.org/": 1, "http://en.beijing2008.cn/": 1, "http://sites.williams.edu/": 3}, "blogtitle": "Frank Morgan"}, {"content": ["The 2012 Lehigh University Geometry-Topology Conference was as warm and welcoming as ever. Here’s a photo from the final day."], "link": "http://sites.williams.edu/Morgan/2012/05/27/lehigh-geometry-topology-conference/", "bloglinks": {}, "links": {"http://sites.williams.edu/": 1, "http://www.lehigh.edu/": 1}, "blogtitle": "Frank Morgan"}]