[{"blogurl": "http://www.freakonomics.com/blog\n", "blogroll": ["\n"], "title": "Freakonomics"}, {"content": ["A Florida state task force on education has just released a recommendation to adjust tuition, by major. \n “Tuition would be lower for students pursuing degrees most needed for Florida’s job market, including ones in science, technology, engineering and math, collectively known as the STEM fields,” writes Scott Travis of the South Florida Sun-Sentinel .  Students in other majors — psychology and the performing arts, for example — would pay more.  ”The purpose would not be to exterminate programs or keep students from pursuing them. There will always be a need for them,”  Dale Brill , the task force chair, told Travis. “But you better really want to do it, because you may have to pay more.” \n Here ‘s how Alex Taborrak (of Marginal Revolution) sees the plan: \n The task force has the right idea but the right way to target subsidies is not to the job market per se (let alone Florida’s job market), wages already reflect job market needs. Subsidies instead should be targeted to fields where education has the greatest positive spillovers, benefits that spill over wages and flow to the public at large. Overall, this likely means subsidizing the STEM fields more than anthropology which is why the taskforce has the right idea. If the task force wants to explain the idea, however, they should make it clear that the goal is to focus subsidies on those fields where education most benefits the taxpayer. \n \n Readers, what do you think?"], "link": "http://www.freakonomics.com/2012/10/31/is-tuition-by-major-a-good-idea/", "bloglinks": {}, "links": {"http://www.huffingtonpost.com/": 1, "http://marginalrevolution.com/": 1}, "blogtitle": "Freakonomics"}, {"content": ["(Photo: Kim) \n With the U.S. presidential election nearly here, everyone seems to have politics on their mind.  Unlike most people, economists tend to have an indifference towards voting .  The way economists see it, the chances of an individual’s vote influencing an election outcome is vanishingly small, so unless it is fun to vote, it doesn’t make much sense to do so.  On top of that, there are a number of theoretical results, most famously Arrow’s Impossibility Theorem , which highlight how difficult it is to design political systems/voting mechanisms that reliably aggregate the preferences of the electorate. \n Mostly, these theoretical explorations into the virtues and vices of democracy leave me yawning. \n Last spring, however, my colleague Glen Weyl mentioned an idea along these lines that was so simple and elegant that I was amazed no one had ever thought of it before.  In Glen’s voting mechanism , every voter can vote as many times as he or she likes.  The catch, however, is that you have to pay each time you vote, and the amount you have to pay is a function of the square of the number of votes you cast.  As a consequence, each extra vote you cast costs more than the previous vote.  Just for the sake of argument, let’s say the first vote costs you $1.  Then to vote a second time would cost $4.  The third vote would be $9 , the fourth $16, and so on. One hundred votes would cost you $10,000.  So eventually, no matter how much you like a candidate, you choose to vote a finite number of times. \n What is so special about this voting scheme?  People end up voting in proportion to how much they care about the election outcome.  The system captures not just which candidate you prefer, but how strong your preferences are.  Given Glen’s assumptions, this turns out to be Pareto efficient — i.e., no person in society can be made better off without making someone else worse off. \n The first criticism you’ll likely make against this sort of scheme is that it favors the rich.  At one level that is true relative to our current system.  It might not be a popular argument, but one thing an economist might say is that the rich consume more of everything – why shouldn’t they consume more political influence? In our existing system of campaign contributions, there can be little doubt that the rich already have far more influence than the poor.  So restricting campaign spending, in conjunction with this voting scheme, might be more democratic than our current system. \n Another possible criticism of Glen’s idea is that it leads to very strong incentives for cheating through vote buying.  It is much cheaper to buy the first votes of a lot of uninterested citizens than it is to pay the price for my 100 th vote.  Once we put dollar values on votes, it is more likely that people will view votes through the lens of a financial transaction and be willing to buy and sell them. \n Given we’ve been doing “one person, one vote” for so long, I think it is highly unlikely that we will ever see Glen’s idea put into practice in major political elections.  Two other economists, Jacob Goeree and Jingjing Zhang have been exploring a similar idea to Glen’s and testing it in a laboratory environment . Not only does it work well, but when given a choice between standard voting and this bid system, the participants usually choose the bid system.     \n This voting scheme can work in any situation where there are multiple people trying to choose between two alternatives — e.g., a group of people trying to decide which movie or restaurant to go to, housemates trying to decide which of two TV’s to buy, etc.  In settings like those, the pool of money that is collected from people voting would be divided equally and then redistributed to the participants. \n My hope is that a few of you might be inspired to give this sort of voting scheme a try.  If you do, I definitely want to hear about how it works out!"], "link": "http://www.freakonomics.com/2012/10/31/an-alternative-to-democracy/", "bloglinks": {}, "links": {"http://papers.ssrn.com/": 1, "http://www.ust.hk/": 1, "http://www.flickr.com/": 1, "http://www.glenweyl.com/": 1, "http://www.freakonomics.com/": 1, "http://en.wikipedia.org/": 2}, "blogtitle": "Freakonomics"}, {"content": ["If there is one thing that politicians love to do it’s to promise people things now and not worry about how we will pay for those promises until sometime far into the future, when some other politician is on the hook to balance the budget.  \n We see this all the time in the form of budget deficits in the federal government, and also with the accounting tricks used on the Social Security Trust Fund. \n These sorts of shenanigans get less press at the state and local level because many state and local governments are required to have balanced budgets ( this paper by my thesis adviser Jim Poterba lays out some of the details).  There are, of course, ways for states to get around the balanced-budget provisions.  The method that currently casts the greatest shadow over the future is underfunded pensions.  State governments promise generous retirement packages to state employees, but use accounting tricks to avoid recognizing the full value of what taxpayers will owe in the future to cover those debts. \n So how big is this hidden burden?  In a new paper , economists Robert Novy-Marx and Josh Rauh try to figure it out.  Their conclusion: Covering the shortfall due to underfunded state and local pensions would require an average increase in taxes of $1,365 per year for every taxpayer. \n This is not the biggest number ever – I actually would have guessed the number would be larger – but it is definitely something to complain about.  If you’ve never thought about unfunded public pensions, then what you’ve discovered is that if you are the average taxpayer, you should think of yourself as being $1,365 per year poorer than you thought you were just a few minutes ago. \n That is one expensive blog post."], "link": "http://www.freakonomics.com/2012/10/30/one-more-thing-to-worry-about-underfunded-public-pensions/", "bloglinks": {}, "links": {"http://economics.mit.edu/": 1, "http://ntj.tax.org/": 1, "http://rnm.rochester.edu/": 2, "http://www.stanford.edu/": 1}, "blogtitle": "Freakonomics"}, {"content": ["(Photo: Keith Allison) \n Much has been made of the plan the Oklahoma City Thunder followed in building a title contender.  Here are the basic steps the Thunder supposedly followed: \n \n Lose a bunch of games across a few seasons, which allows a team to accumulate lottery picks \n Draft “stars” with lottery picks \n Sign “stars” to long-term contracts \n Win a title (or more) \n \n The Thunder did well with step one.  Starting with their last two seasons in Seattle in 2006-07, this franchise had three seasons where it won 31 games, 20 games, and 23 games.  \n These performances primarily led to the following four high picks in the draft: \n \n 2007: Kevin Durant (2 nd pick overall), Jeff Green (5 th pick overall, a pick acquired in the trade of Ray Allen ) \n 2008: Russell Westbrook (4 th pick overall) \n 2009: James Harden (3 rd pick overall) \n \n The next step was to sign each “productive” player to a long-term contract.  \n \n Durant signed a maximum contract in 2010 .   \n Green was apparently not deemed worthy of a significant long-term contract (and this conclusion is consistent with the statistical evidence ), so he was traded to Boston in February of 2011. \n In January of 2012, Westbrook also signed a maximum contract .  \n \n And then this past week… Harden wasn’t offered a maximum contract. And Harden refused to sign the offer the Thunder made.  So now Harden has been traded to the Rockets.  \n Oops!  Apparently the Thunder didn’t have the money to sign all three “productive” players to maximum contract.  And given this constraint, the Thunder had to make a choice.  \n The choice the Thunder made was to sign Durant and Westbrook to maximum contracts and to try and get Harden with something less. One might argue this was a good choice, afterall… \n \n Durant appeared in the All-Star game in 2010, 2011, and 2012 and was a First Team All-NBA selection in each of these seasons as well. \n Westbrook appeared in the All-Star game in 2011 and 2012 and was a Second Team All-NBA selection in these seasons as well. \n Harden has never been an All-Star and has never been voted to the All-NBA team. \n \n Beyond awards, we also see: \n \n Durant has averaged 26.3 points per game in his career and led the NBA in scoring per game the past three seasons. \n Westbrook has averaged 19.0 points per game in his career and finished 5 th in the NBA in scoring per game this past season. \n Harden has only averaged 12.7 points per game in his career.  And this past season he only averaged 16.8 points per game this past season. \n \n So given the Thunder’s budget constraint, it makes sense to pay Durant and Westbrook and let Harden depart. \n Then again, awards in the NBA are driven by scoring totals .  And unfortunately, a player’s contribution to wins is about more than how many points a player scores. \n To see this, let’s look at the Thunder’s Wins Produced ( calculation ) in 2011-12 ( numbers from The NBA Geek ).  \n \n \n \n \n Thunder 2011-12 \n \n \n Games \n Played \n \n \n Minutes \n Played \n \n \n   \n Wins Produced \n per 48 minutes (WP48) \n \n \n Wins \n Produced \n \n \n \n \n Kevin Durant \n \n \n 66 \n \n \n 2546 \n \n \n 0.226 \n \n \n 11.97 \n \n \n \n \n James Harden \n \n \n 62 \n \n \n 1946 \n \n \n 0.263 \n \n \n 10.65 \n \n \n \n \n Serge Ibaka \n \n \n 66 \n \n \n 1792 \n \n \n 0.263 \n \n \n 9.83 \n \n \n \n \n Russell Westbrook \n \n \n 66 \n \n \n 2331 \n \n \n 0.102 \n \n \n 4.94 \n \n \n \n \n Nick Collison \n \n \n 63 \n \n \n 1307 \n \n \n 0.124 \n \n \n 3.38 \n \n \n \n \n Thabo Sefolosha \n \n \n 42 \n \n \n 914 \n \n \n 0.172 \n \n \n 3.27 \n \n \n \n \n Daequan Cook \n \n \n 57 \n \n \n 989 \n \n \n 0.072 \n \n \n 1.48 \n \n \n \n \n Kendrick Perkins \n \n \n 65 \n \n \n 1744 \n \n \n 0.039 \n \n \n 1.41 \n \n \n \n \n Cole Aldrich \n \n \n 26 \n \n \n 173 \n \n \n 0.21 \n \n \n 0.76 \n \n \n \n \n Nazr Mohammed \n \n \n 63 \n \n \n 692 \n \n \n 0.041 \n \n \n 0.59 \n \n \n \n \n Ryan Reid \n \n \n 5 \n \n \n 17 \n \n \n 0.196 \n \n \n 0.07 \n \n \n \n \n Eric Maynor \n \n \n 9 \n \n \n 137 \n \n \n -0.016 \n \n \n -0.05 \n \n \n \n \n Royal Ivey \n \n \n 34 \n \n \n 354 \n \n \n -0.034 \n \n \n -0.25 \n \n \n \n \n Reggie Jackson \n \n \n 45 \n \n \n 501 \n \n \n -0.029 \n \n \n -0.31 \n \n \n \n \n Lazar Hayward \n \n \n 26 \n \n \n 141 \n \n \n -0.121 \n \n \n -0.36 \n \n \n \n \n Derek Fisher \n \n \n 20 \n \n \n 407 \n \n \n -0.071 \n \n \n -0.61 \n \n \n \n \n \n \n \n   \n \n \n   \n \n \n Team Wins Produced \n \n \n 46.77 \n \n \n \n \n The Thunder won 47 games last season. And about 32 of these wins can be linked to the play of Kevin Durant, James Harden, and Serge Ibaka .  Yes, Westbrook – who produced less than five wins last season – was not ranked in the top three on the Thunder last season. Westbrook was in the top three in 2010-11 , but his Wins Produced per 48 minutes of 0.153 that season could be thought of as good (average WP48 is 0.100) but not outstanding (a 0.200 mark is consider the level of a “star”).  \n So what makes Harden so much more productive than Westbrook? The key is shooting efficiency.  Scoring totals are driven by how many shots a player takes and how often those shots go in the basket.  Players – like Glenn Robinson and Stephon Marbury (and yes, this observation is classified as “factorial” – have understood for a very long time that scoring gets a player paid and wins a player awards. So it literally pays for a player to look for his shot. Last season, Westbrook finished 3 rd in the NBA in field goal attempts per game. But when we turn to shooting efficiency – and we can consider effective field goal percentage or true shooting percentage – we see a player that was only average last year.  And across his entire career he is below average for a point guard.  \n Meanwhile, Harden is well above average with respect to shooting efficiency (and this is what drives his lofty Wins Produced mark).  \n So why does Westbrook shoot so much?  Well one obvious explanation is that Westbrook is the Thunder’s point guard.  So many possessions require Westbrook to decide who gets to shoot.  Given the incentives facing NBA players, Westbrook seems to make the same decision that was often made by players like Stephon Marbury and Allen Iverson .  Yes, Westbrook has often decided that it would be a good idea that he shoot.  \n This decision had certainly helped Westbrook get a maximum contract.  But it has also resulted in Harden moving to Houston. \n And this means the Thunder’s path to a title (i.e. step #4 above) has been derailed.  Yes, the Thunder are still an above average team.  But Harden’s production of wins will be very difficult to replace.  So for the 2012-13 season, it doesn’t look like the Thunder will be favored to get back to the NBA Finals. \n All of this should serve a cautionary tale for those franchises who seek to follow the Thunder’s path.  Losing NBA games – as the Charlotte Bobcats demonstrated last year – doesn’t appear to be difficult.  The rest of the Thunder’s game plan, though, is not so easy.  It is difficult to: \n \n draft top talent in the lottery:    Most lottery picks aren’t stars .  We can see this in Oklahoma City, who spent high draft picks on Green and Westbrook (and again, Westbrook doesn’t produce enough to be considere a “star”).  \n know which players to sign to long tersm contracts:  Since all lottery picks aren’t equal, teams need to know which players to sign to long-term contracts.  Maximum contracts are a great deal for any team – whether in small or large markets – when the player produces wins in large quantities. But these are not great deals for pseudo-stars like Westbrook. \n \n Oklahoma City has experienced both pitfalls.  But with both Durant and Harden, they had the talent to compete for a title.  But their inability to recognize that Harden – not Westbrook – was the key to the team’s future has probably led the Thunder off their path to a title.  \n All of that suggests the Oklahoma City model may not be the best plan for teams to follow.  Yes, the losing part is easy.  But turning all the losing into productive players is difficult.  And since teams – as the Spurs have demonstrated – can find productive players outside the lottery, maybe teams should focus less on step #1 (i.e. losing a bunch of games) and more on locating and keeping the productive players that can help a team contend for a championship."], "link": "http://www.freakonomics.com/2012/10/29/the-oklahoma-city-thunder-stumble-while-following-the-oklahoma-city-thunder-plan/", "bloglinks": {}, "links": {"http://sports.go.com/": 1, "http://www.flickr.com/": 1, "http://wagesofwins.com/": 3, "http://www.huffingtonpost.com/": 1, "http://www.freakonomics.com/": 3, "http://espn.go.com/": 1, "http://www.thenbageek.com/": 5}, "blogtitle": "Freakonomics"}, {"content": ["(Photo: League of Women Voters of California LWVC) \n From mid-July to mid-October, I became addicted—to the Presidential election. By October 20, I was looking at the FiveThirtyEight blog at least four times a day, and was constantly checking Google News and other websites.  This was a classic addiction—after three or four searches each time, I stopped because my marginal utility was diminishing.  But after another hour without my “fix,” I had to search again and got tremendous pleasure from that first search.  The addiction was interfering with my work. \n The theory of rational addiction suggested a solution—go cold turkey.  So I vowed not to look at the FiveThirtyEight blog—and I’ve now been “clean” for 6 days.  To mitigate my withdrawal symptoms, watching the NLCS and the World Series has served as my methadone. Watching baseball for me has the virtue that it’s self-contained—I’ve not developed any addiction and only watch the games.  And if I can stay clean through Nov. 6, my problem will be solved!"], "link": "http://www.freakonomics.com/2012/10/26/election-addiction/", "bloglinks": {}, "links": {"http://www.flickr.com/": 1, "http://fivethirtyeight.nytimes.com/": 1}, "blogtitle": "Freakonomics"}, {"content": ["This is a transcript of the Freakonomics Radio podcast “ We the Sheeple . ” \n [AUDIO OF PRESIDENT BARACK OBAMA AND GOVERNOR MITT ROMNEY] \n \n [MUSIC:  Glenn Crytzer and his Syncopators - Witching Hour Blues ] \n \n Stephen DUBNER: Bryan, do you vote in presidential elections? \n \n Bryan CAPLAN: I confess that I do not. \n \n DUBNER: Why not? \n \n CAPLAN: To me, anyone who can actually make it through the system has views that are so repellent to me, and what they say seems to be so contrary to common sense and common decency I just couldn’t bear to really identify with either of them . \n \n DUBNER:  Okay, so Bryan Caplan is not what a political pollster would call a “likely voter.” Not by a long shot. This can best be explained by the fact that Caplan is – yes – an economist. He teaches at George Mason University. Caplan has iconoclastic thoughts about a lot of things. He’s the kind of guy who’ll tell you that just about everything you think — about voting, about parenting, about higher education — is wrong. \n \n CAPLAN: Honestly, if I just listen to any speech that any successful politician gives, it just seems like it’s so unfair, and it’s so untruthful. It’s like every sentence, can you fact check this sentence? Is this sentence actually factually correct? It’s like, no not really. It’s just a very unfair, and just appealing to people’s emotions, and I have to say, I really object to it.  \n \n [PRESIDENTIAL CAMPAIGN AUDIO] \n \n CAPLAN: I almost never actually listen to politicians. I’ll sometimes read transcripts. I find the transcripts less emotionally aversive than actually listening to them say their words. And when I read those transcripts — no matter what the party of the person is — I just think ‘I would give you a C in my economics class.’ This is just not acceptable for a person to be saying, it’s just so wrong. \n \n [PRESIDENTIAL CAMPAIGN AUDIO] \n \n [THEME] \n \n ANNOUCNER: From WNYC and APM, American Public Media: This is Freakonomics Radio, the podcast that explores the hidden side of everything. Here’s your host, Stephen Dubner. \n \n [MUSIC:  Ruby Velle and The Soulphonics - It’s About Time ] \n \n DUBNER:  Before the last presidential election, in 2008 when Barack Obama beat John McCain, Bryan Caplan published a book called  The Myth of the Rational Voter: Why Democracies Choose Bad Policies . \n \n CAPLAN: The background assumption is this: everyone understands why dictatorships choose bad policies, there’s some awful jerk at the head of a country running it like it’s his own personal piggy bank. The puzzle though is why democracies would choose bad policies in a similar way. So in other words, the question is: everyone can agree that dictatorships choose bad policies; it’s no big intellectual puzzle as to why that would happen. But the idea that democracies, which are run by the people, or by the people elected by the people, would also make mistakes, is the puzzle. So you can think about the right way to read the title is, ‘why even democracies choose bad policies .’ \n \n DUBNER:  The cover of Caplan’s book shows a flock of sheep, standing up like humans in a sort of military formation, ready to follow… someone. We the Sheeple. \n \n CAPLAN: Right, so I’m really going against two different baseline wisdoms. One is with the public, just the idea that if a majority of Americans think something is a good idea then it’s right. You can see this in almost any presidential debate where someone will say ‘the American public wants this.’ And the last thing the other guy is going to say is, ‘well it’s true the American public does want it, but the American public is mistaken for the following reasons…’  You never want to be the politician saying that. The idea that if something is popular, it’s a good idea is quite a widespread in public opinion. At the same time, I also wanted to argue against the view that’s very common in economics and political science, which is that even if there’s a lot of ignorance in the public, you know voters are factually mistaken on a lot of issues, nevertheless it all balances out. So that on average, if the public thinks something is a good idea, then it really is a good idea. \n   \n DUBNER:  Consider one topic that just about everyone cares about during the upcoming election: unemployment – or, really, employment. This issue is at the core of both the  Obama and Romney campaigns. The argument is over how the Obama White House has done in creating jobs. But as Bryan Caplan points out, not all jobs are created equal. Some of them are what he calls “make-work” jobs, and that feeds a “make-work bias.” \n \n CAPLAN: I mean, make-work bias is the view that you should judge the performance of an economy based on unemployment rather than production, which especially during recession is a totally natural view. But once again, if you step back and realize, well, suppose we had thought this way in the 19th century, someone comes up with new tractors, new fertilizers, new ways of growing food. Someone else says wait a second, this is going to put farmers out of work, we should stop them, we should ban them. You know these innovations that sound good because they create more food may be bad because they’re going to destroy jobs. If we listened to those people we would still be farmers. We would still be hungry because they weren’t growing enough food then. Since we didn’t listen to people like this, we had a huge increase in food production. We did have a large decrease in employment in agriculture, but those people and their descendants just found something else to do. Which again, is so unsatisfying to hear, because at the time you want to say, okay, well tell us specifically what will they do instead of agriculture, which is what mankind’s been doing for thousands of years. And the answer really is when you’re in a period of change it’s very hard to say what it’s going to be. All you can do is say, well, there’s going to be something. The labor’s valuable; someone will figure it out. \n \n DUBNER: Well, Bryan, how much of the rational voter idea is pegged simply to voting your pocketbook? In other words, voting for the candidate whose policies, or at least the policies that he promises, most closely align with your own economic interests? \n \n CAPLAN: So there are actually two separate issues here. So one of them is how clearly or unclearly people see the world. The other one is how selfishly or unselfishly they vote. A person could be very rational, but totally unselfish. A person could first of all carefully understand the world and then vote on the basis of what he thinks is best for society. A person of course could be the opposite. A person could be very confused but still voting for what he thinks will advance his selfish interests. What I do in the book is — first of all I clear some rubble away — I go over all the evidence on voter motivation showing that despite what a lot of people think, voters are shockingly unselfish. Your individual interests have very little to do with how you vote, very little to do with your views on particular issues. In general it’s not true that rich people are Republican, poor people are Democrats. So there’s a very slight tendency that way, but it’s nothing like the picture people have of the all rich people vote Republican, all poor people vote Democrat. \n \n DUBNER: So that sounds kind of wonderful, yes? \n \n CAPLAN: So far so good. That actually does make democracy sound better. Here’s the problem, though. Even though it does look like people really are voting for what they believe to be good for their society, they actually seem to know very little about that and, in fact, have a lot of very mistaken views about how to advance their interests. And I say that’s actually probably the worst possible case. The worst possible thing is to have people who have good motives but bad understanding because then there’s a lot of agreement and consensus about what we ought to be doing. The problem is just that what we think we ought to be doing is often ineffective or counterproductive. \n \n [MUSIC:  Ruby Velle and The Soulphonics - It’s About Time ] \n \n DUBNER: All right, so in terms of this year’s presidential election, pick a plank, any plank from each candidate’s economic platform. And give me an Obama plank, and give me a Romney plank. And talk about how good that policy is from an economic perspective, and then talk about its viability as a voting appeal. \n   \n CAPLAN: I’d be perfectly happy if you wanted to just give me a couple. \n \n DUBNER: Sure, so let’s see. So President Obama has talked a lot about financial inequality, but also access to education let’s say, right? So he has made moves toward, and talked about making more moves toward, making college more affordable in more ways toward more people. Talk to me about that idea as a piece of economic policy and then talk to me about it as a good piece of voter bait. \n   \n CAPLAN: All right, so in terms economic policy, it’s not at all clear that this is a good idea, because we already have an enormously high dropout rate, especially for marginal students. Most of, or at least a lot of the payoff from going to college comes from finishing. And yet, over the last decade or so we’ve had a large rise of the number of people who start going to college, but the fraction that actually finishes has been very flat. So it seems quite likely in a way that this is just going to encourage a lot of people to waste a couple of years of life and get very little show for it. And yet, what I just said is not anything you’d ever want to tell voters. You certainly don’t want to get in front of a national audience and say, you know, I think too many people are going to college. A lot of people aren’t very serious. You know that’s just the fact, a lot of people aren’t meant for college. That sounds terrible. \n   \n DUBNER: And therefore, campaigning on the idea of sending more people to college is a great thing to campaign on.  \n \n CAPLAN: That sounds great. And of course we’re going to pay for more of the stuff sounds good. I mean, who wants to pay for the stuff. Right? And again it’s not just a selfish matter of I don’t want to pay for my kid. No one should have to pay! Wouldn’t that be great if no one had to pay? \n   \n DUBNER: All right, let’s take something from Governor Romney’s campaign. Let’s say it’s a tax issue. Let’s say that the Romney camp describes President Obama’s forward-looking tax policy as wanting to raise taxes on the highest earners, whereas Governor Romney would argue, and has argued, that that would be a mistake because it would disincentivize small businesses, and maybe large. And that there comes a certain point at which raising taxes rather than, or at the expense of cutting spending is counterproductive. How does that rank as an economically sound or unsound issue in your view, and how does it rank again, as, again, voter bait? \n   \n CAPLAN: That one’s kind of funny, because if you take a look at voters’ views on government spending, they’re literally contradictory. Voters in general favor lower spending overall, but for virtually every category of spending they want to spend more. So this is the kind of thing where if  you say it right almost anything can be good, if you say it wrong almost anything can be bad. When a politician says we need to cut spending, that is a popular appeal. The only problem is if someone says cut which kind of spending? Oh, let’s cut the waste. Can you identify the waste specifically, is there something that it actually is? You know that’s the problem. I mean, I would say that in general, Republicans try to tap into the general public desire for lower spending. They also try to very carefully tap in to the public’s resistance to cutting any particular kind of spending. So even though Republicans know very well that to really cut spending you’ve got to cut entitlements, you know, you’ve got to get Social Security, Medicare, Medicaid under control. Those are really the fast-growing areas of spending. But Republications are very carefully electorally not to name any of those because people are going to say wait, when I said cut spending, I didn’t mean cut any of the spending we like, which are basically all of them, except for foreign aid. \n \n [MUSIC: Lord Echo - Things I Like to Do]  \n \n DUBNER:  Coming up: my Freakonomics partner Steve Levitt talks about his voting history. \n \n Steven LEVITT: I voted for Obama because I wanted to tell my grandchildren that I voted for Obama. And I thought that he would be the greatest president in history. \n \n DUBNER: And?   \n LEVITT: I don’t think I’m going to bother voting this election. \n \n ANNOUCNER: From WNYC and APM, American Public Media: This is Freakonomics Radio. Here’s your host, Stephen Dubner. \n \n [MUSIC: Glenn Crytzer and his Syncopators - Witching Hour Blues]  \n \n DUBNER:  Today on Freakonomics Radio we’re talking with economist Bryan Caplan, author of  The Myth of the Rational Voter.  He is not a huge fan of our current political system. \n \n CAPLAN: If you’re a successful politician, you know you don’t succeed by figuring out what’s really going on in the world and trying to explain it to people. You need to find out what people want to hear and then tell it to them. Successful politicians instinctively are trying to read people, trying to read their faces, what does this person want me to say to him, and that’s how they win. Economists often look down on politicians and sort of mock them for being incompetent. I have a very different view. I think they’re extremely competent, it’s just they’re competent in a skill that economists don’t appreciate. They are people who win these incredibly competitive races to get a job that thousands of people would love to have, maybe millions of people would love to have. They have some incredible skills, it’s just their skills are not figuring out what’s really going on, or deciphering the best research around. Their skill is finding out what the public wants to hear and saying it to them in a way that’s emotionally compelling.  \n \n DUBNER: So what bothers you more, that electoral candidates give the people what the people want — or seem to want — or that people who seem to want what they seem to want? \n \n CAPLAN: That’s a very good question. Because ultimately the source of the problem is that people are so confused in their views of how the economy and other things work, which means that a politician who wants to win has to actually say these things. People have often said that politics has been the religion of the 20th century, and I think there’s a lot to that. In the same way that people get attached to a religion, they get attached to a political party. And once you’re part of it, you don’t want to hear someone talking about the horrible things that your religion or your party did in the past. You don’t want to go and say the people who now run it might be morally questionable, or hypocritical, or just wrong. Instead, you want to find a sense of community with a bunch of like-minded people. You all tell each other how wonderful you are and try to defeat your Satanic enemies who for some strange reason continue to dispute the truth that you have obtained. \n \n [MUSIC:  Ruby Velle and the Soulphonics - Agenda ] \n   \n [MAN ON THE STREET TAPE]  \n \n DUBNER:  People are always talking about the dispiritingly low voter turnout rate in the U.S. — it’s less than 60 percent for a Presidential election. But after hearing Bryan Caplan talk for a while, you may ask yourself a different but equally dispiriting question: why is voter turnout even that high? I asked my Freakonomics friend and co-author Steve Levitt about this recently. He’s an economist at the University of Chicago. \n \n DUBNER: So Levitt, how can you in your life, when you wander around, tell the difference between a smart person and a not-so-smart person? \n \n LEVITT: Well, one good indicator of a person who’s not so smart is if they vote in a presidential election because they think their vote might actually decide which candidate wins. \n \n DUBNER: Well that sound anti-American doesn’t it? That’s a terrible heresy you’re saying aloud. \n \n LEVITT: Well, you know us, Dubner, we try to tell the truth. And the fact is that there has never been and there never will be a vote cast in a presidential election that could possibly be decisive. And one thing we see for sure, and we saw it in the Gore versus Bush election is that if it’s even within thousands of votes it’s not the votes themselves that decide the election, because nobody can figure out how many votes were cast. It’s the courts that always decide, the judges that always decide. It’s virtually impossible that any vote you cast in a national election could ever actually be decisive.  \n \n DUBNER: But don’t you think that people pretty much know that by now, people are aware of the difference between electoral versus popular vote. And you know, if you live in a state like I do, New York, or you do, Illinois, it’s kind of a forgone conclusion. So let’s assume that most people kind of think about that and know that, what drives them to do it anyway? I mean, people complain about low voter turnout, it sounds like you’re saying it’s strange it’s even as high as it is, around fifty percent. \n \n LEVITT: Yeah, so I think you’re right that most people understand that their vote doesn’t really matter for the election, which is exactly why I said it’s only the not so smart people who vote because they’re actually going to influence the election. I think the reason most people vote, and the reason I occasionally vote is that it’s fun. It’s fun to vote, it’s expressive, and it’s a way to say the kind of person you are, and it’s a way to be able to say when something goes wrong when the opponent wins, “well I voted against that fool.” Or when something goes right when you voted for a guy to tell your grandchildren, “well I voted for that president.” So there’s nothing wrong with voting. I think you can tell whether someone’s smart of not so smart by their reasons for voting.    \n DUBNER: Why did you vote for Obama for president in 2008? \n \n LEVITT: So I voted for Obama because I wanted to tell my grandchildren that I voted for Obama. And I thought that he would be the greatest president in history. \n \n DUBNER: And?  \n \n LEVITT: I don’t think I’m going to bother voting this election. \n \n DUBNER: So Levitt, some places around the world have essentially mandatory voting. Australia for one, I don’t really know too many of the details about it. But as a citizen you must vote. And there are different incentives for voting, and penalties for not voting. Do you like that idea for here? \n \n LEVITT: I think it’s totally backwards. Why would you want people who aren’t interested in voting, why would you want to compel them? These are either people who are uninterested in voting, uninformed, indifferent between the candidates. Those are exactly the wrong people to try to get to vote. If anything I think you want to go in the other direction and find ways to let people who care a lot vote repeatedly. That’s really more in the spirit of trying to get to the right answer. That way you get the people who have the strongest convictions acting most aggressively to express those convictions. \n \n [MUSIC:  Ruby Velle and the Soulphonics - Agenda ] \n \n [MAN ON THE STREET TAPE]  \n \n [CREDITS] \n   This is a transcript of the Freakonomics Radio podcast “ We the Sheeple . ”"], "link": "http://www.freakonomics.com/2012/10/25/we-the-sheeple-full-transcript/", "bloglinks": {}, "links": {"http://www.freakonomics.com/": 2}, "blogtitle": "Freakonomics"}, {"content": ["(Photo: umstwit) \n In a new working paper ( PDF ; abstract ), economists David G. Blanchflower , Andrew J. Oswald , and Sarah Stewart-Brown argue that you actually are what you eat: \n Humans run on a fuel called food.  Yet economists and other social scientists rarely study what people eat.  We provide simple evidence consistent with the existence of a link between the consumption of fruit and vegetables and high well-being.  In cross-sectional data, happiness and mental health rise in an approximately dose-response way with the number of daily portions of fruit and vegetables. The pattern is remarkably robust to adjustment for a large number of other demographic, social and economic variables.  Well-being peaks at approximately 7 portions per day.  We document this relationship in three data sets, covering approximately 80,000 randomly selected British individuals, and for seven measures of well-being (life satisfaction, WEMWBS mental well-being, GHQ mental disorders, self-reported health, happiness, nervousness, and feeling low). \n \n One major note: the researchers caution that reverse causality may be an issue. That is, rather than fruit and vegetables  causing well-being, it may be that well-adjusted people prefer eating a lot of fruit and vegetables. The authors recommend additional “randomized trials to explore the consequences for mental health of different levels of fruit-and-vegetable consumption.”"], "link": "http://www.freakonomics.com/2012/10/25/you-really-are-what-you-eat/", "bloglinks": {}, "links": {"http://www.dartmouth.edu/": 2, "http://www.andrewoswald.com/": 1, "http://papers.nber.org/": 1, "http://www2.ac.uk/": 1, "http://www.flickr.com/": 1}, "blogtitle": "Freakonomics"}, {"content": ["(Photo: Vox Efx) \n Our latest Freakonomics Radio episode is called “We the Sheeple.” (You can download/subscribe at  iTunes , get the  RSS feed , or listen via the media player above.) The gist: politicians tell voters exactly what they want to hear, even when it makes no sense — which is pretty much all the time. \n With the Presidential election finally almost here, this is the last of our politically themed podcasts for a while. We’ve previously looked at how much the President really matters (updated here ); whether campaign spending is as influential as people think; why people bother to vote (related Times column here ); whether we tell the truth in polls ; and whether we should consider importing the British tradition of Prime Minister’s Questions. \n “We the Sheeple” features Bryan Caplan , the economist-author of  The Myth of the Rational Voter: Why Democracies Choose Bad Policies . You might have read or heard from Caplan in other Freakonomics venues , including “ The Economist’s Guide to Parenting ,” in which he discussed another of his books, Selfish Reasons to Have More Kids .  \n Caplan is, to put it gently, not a fan of our current political system. At he puts it in the podcast: \n CAPLAN: You know, if you’re a successful politician, you know you don’t succeed by figuring out what’s really going on in the world and trying to explain it to people. You need to find out what people what to hear and then tell it to them. That’s what you see in debates. That’s what you see voters, successful politicians instinctively are trying to read people, trying to read their faces, what does this person want me to say to him, and that’s how they win. \n \n Caplan also shares with us a letter he received from a Virginia state senator after  The Myth of the Rational Voter was published. The senator wanted to thank Caplan for “confirming by your research that my ideas about the stupidity of voters is a valid thought”: \n \n In the podcast you’ll also hear Steve Levitt talk about what he sees as the biggest upside of voting: \n LEVITT: I think the reason most people vote, and the reason I occasionally vote is that it’s fun. It’s fun to vote, it’s expressive, and it’s a way to say the kind of person you are, and it’s a way to be able to say when something goes wrong when the opponent wins, “well I voted against that fool.” Or when something goes right when you voted for a guy to tell your grandchildren, “well I voted for that president.” So there’s nothing wrong with voting. [But] I think you can tell whether someone’s smart of not smart by their reasons for voting.  \n \n Levitt also tells us what he thinks of the idea of compulsory voting, as practiced in Australia and other places. FWIW, we just received an e-mail on this topic from an Australian reader named Andrew Mannion : \n There is a sense that it’s a waste for those who have no interest in politics, although for most of us, voting is just a Saturday morning chore (all our elections are held on Saturdays) to be done with before watching the football or cricket. There is an upside though: with compulsory voting, there’s no need for political parties to spend big dollars on getting people out to vote. Here, that’s guaranteed. So what money is spent – and there’s far less of that here – can be spent on selling policies. \n \n And finally, below is a list of the music that you’ll hear in this episode. David Herman is our engineer and among his many skills is an excellent taste and feel for the music that elevates our podcast above the mere chatter of stationary people. From now on, we’ll try to list the music for all episodes. \n “We the Sheeple” Music Credits: \n \n \n \n \n Song Title \n \n \n Artist \n \n \n   Album \n \n \n \n \n Witching Hour Blues \n \n \n Glenn Crytzer and his Syncopators \n \n \n Harlem Mad \n \n \n \n \n It’s About Time \n \n \n Ruby Velle & The Soulphonics \n \n \n It’s About Time \n \n \n \n \n Things I Like to Do \n \n \n Lord Echo    \n \n \n Things I Like To Do \n \n \n \n \n Agenda \n \n \n Ruby Velle & The Soulphonics \n \n \n It’s About Time"], "link": "http://www.freakonomics.com/2012/10/25/we-the-sheeple-a-new-freakonomics-podcast/", "bloglinks": {}, "links": {"http://rubyvelleandthesoulphonics.com/": 2, "http://www.gov.au/": 1, "http://syncopators.bandcamp.com/": 1, "http://www.flickr.com/": 1, "http://www.bcaplan.com/": 1, "http://itunes.apple.com/": 1, "http://www.freakonomics.com/": 8, "http://lordecho.bandcamp.com/": 1, "http://www.amazon.com/": 4, "http://www.nytimes.com/": 1}, "blogtitle": "Freakonomics"}, {"content": ["(Photo: Loren Javier) \n The Tigers (bravo!) and Giants are in the World Series, with possibly 4 of 7 games to be played in San Francisco. The majority of games will be played there because the extra game (if necessary) goes to the team representing the league that won the All-Star Game. The purpose of the rule (adopted in 2003) is to offer players and managers an incentive to provide more effort in the All-Star Game. I’m doubtful that this incentive matters much. First, with large teams each player is to some extent a free-rider — why risk injury, why strain yourself, if your efforts have little effect? That is especially true if by July you realize that your team has no chance of making it into the Series. Second, and even more important, I doubt that any player or manager’s effort is very responsive to this kind of incentive."], "link": "http://www.freakonomics.com/2012/10/24/the-all-star-game-incentive/", "bloglinks": {}, "links": {"http://www.flickr.com/": 1}, "blogtitle": "Freakonomics"}, {"content": ["We are working on a Hall of Fame project that will pay tribute to people who have used a “freakonomical” way of thinking to better the world in some way large or small. Since a lot of people have a lot of interpretations of what it means to “think like a Freak,” we will leave the criteria up to you. It may have something to do with a creative use of data, or understanding incentives, or challenging the conventional wisdom. \n The person you nominate for this Hall of Fame might be prominent or totally obscure. You may know them personally or perhaps you’ve only read about them. They might work in academia, sports, medicine, philanthropy, entertainment, development — or even politics! \n We have tried to feature such people on the blog over the years but now we need your help in coming up with the best pool possible. Please send this request to everyone you know! \n You can nominate people in the comments section below or send us an e-mail at <> \n We may also put together a Freakonomics Hall of Shame ( here’s an example ), so feel free to submit nominees for that too. \n Thanks!"], "link": "http://www.freakonomics.com/2012/10/24/please-submit-your-nominations-for-a-freakonomics-hall-of-fame-and-hall-of-shame-too/", "bloglinks": {}, "links": {"http://www.freakonomics.com/": 1}, "blogtitle": "Freakonomics"}]