[{"blogurl": "http://geekmusfir.wordpress.com\n", "blogroll": [], "title": "Geekmusfir"}, {"content": ["I am sure many of the readers of this post may not like what they are about to read. But my nature is to blurt out the truth in its very form. Truth is most of its time unpleasant. But that does not mean you should mask it to please others. \n I decided to write this as I had a conversation with one of my friend who got a placement in a respectable company (IT), to which I too have a placement offer. As any circuit engineering student she did not like the IT programming jobs for a living. She had plans at heart. She had a passion for higher studies. But keeping all her thoughts and likes behind she took a daring (foolish) decision to join the company. \n It is agreed by all that IT industry does no good for its employees except mechanically training them into a production machine that would easily be handled by their manager just like a puppet. The proof for it is evident as they recruit anyone with a GPA they specify irrespective of their branches. No other field has ever faced this ridiculous situation. A civil engineer sitting at his cubicle preparing a code for an insurance policy…. \n We all know the umpteen number of reasons why we are being recruited for these mechanical monotonous jobs in bulk. I kept thinking even after knowing all these why do some of the very talented ones go and chain themselves to these giants. I had gone through the same situation for a couple of days. I realize three basic reasons to this fact. I would enlist them down. \n \n Fear  : Many of us do have our own dreams and passions. We do want to achieve it at the depth of our heart. But FEAR stops us from it. We have been brought up in a way to think that failure is a sign of disgrace. That is exactly why we look forth for a sense of security in everything we do. We are thus being mislead by a virtual sense of Job Security. The suspense in life and the randomness that actually makes our life more enjoyable is defined to be the reason for failure.  Let me tell you if all the other members of our species succumbed to this terrible emotion we would still be living in the dark age. What we fear is in fact of the unknown feature. We are not ready to trust the probability of nature that always lead us to the perfection through randomness. \n Laziness : This is another profound reason why we end up doing things against our passion.  To follow our passion it requires us to work hard. the truth is the passion ones we follow it makes our work enjoyable and brings in happiness. That is exactly we find free lancers, though they for 18 – 19 hours a day they are full of energy the next day compared to an IT professional in any triplet lettered companies where the work hours fall below 8 hours. I had several of my friends stating : ” No man: I can’t go any further” ” I need to settle” Settling is another mythical concept in life. To me its a second word for laziness and idleness \n Financial Security:  Those who do not fall in any of the above category could be having this to be a major reason. We all speak against these companies; their atrocities etc. but once they put up their annual package our mouths go wide. Money is a valuable resource. I do agree. But, is it so valuable that we should live all our life to earn? Or is it that we should earn to live? There are people who plan to suffer for a period to “earn” maximum so as to “live” their coming years. As though they are so certain of their death date. I believe life and passion is what values most. that which no money can ever buy. \n \n I am not speaking to any of you who had a dream for this opportunity and who say their sole aim is to be an IT professional. I am only addressing who think “Should I miss this opportunity just because it is not of my passion”. Those who seriously believe IT industry is not what they had learnt all these years. Those who believe they are not pretty good negotiators. Those who believe in the need for quality in life over quantity. \n I know decisions are really painful. Especially when your social commitment comes into the picture. When your dignity and credibility might be questioned. But the brave and bold decisions realizing that “Your Life is Your own” shall never be regretted. I had a very crucial moment in my life where I had to make such a decision. Just after my graduation this year I was lucky enough to get enrolled in a premier institution of this country for PG. There were enough hands to congratulate me, to encourage me… But in a short point of time it turned out that the program was totally against what I am looking for, I immediately stopped and returned. Many of the congratulating hands were accusing me… But I have no regrets. I always believe the need for a set of backward stride to get a greater impact.  \n It is you who drive your life and create factors. Not these factors drive you. You live only once. A day passed never comes back. Enjoy your passion, feel it and live a regret less, remorseless happy life. We Indians really know the price of Freedom and Independence. that is something our forefathers lived for. That is something all we once cared for. Never ever belay it to someone even for a second in your life. \n Let me open up this post for your sound criticism."], "link": "http://geekmusfir.wordpress.com/2012/09/30/do-you-have-to-enslave-yourself-to-the-corporate-world-for-a-living/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1}, "blogtitle": "Geekmusfir"}, {"content": ["WoW…..Today I am an engineering student who had almost completed the graduation. In this context I would like to give a feel of my thoughts and the experiences in short that would be handy to a lot many people. The graduation program was Bachelor of Engineering in Electronics and Communication from University of Calicut. To many of the people the B-Tech degree program would be just a fun and frolic… For many others it would be just writing the exams and records… For many others it would be competing for the scoregrades and of course the fight for sessionals.. Though I had been through all the above scenario for me its something even great. \n It all began when I lost the Kerala Entrance examination (Medical) second time and qualified for B-Tech the second time. When I joined the course (of course hatefully) I had no idea what it would be like.The initial years were filled with Mathematics and I hated it the most. I had almost lost my vision and views on my career and I was just quite unaware of what I had ahead of me. Thanks to the College MES College of Engineering which saved my life. It all began from one person Mr.  Namith Najeeb  after he joined our college. The actual campus life began with a lot of spirit and energy. I expressed my hopelessness and the frustration due to inactivity to him on which he gave me the first lesson. Nothing is going to be good unless you yourself feel so.  That was the first time I stopped complaining of the situation and began to work. I found out the taste in me for Mathematical subject all of a sudden after I had thrown of all the Math onto Unical papers. All I had to do is to find the apt person and luckily without much effort I found a handy group that consisted of Mr. Irshad, Mr. Praveen, Mr. Edet Bijoy K , Mr. Aneesh M Koya, all Assistant Professors at the Department of ECE. And then began my tour through the world of Informations… Though only Bijoy sir remains in our college from the above mentioned names the fruits of inspiration was well found in me from all of the above teachers.  Edet Bijoy sir is the greatest of support I had in my student life. A very unconditioned ethical teacher who values a lot for the hardwork. I believe I was gifted by the Almighty to work along with him for a couple of years which passed off too quickly . He is always more than a teacher alone in my life. \n Soon I made a habit to keep my ears sharp to any of the events that would happen in the college outside the classrooms and today I can say for sure those lectures or events have helped me a lot than any other traditional syllabus would have taught me.. Not that the syllabus is bad but that the piece that I had collected was all rare and additional information. The second lesson in my life was ” Knowledge never comes searching you, but you have to search for it” . I found a mentor, an inspiration in my life when I met my beloved Mr. Sajith Nallithod i, Assistant Professor at the Department of CSE. I used to spent hours with him discussing and learning new things. The energy and kind of support he used to give is beyond what I can put in words. Of course a large part of what I am today is just due to his efforts and motivation. I cannot even think of the situation if the CSE labs were not available to me for hours and on even late till 10:00 PM if that was required. \n I was by now captured by the philosophical view on technology through a very vibrant community, and thanks to Dr. C K Raju , Head of the Department of IT and his very vibrant team that includes Mr, Raghesh, Mr. Sobin C C and of course the students of Computer Science, which shows the effects of motivations by the above mentioned Sajith sir. Sajjad , Aneez , Nakul , Kiran  and many more. The called themselves the FSUG community. The community built in me an understanding and liking towards Open source softwares and programming. It gave me the greatest lesson that though knowledge is easily accessible at your doorstep only the intended and the interested would be attaining it. With so much efforts and publicity its sad that many of the geniuses in my college are still unaware of this community or at least their vision and goals. I would suggest all those who read this to at least try to know very well of the above said Open Source community in depth before you criticize or join it. \n I was totally supported by my classmates, some of whom I believe is worth mentioning, Anjitha  , Jayasree , Deepa A are the gems who had provided me tremendous love and care and support. The witty Akhil G Nath . He is the guy I used to bug whenever I required a change and of course he had done a lot to morally support me during my college life. As equivalent is Aswin  who is credited for his unconditional support to smoothly avail all the documents and materials for the examination and projects. In fact a part of my success is credited to this gem. Arunlal  an IAS aspirant who have filled my life with wits and humor , Jasim  the great manager and hardworker. The list would go even longer if I keep mentioning… \n I believe its not worthy to judge myself  if I am successful or not as the definition of success varies from person to person.  I happened to attend a talk by Dr. C V Jawahar, Professor at IIIT Hyderabad where he stated the people would be of three categories while collecting fruits from a tree. \n \n Those who do not risk themselves and be satisfied by the rotten and fallen fruits. \n Those who take a little effort and get the low lying fruits, of course they do not enjoy the taste but have to satisfy. \n Those who risk themselves and get the highest possible fruits and enjoy the real taste of it. \n \n I do not know to which category I belong, but the fruits that I have collected is extremely sweet and I do enjoy it very well. I would also like to thank another person who brought me back to the once hated Mathematics, a genius Dr. K P Soman , Head of Department CEN, Amrita Vishavidyapeetham. Above all my Creator and Sustainer, The Almighty who loves and knows me the most who had blessed me with bounties over and over is the only one reason why all this was possible. \n To those who read this I would like to jot down a few more lessons I came across in my short life. I believe this would extremely help my juniors \n \n Listening to anything without presumption teaches you a lot. \n To know nothing is the best way to begin to master something. \n Never learn anything for grades or marks. In fact it spoils the entire taste of education. My very close friends would know that I hardly cared about the scores after I had written any exams but the studying part… It is out of question that I should cover up the entire syllabus at least before I write the exam . I had suffered a couple subjects in a couple of semesters in terms of sessionals for the same but it helps well on long run. \n Never wait for you to get free. In fact Swami Vivekananda states “Everything is easy when you are busy!! Nothing is easy when you are lazy!!” I had experienced myself the very first part. I have gained a lot when I look back, things I couldn’t imagine would happen in my life during the busiest days of my life. \n Trust in the goodness of the world.. That is the exact reason why we have Wikipedia. The world is filled with a lot of good and helpful people with a very few anti-socials. \n Value yourself as a professional as no one value if you yourself feel that you are worthless \n Grab any of the opportunities as though you never get them again and exploit it even if it be not of your liking. Eg: A boring lecture  \n \n Well, I think this would be enough. Thanking you all for the patience to read through. Feel free to express your views on this. All the very best to one and all."], "link": "http://geekmusfir.wordpress.com/2012/06/08/testimony-of-an-engineering-student-a-vote-of-thanks/", "bloglinks": {}, "links": {"https://www.facebook.com/": 13, "https://twitter.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.amrita.edu/": 1}, "blogtitle": "Geekmusfir"}, {"content": ["I write this after a week of the grand event Debian Utsavam 2012 a two day event at MES College of Engineering to where I belong as a student. Thanks to the initiatives from Praveen , Nakul E , Aneez , and all others. Not to forget our mentor and sole support Sajith sir. Till the last week I was just a Free – (which requires no money) Software user. I never knew what was the necessity for one to know about the existence of the philosophy behind anything that come across me in my life. And as we engineers, software is something one can never avoid in the daily life. Before I begin let me request the readers to make sure you correct me wherever you feel I go wrong as its the first time I blog on my views and understanding. \n Though I had attended lots of FOSS – FSUG events, this was an eye opener with talks from Labeeb, Sadique, Harris etc. I have never been triggered to think of philosophical part so much before. People used to ask me the distinction between using an open software and a pirated one to which all I could answer was to fight piracy. This would satisfy a very little of my pals. But when the motivation behind the proprietary giants are exposed, when the loop holes in their privacy and security conditions are thrown out I am sure those people would not feel the same easiness they have today. \n Understanding the philosophy of anything what you learn or come across is essential so as to prevent its unnecessary abuse. Let me quote a very small example I came across a random blog. Ruby – A well known programming language says in its underlying philosophy that it is meant for programming to be fun. So it is with unusually readable syntax. But if my concern is high speed of execution then my selection of Ruby for my work would be out of context where I would waste my time and effort just to know that it con’t be accomplished. A simple understanding of the philosophy would’ve saved my time and toil. \n Another sheer example of misuse is that of the Ubuntu Operating System.  Ubuntu is very popular, and its original philosophy was to be the “best desktop linux distribution.” However, you see many people choosing to run it as their production web servers!!!! \n So now that’s said I feel I can get an understanding why there are brilliant students dropping out of colleges. Recently I was shocked to hear one of my close friend with sheer unusual brilliance, decided to drop off. When I asked him of the reason, it was whatever he learnt made no sense to him!! \n When I thought of it I too could find… I never knew the purpose of the thoeries and formulations I had swallowed. Nor do I have any idea of the situations that led Nyquist to even think of the Great Great Sampling Theorem (Sorry… As my background is from ECE… metaphors and similes might be from there \n But I am sure just before I even complete saying Gravitational force, the entire picture of Newton sitting under an apple tree and THE Apple bumping his head would have flashed your minds. If any of the educationists read acoss this I would request them to involve the philosophies (at least in short) in the syllabus, lectures etc. so that the students would at least be aware such a thing exists on what they lear. \n I do think the negligence of the Philosophy of what they had learnt, is what makes a Mechanical or Civil graduate to to toil the six months in an outsourcing BPO center to gulp down the jargons of JAVA, C, etc. Further more in the scenario of FOSS what philosophy had given me is it bridged the gap between technology and humanity. I quote this from an open essay which came in Human Readable: \n \n \n \n \n Why Free Software is Important \n Written by Darrell Anderson. \n After spending the past several years researching and studying human social and legal systems, I am both pessimistic and optimistic about humanity’s future. \n Much of the conflict and turmoil witnessed today is a result of superstition and ignorance. I have no idea where humanity will go in the future, but I can envision events such as massive self-destruction or global tyranny because of the flawed manner in which modern social and legal systems are structured. On the other hand, technology is rapidly outdating many unhealthy customs and norms. In the midst of my pessimism there is hope. That ray of sunshine is the philosophy behind the free/libre and open source software (FLOSS) movement. \n As a student of human social systems I am interested in the free/libre and open source software more as a social movement than the many benefits the technology offers. I believe there are fundamental flaws in the way human social exchange systems function and those flaws are root causes of much conflict. I believe coercive and politicized monopoly exchange promotes destructive competition rather than cooperative competition, and the current concepts of copyright, patents, and trademarks as practiced must change or they will continue to provide the foundation for much conflict. I believe people within the FLOSS movement could change many of the ways those systems operate and could help create a better world for us all. I am encouraged that those changes are evolving right before my eyes within my lifetime. What remains to be seen is whether the FLOSS movement succeeds. \n \n \n \n \n  I fully agree to what has been said above. I believe it is not the number of volunteers that would take the Libre foundation to the skies. But, the spirit of the philosophy that is built in it. The redefinition of Software from “As a mere Product” to  ”A Knowledge based Product”.\\ \n Today I realize it is the toil of people who believe in this philosophy that I can Wikipedia and the like sources with the enormous bank of knowledge it carry."], "link": "http://geekmusfir.wordpress.com/2012/05/06/the-necessity-to-look-into-the-philosophy-of-what-you-learn/", "bloglinks": {}, "links": {"http://nakule.in": 1, "https://twitter.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.j4v4m4n.in/": 1, "http://techlessons.in": 1}, "blogtitle": "Geekmusfir"}, {"content": ["Reblogged from What's new: \n \n In preparation for my upcoming course on random matrices, I am briefly reviewing some relevant foundational aspects of probability theory , as well as setting up basic probabilistic notation that we will be using in later posts. This is quite basic material for a graduate course, and somewhat pedantic in nature, but given how heavily we will be relying on probability theory in this course, it seemed appropriate to take some time to go through these issues carefully. \n  Read more… 10,278 more words"], "link": "http://geekmusfir.wordpress.com/2012/04/04/171/", "bloglinks": {}, "links": {"http://terrytao.wordpress.com/": 2, "http://en.wikipedia.org/": 1}, "blogtitle": "Geekmusfir"}, {"content": ["MATLAB is a unique tool where you can play with your imaginations. Recently I and some of my friends are on a work wherein the speech signals are to be processed using the MATLAB codes and receive the output in the Simulink work space. In fact the problem is not all that difficult neither is it that easy. \n Simulink has evolved as a very powerful tool whereby a large number of processors and external hardware can be interfaced. As we are on to speech processing we intend to explore the hardware implementation on DSK TMs320 processors which can easily be interfaced with Simulink on Code Composer Studio. This post intends to share the primary success of our work and touches the very basic embedded Matlab Function blockset. It is placed under the user defined functions library listed under Simulink. \n We have tried out the amplification of a speech signal “zero” and obtained a graphical plot for the same. This could be easily implemented in real time on a DSK processor which allows a real time amplifier of the speech signal. \n The embedded MATLAB function blockset allows you to write your code in the space provided in it which can be accessed by clicking on it. \n \n  Type your code here \n A screenshot of the basic trial of this block has been shown below wherein we tried amplifying the signals 100 times of its original value which was successfully obtained. \n  \n \n  Input \n  Amplified Output \n \n Likewise any simple to complex algorithms can be implemented in this blockset limiting to the parameter configuration in Simulink. The coming posts would be on other blocks of the User defined functions. \n \n Put forward your queries and suggestion regarding this work. We would be constantly updating our work on this."], "link": "http://geekmusfir.wordpress.com/2012/03/24/unleash-the-power-of-simulink-and-matlab/", "bloglinks": {}, "links": {"http://geekmusfir.wordpress.com/": 4, "http://feeds.wordpress.com/": 1}, "blogtitle": "Geekmusfir"}, {"content": ["The data, model, algorithms (solver) and modeling language/system requires one to know the principles of basic mathematical optimization. The above are the key problems an engineer may face where the optimization becomes handy.  A typical optimization problem is as shown below. \n \n The optimization blocks include data, model, optimization algorithm and the optimal solution. \n  \n Data includes the situation and requirements of a system i.e. demands available resources, capacities etc. The model consist of the variables, constraints,, objective functions etc. Solver consist of the algorithms like the simplex algorithms, outer approximation etc. The model consist of the variables, constraints,, objective functions etc. Solver consist of the algorithms like the simplex algorithms, outer approximation etc. A general optimization technique is really tough to solve and might require a long computation and also it appears that the solution may not be achieved all the time. Linear squares, linear programming and convex optimization are exception to the above scenario. The upcoming posts would provide n insight to the three above mentioned problem."], "link": "http://geekmusfir.wordpress.com/2012/02/22/mathematical-optimization/", "bloglinks": {}, "links": {"http://geekmusfir.wordpress.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "Geekmusfir"}, {"content": ["A few slides prepared on the basis of what I interpret compressive sensing has been shared below. \n Introduction to Compressive Sensing \n Request you all to go through and comment!! \n This was prepared with the help or Mr. Edet Bijoy K wit the reference to the paper “An Introduction to Compressie Sensing”."], "link": "http://geekmusfir.wordpress.com/2012/02/21/introduction-to-compressive-sensing/", "bloglinks": {}, "links": {"http://geekmusfir.wordpress.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "Geekmusfir"}, {"content": ["Reblogged from Tech Girl:  \n\n 4) Encoding the data \n This is the feature extraction step. In order to specify to HTK the nature of the audio data (format, sample rate, etc.) and feature extraction parameters (type of feature, window length, pre-emphasis, etc.), create a configuration file (config) as follows: \n # Coding parameters \n SOURCEFORMAT = WAV \n TARGETKIND = MFCC_0_D_A \n TARGETRATE = 100000.0 \n SAVECOMPRESSED = T \n SAVEWITHCRC = T… \n\n  Read more… 725 more words  \nThis is what I am looking for!!"], "link": "http://geekmusfir.wordpress.com/2012/02/16/133/", "bloglinks": {}, "links": {"http://orangegeek.wordpress.com/": 2}, "blogtitle": "Geekmusfir"}, {"content": ["An overcomplete basis has the number of basis vectors  greater than the dimensionality of the input, and the representation of an input is not a unique combination of basis vectors. Overcomplete representations have been advocated because they have greater robustness in the presence of noise, can be sparser, and can have greater flexibility in matching structure in the data. Overcomplete codes have also been proposed as a model of some of the response properties of neurons in primary visual cortex. Overcomplete bases is expected to yield  better approximation of the underlying statistical distribution of the data and can thus lead to greater coding efficiency. This can be viewed as a generalization of the technique of independent component analysis and provides a method for Bayesian reconstruction of signals in the presence of noise and for blind source separation when there are more sources than mixtures. Initially the technique might seem to contradict with the concept of sparseness due to the increased number of analytical coefficients. But the increased dimensions produces extra degrees of freedom which can be exploited to increase the sparsity of the set of coefficients. Thus only those coefficients that deemed significant are evident in the representation. \n This type of coding forms the basis for what is called the ‘Holy Grail’ of Audio coding called the Object coding which can be seen as a footstep towards musically intelligent acoustic coding."], "link": "http://geekmusfir.wordpress.com/2012/02/12/overcomplete-basis-for-sparse-coding/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1}, "blogtitle": "Geekmusfir"}, {"content": ["Here we will consider a situation where N number of soldiers have to be tested for a particular disease using a sensitive but an expensive blood test. If blood samples from different soldiers were grouped together, the test would be sensitive enough to declare a positive if any of the soldier was infected. If there are K soldiers and where K>> then M = N measurement is to be done. If K=1 (priori) then M=log2 (N) is possible. Here global measurement is taken which is then followed by a reasoning algorithm. This was proposed by two economist during the Second World war for the screening of soldiers infected with syphilis. The proposal was to put the blood samples together as few people were likely to be infected by Syphilis, this saves tests on average. Though test was not put into practice the discussions on the subject is still being continued!! A similar principle is applied in compressive sensing. \n  \n The signal is projected onto a random signal of equal length. Each projection refers to a measurement. Each random signal used for measurement in the view of Fourier Series is a linear combination of several frequency component thus is equivalent to the extraction of information regarding several frequencies of the original signal. With adequate measurement the signal can be reconstructed using the L-1 norm optimization algorithm. The accuracy obtained by this is remarkable but is limited to a very strict condition. The signal should be sparse in terms of ‘Information content’. Mathematically the number coefficients representing the signal must be small. Luckily most of the signals in nature satisfy this requirement and that is the reason why signals are compressible."], "link": "http://geekmusfir.wordpress.com/2011/12/30/compressed-sensing-an-overview-2-group-testing/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1}, "blogtitle": "Geekmusfir"}]