[{"blogurl": "http://www.genomicslawreport.com\n", "blogroll": [], "title": "Genomics Law Report"}, {"content": ["Sara Huston Katsanis, MS is an Associate in Research at the Institute for Genome Sciences & Policy at Duke University. \n On September 5, 2012, a coordinated release of 30 articles in Nature , Cell , Science , Genome Research , Genome Biology  and other journals published the long-awaited findings of The Encylopedia of DNA Elements (ENCODE) Consortium. The press coverage of ENCODE data is deafening at this point, and ENCODE’s relevance to GLR readers may not be immediately apparent. \n Across the U.S., numerous groups are challenging the integration of CODIS profiles (sometimes called “DNA Fingerprints”) into the routine booking procedures upon arrest for certain crimes (depending on the state), placing genetic profiling among other standard procedures such as fingerprinting and mug shot photographs. The GLR has covered these legal challenges previously (including here , here , and here ). \n On September 19, 2012, the Ninth Circuit sitting en banc heard oral arguments in Haskell v. Harris (formerly Haskell v. Brown ) challenging California’s Proposition 69 (for the GLR’s previous coverage, see here ). This week, the Electronic Frontier Foundation, or EFF, filed a brief with the Ninth Circuit asking the court to take the recently published ENCODE findings into consideration, explaining on the EFF blog that ENCODE represents: \n ground-breaking new research that confirms for the first time that over 80% of our DNA that was once thought to have no function, actually plays a critical role in controlling how our cells, tissue, and organs behave…[ENCODE] should have broad ramifications for federal and state DNA collection programs. \n With headline after headline after headline seemingly providing ample ammunition–opponents of DNA profiling of arrestees are taking aim at the constitutionality of CODIS profiles. Those opponents contend that the portions of the genome once disregarded as mere non-protein-coding DNA (ncDNA, or, as the unfortunate phrase goes, “junk DNA”) have been upgraded by ENCODE to “functional” portions of the genome. Though that claim is probably more robustly supported by the hype of ENCODE than ENCODE’s actual findings , opponents of DNA profiling are nevertheless using ENCODE’s findings to argue that CODIS profiles relay far more than just identification information and that, under a totality of the circumstances analysis (which is the legal argument that multiple courts in Haskell v. Harris have, thus far, used to find California’s policy of DNA fingerprinting of felony arrestees constitutional), the interests of the government are far outweighed by privacy interests of individuals not yet convicted. \n As two scholars independent of the forensic science community but committed to the ethical, legal, and social implications of genome sciences, we investigated what is currently known about the current and recommended CODIS markers. Our research, conducted in October 2011 on the current draft of the human genome (hg19), was published in the Journal of Forensic Sciences within a week of the ENCODE publications and was cited by the California Attorney General in its reply to the EFF brief in Haskell v. Harris . \n In our Technical Note , “ Characterization of the Standard and Recommended CODIS Markers ,” we found no evidence that CODIS genotypes are causative or predictive of known phenotypes. In the Letter , one of us urged the avoidance of the phrase “junk DNA.” It is of immediate importance and interest to try to reconcile the ENCODE publications with our understanding of CODIS, both because of the professional arguments that have followed the ENCODE publications and because of, as the EFF’s brief demonstrates, the inevitable use of ENCODE’s data and hype to attempt to sway lawmakers, courts and jurors with respect to the appropriateness of DNA fingerprinting. 1 \n A brief introduction to ENCODE and CODIS is necessary before we explain that, while ENCODE (and the large body of scientific work developed prior to and in parallel with ENCODE) may have revealed that the genomic regions including the CODIS markers have some functionality, ENCODE has not demonstrated that CODIS genotypes have any known functionality or that the resulting CODIS profiles have any known direct positive or negative predictive value for inferring phenotypes. \n A brief introduction to ENCODE and CODIS . ENCODE, the Encyclopedia of DNA Elements , is a federally supported, international research collaboration aimed at better understanding and cataloging the “functional” elements of the genome and is an important follow-up and supplement to the Human Genome Project . \n CODIS, the Combined DNA Index System , is a DNA database established by the FBI pursuant to congressional authorization by the DNA Identification Act of 1994. Since then, a number of federal statutes have authorized the collection of a DNA sample and creation of DNA profiles from individuals convicted of felonies. Similar databases and collection statutes exist worldwide, with Life Corporation ($LIFE) recently estimating that, “to date, 44 countries have now implemented criminal offender DNA database programs with a combined offender sample pool of 40 million and growing.” In the United States, the federal statutory authority expanding DNA profiling from those convicted of any federal felony to those arrested and charged with particular felonies is The DNA Fingerprint Act of 2005. Since its passage, more than half of the states have passed arrestee DNA Database laws. \n The DNA profiles used in CODIS consist of genotypes at a standard panel of 13 markers, all short tandem repeats or STRs. The consideration of an additional 11 STRs is ongoing, which could soon result in a standard profile consisting of genotypes at 24 markers. The statutory authorization for CODIS limits the DNA analysis to discovery of identification information and precludes DNA analysis that would disclose phenotypic information (such as an individual’s appearance or health conditions), a point reiterated by the Department of Justice’s Final Rule . \n  \n What does ENCODE currently mean for CODIS? The recent news of the functional significance of certain non-protein-coding regions of the genome has snowballed, in part thanks to some questionable constructions of ENCODE’s actual findings, into assumptions that the CODIS markers (which are located in non-protein-coding regions of the genome) are–or might be–predictive of individual traits. This is largely a result of the misguided equating of “marker” with “genotype.” \n Even prior to ENCODE, it was a well-known fact that many of the CODIS markers are positioned within genomic regions associated with known traits. Some markers are even located within introns of genes with demonstrated causal relationships to known traits. And some of these genes are listed in OMIM, the Online Mendelian Inheritance in Man database, which to geneticists means that the genes may be associated with disease. \n However, the genotypes of the CODIS markers (that is, the specific repeat lengths of As, Cs, Gs and/or Ts at the CODIS markers) have no known association (either statistical or causal) with any phenotype. They remain understood as “polymorphisms,” even now that we know (or perhaps have re-learned, thanks to ENCODE), that the genes and genomic regions in which those markers occur may be largely functional (in the broad sense of that word). These genotypes could be in linkage disequilibrium with mutations associated with phenotypes, meaning that a genotype would be near enough to a mutation to be a statistical harbinger for that mutation. One marker, indeed, has a documented weak association of schizophrenia with a particular repeat length, but the association is so weak that the predictive value is negligible. That is, even if the police know that a person has this repeat-length genotype, the police could not predict whether that person is schizophrenic. \n CODIS genotype frequencies do vary by race and ethnicity, and to the extent that phenotypes also vary by race or ethnicity, CODIS profiles could indirectly be used to infer race and/or ethnicity and by extension could then be used to infer phenotypes. However, the statistical correlations are crude at best, as these markers are not robust ancestry informative markers (AIMs). Also of note, CODIS profiles routinely test for a polymorphism in the amelogenin gene that varies on the X- and Y- chromosomes. The genotype for amelogenin, therefore, (in most, but not all, cases) confers sex. But most important to the legal challenges at hand, the limited phenotypic information inferred from ameloginin or ancestry estimation is already decipherable from mug shot photos, so its redundant availability in the form of CODIS profiles is, or at least should be, unlikely to cause any notable controversy. \n The bottom line is that knowing a person’s unique 13- or 24-marker profile at the genomic sites used by CODIS does not, to the best of our current knowledge, allow reliable, valid inference of anything more than identity (aside from sex) without performing additional analyses and drawing additional inferences from those analyses (e.g. estimating ancestry from the CODIS genotypes and subsequently performing analyses to infer phenotypes from those ancestry estimates). Importantly, the statutes establishing CODIS expressly prohibit the use of CODIS profiles for analysis other than identity. \n A shift in focus is needed . At this time, the courts (including the Ninth Circuit) hold the future of CODIS, and the expanded use of DNA-based technologies in law enforcement, in their hands. It is essential that the courts consider the constitutionality of DNA collection upon arrest within the context of existing scientific knowledge (and not conjectures driven by press releases). A clear understanding of the science, as presented by ENCODE and elsewhere, indicates that the real focus of the legal challenges to DNA profiling upon arrest should rest with the collection and retention of the DNA and the potential for future additional uses of those samples aside from CODIS and beyond identification, rather than an obsession with yet-to-be-discovered direct phenotypic predictive value of the current CODIS markers. That said, the choice of markers used by law enforcement must be flexible enough to respond to concerns of functionality that may be revealed through future scientific research; but, again, the existing set of markers – as far as we know today – do not convey information directly other than identity. \n The expanded use of DNA in law enforcement remains a concern for some of us in regards to the perpetuation of racial disparities of the CODIS database , the questionable utility of the expanded database in solving crimes and the appropriate allocation of resources for solving crimes and reducing evidence backlogs. \n Those are all important issues that should inform the ongoing conversation over the future of CODIS and similar databases worldwide. But to effectively have that conversation, we must first stop dwelling upon the currently nonexistent functionality of CODIS genotypes and shift the conversation back to the decision at hand – whether the collection and retention of DNA samples from innocent individuals is both constitutionally permissible and represents appropriate public policy. \n ________________________________ \n 1 The inevitable use of ENCODE’s data and hype is not limited to the issue of DNA fingerprinting but includes opposition to evolution (For further reading, see here and here )."], "link": "http://www.genomicslawreport.com/index.php/2012/09/21/encode-codis-and-the-urgent-need-to-focus-on-what-is-scientifically-and-legally-relevant-to-the-dna-fingerprinting-debate/", "bloglinks": {}, "links": {"http://www.fbi.gov/": 2, "http://blogs.nature.com/": 1, "http://www.duke.edu/": 1, "http://www.fsijournal.org/": 1, "http://www.genomicslawreport.com/": 6, "http://www.sciencemag.org/": 1, "http://onlinelibrary.wiley.com/": 2, "http://www.genomeweb.com/": 1, "http://www.genome.gov/": 1, "http://www.nature.com/": 2, "http://www.dnaresource.com/": 1, "https://www.eff.org/": 1, "http://news.pennmedicine.org/blog": 1, "http://www.usatoday.com/": 1, "http://www.nih.gov/": 1, "http://www.nytimes.com/": 1, "http://www.google.com/": 1, "http://arstechnica.com/": 1}, "blogtitle": "Genomics Law Report"}, {"content": ["The latest chapter in the Myriad gene patent litigation was written yesterday, with the Federal Circuit issuing its much anticipated opinion (pdf) after rehearing the case following the Supreme Court’s unanimous decision earlier this year in Prometheus v. Mayo . \n Or perhaps we should say that the latest chapter was “rewritten” as, in a move that surprised approximately nobody, and as we predicted earlier this spring , the Federal Circuit reached precisely the same result in its opinion today as it did last July when it issued its first substantive ruling in the Myriad litigation . Below, we examine how the Federal Circuit applied Mayo to Myriad , what the next step in the Myriad litigation is likely to be (spoiler alert: it’s another appeal) and why we think the final opinion in this case, whenever it arrives and whatever it says, might not matter all that much. \n Applying Mayo to Myriad . As mentioned, the only major change since the last time the Federal Circuit ruled in Myriad , and the reason for the re-hearing, was the Supreme Court’s decision earlier this spring in Mayo . \n However, Mayo was about method patents and the boundary between a patent-eligible method and a law of nature. It was not about product patents or the product of nature doctrine. Since the Federal Circuit had already invalidated all but one of Myriad’s method patents even before the Supreme Court tightened the criteria for method patents in Mayo , it was hard to see much of substance changing the second time around. \n The Federal Circuit did not disappoint. \n Indeed, comparing the two Federal Circuit opinions reveals that, despite checking in at a hefty 106 pages, this week’s opinion varies little in form, and even less in substance, from the 105-pager penned last summer. Here, for example, is a comparison of the official holding of the case, with new text highlighted in blue and old text struck through in red (a complete comparison of the two opinions is also available here   (pdf) ) : \n On the threshold issue of jurisdiction, we affirm the district court’s decision to exercise declaratory judgment jurisdiction because we conclude that at least one plain-tiff, Dr. Harry Ostrer, has standing to challenge the validity of Myriad’s patents. On the merits, we reverse the district court’s decision that Myriad’s composition claims to “isolated” DNA molecules cover patent-ineligible products of nature under § 101 since  because each of the claimed molecules as claimed do not exist in nature  represents a nonnaturally occurring composition of matter . We also reverse the district court’s decision that Myriad’s method claim to screening potential cancer therapeutics via changes in cell growth rates of transformed cells is directed to a patent-ineligible scientific principle. We , however, affirm the court’s decision ,  however, that Myriad’s method claims directed to “comparing” or “analyzing” DNA sequences are patent ineligible; such claims include no transformative steps and cover only patent-ineligible abstract, mental steps. \n Substantively, the Federal Circuit reached the exact same result as last time around: one plaintiff (Dr. Ostrer) continues to have standing in the eyes of the court, allowing it to reach the merits of the case and affirm its position that, Mayo notwithstanding, (1) Myriad’s gene patents (whether claiming cDNA or isolated DNA) are valid, (2) its diagnostic method patents are invalid and (3) its separate theareputic screening method patent is valid. \n Mayo , Myriad and Gene Patents. From the public’s perspective, the most captivating aspect of the Myriad litigation from the very start has been the so-called “gene patents.” The issue is whether gene patents – or, more technically, compositions of matter comprising isolated DNA molecules – patent-eligible under §101 of the Patent Act or patent-ineligible under the longstanding “products of nature” doctrine. \n Despite the fact that Mayo dealt with process or method patents, and not product patents, both the majority opinion and the dissent attempted to analyze whether and how Mayo might inform the court’s reasoning with respect to the patent-eligibility of isolated DNA sequences. \n According to Judge Lourie’s majority opinion, Mayo was simply not applicable: \n The principal claims of the patents before us on remand relate to isolated DNA molecules. Mayo does not control the question of patent-eligibility of such claims. They are claims to compositions of matter, expressly authorized as suitable patent-eligible subject matter in §101. As to those claims, the issue of patent-eligibility remains, as it was on the first appeal to this court, whether they claim patent-ineligible products of nature. (Lourie, 38) \n Despite the “valuable insights” provided by Mayo , Judge Lourie’s opinion reached the same conclusion as last summer: isolated DNA molecules are not found in nature, do not represent products of nature and, therefore, are patent-eligible. \n In her concurrence, Judge Moore reiterated that isolated DNA represented a close call in the abstract, but was clearly patent-eligible in light of the historical context: \n If I were deciding this case on a blank canvas, I might conclude that an isolated DNA sequence that includes most or all of a gene is not patentable subject matter. The scope of the law of nature/manifestation of nature exception was certainly enlarged in  Prometheus . But we do not decide this case on a blank canvas…There are no thousands of patents with claims to isolated DNA, and some unknown (but certainly large) number of patents to purified natural products…we must be particularly wary of expanding the judicial exception to patentable subject matter where both settled expectations and extensive property rights are involved. (Moore, 13-14) \n Then there was Judge Bryson, who agreed with the majority on the method claims and on the patentability of cDNA, but dissented on isolated DNA. Judge Bryson’s dissenting opinion provided a window into why some commentators – as well as the plaintiffs – speculated that Mayo might call for a different result with respect to Myriad’s gene patents. Here, quoted at some length, is Judge Bryson’s interpretation of how Mayo ought to have altered the court’s analysis of the patent-eligibility of isolated DNA sequences: \n In Mayo , which involved method claims…the [Supreme] Court found that the method was not directed to patent-eligible subject matter because it contributed nothing “inventive” to the law of nature that lay at the heart of the claimed invention…In concluding that the claims did not add “enough” to the natural laws, the Court was particularly persuaded by the fact that “the steps of the claimed processes…involve well-understood, routine, conventional activity previously engaged in by researchers in the field.” \n Just as a patent involving a law of nature must have an “inventive concept” that does “significantly more than simply describe…natural relations,”… a patent involving a product of nature should have an inventive concept that involves more than merely incidental changes to the naturally occurring product. In cases such as this one, in which the applicant claims a composition of matter that is nearly identical to a product of nature, it is appropriate to ask whether the applicant has done “enough” to distinguish his alleged invention from the similar product of nature. Has the applicant made an “inventive” contribution to the product of nature? Does the claimed composition involve more than “well-understood, routine, conventional” elements? Here, the answer to those questions is no. \n Neither isolation of the naturally occurring material nor the resulting breaking of covalent bonds makes the claimed molecules patentable….The functional portion of the composition—the nucleotide sequence—remains identical to that of the naturally occurring gene. \n The majority suggests that I have “focus[ed] not on the differences between isolated and native DNAs, but on one similarity: their informational content.” In light of Mayo , that approach seems appropriate. (Bryson, 14-16, internal citations omitted) \n The other two Federal Circuit judges declined to follow Judge Bryson’s extension of the Supreme Court’s analysis in Mayo from laws of nature to products of nature. Still, the roadmap that Judge Bryson laid out – specifically that an isolated DNA sequence lacks an inventive product or process to distinguish it from its naturally-occurring counterpart, and that the two are identical in their informational content rendering the isolated DNA not patent-eligible – seems to be one that the Supreme Court might plausibly follow if it (a) agrees to hear Myriad following the inevitable appeal and (b) agrees that isolated DNA sequences representing human genes are not patent-eligible. \n What Myriad Means Now. As for what the Federal Circuit’s most recent opinion means for the moment, we think the answer is an unequivocal “nothing new.” The Federal Circuit’s ruling remained substantively unchanged post- Mayo , a result which was entirely expected. \n If that outcome represents a “ win for Myriad ,” as has been claimed, it is only because the status quo has been preserved for another year. For a company that is currently thriving – despite the ongoing litigation, Myriad recently reported that its BRACAnalysis revenues topped $400 million during the company’s most recent fiscal year , representing a 15% increase over the previous year – maintaining the status quo probably is a good thing, at least in the short term. \n The near-certain next step in the Myriad litigation, as it always seems to be, is another appeal, either en banc to the entire Federal Circuit and/or to the Supreme Court. The Supreme Court already granted certiorari once, albeit briefly, and given that court’s recent interest in high-profile patent cases (e.g., Bilski and Mayo ) and Myriad’s even higher profile, there’s certainly a strong possibility the Supremes will agree to hear the case. If so, a resolution on the merits would appear most likely in 2013, with 2014 as an outside possibility. \n Myriad’s Long-Term Implications: Watching the Watchers . Looking ahead, it appears increasingly unlikely that Myriad’s denouement, when it finally arrives in 2013 or 2014, will produce a significant effect one way or the other on either Myriad or the personalized medicine industry. We think this is likely to be true regardless of the litigation’s substantive outcome. \n For Myriad, win or lose in court, its challenged patents will expire by the end of 2015. But the company’s additional patents (the litigation involves only a small minority of Myriad’s overall BRCA portfolio), its decades of experience as the sole provider of clinical BRCA diagnostic testing and its proprietary database of BRCA mutation information should allow Myriad to comfortably maintain its advantage in the marketplace against would-be direct competitors of clinical BRCA diagnostic testing. \n More broadly, competition for single-gene diagnostic providers like Myriad is expected to increase thanks to a growing cohort of companies deploying next-generation sequencing platforms to develop multiplex or whole-genome diagnostic and interpretive products. The price for these broad-based products is expected to rival what Myriad and other similar companies currently charge to analyze only one or two individual genes. And the technology employed by these companies – which include Genomic Health, Foundation Medicine, GenomeQuest, Ingenuity, Personalis, Silicon Valley Biosystems and many, many others – may very well invent around any Myriad-style gene patents on isolated DNA sequences that manage to survive both legal challenge and patent expiration, although that proposition has yet to be tested in court. \n With gene patents unlikely to pose a threat, and diagnostic method patents seriously weakened post- Mayo (as affirmed by the latest Myriad decision), does the ultimate outcome in Myriad much matter at this point for the personalized medicine industry? \n Not so much, in our view. While the case could still carry important and long-lasting ramifications for the patent-eligibility of certain products, particularly if the Supreme Court utilizes Myriad to clarify more than a century of convoluted “product of nature” jurisprudence, the greater impact – at least as far as the personalized medicine industry is concerned – is likely to come from the public and political reaction to the case. \n One interesting change in the Federal Circuit’s opinion this time around, as compared to last summer, was the lengths to which the court went to clarify what Myriad is not about, at least as far as the court is concerned: \n  It is not about whether individuals suspected of having an increased risk of developing breast cancer are entitled to a second opinion. Nor is it about whether the University of Utah, the owner of the instant patents, or Myriad, the exclusive licensee, has acted improperly in its licensing or enforcement policies with respect to the patents. The question is also not whether is it [sic] desirable for one company to hold a patent or license covering a test that may save people’s lives, or for other companies to be excluded from the market encompassed by such a patent – that is the basic right provided by a patent, i.e., to exclude others from practicing the patented subject matter. (Lourie, 37) \n  And again: \n Whether [isolated DNA’s] unusual status as a chemical entity that conveys genetic information warrants singular treatment under the patent laws as the district court did is a policy question that we are not entitled to address….Congress is presumed to have been aware of the issue, having enacted a comprehensive patent reform act during the pendency of this case, and it is ultimately for Congress if it wishes to overturn case law and the long practice of the PTO to determine that isolated DNA must be treated differently from other compositions of matter to account for its perceived special function. (Lourie, 49-50) \n Even if the Federal Circuit is intent in remaining above the political fray, the fact of the matter remains that the special status of gene patents – and issues like second opinion testing and exclusive licensing regimes – are exactly why the Myriad litigation was brought in the first place, and what it is ultimately about. \n Breast cancer remains, unfortunately, a widespread disease, affecting more than 1 out of every 10 women born today . Genetic tests can reliably indicate whether a woman is at such a greatly increased risk of developing breast cancer, for example due to deleterious genetic mutations in her BRCA-1 and/or BRCA-2 genes, that she should consider a serious medical intervention such as a prophylactic mastectomy. Patents awarded on the BRCA-1 and BRCA-2 genes, as well as on related diagnostic methods, allowed Myriad Genetics to develop a diagnostic test which generates more than $400 million dollars in annual revenue, and is widely accessible to women in this country and reimbursed by most insurers. At the same time, the exclusivity provided by those same patents means that the woman is unable to obtain a confirmatory genetic test before choosing to undergo serious surgery. \n This leads to a debate that is easy to understand. These patents argue the plaintiffs, “ restrict both scientific research and patients’ access to medical care .” On the other hand, argue patent proponents, the government’s “long-term policy of protecting isolated DNA molecules has resulted in an explosion of innovation in the biotechnology industry…Holding isolated DNA not patentable would destroy long settled industry expectations…” and do irreparable damage to that very same industry. (Lourie, 22) \n At root, this is what Myriad is and always has been about – not arguments about whether isolated DNA sequences should be patent eligible because they are (or are not) akin to elemental lithium or a leaf on a tree or the fine distinctions of where and how chemical bonds are cleaved. Myriad is a touchstone for the public, the media, industry and policymakers not for its legal holding but for the manner in which it embodies our continuing struggle to balance the benefits and costs of personalized medicine. \n The future of personalized medicine hinges upon the ability to strike the appropriate balance between the desire of patients, providers and payers for broad and affordable access to personalized medicine products against the demands of the corporations, investors and shareholders who require a return on the capital that must be invested to produce those very same personalized medicine products. And patents are only one piece of the puzzle. The same factors are also at play as we seek to overhaul reimbursement regimes and regulatory structures to accommodate personalized medicine. \n Which is why, in the end, what really matters in Myriad is not whether any of the specific patents stand or fall. What matters at this point is how the public and policymakers respond to Myriad as they seek to update legal, regulatory and reimbursement regimes in 2013 and beyond. The final legal result, whenever it is handed down, is likely in the end to be little more than a footnote to that conversation."], "link": "http://www.genomicslawreport.com/index.php/2012/08/17/applying-mayo-to-myriad-latest-decision-brings-no-new-news/", "bloglinks": {}, "links": {"http://www.fiercebiotech.com/": 1, "http://www.cancer.gov/": 1, "http://www.aclu.org/": 1, "http://www.genomeweb.com/": 1, "http://www.genomicslawreport.com/": 11}, "blogtitle": "Genomics Law Report"}, {"content": ["Amit Bhagwandass is a rising third-year student at University of North Carolina School of Law . \n New rules adopted by the Federal Communications Commission (FCC) have an appreciable impact on the way that hospitals, nursing homes and other inpatient and outpatient health care providers will monitor their patients in the future. The new FCC rules enable the use of Medical Body Area Networks (MBANs). MBANs are low-power wideband networks consisting of multiple body-worn sensors that transmit various patient data to a control device that collects data from the sensors. \n Wireless devices operating on the MBAN spectrum can be used to continuously monitor a patient’s health by measuring indicators such as blood glucose levels, blood pressure and electrocardiogram results. Additionally, wireless health devices can include mobile devices and associated applications of increasing relevance to consumer health and personalized medicine, such as mobile-device enabled sensors that monitor vital signs for any number of traits or conditions like blood pressure, glucose levels or even the early signs of an asthma attack . \n Among the benefits of MBAN use are improved patient outcomes and comfort due to increased mobility as patients are untethered from the cables that restrict them to a hospital bed. Additionally, there is decreased risk of hospital- acquired infection for patients . Furthermore, wireless devices using MBANs lower costs by giving physicians real-time and accurate data and allowing them to intervene prior to more drastic deterioration. This creates more opportunities for preventative care and continuous monitoring of chronic conditions . It has been estimated that wireless monitoring technology could save as much as $197 billion over the next 25 years in the United States. 1 \n While it is likely that the majority of the early utilization of MBANs will be on an inpatient basis, in-home use of MBANs for monitoring patients with chronic illness will likely increase as the technology develops . At the FCC’s June 6, 2012 mHealth Summit, FCC Chairman Julius Genachowski announced that the FCC intends to amend its rules to create more flexibility for experimental uses of the spectrum for wireless health care technologies . \n In addition to the FCC’s oversight of MBAN broadband networks, MBAN equipment will also generally be required to gain approval or clearance from the U.S. Food and Drug Administration (FDA) if such equipment qualifies as a medical device . The FDA and FCC have jointly committed to working together to clarify and streamline the regulatory processes for evaluating the safety and efficacy of wireless-enabled medical devices , including MBANs and other mobile devices, while encouraging innovation and affording the public the potential benefit of these devices. In 2007 draft guidance entitled “ Radio Frequency Wireless Technology in Medical Devices ,” the FDA commented that wireless medical device manufacturers should maintain wireless quality of service, wireless coexistence and the integrity and security of data transmitted wirelessly. \n Among the concerns facing the FDA as they develop guidelines for MBAN manufacturers is the vulnerability of wireless medical devices to hacking. The Information Security and Privacy Advisory Board (ISPAB), which advises the Office of Management and Budget, recently proposed that the FDA or another federal agency assess the security of medical devices before they are sold . Additionally, the Government Accountability Office (GAO) is currently preparing a report on the security vulnerability of wireless medical devices . These developments, and continued industry, user and provider education efforts, are likely to significantly influence the FDA’s guidance and enforcement decisions regarding the development and distribution of MBANs and other mobile devices and applications as they continue to proliferate in coming years. \n Early MBAN proponents have continued to develop the technology , despite the fact that there is no federal reimbursement for MBAN utilization and some concerns exist regarding their implementation. Among the concerns is the risk that harmful disturbance or interference from other frequency bands will prevent the accurate transmission of the medical data through MBANs. In order to mitigate this risk, the FCC will require registration for MBAN use at health care facilities . Furthermore, the FCC does not find the risk of interference threatening because MBAN devices may operate over relatively short distances and at a low power, which decreases the risk of interference disrupting the transmission of medical data. In any event, it is likely that the FDA will address this risk as it develops standards for the approval of MBAN equipment. \n In addition to the FCC and the FDA overlay, MBANs also present significant HIPAA compliance concerns, as well as other data privacy concerns, particularly with respect to the security of the sensitive personal health data being transmitted by such devices . Health care providers and others utilizing or contemplating the use of MBANs at their facilities, and companies developing MBANs or other innovative wireless medical devices and applications, should consult with counsel to ensure that they are in compliance with the FCC and FDA rules, HIPAA and other federal and state regulations. \n ______________________________ \n 1  Robert Litan, Vital Signs via Broadband: Remote Monitoring Technologies Transmit Savings , Better Health Care Together Coalition, October 24, 2008."], "link": "http://www.genomicslawreport.com/index.php/2012/08/08/removing-the-cables-new-fcc-rule-paves-way-for-utilization-of-wireless-medical-technology/", "bloglinks": {}, "links": {"http://www.genomicslawreport.com/": 1, "http://www.gereports.com/": 1, "http://www.natlawreview.com/": 1, "http://csrc.nist.gov/": 1, "http://mobihealthnews.com/": 1, "http://www.mwe.com/": 2, "http://www.unc.edu/": 1, "http://www.fcc.gov/": 5, "http://www.informationweek.com/": 1, "http://online.wsj.com/": 1, "http://www.fda.gov/": 2}, "blogtitle": "Genomics Law Report"}, {"content": ["Last week, personal genetics company 23andMe announced that it had formally delivered the first round of documentation to the U.S. Food and Drug Administration (FDA) in an attempt to receive 510(k) clearance for its consumer product. \n 23andMe declared itself “first in the [ direct-to-consumer (DTC) genetic testing] industry to announce it is working towards FDA clearance.” That first followed another first for the company earlier in the summer: 23andMe’s first patent, which covers a method of predicting susceptibility to Parkinson’s Disease . \n I sat down last week with The Burrill Report to discuss 23andMe’s recent activities and their implications for the future of DTC genetic testing and personalized medicine . You can listen to the complete podcast here ."], "link": "http://www.genomicslawreport.com/index.php/2012/08/06/23andme-seeks-fda-clearance-podcast/", "bloglinks": {}, "links": {"https://www.23andme.com/": 1, "http://www.burrillreport.com/": 3, "http://www.fda.gov/": 1, "http://www.genomicslawreport.com/": 1}, "blogtitle": "Genomics Law Report"}, {"content": ["The Genetic Information Nondiscrimination Act of 2008 (GINA) is a federal law making it illegal for insurers and employers to acquire and to use genetic information in certain contexts. Specifically, Title II of GINA prohibits employers with more than 15 employees, employment agencies, labor organizations, and joint labor-management training and apprenticeship program committees from using genetic information when making employment decisions (e.g. hiring, firing, promotions, placement, compensation, privileges, seniority, etc). \n The employment discrimination provisions took effect on November 21, 2009, with an air of uncertainty, as the Final Rules implementing Title II of GINA were not issued by the Equal Employment Opportunity Commission (EEOC) until a year later (See 75 Fed Reg 68912-68939  [pdf], issued November 9, 2010) and did not take effect until January 10, 2011. (See previous GLR coverage of GINA Title II here and of GINA generally here ). \n  EEOC v. Nestle Prepared Foods. A recent case reminds us of the evidentiary hurdles generally present in employment discrimination litigation that GINA did not address. In June of 2010, Michael Peel filed a charge of genetic discrimination in employment with the EEOC against his former employer, Nestle Prepared Foods. According to the opinion and order issued on May 23, 2012, by Senior District Judge Hood in EEOC v. Nestle Prepared Foods , 2012 WL 1888130 (E.D. Kentucky, 2012), Mr. Peel’s charge of discrimination was based on “retaliation” and “genetic information.” 1 The charge alleged that during his employment with Nestle Prepared Foods, Mr. Peel was required to complete a “fitness-for-duty” medical examination, that the medical examination included collection of his family medical history, and that his employer terminated his employment within one month of the medical examination. \n GINA defines “genetic information” broadly to include family medical history. Employers and other covered entities may still require employees to undergo medical examinations for job fitness; however, family medical history is not to be involved in such employment medical exams . As Judge Hood’s order notes, Mr. Peel did not elaborate on his allegation of “genetic discrimination” in his complaint to the EEOC, but it subsequently became “clear that that portion of the charge relates to Dr. McLaughlin’s [the private physician to whom Mr. Peel was sent by Nestle] acquisition of Peel’s family medical history.” \n During the administrative handling of Mr. Peel’s charge of discrimination under GINA Title II, the EEOC issued a subpoena directing Nestle to disclose company documents showing employment decisions involving any employee or other person who, at Nestle’s request, was subjected to a medical examination from approximately six months before the alleged incident involving Mr. Peel to the present day, including hiring and firing decisions with respect to such individuals. Nestle refused to produce the evidence, so the EEOC then petitioned the Eastern District Court of Kentucky to enforce the subpoena. \n Senior District Judge Hood rejected the EEOC’s petition to enforce the subpoena, holding that the information that the EEOC sought to obtain was “irrelevant to the charge being investigated.” \n In previous proceedings before a Magistrate Judge, which had ruled in favor of the EEOC and ordered Nestle to comply with the EEOC’s subpoena, the EEOC had argued that a broad review of Nestle’s practices with respect to medical examinations for current and potential employees was relevant to see if the alleged GINA violation in Mr. Peel’s case might also have occurred with respect to other Nestle employees or potential employees. \n In essence, the EEOC, through its investigation of Mr. Peel’s claim of individual disparate treatment, was interested in simultaneously exploring whether there was evidence of systematic disparate treatment. While acknowledging that “it is well established that the EEOC has broad access to evidence that is relevant to a charge being investigated,” and that the relevance standard is to be “construed expansively,” Judge Hood was unprepared to stretch the meaning of “relevant” to the degree requested by EEOC. Or, as Judge Hood put it, to grant the EEOC’s subpoena “would eviscerate the relevance requirement and condone fishing expeditions” (citing EEOC v. K-Mart Corp., 694 F.2d 1055, 1066). Judge Hood explained further that, “while the Court recognizes that it is important for the EEOC to have the ability to investigate possible patterns of discriminatory action, this does not mean that every charge of discrimination justifies an investigation of the employer’s facility-wide employment practices” (citing EEOC v. Burlington N. Santa Fe R.R. , 669 F.3d 1154, 1157-1158). \n The Burden of Enforcing GINA. As one of us pointed out previously, 2 cases with direct evidence of discrimination are unusual, and most alleged victims have little choice but to try to prove individual disparate treatment claims using circumstantial evidence to show either a pretext or mixed-motive for the employment decision at issue. While GINA expanded the scope of federally prohibited discrimination to include the use of genetic information by certain employers, including family history, GINA did not address the burden shifting involved in establishing that discrimination has actually occurred (See McDonnell Douglas v. Green , 411 U.S. 792 (1973) and Price Waterhouse v. Hopkins , 490 U.S. 228 (1989), respectively) or alleviate other evidentiary burdens of employment discrimination claims. \n EEOC v. Nestle Prepared Foods underscores that even the EEOC – the agency charged with investigating and enforcing GINA’s Title II proscriptions – is not possessed with unrestrained investigatory tools. The opinion, perhaps lending credence to the notion that GINA is more bark than bite, suggests that the EEOC may need to show allegations of discrimination from multiple victims before courts will compel employers, particularly large corporate employers like Nestle, to produce corporate records that would facilitate a broad investigation of potential systematic disparate treatment. It seems likely that the EEOC will need to pursue other lines of inquiry to substantiate such claims (such as interviewing coworkers identified or known by the victim filing the charge of discrimination) and have, as this court indicated is required, “articulable circumstances that suggest the existence of violations beyond those specified” in the original charge before courts force employers to throw open their file cabinets in the name of investigating and enforcing GINA. \n More broadly, the Nestle case is a reminder that GINA remains a relatively new piece of legislation. The most recent enforcement statistics published by the EEOC, which cover fiscal years 2010-2011 , show an extremely modest number of charges of discrimination received by the Commission allege genetic discrimination (201 in 2010, 245 in 2011). Just how modest those numbers are is perhaps more easily appreciated when one considers that the EEOC received nearly 100,000 total charges of discrimination in each of those two years and, as the Nestle case highlights, adding a charge of genetic discrimination to an EEOC complaint is as simple as checking the box on a standard EEOC-provided form. 3 \n Raising awareness and, ultimately, appropriate enforcement of GINA will clearly take both time and a concerted effort by the EEOC and other federal and state authorities. A major part of that effort will include continuing to educate individuals, employers and, yes, even courts about GINA’s requirements and the challenges of identifying and preventing discrimination in the genetic age. \n ______________________ \n 1 The charge also appears to have included discrimination on disability, which is not relevant to the opinion and order. \n 2 Wagner JK. The Genetic Information Nondiscrimination Act of 2008: Minimal protections but maximum publicity. Presented at the ASHG Annual Meeting. Philadelphia, PA 2008. \n 3 The EEOC enforcement data further show that, of the charges of discrimination filed that alleged genetic discrimination, the EEOC investigations led to determinations that there was reasonable cause to believe genetic discrimination occurred in just 13 of those instances. While itself a very low number, the 13 charges exhibiting reasonable cause out of 446 total charges in the most two recent fiscal years is generally in line with the rate at which EEOC finds reasonable cause for discrimination charges more broadly."], "link": "http://www.genomicslawreport.com/index.php/2012/06/20/the-burden-of-enforcing-gina-eeoc-v-nestle-illustrates-one-challenge-in-pursuing-genetic-discrimination-claims/", "bloglinks": {}, "links": {"http://ky.findacase.com/": 1, "http://www.eeoc.gov/": 3, "http://www.genomicslawreport.com/": 5}, "blogtitle": "Genomics Law Report"}, {"content": ["Earlier this week 23andMe, the Silicon Valley-based personal genomics company, was awarded its first patent:  US Patent Number 8,187,811, entitled “Polymorphisms associated with Parkinson’s disease” . \n 23andMe co-founder Anne Wojcicki announced the issuance of the patent via a post on the company’s blog late Monday evening , attempting to strike a tenuous balance between her company’s oft-championed philosophical devotion to providing individuals with “unfettered access to their genomes” and its desire to commercialize the genomic information so many of those very same individuals have shared, free of charge, with 23andMe. With its new patent, 23andMe also injected itself into the middle of what Wojcicki herself described as the “hot debate” surrounding the patentability of “inventions related to genetics.” Wojcicki’s announcement appeared to catch more than a few of the company’s customers by surprise, sparking concern about the company’s intentions on 23andMe’s blog , Twitter and elsewhere, along with rapid and pointed commentaries from Stuart Hogarth  and Madeleine Ball , among others. \n Of the various questions asked of and about 23andMe and its new patent, these may be the three most common:  Where did this patent come from, and why didn’t I hear about it before? What does 23andMe’s patent cover? How is 23andMe going to use its patent? Let’s take each question in turn. \n 1.  Where did this patent come from, and why didn’t I hear about it before?  Just over three years ago, 23andMe announced that it was launching its Parkinson’s Disease Genetics Initiative in collaboration with The Parkinson’s Institute and Clinical Center and The Michael J. Fox Foundation . In the years that followed, the company regularly touted (see, e.g., here , here , here and here ) the scientific progress that it was making, frequently crediting its novel research model which leveraged an engaged customer base willing to freely share not only personal genetic information but also the medical and family history, lifestyle, environmental and other phenotypic data so critical to untangling the complex relationship between genes, environment and traits. \n Indeed, in a paper published last summer in PLoS Genetics in which 23andMe confirmed several existing genetic variants associated with late-onset Parkinson’s Disease (PD) susceptibility and identified two new variants , 23andMe’s research was newsworthy less for its scientific contributions to the understanding of PD than for its validation of the company’s research model. As Chuong B. Do and his 23andMe colleagues wrote, their research: \n …illustrates the ability of web-based methods for enrollment and data collection to yield new scientific insights into the etiology of disease, and it demonstrates the power and reliability of self-reported data for studying the genetics of Parkinson’s disease. \n But for all of the digital ink that 23andMe spilled in the past three years in highlighting both its scientific progress and the broader utility of its web-based research platform , the company maintained a persistent public silence with respect to its concurrent pursuit of intellectual property protection 1 (23andMe’s first provisional patent application was filed in late 2009, the same year it launched its PD initiative). \n To be clear, it’s not as if it was a secret that 23andMe was pursuing a PD-related patent. After all, in keeping with the Constitutional aims underlying the United States patent system , patents and patent applications, and the inventions they purport to describe, are matters of public record. Accordingly, 23andMe’s  patent application , which was filed November 2010 and published June 2011, had been publicly available for nearly a year before the final patent issued, and had during that time been a topic of discussion at academic conferences, in blog posts and in private industry conversations. \n Still, with more than a half million other patent applications published by the PTO in 2011 , and most of 23andMe’s customers having lives and careers outside of personal genomics, the odds were very good that the vast majority of the company’s customers were never going to learn of its patent plans until 23andMe itself made an announcement. \n Which brings us to Monday evening and to our second question. \n 2.  What does 23andMe’s patent cover? One of the oddest aspects of 23andMe’s press release was how vague it was in describing the nature of the company’s patent, along with its failure to provide a patent number or, better yet, a copy of or link to the patent itself. 2 \n Here’s what co-founder Anne Wojcicki wrote instead: \n Our patent, “Polymorphisms Related to Parkinson’s Disease” is expected to issue on Tuesday, May 29, 2012. This relates to our discovery of a variant in the SGK1 gene that may be protective against Parkinson’s disease in individuals who carry the rare risk-associated LRRK2 G2019S mutation. \n Saying that the patent “ relates to our discovery of a variant” (emphasis added) in a Parkinson’s disease gene does not give a reader a very good sense at all of the specific invention covered by 23andMe’s patent. That requires a review of the patent itself, which is available from both the PTO and the  GLR , and in particular the “Claims” section where the invention itself is described. \n Claims in 23andMe’s Issued Patent . The claims section itself is fairly short but, for our purposes, we can shorten it further by focusing on the four key claims, which read as follows: \n 1.   A method for screening a human subject for susceptibility to Parkinson’s Disease (PD), the method comprising: obtaining a nucleic acid sample from the human subject; determining which allele is present in the sample at the polymorphic nucleotide position of SNP rs10513789 (SEQ ID NO: 1); and identifying the human subject as having an increased risk of developing PD if the subject has a T at the polymorphic nucleotide position of rs10513789 (SEQ ID NO: 1). \n 5.  The method of claim 1, further comprising determining which allele is present in the sample at one or more of the polymorphic nucleotide positions selected from the group of SNPs consisting of rs6599389 (SEQ ID NO: 2), rs873785 (SEQ ID NO: 3), rs11248060 (SEQ ID NO: 4), rs6812193 (SEQ ID NO: 5), rs4130047 (SEQ ID NO: 6), rs7451962 (SEQ ID NO: 7) and rs4397141 (SEQ ID NO: 8). \n 6.  A method for generating a prognosis of a human subject’s susceptibility to Parkinson’s Disease (PD), comprising: obtaining a genomic sample from said human subject; analyzing the genomic sample to determine which allele is present in the sample at the polymorphic nucleotide position of SNP rs10513789 (SEQ ID NO: 1); storing the determined allele of the sample in a database that includes a set of information related to said subject; correlating the determined allele with an association between the alleles of rs10513789 (SEQ ID NO: 1) and susceptibility to PD in the database; generating a prognosis of the subject’s susceptibility to PD based on the correlation; and communicating the prognosis of susceptibility to a medical practitioner. \n 7.  The system of claim 6 wherein the set of information related to said subject comprises family medical history, diet, exercise and medical history of said subject. \n To put it in slightly simpler terms, 23andMe’s patent claims a method of (a) screening human subjects for PD susceptibility based on examining variations at eight separate positions in the human genome 3 and (b) generating a separate prognosis for PD susceptibility developed by considering genetic variation 4 alongside family medical history, diet, exercise and medical history, and then communicating that prognosis to the subject’s doctor. \n Or, to simplify even further, this is a patent on one particular method of predicting susceptibility to Parkinson’s Disease. \n The Past and Future of 23andMe’s Patent .  It is important to note that everything we’ve said so far describes only the present state of this single patent as presently granted to 23andMe. The company has indicated that it will “continue to pursue patents that we believe will eventually benefit us all,” but has not publicly expounded upon what, specifically, that might entail. \n As for 23andMe’s first patent, the patent that was issued earlier this week is substantially narrower than the patent that the company sought 18 months ago, as we can see by comparing the claims section from 23andMe’s published patent application (2011/0130337) to that of the issued patent (8,187,811) 5 . In particular, (i) the range of genetic variants covered by the patent has been narrowed, (ii) the claims on primers designed to specifically hybridize to the identified genetic variants have been removed completely and, likewise, (iii) an attempted claim for “a kit for diagnosis or prognosis of PD” based on the identified genetic variants has vanished in its entirety. 6 \n Also gone is claim 10 of 23andMe’s original application, which was clearly the application’s most ambitious claim, and comprised “a method for treating or preventing the development of PD” by “administering to a subject suffering from or identified at risk for PD an agent that modulates expression or activity of a protein” influenced by the one of the identified genetic variants. \n The fact that 23andMe’s patent application was narrowed so significantly should come as no surprise. Despite persistent claims that the PTO’s review process is inadequate to the task, producing questionable and/or overly broad patents (see, e.g., here and here ), it does result in the limiting (and even outright rejection) of numerous patent applications. \n Likely of particular interest to the PTO in reviewing (and ultimately narrowing) 23andMe’s patent application, as co-founder Anne Wojcicki noted in her announcement of the company’s own patent , is the ongoing question “of whether innovations related to genetics can be patented,” which Wojcicki acknowledged remains a “hot debate as evidenced by recent rulings related to Prometheus and Myriad patents.” \n As background, this past July, in Association for Molecular Pathology v. USPTO (aka the Myriad gene patent litigation ), the Federal Circuit held unanimously 7 that Myriad Genetics’ claims on a method to assess cancer susceptibility by examining genetic variations in the BRCA1 and BRCA2 genes were invalid . The court found that Myriad’s claims “recite nothing more than abstract mental steps necessary to compare two different nucleotide sequences” and, therefore, do not constitute patentable subject matter. \n Next, in March of this year, the Supreme Court reached a similar conclusion, also unanimously, in its opinion in Mayo Collaborative Services v. Prometheus Laboratories , holding that Prometheus Laboratories’ claims to methods of administering drugs to treat an autoimmune disease reflected a law of nature and did not constitute a patentable invention . As Justice Breyer put it: \n If a law of nature is not patentable, then neither is a process reciting a law of nature, unless that process has additional features that provide practical assurance that the process is more than a drafting effort designed to monopolize the law of nature itself. A patent, for example, could not simply recite a law of nature and then add the instruction “apply the law.” Einstein, we assume, could not have patented his famous law by claiming a process consisting of simply telling linear accelerator operators to refer to the law to determine how much energy an amount of mass has produced (or vice versa). Nor could Archimedes have secured a patent for his famous principle of flotation by claiming a process consisting of simply telling boat builders to refer to that principle in order to determine whether an object will float. \n Both the Myriad and Prometheus opinions discussed above were published subsequent to the filing of 23andMe’s patent application in November 2010, and there should be little doubt that each played a role in the PTO’s review and narrowing of the PD-related claims 23andMe initially sought. \n As for the future of 23andMe’s current patent, there remains the possibility that its claims will be further limited, or even invalidated entirely, by way of one or more post-grant challenges to the breadth and validity of those claims. Last September, Congress passed the Leahy-Smith America Invents Act (aka patent reform legislation) and, in the process, revised and expanded the options available to third parties to challenge patents following their issuance by the PTO . With relevant litigation still pending (for example, Myriad is currently awaiting additional review at the Federal Circuit level following its remand from the Supreme Court ) and the options for would-be challengers of 23andMe’s patent bolstered by the recent patent reform legislation, the future of 23andMe’s patent is far from secure. \n Of course, with the cost of challenging a patent, whether through the PTO or in court, typically starting at six figures and rising rapidly from there, whether any would-be challengers to 23andMe’s patent actually emerge depends almost entirely on the answer to our third question. \n 3.  How is 23andMe going to use its patent? Patents are frequently mischaracterized as granting the inventor sole ownership and control of the claimed invention. In fact, patents provide a more limited right to exclude others from making, using or selling that invention . As a practical matter, this means that many patents covering (or arguably covering) many “inventions” are never enforced, with actual and potential infringement of untold patents happening every minute of every hour of every day. \n The rubber meets the road when a patent holder — or the assignee, purchaser or licensee of the patent — seeks to prevent what it believes to be an infringing use of the covered invention, which can include suing or threatening to sue the alleged infringer. Inventors profit financially from the patents they awarded primarily in one of two ways:  either by (i) exercising their right to exclude others from using the invention (as Myriad Genetics has done in using its patents on breast cancer genes to develop a lucrative diagnostic product) or (ii) sharing that right with others in exchange for a fee (i.e., licensing). \n 23andMe, while arguably one of the most successful personal genomics companies in terms of consumer uptake and public exposure, is still a business struggling to find its way to profitability. Co-founder and CEO Anne Wojcicki explicitly acknowledged as much in a note sent to customers in early May 8 to clarify yet another change in the company’s pricing structure. “We are not profitable yet,” Wojcicki wrote, “and we need to continue to develop our business model.” \n 23andMe has been working on achieving profitability for a while now, having raised more than $50 million in investor funding (in addition to the tens of millions contributed by Wojcicki, her husband, Google co-founder Sergey Brin , and others to Parkinson’s Disease research with which 23andMe is involved, with some of those dollars flowing back to 23andMe) since the company was founded more than five years ago. \n Naturally, then, 23andMe is exploring all available avenues as it seeks to find a sustainable business model that will return, and ideally multiply, the money its investors have handed to it over the past half decade, including pursuing patents on the results of the research it conducts with the assistance of its customers. \n Still, the company’s patent announcement prompted plenty of questions, in part because of the unmistakable tension in Wojcicki’s statement between the company’s need to demonstrate a commercially viable business model and its desire to provide the public with affordable, unfettered access to their genomes, at times seeming to vacillate between the two. \n “If the follow up work we are now doing with the Scripps Research Institute and the Michael J. Fox Foundation looks promising and moves towards drug development,” Wojcicki wrote, “the patent will be important for a biotech or pharmaceutical company to pursue drug development.” In the very next sentence, however, Wojcicki emphasized that 23andMe believes “patents should not be used to obstruct research or prevent individuals from knowing what’s in their genome. We believe that everyone has a right to know their genomes — their sequence of As, Ts, Cs, and Gs — and should be able to access them should they want to.” \n A diagnostic patent such as the one issued to 23andMe this week may one day be valuable to a pharmaceutical or biotechnology company, although in all likelihood it would first need to be paired with other, stronger patents more directly applicable to a targeted and commercially protectable diagnostic or therapeutic product. But to the extent that 23andMe’s first patent does one day come to represent a commercially valuable asset, as opposed to a scientifically important discovery or invention (depending on your point of view), its value is most likely to rest with its ability to help the party controlling the patent (whether 23andMe or a future pharmaceutical or biotechnology acquirer) prevent others from using the patent invention, in this case a method for predicting PD susceptibility. 9 \n That unavoidable tension helped to spur a flurry of concerned comments in response to 23andMe’s patent announcement, including the following: 10 \n \n Why were we not explicitly told that 23andMe would be pursuing patents on research involving its customers? [ Holly Dunsworth ] \n \n 23andMe responded by pointing to sections of its terms of service and research consent document that referenced its “ intent to pursue intellectual property rights .” The references in those documents to the company’s commercial plans are vague and conditional, with the most explicit showing up in Section 5 of the 23andMe consent document , which states that “ if 23andMe develops intellectual property and/or commercializes products or services, directly or indirectly, based on the results of this study, you will not receive any compensation.” (emphasis added) \n \n How does a patent on a method of determining susceptibility to Parkinson’s Disease (i.e., a diagnostic patent) drive the development of a therapy?  [ Stuart Hogarth ] \n \n In response, 23andMe reiterated Wojcicki’s original comment that “if our continued research on SGK1 offers promise, the patent may be crucial for a pharmaceutical company to take the next step and begin drug development,” which is arguably not much of a response. As mentioned above, the likelihood of the patent as issued being “crucial” to the development of a PD therapy seems slender indeed, but recall that claim 10 of 23andMe’s original patent application, which was explicitly therapeutic in nature, was not allowed by the PTO. \n \n If 23andMe’s core beliefs include an individual’s right to unfettered access to his or her own genetic data, why hasn’t the company publicly committed to using and/or licensing its patent only in accordance with those beliefs? [E.g., Madeleine Ball , Stuart Hogarth , Dave Mackey and Carl Lumma ] \n \n In response, 23andMe reiterated its general philosophy regarding genetic access and patents, but stopped well short of publicly imposing restrictions on how it will use or permit others (including its sought after pharmaceutical or biotechnology partners) to use its patents. As Madeleine Ball notes , prominent technology developers, including Red Hat and Twitter have public policies limiting their enforcement of certain patents. In addition, fellow personal genomics company Navigenics has  long maintained a written policy promising to license on a non-exclusive, non-discriminatory basis any gene patents it may acquire (although Navigenics’ own policy appears to explicitly exclude diagnostic patents of the type issued to 23andMe). \n In addition to the important questions above, here is one more: \n \n Why has 23andMe not been more aggressive in trying to engage its customer base as a partner in its for-profit endeavors? \n \n Rather than continuing the struggle to strike the elusive balance between encouraging individuals to freely give of their genomic and phenotypic data in the name of scientific progress and urging investors to open their wallets wide on the promise of future corporate profits, why not seek to align the two goals by finding a way for 23andMe’s customers to share more directly in the company’s success. As one example, last spring in the journal Science , Mitchell et al.  proposed a novel approach to genomic biobanking based on the trade secret model . After interviewing biobank volunteers, the authors concluded that many healthy participants already understand their participation (contributing genetic information, medical records and other data, answering surveys and questionnaires, etc.) in terms of an exchange, and some in explicitly financial terms. 23andMe could seek to invest their customers and research participants directly in the company’s ongoing success by promising to share a (likely small) portion of the financial proceeds it realized from research and/or commercial partnerships built upon customer-provided data. \n While even a nominal sharing of corporate profits might be the most direct way to ease the tension between soliciting already-paying customers to provide additional data from which 23andMe seeks to profit, as Mitchell et al . note, “the trade-secret model does not require that an exchange take the form of money.” In addition to sharing data with its participants and involving them in the identification of research targets, two things Mitchell and his colleagues suggest and 23andMe has already embraced, the company could take other steps to more clearly align its own interests with those of its customers, including joining the growing movement to promote expanded access to scientific research . Rather than embracing its scorpion nature and erecting walls around its data , it could embrace openness instead, and commit not only to publishing its own research in an open access format but to requiring its commercial partners to do the same as a condition to their receiving access to data supplied by 23andMe’s customers. \n Taking a step back, it is hardly surprising that 23andMe appears to be unsure, at this point in time, as to how exactly it intends to use its newly issued patent. Given the continuing shifts in the company’s business model and the company’s uncertainty as to what value, if any, outside parties will place on the patent (or 23andMe’s future patents) now or ever, 23andMe has a clear interest in keeping its options open. It is also not surprising that the company is proud of earning its first patent, which represents an important and validating milestone for a young company. \n What is surprising is that 23andMe appears to lack a coordinated plan for positioning its patent — a relatively pedestrian diagnostic method patent that, if it ever becomes valuable enough to be challenged, might not survive the challenge — as clearly of secondary importance to what is, at least in this author’s view, unquestionably the company’s most valuable asset: an engaged, enthusiastic and growing community of customers-qua-research-participants who, provided 23andMe can keep from alienating too many of them, represent something much more unique, and inventive, than US Patent number 8,187,811. \n _______________ \n 1 23andMe’s first provisional patent application was filed in late 2009, the same year it launched its PD initiative. Provisional patent applications are not examined by the PTO and, unlike patent applications, are not published. \n 2 In a comment on its blog post two days later , 23andMe did provide the patent number (8,187,811), although not a direct link. \n 3 The first genetic variant — a single nucleotide polymorphism or SNP — is identified in claim 1 by its “rs” or “ r eference S NP” number 10513789; the other seven variants are identified in claim 5. \n 4 Only the first of the eight SNPs (rs10513789) was allowed in claim 6 (the method for generating a multi-factorial prognosis and communicating it to a subject’s doctor), which represents a narrowing of what 23andMe sought in its original application. \n 5 Text in black represents overlap between the application and the issued patent. Text that is blue and underlined represents new text in the issued patent that did not appear in the patent application. Text in red that has been struck through represents text from the patent application that does not appear in the issued patent. And text in green represents text from the patent application that appears in the issued patent but has been moved, with the strikethrough portion representing where that that text appeared in the application and the underlined portion represent where that text appears in the issued patent. \n 6 See claims 2 (related to rs11755699), 6-8 (related to primers) and 9 (related to a diagnostic kit) of the 23andMe patent application. \n 7 While the opinion was not unanimous in its entirety, on the question of the validity of Myriad’s diagnostic method claims the panel held 3-0 that those claims were invalid. \n 8 The note was sent to customers on May 8, 2012, although for reasons unknown it has been given a publication date of January 8, 2012 on 23andMe’s corporate blog and is available only to customers who are logged in to their accounts. A 23andMe representative clarified that the January 8, 2012 post represents a separate communication by the company, also regarding customer pricing models. \n 9 There are other ways in which 23andMe’s patent could be valuable, including as a bargaining chip in future discussions to create patent pools or similar resources designed to prevent patents from impeding the development and provision of personalized medicine. However, this is not an angle that 23andMe has emphasized, preferring instead to focus on the potential direct commercial value of its patent. \n 10 The questions are presented in a combined, condensed and paraphrased format for clarity, with a link provided to the original comment or post."], "link": "http://www.genomicslawreport.com/index.php/2012/06/01/patenting-and-personal-genomics-23andme-receives-its-first-patent-and-plenty-of-questions/", "bloglinks": {}, "links": {"http://www.uspto.gov/": 2, "http://www.navigenics.com/": 1, "http://spittoon.23andme.com/": 13, "http://blog.twitter.com/": 1, "http://del-fi.org/": 1, "http://www.genomicslawreport.com/": 11, "http://www.plosgenetics.org/": 1, "http://www.sciencemag.org/": 1, "https://twitter.com/": 1, "http://www.sughrue.com/": 1, "http://www.usconstitution.net/": 1, "http://www.crunchbase.com/": 1, "https://www.23andme.com/": 8, "http://www.ftc.gov/": 1, "http://www.madprime.org/": 3, "http://patft.uspto.gov/": 1, "http://access2research.org/": 1, "https://www.eff.org/": 1, "http://www.bloomberg.com/": 1, "http://genevalues.wordpress.com/": 2, "http://www.redhat.com/": 1}, "blogtitle": "Genomics Law Report"}, {"content": ["We recently covered the Ninth Circuit’s split decision in Haskell v. Harris , 1 which found DNA Fingerprinting of arrestees pursuant to California’s Prop 69 to be constitutionally sound. We also reported the Minnesota Supreme Court findings in In re Welfare of M.L.M. and State v. Johnson , rejecting challenges of DNA Fingerprinting based on 4th Amendment and Equal Protection grounds. \n An Update from Colorado. An ongoing prosecution, United States v. Fricosu, 2 became the most recent constitutional challenge to DNA fingerprinting upon arrest. The defendant, Ramona Fricosu, had her DNA sampled as part of her arrest pursuant to the DNA Fingerprinting Act of 2005, 42 U.S.C. §14135(a). She filed a motion challenging the constitutionality of the practice, requesting that the court order her DNA sample and CODIS profile be destroyed. Fricosu challenged the constitutionality of the practice on Fourth Amendment grounds. On February 22, 2012, Colorado District Judge Blackburn denied the motion (pdf). \n Specifically, Judge Blackburn noted that only two federal appellate courts have considered the constitutionality of the DNA Fingerprinting Act as it applies to arrestees: the Ninth Circuit ruling of United States v. Pool 3 and the Third Circuit ruling of United States v. Mitchell . 4 As we noted previously , the Ninth Circuit opinion in United States v. Pool has no precedential value, the opinion having been vacated. Judge Blackburn followed the road map set out by the Third Circuit without any notable deviations. Like the Third Circuit, Judge Blackburn applied a totality-of-the-circumstances analysis and considered two separate searches: the DNA sampling and the subsequent creation of the CODIS profile. Quickly dismissing the first search as minimally invasive, Judge Blackburn’s opinion focused on the nature of the second search. \n As has become commonplace in these opinions on DNA fingerprinting, the Judge focused on “junk DNA” and what “junk DNA” can tell us about “physical and medical characteristics.” Judge Blackburn, agreeing with the Third Circuit, reasoned that there is a significant difference in the “amounts of private information” included in a DNA sample and a CODIS profile, the latter of “which at present reveals only identity.” Judge Blackburn was not persuaded by the “potentially nefarious uses to which this information might be put,” citing a lack of evidence that “such hypothetical abuses are either likely or imminent.” Balancing the privacy interests against the government’s legitimate interests in the information, Judge Blackburn found there are sufficient safeguards in the statutes that limit law enforcement uses of the DNA sample to identification purposes and that deter and penalize abuse of law enforcement discretion or misuse of the DNA profiles. \n Mitchell Not Moving on Up. On March 19, 2012, the U.S. Supreme Court denied (pdf) the petition of certiorari in United States v. Mitchell , the Third Circuit opinion upon which the Colorado District Court relied in Fricosu the previous month. Justice Kagan did not take part in the consideration or decision. It seems likely that the Justices are content to let the constitutionality of DNA fingerprinting upon arrest percolate a while longer at the lower court level and will not grant certiorari unless a clear divide among the federal circuits becomes apparent. \n_______________________ \n 1 Haskell v. Harris , — F.3d — (9th Cir. (Cal) 2012) \n 2 United States v. Fricosu , — F.Supp.2d – (2012), 2012 WL 592322 \n 3 United States v. Pool , 2009 WL 2152029 (E.D. Cal, 2009), affirmed by 621 F.3d 1213 (9th Cir. (Cal.) 2010), rehearing en banc granted by 646 F.3d 659 (9th Cir. 2011), opinion vacated as moot by 659 F.3d 761 (9th Cir. 2011) \n 4 United States v. Mitchell , 652 F.3d 387 (3rd Cir. 2011) (en banc), pet. for cert. filed (Nov. 22, 2011)(No. 11-7603, 11A384), cert. denied – S.Ct. – (Mar. 19, 2012)."], "link": "http://www.genomicslawreport.com/index.php/2012/04/02/courts-in-unsettled-territory-turn-to-the-map-available-united-states-v-mitchell/", "bloglinks": {}, "links": {"http://www.genomicslawreport.com/": 6}, "blogtitle": "Genomics Law Report"}, {"content": ["Yesterday, the Supreme Court (as we predicted last week that it might ) GVR’d the certiorari petitions  (pdf) of both parties in the Myriad Genetics case . \n Big news, right? Not really. \n What this means is that the Court G ranted cert in Myriad , but for the limited purpose of V acating the Federal Circuit’s July 2011 decision and R emanding the case to that court for reconsideration in light of the Supreme Court’s decision last week in Prometheus . \n As we wrote last week, there is nothing in Prometheus to suggest that the Federal Circuit should or will change its mind about the method claims it invalidated once before (relating to comparing BRCA gene sequences in cancer patients to sequences in healthy patients to identify deleterious mutations). Its decision upholding Myriad’s claims to methods of evaluating cancer therapies is a closer call, but nothing in Prometheus clearly compels the Federal Circuit to change its mind. \n Finally, Prometheus said nothing at all about product patents, so there’s no good reason to think that the Federal Circuit panel will revisit—let alone reverse—its split (2-1) decision upholding those claims. While some commentators have suggested that there are implications for  Myriad’s products of nature issue in Prometheus’s discussion of the laws of nature question that was central to that case, it’s hard to imagine that the Federal Circuit would discern from Prometheus any command to change its mind on the product claims in Myriad . \n If the Supreme Court were ultimately to accept a second certiorari petition in  Myriad —after the Federal Circuit’s remand decision—which is by no means certain, and is likely to be at least a year in the future, we’ll have plenty of time then to revisit the tea-leaf value of the Court’s laws of nature rhetoric. For now, though, Myriad heads back to the Federal Circuit and the status quo with respect to Myriad’s patents remains unchanged from yesterday."], "link": "http://www.genomicslawreport.com/index.php/2012/03/27/myriad-finally-reaches-the-supreme-court-but-only-for-a-moment/", "bloglinks": {}, "links": {"http://www.supremecourt.gov/": 1, "http://www.genomicslawreport.com/": 6}, "blogtitle": "Genomics Law Report"}, {"content": ["In a strong rebuke to the Federal Circuit, a unanimous U.S. Supreme Court held  (pdf), on March 20, 2012, that Prometheus Laboratories’ claims to methods of administering drugs to treat gastrointestinal autoimmune diseases do not meet the patentable subject matter standard of section 101 of the Patent Act.  The representative claim quoted by the Court recites, “A method of optimizing therapeutic efficacy for treatment of an immune-mediated gastrointestinal disorder” comprising two steps: (a) administering one of a class of drugs (thiopurines) and (b) determining the level of a specified metabolite, “wherein” a level below a given threshold “indicates a need to increase the amount of said drug subsequently administered” [to improve efficacy], and a level above the threshold “indicates a need to decrease the amount of said drug subsequently administered” [to avoid toxicity]. \n History of the Case . Mayo originally bought and used Prometheus test kits that employed the patented method, but it then decided to sell and market its own test, which was similar, but not identical.  Prometheus sued for patent infringement.  The district court found that Mayo’s test would infringe the Prometheus patents, but it then held the patents invalid as essentially claiming unpatentable laws of nature–in this case, the relationship between the levels of the specified metabolite and the efficacy or toxicity of the relevant drugs. \n The Federal Circuit reversed this decision in 2009 , finding that the claims satisfied its then-controlling machine-or-transformation test.  Both the administering and determining stages, the court held, brought about a transformation of the patient’s body.  In the summer of 2010, while a Prometheus cert. petition (a request for Supreme Court review) was pending, the Supreme Court decided Bilski v. Kappos , a case involving a patent on a method of commodities hedging.  In a set of murky opinions, the Court held that the machine-or-transformation test was not the exclusive test of subject matter eligibility for method claims, but that it could be helpful in appropriate cases.  Immediately thereafter, the Court ordered the Federal Circuit to reconsider its Prometheus opinion in light of Bilski .  In an opinion that might be described as perfunctory, the Federal Circuit held once more that the Prometheus patents comprised statutory subject matter , and the Supreme Court granted cert . \n The Supreme Court’s Reasoning . The Court’s opinion  (pdf) focuses on the difference between claims to laws of nature themselves and claims to specific applications of such laws: the former fail the section 101 subject matter test, while the latter pass.  The laws of nature involved here are the “relationships between concentrations of certain metabolites in the blood and the likelihood that a dosage of a   thiopurine drug will prove ineffective or cause harm.”  The legal question then becomes, “do the patent claims add enough to their statements of the correlations to allow the processes they describe to qualify as patent-eligible processes that apply natural laws?” For all nine members of the Court, the answer was a clear no. \n The Court’s analysis of the claims went through four steps.  First, it observed, the administering step just defines “the relevant audience”—doctors who treat patients with thiouprine drugs.  Second, “the ‘wherein’ clauses simply tell a doctor about the relevant natural laws.”  Third, the determining step does not specify any particular process, but merely invites doctors “to engage in well understood, routine, conventional activity.’  And fourth, “to consider the three steps as an ordered combination adds nothing to the laws of nature that is not already present when the steps are considered separately.”  In sum, “the three steps simply tell doctors to gather data from which they may draw an inference in light of the correlation.”  They “are not sufficient to transform unpatentable natural correlations into patentable applications of those regularities.”  To allow such a patent could “inhibit further discovery by improperly tying up the future use of laws of nature.” \n What Do We Learn?  The first point is that section 101 is alive and well as the first test of patentability.  Some recent Federal Circuit opinions have suggested that section 101 can and should be avoided in most cases , leaving the work of evaluating patents to sections 102 (novelty), 103 (nonobviousness), and 112 (written description).  The Court explicitly rejects that approach, refusing to let section 101, with its law of nature prohibition, become “a dead letter.”  So the Patent Office and the courts will continue to have to make an initial determination of whether an invention comprises statutory subject matter, independent of whether it satisfies the other criteria of patentability.  Nonetheless, the language quoted above about “well understood, routine, conventional activity” suggests that novelty and obviousness have some relevance to subject matter eligibility, despite loud protests that this conflates section 101 with issues presumably assigned to 102 and 103. \n Second, although this opinion is light years ahead of Bilski in terms of clarity, it is still hard to be absolutely certain of what the subject matter test for method patents is.  We know—from the last paragraph of the opinion—that patents that “effectively claim the underlying laws of nature themselves” are invalid.  Another version of this is that a survivable claim must “differ significantly from a claim that just said ‘apply the algorithm.’” But just how to identify such a claim is a more difficult issue.  We know that a claim structured just like Prometheus’s is invalid: that is, a claim that involves nothing more than gathering data that may provoke an inference based on a law of nature (for example, maybe, the claims upheld by the Federal Circuit on August 31, 2011 in Classen Immunotherapies, Inc. v. Biogen IDEC ?).  Some additional application of the law of nature is required—but how much? \n The Court rejects “simply appending conventional steps, specified at high level of generality, to laws of nature.”  It expresses particular concern about claims so broad as to “seek pre-empt the use” of the law of nature.  But it gives little affirmative guidance about how specific the application of the law must be, declining to speculate on precisely what additional limitations might have saved the Prometheus claims before it. \n Impact on Myriad ?  There have already been a lot of questions raised about the impact of Prometheus on the Myriad litigation , in which a cert petition is still pending in the Supreme Court.  Does this new decision make it more or less likely that the Court will take Myriad? Does it suggest a likely outcome if the Court does take it? \n Before speculating about these questions, it is important to remember that the Federal Circuit decision in Myriad addressed three separate sets of patent claims: (1) the court upheld (with a partial dissent) Myriad’s product claims on cDNA and isolated DNA; (2) the court also upheld Myriad’s claims to methods of screening potential cancer therapeutics by analyzing growth rates of cells with altered BRCA genes in the presence or absence of the treatments; but (3) the court rejected Myriad’s claims to methods of analyzing BRCA gene sequences and comparing those with cancer-predisposing mutations to normal sequences. The cert petitions filed by both sides do not address the methods claims (only the product claims and the highly technical standing issue), but the Supreme Court could order briefing and argument on any aspect of the case. \n The Prometheus decision says nothing about gene product claims, so is irrelevant to issue (1) in Myriad. But it says a lot, obviously, about method claims that bear at least some structural similarity to those in Prometheus .  So does Prometheus indicate that the Court is more or less likely to review those method claims? (Warning: anyone who claims to have inside information about pending Supreme Court decisions is lying—Court security makes the old KGB look like a sieve.) Our guess (and it’s little more than that) is that the issuance of Prometheus makes it less likely that the Court would review the Myriad method claims.  It has just issued a unanimous and—by the standards of Supreme Court patent cases—relatively clear opinion on generally similar medical methods.  History suggests that is unlikely to want to revisit that topic the very next year.  Prometheus itself is an obvious exception, of course, coming right after Bilski. But the Court may have realized how unhelpful its fractured Bilski opinion was, and all of the justices apparently believed that the Federal Circuit had either failed to understand it or chosen to ignore it.  And the history of Prometheus suggests a possible pathway for Myriad: that the Supreme Court would grant cert, but (with respect to the method claims) for the limited purpose of vacating the Federal Circuit’s opinion and ordering reconsideration in light of Prometheus. \n But if the Court does decide to review Myriad (or if the Federal Circuit is ordered to do it over) , does Prometheus help us to predict the outcome?  The method claims that the Federal Circuit rejected ((3) above) are hard to distinguish from those in Prometheus : doctors gather information and make a straightforward comparison, using basic genetic knowledge.  Those claims are likely to be rejected once again.  The drug-screening claims that were upheld ((2) above) are a closer call.  If the “algorithm” is the protocol for comparing the effects of treating or not treating cell lines, then “do the patent claims add enough to their statements of the correlations [or algorithm] to allow the processes they describe to qualify as patent-eligible processes that apply natural laws?”  There is a good bit of practical application going on here: cell lines must be grown and drugs applied (or not) before a judgment is made.  It looks more like a real-world pharmaceutical process than a broad statement of an algorithm.  For that reason, it seems more likely than not that this category of method claims would be upheld once again under section 101. \n Conclusion . We now know considerably more about the Supreme Court’s views on methods than we did after the worse-than-useless Bilski opinion.  It is refreshing to these observers that the Court dove right back into method patents in an apparent effort to rectify the damage it did in Bilski (and there’s also some entertainment value in the revival of the Supreme Court-Federal Circuit tension that seemed to have abated a bit). But it also seems unlikely that the Court would go back to the method issue immediately, so we doubt that it will take that part of Myriad, except for the limited purpose of remanding to the Federal Circuit for reconsideration. \n In terms of impact on the marketplace, there is, of course, serious impact if your business model depends on patents just like these (e.g., if you are Dr. Classen).  But for others, both in biotechnology and IT, the effect should be minimal.  Admittedly, the mere changing of the test from one that was formerly more inclusive to one that narrows eligibility is potentially destabilizing–under the former machine-or-transformation test, “administering” and “determining” steps were generally transformative and therefore corresponded with patent eligibility.  But the key word is potentially , since the Prometheus patents already reflected an extreme stretching of section 101’s limits, and were also—as the Federal Circuit pointed out in its 2009 opinion—highly suspect under sections 102 and 103."], "link": "http://www.genomicslawreport.com/index.php/2012/03/21/prometheus-patents-struck-down-9-0-mayo-collaborative-services-v-prometheus-laboratories-inc-analysis/", "bloglinks": {}, "links": {"http://www.ipwatchdog.com/": 1, "http://www.supremecourt.gov/": 2, "http://www.genomicslawreport.com/": 13}, "blogtitle": "Genomics Law Report"}, {"content": ["SD H.B. 1260, introduced in South Dakota on January 26, 2012, is an act that would govern the use of genetic information. By any standards – and especially by legislative standards – the two-page bill (pdf) is succinct and should not be considered a state variation of GINA, as the bill does not speak to non-discrimination issues. \n The bill’s brevity should not, however, be mistaken for a narrowness of purpose. In under 200 words, the South Dakota bill, if passed, would (1) grant property rights to individuals in their DNA samples and genetic information, (2) prohibit surreptitious testing, (3) call into question many forensic and law enforcement uses of DNA, (4) eliminate newborn blood spot screening without explicit consent and (5) impose broadly worded informed consent requirements on all collections and uses of individual genetic data. So much for inefficient government. \n Of course, what the South Dakota bill offers in brevity and breadth, it lacks in clarity. No details are provided to explain exactly what sort of property rights in DNA would be bestowed upon individuals, whether there would be statutory carve-outs to consent requirements for routine governmental and other uses (such as collection and forensic analysis of crime scene DNA ) or what penalties might be imposed for violations of the new statute, should it be enacted. \n And then there are the broadly drafted informed consent requirements. While the importance of securing informed consent for the full range of uses of personal genetic data is unarguable, as we have written previously , state-level attempts to define the informed consent process may be disruptive to research and public health efforts, particularly those spanning multiple states, as potential vertical and horizontal conflicts put investigators (academic researchers and those in the personal genomics industry) in a bind. \n As just one example, the South Dakota’s bill requirement that no genetic data or DNA be “sold or given to any federal or state agency, any data bank for storage, or be used for research unless the person gives written informed consent after the test and use of the results is specifically explained” could easily call into question the use of broad consenting approaches that are crucial to large-scale and longitudinal genetic and genomic research. (SD H.B. 1260, Lines 13-15) \n Parsing Proposals to Create Property Rights in DNA. Whatever its ultimate fate, South Dakota’s proposal shares at its core a theme that we have highlighted across numerous posts here at the Genomics Law Report , including similar proposals from Vermont , Massachusetts , and Alabama : the desire to confer greater individual rights in and control over genetic data. With that in mind, we offer a line-by-line comparison of how several proposed state statutes would purport to confer ownership rights to individuals over their genetic material and information. \n On to the states (emphasis is ours unless otherwise noted): \n 1. South Dakota ( SD H.B. 1260 ) \n “All DNA, genetic information, or results of any genetic test…are the sole property of the person from whom it was derived …” (SD H.B. 1260, Lines 9-11) \n 2. Alabama ( AL H. 78 ) \n “GENETIC INFORMATION…is also the personal property of whom it is taken .” (Page 2, Lines 22-27; Page 3, Lines 1-4) \n 3. Massachusetts ( MA S.B. 1080 ) \n “…it shall be a goal of the Commonwealth to declare genetic information the excusive property of the individual from whom the information is obtained . (MA S.B.1080, Lines 5-6) \n “Genetic material shall be considered real property subject to one’s individual control and dominion in accord with generally held precepts of property law in the Commonwealth.” (MA S.B.1080, Lines 64-65) \n 4. Vermont ( VT H. 368 ) \n “…it is the intent of the general assembly to declare genetic information the exclusive property of the individual from whom the information is obtained .” (VT H.368, Lines 15-17). \n “…genetic material shall be considered real property subject to one’s individual control and dominion in accordance with generally held precepts of property law in Vermont…” (VT H.368, Lines 8-11) \n When reviewing the state proposals, it is important to keep an eye on both clauses, the type of property (indicated by single underlines) and upon whom the property rights are conferred (indicated by italics). \n Many of these phrases are legal terms of art, with distinct legal meanings that are often not in line with common usage. Take note of the following Black’s Law Dictionary (9th Ed) definitions: \n • Real Property : “Land and anything growing on, attached to, or erected on it, excluding anything that may be severed without injury to the land.” \n • Personal Property : “Any movable or intangible thing that is subject to ownership and not classified as real property.” \n • Private Property : “Property – protected from public appropriation – over which the owner has exclusive and absolute rights” \n • Tangible Property : “Property that has physical form and characteristics.” \n • Corporeal Property : “1. The right of ownership in material things. 2. Property that can be perceived, as opposed to incorporeal property.” \n • Qualified Property : “A temporary or special interest in a thing (such as a right to possess it), subject to being totally extinguished by the occurrence of a specified contingency over which the qualified owner has no control.” \n Lawyers love their fine distinctions, which means here that the specific terms that legislators use in crafting genetics rights bills can carry important distinctions. For instance, bills purporting to grant “real property” rights (Massachusetts and Vermont) to genetic material and information, should they pass, would potentially create an awkward blurring of the lines between real property and personal property, which carry many differences, including how such rights may be enforced or transferred to others. It may be that legislators are attempting to confer the same ownership and possessory rights to DNA samples that are afforded to land because casting genetic rights as “real property” would subject any transfers (e.g. sales, bequests, licenses) of DNA samples to the same requirements as land (e.g. transfers of land are unenforceable unless supported by a writing sufficient to satisfy the Statute of Frauds ). \n Much more importantly, recognition of property rights of any manner in biospecimens and genetic information could vastly change the legal landscape and potentially abrogate the ruling in Moore v. Regents of the University of California , 793 P.2d 479 (Cal. 1990), the landmark California Supreme Court case that rejected John Moore’s claim of property rights in his blood, cells and other biospecimens. In Moore , the court ruled that an individual had no property rights in his cells or other unique products of his body, and thus could not share in the commercial profits generated as the result of research performed on using Moore’s biospecimens. An important rationale underpinning the California Supreme Court’s conclusion was the potentially chilling effect imbuing biospecimens with property rights might have on medical and scientific research. State statutes explicitly creating property rights in individuals’ DNA could put the result in Moore back under the microscope which, while potentially a welcome development for many individuals, could also create significant uncertainty for scientific and medical researchers, particularly those involved in ongoing research. \n Similarly, it is unclear whether acknowledging property rights in genetic material and information would potentially renew or bolster legal arguments challenging the constitutionality of DNA fingerprinting upon arrest (as opposed to following conviction), as recognition of property rights could, by extension, create an argument that DNA Fingerprinting upon arrest constitutes an unlawful taking in violation of the Due Process clauses found in the 5th and 14th Amendments. \n Similarly, as to the person or persons upon whom property rights (i.e., ownership and possession rights) are conferred by these proposed legislations, it is important to recognize narrow distinctions in phraseology. The clauses, “from whom the information is obtained” and “from whom the information has been derived,” are not likely to be construed similarly. The former is potentially much broader than the latter, particularly in a personal genomics and participatory research age. “From whom the information is obtained” could permit property rights to be extended to third parties not limited to relatives who share genetic information by virtue of shared ancestry. For example, if Annette shares her genomic information from 23andMe with her buddy Svend, and then Svend sells Annette’s genomic information along with his own to his friend Natalie, it follows that Natalie “obtained” Annette’s information from Svend, therefore Svend may be statutorily recognized (purposefully or perhaps unwittingly) as having property rights in Annette’s genomic information such that he could lawfully transfer or license the information to Natalie at his unlimited discretion. Conversely, “from whom the information has been derived” seems to be less generous, conferring property rights only on the individual who submits a DNA sample for analysis. In the previous example this would imply that Svend would have property rights sufficient to sell his own information to Natalie but not Annette’s information. \n Of course, none of the discussion above should be taken to suggest that conferring property rights in individuals is a bad thing. However, as this discussion should make painfully obvious, it is certainly not a simple thing. While legislators should be applauded for drafting two-page statutes, they should also be mindful of the complexity and the potential implications of their proposals. With all due respect to the South Dakotan legislature – a body with 70 members and only 35 working days this year – the importance of defining a new set of legal rights for a new era of personal genomics, and the challenges inherent in doing so, is yet another reminder of the importance of securing clear federal and international leadership ."], "link": "http://www.genomicslawreport.com/index.php/2012/03/20/on-genetic-rights-and-states-a-look-at-south-dakota-and-around-the-u-s/", "bloglinks": {}, "links": {"http://legis.sd.us/": 3, "http://alisondb.al.us/": 1, "http://en.wikipedia.org/": 2, "http://www.genomicslawreport.com/": 9}, "blogtitle": "Genomics Law Report"}]