[{"blogurl": "http://www.graphoftheweek.org\n", "blogroll": [], "title": "Graph of the Week"}, {"content": ["\"Russia is a riddle wrapped in a mystery inside an enigma.\" \n -- Winston Churchill, radio address in 1939 \n \nA couple of weeks ago, Graph of the Week published an article describing the significant improvement in medals won by the host country as opposed to how that country 'normally' performs when not hosting. We concluded that Great Britain (the host country) would end up with between 53 and 70 medals (roughly 1.5 - 2.0 times more than 'normal'). As it turns out, they won 65. \n \nThe Winter Olympics may not be until 2014, but why not make another prediction for the host country? So, Russia , let's take a look at you and see what we can surmise. \n \n Fact : Russia has never hosted the Winter Olympics - nor had the Soviet Union. That seems a bit odd seeing that the Russians usually do well in these games. There is probably another story lurking around there, but we'll let someone else field that one. \n \n \n \n \n Friends and Family Winter Plan \n \n \n \nJust like the Summer Olympics, the Winter Olympics also spur athletes on to perform better than ever. Rather than jumping, throwing and running, however, these games feature skiing, skating, sledding and of course, hockey. The graph above clearly shows this effect from all modern-era Winter Olympics. \n \n Fact : The modern-era Winter Olympics didn't exist until 1924 - here's why, according to the International Olympic Committee : \n \n \n\"When Coubertin revived the Olympic Games, only summer sports were included. In the 1920’s, however, snow and ice sports began to enjoy soaring popularity. A number of IOC members decided to react to this new phenomenon. In 1924, it was decided to hold an International Winter Sports Week in Chamonix (France): 258 athletes from 16 countries (mainly in Europe and North America) attended. \n \nThe week was a great success and, two years later, it was retroactively named the first Olympic Winter Games. The future of an Olympic event dedicated exclusively to snow and ice sports was assured.\" \n \nJust like the Summer Olympics, the Winter Olympics have also had their share of scandals , controversies and boycotts which affect the results (and any statistics derived from those results). \n \nFor the sake of consistency, we'll re-quote what was stated in the Summer Olympic article about the well-known 'home court advantage' noted by Harvard researcher Jeremy P. Jamieson, PhD, in the Journal of Applied Psychology : \n \n \n\"A significant advantage for home teams was observed across all conditions (Mp = .604); and time era, season length, game type, and sport moderated the effect.\" \n \n More Snow, More Events \n \nWhile the number of total events in the Winter Olympics is small when compared to the Summer Olympics, this number has risen steadily over the years. Looking at the graph below, a rather sharp increase in the number of events starts in 1992, continuing through 2010. Back in 1924, there were only 16 events, but that number will rise to 98 for the 2014 games. \n \nAnd like their summer counterpart, this provides more opportunity for the local fans to show up and cheer on their athletes, providing a mental edge in all events for the host country. \n \nBut, like the summer games, it's difficult for any country to be proficient in every event. This is especially true for countries with financial difficulties or environments not conducive to Olympic sport (although that doesn't stop the Jamaicans !). So, while there are more opportunities to have the home court advantage, there are also more opportunities for other countries to win. \n \n \n \n \n \n \n \n \n \n Everybody's Got a Sled Dog in the Race \n \nNot as many countries participate in the Winter Olympics when compared to the Summer Olympics. In fact, 28 countries (out of 80) won medals in 2010 (compared to 79 countries (out of 204) winning medals in the 2012 Summer Olympics). That being said, the number of countries which win medals has steadily increased from 10 to the aforementioned 28 as shown in the chart below. \n \nSince more countries are producing Olympic-level athletes, it follows that the host country's medal count would be reduced due to the stiffer competition. While that was true for the Summer Olympics, it isn't very true for the Winter Olympics. In the first half of the modern Winter Olympic era (through 1968), the host country winning percentage was about 10% . During the second half (since 1972), that percentage only dropped to 9% (for comparison purposes, these percentages were 24% and 9%, respectively, for the Summer Olympics ). \n \nSo, while the smaller countries are winning more medals, they aren't doing so at a rate that significantly affects the host country's winning percentage. \n \n \n \n \n \n \n \n Is the Host-Country Advantage as Strong in the Winter Olympics? \n \nIn our previous article about the Summer Olympics, we estimated that the host country advantage for those games was between 1.5 and 2 times better than what we considered 'normal' (using the last three Olympics to determine 'normal'). \n \nDoes that hold true for the Winter Olympics? \n \nNo, not to that degree. \n \nThis median winning percentage of all host countries - when hosting - is approximated at 7.7%. For these same countries, that drops to 5.0% when not hosting (for the Summer Olympics that is 8.5% and 3.4%, respectively). When attempting to predict how many medals Russia will win using this method, we take 7.7% of the estimated 294 medals awarded (usually more due to ties) which will net them 23 medals. \n \nHowever, the Russians already get about 6.7% of the medals (when averaged) when taking the last three Winter Olympics into consideration: \n \n \n Recent Russian Winter Olympic Medal Percentages: \n \n \n \n \n \n Year \n Medals Awarded \n % of Total \n \n \n 2010 \n 15 \n 5.0 % \n \n \n 2006 \n 22 \n 8.7 % \n \n \n 2002 \n 13 \n 6.4 % \n \n \n \nSo, the host country advantage for Russia , using the above method, is only 1 percentage point higher (they would get 23 medals instead of 20 for 2014). That doesn't seem like much of an advantage. We suspect that they will obtain more than 23 medals. Or perhaps the host country advantage isn't as great for the 'big dogs' in the Olympics - those that finish with high medal counts every year. \n \nIf we multiply the expected amount (when not hosting) by 1.5 as pointed out by Stephen Clarke for the Summer Olympics, Russia would end up with about 30 medals for 2014. \n \nIn this excellent paper written specifically for the Winter Olympics, authors Madeline Andreff and Wladimir Andreff predict Russia will win between 21 and 27 medals, using 24 as the target. Using some very sophisticated techniques and taking into account a great many variables (like economic indicators, government types, etc.), their research is probably more accurate than anything else floating around out there. That being said, they summarize any attempt to predict Olympic performance nicely: \n \n\"For the time being our recommendation is: do not bet that Russia will win 24 medals at Sochi Winter Olympics! \n \nBut, if Russia makes it with more than 27 medals you would be allowed to conclude that she performed very well, better than expected with an economic model, and that this must be due to exceptional efforts of Russian athletes and coaches before and during Sochi Games. \n \nIf Russia would win less than 21 medals, you could join Prime Minister Putin and President Medvedev in complaining that the Russian winter sports squad should really have done better – or that it was unexpectedly bad lucky.\" \nCouldn't have said it better myself. \n \n \n Conclusion \n \n \nAs concluded in our Summer Olympics article, there are many attempts to quantify home-court advantage. The best ones will give a range of performance rather than a specific number due to the large amount of variables involved. And as the Andreffs point out above, do not bet that Russia will win 24 medals on the nose. Rather, enjoy watching the Olympics for what they represent. \n \nOf course, it is fun to play around with predictions, so Graph of the Week will use a combination of the above efforts and estimate that Russia will win between 24 and 31 medals. This is a bit higher than most predictions, but then again Russia has never had the home country advantage in the Winter Olympics. We suspect they will rise to the challenge with a chance to grab even more. \n \n \n \n Questions: \n1) Why has Russia (or the Soviet Union) never hosted the Winter Olympics in the past? \n2) Will future warfare and politics affect the Olympic games as in the past? \n3) Will Russia's performance decline in 2018? \n \n Data: \n \n http://www.databaseolympics.com/ \n \n http://www.olympic.org/ \n \n \n Further Reading: \n \n \n\n\n\n\n\n\n\n\n\n\n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' and ' maps ' packages within the R programming language . Additional graphics were created/edited using GIMP . \n \n1st graph:\nggplot(olympics.melt.hosting.frame, aes(x=Country, weight=(value*100), fill=variable, group=variable)) +\n geom_bar(position=\"dodge\", color=\"black\") +\n\n ylab(\"Percentage (%) of Medals Won\\n\") +\n xlab(\"Host Country\") +\n \n scale_fill_manual(values=palette) +\n \n opts(\n  plot.title=theme_text(size=24, family='Segoe'),\n  title = \"Winter Olympics:\\nHost Country Advantage\",\n  legend.title = theme_blank(),\n  panel.background = function(...)pngob, title=\"library(png)\",\n  axis.line = theme_segment(),\n  axis.text.x=theme_text(size=12, family='Segoe', angle=90),\n  axis.text.y=theme_text(size=12, family='Segoe'),\n  axis.title.x=theme_text(size=14, vjust=-0.4, family='Segoe'),\n  axis.title.y=theme_text(size=14, hjust=0.5, angle=90, family='Segoe'),\n  plot.margin = unit(c(1, 1, 1, 1), \"cm\"))\n  \n \n2nd graph (3rd graph code is the same in structure):\nggplot() +\n geom_bar(data=event.counts.frame, aes(x=factor(Year), weight=Events), fill=\"dark red\", color=\"black\", alpha=0.6) + \n geom_smooth(data=event.counts.frame, aes(x=factor(Year), y=Events, group=1), color=\"blue\", method=\"lm\", fill=NA, size=1) +\n \n ylab(\"Number of Events\") +\n xlab(\"Year\") +\n \n opts(\n  plot.title=theme_text(size=24, family='Segoe'),\n  title = \"Winter Olympics:\\nNumber of Events\",\n  legend.title = theme_blank(),\n  panel.background = function(...)pngob, title=\"library(png)\",\n  axis.line = theme_segment(),\n  axis.text.x=theme_text(size=12, family='Segoe'),\n  axis.text.y=theme_text(size=12, family='Segoe'),\n  axis.title.x=theme_text(size=14, vjust=-0.4, family='Segoe'),\n  axis.title.y=theme_text(size=14, hjust=0.5, angle=90, family='Segoe'),\n  plot.margin = unit(c(1, 4, 1, 1), \"cm\"))"], "link": "http://www.graphoftheweek.org/feeds/4150668296361325878/comments/default", "bloglinks": {}, "links": {"http://www.ac.nz/": 1, "http://www.databaseolympics.com/": 1, "http://www.graphoftheweek.org/": 3, "http://www.harvard.edu/": 1, "http://www.gimp.org/": 1, "http://www.jamaicabobsleighteam.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.apa.org/": 1, "http://www.org.uk/": 1, "http://1.blogspot.com/": 2, "http://www.r-project.org/": 1, "http://had.co.nz/": 1, "http://www.mapsofworld.com/": 1, "http://en.wikipedia.org/": 3, "http://www.amazon.com/": 1, "http://4.blogspot.com/": 1, "http://graphoftheweek.org/": 1, "http://www.olympic.org/": 3, "http://www.google.com/": 1, "http://cran.r-project.org/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["The Olympics are a big deal on a global scale. How big? Perhaps Paula Radcliffe (an English long distance runner) said it best: \n \n \n \n\"I have achieved a lot and I'm grateful for that - I'm just a bit greedy because I want to add the Olympics. It's once every four years - everyone wants it and very few people get it.\" \n \n \n \nTake that sentiment and factor in competing in the Olympics in your home country. Talk about intense! \n \n \n Friends and Family Plan \n \n \n \nWhat inspires an athlete to perform better in front of a home crowd? How is it possible to jump a little higher, throw a little harder or run a little faster when he/she would otherwise not do so? The graph above shows this effect using the host countries' medal percentage from all modern-era Summer Olympics. There is a sharp increase in the total number of medals won (as a percentage of all medals awarded) by the host country as opposed to when they are not hosting. It should be noted that some of the results are heavily skewed due to boycotts (which further increased the home countries medal percentage significantly) and other factors described later in this article. \n \nThe 'home court advantage' has been studied previously and is a well-known phenomenon. In fact, it appears to be present across all sports as noted by Harvard researcher Jeremy P. Jamieson, PhD, in the Journal of Applied Psychology : \n \n \n\"A significant advantage for home teams was observed across all conditions (Mp = .604); and time era, season length, game type, and sport moderated the effect.\" \n \n \n \n Piling On the Events \n \nCoupling the home court advantage with an increasing number of events results in more opportunities for the host country to utilize this edge. Back in 1896, there were less than 50 total events in the Summer Olympics. As the chart below reveals, that number has climbed to over 300 ( 302 , to be precise). Therefore, assuming that local fans show up to most events, then there is more opportunity to cheer on the home athletes. \n \nOn the other hand, it's difficult for any country to be proficient in every event. This is especially true for countries with financial difficulties or environments not conducive to Olympic sport. So, while there are more opportunities to have the home court advantage, there are also more opportunities for other countries to win. \n \n \n \n \n \n \n Everybody's Got a Horse in the Race \n \nAnd win those other countries do: not only have the number of events increased, but the number of countries who are winning medals has also increased - a lot. As shown in the chart below, this number has increased from eleven in 1896 to over 80 in 2008 (currently this number sits at 79 in the 2012 Summer Olympics as of August 9, 2012 - only a few days left to go). \n \nSince more countries are producing Olympic-level athletes, it follows that the host country's medal count would be reduced due to the stiffer competition. This appears to be true since the winning percentage of the host country in the first half (through 1956) of the modern Olympic era was much higher ( 24% ) than the second half ( 9% ). \n \nGranted, most of the countries winning medals only win a small percentage, but overall it does take away from the major players. \n \n \n \n \n \n So How Much, Exactly, Is This Host Country Advantage? \n \nNo one really knows the answer to that question. There are many attempts at quantifying it (giving it an actual number), but all of those are estimates. Further complicating matters are the issues cited above: the number of events, boycotts, and more medal winners. As PricewaterhouseCoopers (that's how it's spelled) states: \n \n \n\"It is not surprising that the model cannot explain all the variation in medal shares across countries as this will also be influenced by individual athletic performances, as well as by policy-related factors (including funding).\" \n \nThis can be illustrated when using the median winning percentage of all host countries - when hosting - is approximated at 8.5%. For these same countries, that drops to 3.4% when not hosting. When attempting to predict how many medals Great Britain will win using this method, we take 8.5% of the estimated 906 medals awarded (usually more due to ties) which will net them 77 medals. \n \nThat seems a bit high for Great Britain, though, doesn't it? That's not an insult directed at them; rather, recent Summer Olympics with about the same number of events show that they get around 35 in total: \n \n \n Recent Great Britain Summer Olympic Medal Percentages: \n \n \n \n \n \n Year \n Medals Awarded \n % of Total \n \n \n 2008 \n 47 \n 4.9 % \n \n \n 2004 \n 30 \n 3.2 % \n \n \n 2000 \n 28 \n 3.0 % \n \n \n \nTherefore, it's probably best to examine each country individually to more closely estimate the host country advantage because each country doesn't have the same profile and number of athletes. So, applying a universal quantifier doesn't work all that well. That being said, Stephen Clarke estimated that host countries will perform about 1.5 times better than 'normal' (which itself is difficult to quantify due to above cited reasons) when hosting the Olympics. \n \nIf that is true, then Great Britain will net about 53 medals ( PricewaterhouseCoopers predicts 54 medals) at the 2012 Summer Olympics, using the last three editions to calculate 'normal' (35 medals). As of this writing (August 9, 2012), they are already at 51 with just a few days ago. \n \nThat being said, Great Britain was already experiencing an upward trend in Olympic performance, so one cannot really tell if being the host country is truly providing an advantage or the Brits are just getting much better at the games. \n \nOnly time will tell. \n \n \n Conclusion \n \n \nA quick search on Google will reveal several attempts at quantifying the host country advantage in the Olympics. Like any sport, however, if we knew the outcome what would be the point of watching? It's fun to make predictions, but they shouldn't be taken too seriously in this sort of context (perhaps oddsmakers would disagree). \n \nThat being said, it certainly seems that the host country advantage lies between 1.5 and 2 times more medals than what might be considered 'normal.' Therefore, Great Britain will have won between 53 and 70 medals by the closing ceremonies. \n \n \n \n Questions: \n1) Will smaller countries be able to host future Summer Olympics? \n2) Will future warfare and politics affect the Olympic games as in the past? \n3) Will Great Britain's performance decline in 2016? \n \n Data: \n \n http://www.databaseolympics.com/ \n \n http://www.olympic.org/ \n \n \n Further Reading: \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' and ' maps ' packages within the R programming language . Additional graphics were created/edited using GIMP . \n \n1st graph:\nggplot(olympics.melt.hosting.frame, aes(x=Country, weight=(value*100), fill=variable, group=variable)) +\n geom_bar(position=\"dodge\", color=\"black\") +\n\n ylab(\"Percentage (%) of Medals Won\\n\") +\n xlab(\"Host Country\") +\n \n scale_fill_manual(values=palette) +\n \n opts(\n  plot.title=theme_text(size=24, family='Segoe'),\n  title = \"Summer Olympics:\\nHost Country Advantage\",\n  legend.title = theme_blank(),\n  panel.background = function(...)pngob, title=\"library(png)\",\n  axis.line = theme_segment(),\n  axis.text.x=theme_text(size=12, family='Segoe', angle=90),\n  axis.text.y=theme_text(size=12, family='Segoe'),\n  axis.title.x=theme_text(size=14, vjust=-0.4, family='Segoe'),\n  axis.title.y=theme_text(size=14, hjust=0.5, angle=90, family='Segoe'),\n  plot.margin = unit(c(1, 1, 1, 1), \"cm\"))\n\n  \n \n2nd graph (3rd graph code is the same in structure):\nggplot() +\n geom_bar(data=event.counts.frame, aes(x=factor(Year), weight=Events), fill=\"dark red\", color=\"black\", alpha=0.6) + \n geom_smooth(data=event.counts.frame, aes(x=factor(Year), y=Events, group=1), color=\"blue\", method=\"lm\", fill=NA, size=1) +\n \n ylab(\"Number of Events\") +\n xlab(\"Year\") +\n \n opts(\n  plot.title=theme_text(size=24, family='Segoe'),\n  title = \"Summer Olympics:\\nNumber of Events\",\n  legend.title = theme_blank(),\n  panel.background = function(...)pngob, title=\"library(png)\",\n  axis.line = theme_segment(),\n  axis.text.x=theme_text(size=12, family='Segoe'),\n  axis.text.y=theme_text(size=12, family='Segoe'),\n  axis.title.x=theme_text(size=14, vjust=-0.4, family='Segoe'),\n  axis.title.y=theme_text(size=14, hjust=0.5, angle=90, family='Segoe'),\n  plot.margin = unit(c(1, 4, 1, 1), \"cm\"))"], "link": "http://www.graphoftheweek.org/feeds/3199367765894778237/comments/default", "bloglinks": {}, "links": {"http://www.pwc.com/": 2, "http://www.ac.nz/": 1, "http://www.databaseolympics.com/": 1, "http://www.harvard.edu/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.apa.org/": 1, "http://www.r-project.org/": 1, "http://www.huffingtonpost.com/": 1, "http://www.paularadcliffe.com/": 1, "http://en.wikipedia.org/": 1, "http://www.gimp.org/": 1, "http://2.blogspot.com/": 3, "http://www.olympic.org/": 2, "http://cran.r-project.org/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Malpractice - A Booming Industry? \n \n \n \nPerhaps authors Frank Sloan, Randall Bovbjerg and Penny Githens capture it best from their book Insuring Medical Malpractice : \n \n\"If aging Doctor Kildare were to return to medical practice today, having been in suspended animation since the early 1960s, he would find enormous changes in his malpractice insurance coverage. The first surprise is that the physician's malpractice coverage has become so important. No longer can he practice at his hospital without it. And much higher limits are needed to protect his practice and other assets against the financial risks of lawsuits.\" \nThis history of health insurance is a story of evolution, revealing ecological niches in the system allowing for the growth of malpractice lawyers and casualty insurers. In other words, doctors now have to protect themselves against financial ruin by purchasing malpractice insurance. \n \nA quick glance at the above graph will quickly show that f rom 1990-2004 the dollar amounts awarded in malpractice cases rose significantly, with the largest gain coming in a five year period from 2000 - 2004. The publicity surrounding these astonishingly high payouts was intense, resulting in various forms of tort reform implementing caps on malpractice payouts in some states. Since then, the total amount awarded of medical malpractice claims have decreased. \n \n Yet health care costs still continue to rise. \n \n \n \n \n Survival of the Fittest \n \nHow then, can falling malpractice awards be related to rising health care costs? As noted in the conclusion of part 2 of this series, the health care system is complex and interdependent on numerous variables. In this case, it can take several years before the industry can recognize a trend (positive or adverse). \n \nInsurance companies need to build a pool of money in order to be prepared for claims that will inevitably follow. This is done in two major ways: 1) premiums and 2) investments. Not unlike a bank, they will use some of the money gathered from premiums and invest it so that more money can be earned, thus allowing them to enact various business strategies including \"price wars.\" In this case, larger companies with larger pools of money can force smaller companies out of business by offering low rates at a loss long enough to snuff out the competition. \n \n It's a race of attrition. \n \nCouple that with a large increase in malpractice payouts (as shown above) and the net result is twofold: 1) fewer casualty insurers and 2) higher premiums enacted for those left standing. All of that lost money has to be recovered somehow and it falls on the customers themselves to provide it - the very same customers who caused it by winning large sums of money in malpractice cases. \n \n \n \n \n \n \n If That Wasn't Enough... \n \nThe above graph shows just how bad things got for casualty insurers. The combined ratio was well over 100% for several years, peaking in 2001. For every percentage point above 100 a company paid out more than what it took in, all factors considered (except investments). \n \nSo, in 1991 when the combined ratio peaked at 154%, the industry as a whole was paying out $1.54 for each $1.00 that it took in. Granted, this does not consider investment income. However, the return on investments for these companies have shown a slight decline for the past few years resulting in less auxiliary income for their reserves. Less money in reserve means less money for investments, which means less money in reserves and - you get the picture. The bottom line is that it will take quite a while before they can build those reserves back up - something which they are still attempting to do (in an unstable economy at that). \n \nAnd what is the quickest way to build those reserves? Higher premiums, which explains why heath care costs are continuing to rise even after the peak of disaster passed several years ago. \n \n \n Conclusion \n \n \n While researching health care costs, this author found himself in a world he would not like to visit again anytime soon. It's a tricky business - one that deserves far more attention that what is provided here. The above graphs do indeed correlate - almost exactly - with the largest rise in health care costs as noted in part 1 . Therefore - and despite what some senators and other media might suggest otherwise - malpractice payouts and aggressive business practices appear to be root causes. In the former, we did this to ourselves - after all, juries are made up of our 'peers' who thought that these high rewards were justified. Regarding the latter - when insurance companies become too involved in eliminating competition, the costs of doing inevitably end up being shouldered by their customers (we win in the short run and lose in the long). \n \n \nAs a side note, the scenario described here in parts 1 , 2 and 3 is indicative of a repeating pattern. It would not surprise this author if premiums decreased for a while before this scenario plays out again. If that is indeed true, perhaps we can all enjoy lower rates in the upcoming years until the next cycle hits. Further, this is the time for new casualty insurers to spring up and re-populate the ecosystem, hopefully bringing fresh ideas and technology resulting in lower costs for all of us. \n \n \n \n Questions: \n1) The time is ripe for innovative companies to shake-up the health care system - are they out there? \n2) Is there a checks and balances system for lawyers and judges to prevent fraud? \n3) Are other countries suffering the same fate as the U.S. with regards to health care costs? \n \n Data: \n \n http://www.scha.org/ \n http://www.npdb-hipdb.hrsa.gov/ \n \n \n Further Reading: \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' and ' maps ' packages within the R programming language . Additional graphics were created/edited using GIMP . \n \n1st graph:\nggplot(malpractice.melt.frame, aes(x=as.integer(substr(variable,2,5)), y=as.numeric(value)*as.numeric(Amount), color=Malpractice.Payment.Range)) +\n geom_rect(aes(xmin=1990, xmax=2000, ymin=0, ymax=5000000000), fill=\"red\", color=\"gray\", alpha=0.002) +\n geom_rect(aes(xmin=2000, xmax=2004, ymin=0, ymax=5000000000), fill=\"red\", color=\"gray\", alpha=0.01) +\n geom_rect(aes(xmin=2004, xmax=2011, ymin=0, ymax=5000000000), fill=\"green\", color=\"gray\", alpha=0.005) +\n \n geom_text(x=1994.5, y=4900000000, label=\"(Combined Ratios Rising)\", size=3, color=\"dark blue\") +\n geom_text(x=2002, y=4900000000, label=\"(Combined Ratios Peak)\", size=3, color=\"dark blue\") +\n geom_text(x=2007.5, y=4900000000, label=\"(Combined Ratios Falling)\", size=3, color=\"dark blue\") +\n \n geom_text(x=1990, y=1500000000, label=\"$1,515,750,000\", size=2.5) +\n geom_text(x=2011.2, y=2200000000, label=\"$2,280,000,000\", size=2.5) +\n \n geom_text(x=1990, y=440000000, label=\"$491,250,000\", size=2.5) +\n geom_text(x=2011.2, y=2700000000, label=\"$2,467,500,000\", size=2.5) +\n \n geom_text(x=1990, y=5000000, label=\"$57,000,000\", size=2.5) +\n geom_text(x=2011.2, y=310000000, label=\"$381,000,000\", size=2.5) +\n \n \n #geom_point() +\n geom_line(aes(group=Malpractice.Payment.Range), size=1.2) +\n \n scale_color_manual(breaks=c(\n   \"< $500,000\",\n   \"$500,000 - $2,000,000\",\n   \"> $2,000,000\"), \n  values=newPalette) +\n \n \n scale_y_continuous(limits = c(0,as.numeric(5000000000)), labels = mysep) +\n \n ylab(\"Estimated Total Dollars Spent\\n (using median value in range)\\n\") +\n xlab(\"Year\") +\n \n opts(\n  plot.title=theme_text(size=24, family='Segoe'),\n  title = \"Estimated Dollars Awarded in Malpractice Cases\\n\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank(),\n  axis.line = theme_segment(),\n  axis.text.x=theme_text(size=12, family='Segoe'),\n  axis.text.y=theme_text(size=12, family='Segoe'),\n  axis.title.x=theme_text(size=14, vjust=-0.4, family='Segoe'),\n  axis.title.y=theme_text(size=14, hjust=0.5, angle=90, family='Segoe'),\n  plot.margin = unit(c(1, 1, 1, 1), \"cm\"))\n\n  \n \n2nd graph:\nggplot(malpractice.ratios.frame, aes(x=year, y=combined.ratio)) +\n\n geom_rect(aes(xmin=1995, xmax=2010, ymin=40, ymax=69.99), fill=\"green\", alpha=0.09) +\n geom_rect(aes(xmin=1995, xmax=2010, ymin=130, ymax=160), fill=\"red\", alpha=0.09) +\n geom_rect(aes(xmin=1995, xmax=2010, ymin=70, ymax=99.99), fill=\"green\", alpha=0.02) +\n geom_rect(aes(xmin=1995, xmax=2010, ymin=100, ymax=129.99), fill=\"red\", alpha=0.02) +\n\n geom_rect(aes(xmin=1995, xmax=2010, ymin=40, ymax=160), fill=\"gray\", alpha=0.01) +\n \n geom_rect(aes(xmin=1999.99, xmax=2000.01, ymin=40, ymax=160), fill=\"dark gray\") +\n geom_rect(aes(xmin=2003.99, xmax=2004.01, ymin=40, ymax=160), fill=\"dark gray\") +\n \n geom_point(size=3) +\n geom_line(aes(group=1), size=2) +\n \n geom_text(x=1995.3, y=65, label=\"Best\", size=5, color=\"dark blue\") +\n geom_text(x=1995.35, y=95, label=\"Good\", size=5, color=\"dark blue\") +\n geom_text(x=1995.25, y=125, label=\"Bad\", size=5, color=\"dark blue\") +\n geom_text(x=1995.4, y=155, label=\"Worst\", size=5, color=\"dark blue\") +\n \n geom_text(x=2002, y=50, label=\"(Peak Malpractice Payout Years)\", size=3, color=\"dark blue\") +\n geom_text(x=1997.5, y=50, label=\"(Rising Malpractice Payout Years)\", size=3, color=\"dark blue\") +\n geom_text(x=2007, y=50, label=\"(Falling Malpractice Payout Years)\", size=3, color=\"dark blue\") +\n \n scale_y_continuous(limits=c(40,160)) +\n \n ylab(\"Combined Ratio (%)\\n\") +\n xlab(\"Year\") +\n \n opts(\n  plot.title=theme_text(size=24, family='Segoe'),\n  title = \"Combined Ratios for Casualty Insurers\\n\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank(),\n  axis.line = theme_segment(),\n  axis.text.x=theme_text(size=12, family='Segoe'),\n  axis.text.y=theme_text(size=12, family='Segoe'),\n  axis.title.x=theme_text(size=14, vjust=-0.4, family='Segoe'),\n  axis.title.y=theme_text(size=14, hjust=0.5, angle=90, family='Segoe'),\n  plot.margin = unit(c(1, 3, 1, 1), \"cm\"))"], "link": "http://www.graphoftheweek.org/feeds/5698821754793704513/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.graphoftheweek.org/": 4, "http://www.hrsa.gov/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.r-project.org/": 1, "http://eh.net/": 1, "http://www.scha.org/": 1, "http://www.gimp.org/": 1, "http://4.blogspot.com/": 1, "http://www.amazon.com/": 1, "http://www.investopedia.com/": 1, "http://cran.r-project.org/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Lighting Up \n \n Way back in the day, folks believed that smoking was not only cool but also completely safe. As Marcel Danesi states in his book Of Cigarettes, High Heels, and Other Interesting Things, Second Edition: An Introduction to Semiotics (Semaphores and Signs) : \n \n \n\"American society believed that smoking was not only highly fashionable, but that is also relieved tensions and even produced health benefits.\" \nAt least this explains why smoking was performed with such \" unapologetic gusto \" in those old movies. Alas, these poor souls knew not what awaited them later in life. Often there is a high price to be paid for fashion - sometimes in monetary terms, sometimes in emotional terms and unfortunately, sometimes in physical terms. Danesi goes on to point this out: \n \n\"However, epidemiologists started noticing around 1930 that lung cancer - rare before the twentieth century - had been increasing dramatically.\" \nDue to the overwhelming evidence linking smoking and lung cancer , the U.S. imposed a ban on tobacco advertising on TV and Radio while also forcing manufacturers to put a warning label on the packages. \n \n \n \n But It's Not Related to Increasing Insurance Rates \n \n \nApparently the warnings, bans, anti-smoking campaigns and perhaps common sense have led to a gradual decline in smoking. Taking a look at the above chart, around 42% of the population smoked in the early 70s. Since then, that percentage has steadily declined to its present levels around 19%. \n \nAs noted in Part 1 of this series, however, average insurance rates are surpassing inflation. Unless one were to speculate on an inverse relationship between smoking and insurance rates (due to weight gain perhaps), then one must conclude that the smokers in America are not contributing to the rising costs of health care. \n \nThis doesn't mean that smokers aren't paying more for insurance - they are . In essence, they fork out the extra cash to support their habit in the form of increased rates unique to them. So, if an insurance company claims that everybody's rates are higher due to smokers, feel free to point them to this article. \n \nFrom the data gathered here, rising insurance rates should not be related to the smoking public. \n \n \n \n \n \n Living On the Edge \n \nThere are many millions of Americans without health insurance. Going back in time to the turn of the 20th century, virtually nobody had health insurance. A number of factors could be cited for this (lack of medical advancement , low healthcare costs and perhaps the lack of need at the time), but it remains a fact. \n \nThings certainly have changed. \n \nIn the United States today, the percentage of uninsured has remained very steady at around 16%. Life for those individuals is a bit different from those holding insurance. Mar k L. Friedman, M.D. and Donna Raskin, in their book The Complete Idiot's Guide to Medical Care for the Uninsured , describe it as follows: \n \n \n \n \n \n \n\"Today in the United States the quality of one's health depends not only on his family history and how well he takes care of himself but also on whether or not he has insurance.\" \n \n\"In general, Americans without insurance don't go to the doctor for preventative care, which means that if they have an illness, they are diagnosed when their disease is at a more advanced stage, and, finally, once diagnosed, the uninsured receive less care and die more often and sooner than people with insurance.\" \n \n\"In fact, throughout every stage of health and disease, no matter what the type of care, including general health, mental health, dental health, and specific diseases, Americans without insurance fare worse than those with insurance, according to the National Coalition on Health Care.\" \n \n The Uninsured Aren't the Problem \n \nDon't be fooled by looking at the above graph into thinking that the number of uninsured has remained the same - it hasn't. It has increased from around 23 million in the early 70s to around 43 million today. In the same time frame, the total population has also increased from around 180 million to 260 million (which is why the percentage of uninsured has remained the same). \n \nThat being said, the number of those who have insurance has also increased, so all things are relatively equal. \n \nThose without insurance are going without preventative care which means they aren't a burden to the health system in that area. When something catastrophic occurs, however, is when that can change (trauma, major disease, etc.). That being said, that would have been the case in the early 70s as well so based on that criteria, the uninsured can't be attributed to rising health care costs (unless illegal immigration is taken into account which won't be discussed here). \n \n \n \n \n Conclusion \n \n \n \n \nIt was actually quite difficult to find non-factors in the health care debacle. Unfortunately the health care system in the United States is so complex and inter-dependent that nearly every measured variable is a player in the cause of the problem. In the next article (or perhaps more) the many factors playing into this problem will be revealed. \n \n \n- continue to Part 3 - \n \n \n \n Questions: \n1) What other variables might be non-factors in the heath care problem? \n2) How are the tobacco companies profits these days? \n3) What country has the 'best' health care system? \n \n Data: \n \n http://www.cdc.gov/ \n \n \n \n Further Reading: \n \n \n\n\n\n\n\n\n\n\n\n\n\n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' and ' maps ' packages within the R programming language . Additional graphics were created/edited using GIMP . \n \n1st graph:\nggplot(smoking.frame, aes(x=Year, y=Overall.Population)) +\n\n geom_point(color=\"blue\", size=2) +\n geom_line(aes(group=1), color=\"blue\", size=2.5) +\n geom_segment(aes(x=2009, xend=2010, y=23, yend=19.3, color=\"blue\"), color=\"blue\", size=2) +\n geom_segment(aes(x=2008.8, xend=2010, y=17, yend=19.3, color=\"blue\"), color=\"blue\", size=2) +\n geom_text(x=1965, y=47, label=\"42.4%\", size=4) +\n geom_text(x=2010, y=27, label=\"19.3%\", size=4) +\n \n scale_y_continuous(limits=c(0,100)) +\n \n ylab(\"(%) Percentage who smoke\\n\") +\n xlab(\"Year\") +\n \n opts(\n  plot.title=theme_text(size=24, family='Segoe'),\n  title = \"Smoking in the United States\\n\",\n  legend.title = theme_blank(),\n  panel.background = function(...)pngob,\n  axis.line = theme_segment(),\n  axis.text.x=theme_text(size=12, family='Segoe'),\n  axis.text.y=theme_text(size=12, family='Segoe'),\n  axis.title.x=theme_text(size=14, vjust=-0.4, family='Segoe'),\n  axis.title.y=theme_text(size=14, hjust=0.5, angle=90, family='Segoe'),\n  plot.margin = unit(c(1, 2, 1, 1), \"cm\"))\n \n2nd graph:\nggplot(insured.frame, aes(x=Year, y=(Uninsured/Population.Under.65.Millions)*100)) +\n \n geom_point(color=\"blue\", size=2) +\n geom_line(aes(group=1), color=\"blue\", size=2.5) +\n geom_segment(aes(x=2006, xend=2007, y=18.9, yend=16.7), color=\"blue\", size=2) +\n geom_segment(aes(x=2006, xend=2007, y=14.6, yend=16.7), color=\"blue\", size=2) +\n geom_text(x=1972, y=22, label=\"16.7%\", size=4) +\n geom_text(x=2007, y=22, label=\"16.6%\", size=4) +\n \n scale_y_continuous(limits=c(0,100)) +\n scale_x_continuous(limits=c(1972,2007)) +\n \n ylab(\"(%) Percentage of Population Uninsured\\n\") +\n xlab(\"Year\") +\n \n opts(\n  plot.title=theme_text(size=24, family='Segoe'),\n  title = \"Uninsured in the United States\\n\",\n  legend.title = theme_blank(),\n  panel.background = function(...)pngob,\n  axis.line = theme_segment(),\n  axis.text.x=theme_text(size=12, family='Segoe'),\n  axis.text.y=theme_text(size=12, family='Segoe'),\n  axis.title.x=theme_text(size=14, vjust=-0.4, family='Segoe'),\n  axis.title.y=theme_text(size=14, hjust=0.5, angle=90, family='Segoe'),\n  plot.margin = unit(c(1, 2, 1, 1), \"cm\"))"], "link": "http://www.graphoftheweek.org/feeds/907073146670038233/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://cran.r-project.org/": 1, "http://www.graphoftheweek.org/": 3, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://selfstyledsiren.blogspot.com/": 1, "http://www.r-project.org/": 1, "http://www.msn.com/": 1, "http://www.gimp.org/": 1, "http://4.blogspot.com/": 1, "http://www.amazon.com/": 2, "http://www.mayoclinic.com/": 1, "http://www.history.com/": 1, "http://www.cdc.gov/": 3}, "blogtitle": "Graph of the Week"}, {"content": ["The Problem \n \n \nIn the United States, health care costs have been going up for a number of years, even when adjusted for inflation. Not unlike a runaway freight train, this rampant inflation cannot continue indefinitely without crashing. \n \n \n \n Health \n \nWhat is 'health', anyway? According to Steven Jonas, MD, Raymond Goldsteen, DrPH, and Karen Goldsteen, PhD in their book An Introduction to the U.S. Health Care System , the World Health Organization (WHO) defined it in 1946: \n \n \n\"Health is a state of complete physical, mental and social well-being and not merely the absence of disease or infirmity.\" \nInteresting. When is the last time any of us felt like this was the goal of health care in the U.S.? They go on to say: \n \n \n\"Indeed, the WHO definition is 'honored in repetition, rarely in application.'\" \nSo, even when 'health' (as defined here) is only applied in a narrow scope, the costs are still increasing quickly - and outpacing inflation (otherwise the lines above would be flat). \n \n \n Out of Control \n \n \nAn article written for the Robert Graham Center (\" Who will have health insurance in the year 2025? \") postulates that by the year 2025 the costs of insurance premiums will surpass household income. Below is the graph from that article depicting this forecast: \n \n \n \n \nPractically speaking, there is no way the above situation can occur as no business can survive if priced out of existence. However, it illuminates the problem and provides a time frame in which it must be solved. Bottom line: we're on the clock to solve this burgeoning crisis. \n \nThat being said, health care is not cheap and were it not for some intervening factors right now , it would cost a lot more. In their (excellent) book, The Innovator's Prescription: A Disruptive Solution for Health Care , authors Clayton M. Christensen, Jerome H. Grossman, M.D., and Jason Hwang, M.D. note: \n \n \n\"Today, it's very expensive to receive care from highly trained professionals. Without the largesse of well-heeled employers and governments that are willing to pay for much of it, most health care would be inaccessible to most of us.\" \n \n \n \n \n \nTrue words, indeed. \n \n \n Conclusion \n \nClearly, health care costs are on the rise; perhaps we are on the verge of a vicious cycle . Historically speaking, this isn't the first time health care has been addressed. Beliefs range from total government healthcare to total private health care and all points in between. Regardless of where a person stands philosophically, the reality is that health care in the United States is getting out of control. In this series of articles, we'll explore both the factors and non-factors in this phenomenon and hopefully some shed some light on this complicated topic. \n \n \n - continue to Part 2 - \n \n \n \n Questions: \n1) What other solutions have been provided to reverse the rising trend of health care? \n2) How long can the above trend continue if nothing changes - 2025 ? \n3) Is our national weight gain problem a factor? \n \n Data: \n \n http://meps.ahrq.gov/mepsweb/ \n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' and ' maps ' packages within the R programming language . Additional graphics were created/edited using GIMP . \n \nggplot() +\n \n geom_point(data=adjusted.health.expenses.frame, aes(x=Year, y=Per.person.expense.mean, color=\"Average\"), size=3) +\n geom_line(data=adjusted.health.expenses.frame, aes(x=Year, y=Per.person.expense.mean, color=\"Average\"), size=2) +\n geom_segment(aes(x=2008.6, xend=2009.06, y=5000, yend=4950, color=\"Average\"), size=2) +\n geom_segment(aes(x=2008.8, xend=2009.05, y=4600, yend=4950, color=\"Average\"), size=2) +\n \n geom_point(data=adjusted.health.expenses.frame, aes(x=Year, y=Out.of.pocket, color=\"Out of Pocket\"), size=2) +\n geom_line(data=adjusted.health.expenses.frame, aes(x=Year, y=Out.of.pocket, color=\"Out of Pocket\"), size=1, linetype=2) +\n \n geom_point(data=adjusted.health.expenses.frame, aes(x=Year, y=Private.insurance, color=\"Private Insurance\"), size=2) +\n geom_line(data=adjusted.health.expenses.frame, aes(x=Year, y=Private.insurance, color=\"Private Insurance\"), size=1, linetype=3) +\n \n geom_point(data=adjusted.health.expenses.frame, aes(x=Year, y=Medicare, color=\"Medicare\"), size=2) +\n geom_line(data=adjusted.health.expenses.frame, aes(x=Year, y=Medicare, color=\"Medicare\"), size=1, linetype=4) +\n \n geom_point(data=adjusted.health.expenses.frame, aes(x=Year, y=Medicaid, color=\"Medicaid\"), size=2) +\n geom_line(data=adjusted.health.expenses.frame, aes(x=Year, y=Medicaid, color=\"Medicaid\"), size=1, linetype=5) +\n \n geom_point(data=adjusted.health.expenses.frame, aes(x=Year, y=Other, color=\"Other\"), size=2) +\n geom_line(data=adjusted.health.expenses.frame, aes(x=Year, y=Other, color=\"Other\"), size=1, linetype=6) +\n \n ylab(\"Per person annual average expenditures\\n (in dollars)\\n\") +\n xlab(\"Year\") +\n \n scale_colour_manual(values=wideBluePalette) +\n \n scale_y_continuous(labels = mysep) +\n scale_x_continuous(breaks=1996:2009) +\n \n opts(title=\"Health Care Expenses\\n (adjusted for inflation)\\n\",\n  legend.title = theme_blank(),\n  panel.background = function(...)pngob, title=\"library(png)\",\n  axis.line = theme_segment(),\n  axis.text.x=theme_text(size=12),\n  axis.text.y=theme_text(size=12),\n  axis.title.x=theme_text(size=14, vjust=-0.4),\n  axis.title.y=theme_text(size=14, hjust=0.5, angle=90))\n\n \n Further Reading:"], "link": "http://www.graphoftheweek.org/feeds/8884227134999174845/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.graphoftheweek.org/": 2, "http://www.gimp.org/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.r-project.org/": 1, "http://en.wikipedia.org/": 1, "http://www.graham-center.org/": 2, "http://www.amazon.com/": 2, "http://www.who.int/": 1, "http://meps.ahrq.gov/": 1, "http://cran.r-project.org/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Carbs \n \nIn P art 2 of this series, micro -nutrients were cited as a non-factor for weight gain. This is not the case with macro -nutrients (carbohydrates, fats, proteins, water). While fats, proteins and water are essential (without them you could not live), carbohydrates, on the other hand, don't appear to share this status. As Dr. Christian B. Allan and Dr. Wolfgang Lutz state in their book Life Without Bread: How a Low-Carbohydrate Diet Can Save Your Life : \n \n \n\"To our knowledge, there has never been an essential carbohydrate discovered. Every carbohydrate your body needs can be made from either protein or fat.\" \n \nWow - powerful words, indeed. This is not to say that carbohydrates do not add healthy value to our bodies (such as fiber); rather is puts their contributions into perspective. This makes looking at the above chart very disturbing as it shows we've been wolfing down carbs more and more for quite some time - a nutrient that we simply do not need in large quantities, much less ever increasing quantities. \n  \n If you eat ten pounds of cheesecake in a day, you will gain weight (and then promptly lose some of that as you throw up). Your body just cannot deal with those extra calories and is forced to do what it does best - store them as fat (those that didn't end up on the floor). This certainly holds true when eating carbs since they are mostly non-essential. The end result will be the same - a new, larger wardrobe. \n \n Speaking of carbohydrates, let us turn our attention to caloric sweeteners (sugars that have calories). \n \n \n \n \n \n \n High Fructose Corn Syrup \n \nBefore 1970, nobody ever heard of high fructose corn syrup (it had only become viable around 1967). Humans had never encountered it before, so any long-term effects from it were unknown. Cane sugar, on the other hand, had been around since 6000 B.C. and was a primary sweetener of the time. It's effects were well-known given its (extremely) long history in the human diet. \n \nSo what caused this mysterious new sugar to show up? Due to government subsidies encouraging corn crop production for Ethanol , so much corn was produced that something had to be done with all of the excess. \n \nEnter High Fructose Corn Syrup (HFCS) - a product which could be made from all that extra corn. At around the same time the U.S. government imposed tariffs on sugar imports, setting the stage for a significant change in our diet. \n \n According to Dr. Dee Takemoto in her book Gaining Weight?: High Fructose Corn Syrup and Obesity , she observed this trend first hand: \n \n \n\"I wasn't too political at the time, being kind of a hippie artist housewife, in the hills of northern California, but I had read that they were subsidizing farmers not to grow certain crops and that imports of certain foods were being limited. One of those was sugar which had been replaced by high fructose corn syrup! Lobbying power, anyone?\" \nThus, the replacement of sugar with HCFS began as the chart above shows. E stimates show that Americans now gobble down anywhere from 35 to 60 lbs of HFCS per year versus virtually zero lbs in 1970. Coincidence or not, this corresponds to the same time frame in which rapid weight gain has occurred in the United States. \n \n \n \n A Reversal? \n \nIn 2011 the oft-maligned corn Ethanol subsidy was allowed to expire due to various pressures. Interestingly, the rise in products containing sugar in place of HFCS (such as 'Throw-back' Pepsi) began to emerge around the same time . \n \n Coincidence ? \n \n The public is beginning to get wind of HFCS-is-bad-for-you relationship, so food manufacturers are slowly and quietly (re)introducing products on the market replacing HFCS with sugar as the cost to do so becomes more manageable (the graph above shows this recent trend). \n \n \n But does HFCS make you fat? \n \nAlmost assuredly so. Rats, when given HFCS instead of sugar (while caloric intake was the same) gained significantly more weight - to the point of obesity - in every single case. According to the American Journal of Clinical Nutrition , all animals given HFCS will gain weight when compared to control subjects - every single one (and also in humans - scroll down to section 3 in the article cited). Thus, the evidence is strong in relating HFCS consumption with weight gain. \n \nAdditionally, HFCS is a chief suspect for the rise in metabolic syndrome in the U.S., causing all sorts of nastiness such has heart disease, diabetes and strokes. In fact, it is difficult to see any beneficial health effects from HFCS at all. \n \n \n Chair Jobs \n \nIn part 2 of this series, it was noted that leisure-time activity has gone up. But, not unlike attempting to \"counter a pack-a-day smoking habit by jogging\", our occupational-time (work-time) activity has gone down. And guess where we spend most of our time? \n \nAt work. \n \n \n  \n \n \n Medical Billing and Coding created an excellent info-graphic which really gets the points across about the dangers of sitting too long (shown at left - click to see full size). \n \nTo hammer this home a bit more, consider this question raised by Dr. James Levine in his eBook Is Your Chair Killing You? : \n \n \n \n\"But what if I told you that even if you adhere to the government's guidelines for daily exercise and work out for thirty to sixty minutes per day three to five days per week, you still may not be doing enough to counteract the damage that sitting for extended periods does to your health?\" \n \nHe elaborates on the dangers of sitting asserting that it is worse for us than \"smoking a pack a day.\" It's sobering news when we learn just how little we move while in a chair as described in this New York Times piece with Dr. Levine. Indeed the \"chair-based life style\" not only makes us overweight, but it reduces our ability to counteract weight gain - a vicious cycle (an economic term which plays well here). \n \nIn other words, the more you sit, the harder it is to un-do the effects from it. \n \nAlthough this extremely well-executed study was performed in Europe, it applies to the United States as well. In it, thirty-year trends show an increase in leisure-time activity with a significant drop in occupational-time activity - for both men and women. \n \nSo while more people are jumping, running, spinning, climbing and dancing in gyms all around the country after work, we are sitting on our butts more during work. And the during work part is killing us faster than the after work part can save us. \n \n \n \n Conclusion \n \nIn Part 1 of this series it was shown that Americans are getting fatter - no surprise there. Part 2 highlighted some of the major non-factors in weight gain while this 3rd installment provides (strong) evidence to the causes of increasing fatness. While each section of this article uses a different data set, it would be irresponsible to directly link these factors (as presented here) to weight gain. However, the evidence is nearly overwhelming and ignoring these factors will most likely lead to a lifetime of poor health, disease and weight problems. \n \n We are in control of our own destiny which includes our health. Tr usting your health to the government (or any one entity) will lead to disastrous results - just look around to see proof of this in action. At the end of the day, do what works for you - even if in direct opposition to various health claims, studies, articles (such as this one) and advice. Each of us, while sharing many similarities, is unique and wonderful and responds best to our own internal guidance. \n \n That being said, a good place to start would be to reduce carbohydrates, eliminate high fructose corn syrup and get out of the chair whenever possible. \n \n \n \n Questions: \n1) Usage of HFCS has been trending downward as of late - will this continue? \n2) People are working long hours at sedentary jobs to 'get ahead' - at what cost to their health? \n3) The U.S. government provides subsidies for specific crops - is there a way to assist farmers without this restriction? \n \n Data: \n \n http://www.cdc.gov/ \n \n Code: \nThese graphs were generated using the ' ggplot2 ' and ' maps ' packages within the R programming language . Additional graphics were created/edited using GIMP . \n \n 1st graph: \nggplot(totals.melt.frame, aes(x=Year, y=value, color=variable)) +\n geom_point(size=0.5) +\n geom_line(aes(group=variable), size=1) +\n \n ylab(\"Amount (calories)\") +\n xlab(\"Year\") +\n \n opts(title=\"Yearly U.S. Food Consumption by Type\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank())\n \n \n 2nd graph: \nggplot() +\n geom_point(data=sugars.melt.frame, aes(x=Year, y=value, color=variable), size=1.3) +\n geom_line(data=sugars.melt.frame, aes(x=Year, y=value, color=variable), size=0.7) +\n geom_line(data=sugars.frame, aes(x=Year, y=High.Fructose.Corn.Syrup, color=\"High.Fructose.Corn.Syrup\"), size=2) +\n geom_line(data=sugars.frame, aes(x=Year, y=Refined.cane.and.beet.sugar, color=\"Refined.cane.and.beet.sugar\"), size=2) +\n \n geom_point(data=sugars.frame, aes(x=Year, y=High.Fructose.Corn.Syrup, color=\"High.Fructose.Corn.Syrup\"), size=2.5) +\n geom_point(data=sugars.frame, aes(x=Year, y=Refined.cane.and.beet.sugar, color=\"Refined.cane.and.beet.sugar\"), size=2.5) +\n \n \n ylab(\"Amount (calories)\") +\n xlab(\"Year\") +\n \n opts(title=\"Yearly U.S. Sugar Consumption by Type\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank(),\n  axis.line = theme_segment())\n \n \n Further Reading:"], "link": "http://www.graphoftheweek.org/feeds/2555913436220137590/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.kew.org/": 1, "http://www.lef.org/": 1, "http://www.r-project.org/": 1, "http://www.nih.gov/": 1, "http://www.gimp.org/": 1, "http://4.blogspot.com/": 1, "http://www.sciencedaily.com/": 1, "http://cran.r-project.org/": 1, "http://phys.org/": 1, "http://www.graphoftheweek.org/": 5, "http://www.nytimes.com/": 1, "http://eurpub.oxfordjournals.org/": 1, "http://www.ajcn.org/": 1, "http://www.amazon.com/": 3, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.dailyfinance.com/": 1, "http://www.builtlean.com/": 1, "http://en.wikipedia.org/": 1, "http://2.blogspot.com/": 1, "http://www.cdc.gov/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Sometimes the story isn't what is a trend, but rather what is not a trend. In this second installment about body weight in the U.S., listing what doesn't seem to be contributing factors will help narrow down what might actually be the problem(s). \n \n \nAlcohol \n \n\"Stay busy, get plenty of exercise and don't drink too much. Then again, don't drink too little.\" \n  - Herman \"Jackrabbit\" Smith-Johannsen \n \nSage advice from a person who lived to be 111 years old. \n \n \n \nAlcohol has been around since 10,000 B.C. , starting with beer. In fact, it may have preceded bread which, as will be discussed in the next article, might be a contributing factor to weight gain. Perhaps the ancients had it right by 'drinking' their bread... \n \nLooking at the above graph, alcohol consumption hasn't changed all that much since 1960. Peering back even further , Americans are remarkably consistent when it comes to having that 'wee nip' at the local pub. Considering the explosion in the variety of drinks available today, humans are adept at moderating their intake of spirits. \n \nTherefore, one cannot say that alcohol consumption is related to weight gain as a trend in this country. \n \n \nExercise (during leisure time) \n \nSurprise! American are not sitting around as much as they used to during their leisure time (time not working or commuting to work). That means that when not working, we are more active now than in the past as the graph below shows: \n \n \n \n \n \nWith over 50 million health club memberships and nearly 30,000 health clubs, it appears that Americans are collectively pumping more iron then ever before. Go to any spa after work and it will be filled to capacity with people on every imaginable machine. Being an avid cyclist , this author has personally witnessed a cycling boom all over the country. \n \n \n \nJust try going to a garage sale and not seeing some sort of exercise equipment for sale. Yes, that means that it's no longer being used in that household, but once sold would be used in a new household (hopefully). \n \n \n \nThere isn't an (obvious) relationship between leisure-time exercise and weight gain. Of course, exercise can come at other times and this will be examined in the next article. \n \n \n \nDoes that mean that all that effort is wasted? No, not at all. People are getting heavier in this country and it seems likely the rate at which that occurs would increase if people stopped working out altogether. \n \n \n \nNutrients (micro) \n \n \n \nMicro-nutrients (vitamins and minerals) are those that are needed in small quantities while macro-nutrients (carbohydrates, fats, protein, water, etc.) are those needed in large quantities. Click here to see a detailed description. Insufficient quantities of micro-nutrients can lead to several diseases , most of which have been eliminated in the U.S. due to our ready supply of fortified food. \n \n \n \nEven so, is it possible Americans, on average, are not getting enough micro-nutrients? In other words, could this partially explain the rise in body weight over the last fifty years? \n \n \n \n \n \n \n \n \n \nLooking at the graph above, it is important to see that consumption of micro-nutrients has remained fairly steady for over a hundred years. The chart isn't designed for individual nutrient clarity, but rather to paint a broad stroke so that the reader can see most of the lines are fairly level. Sodium and potassium levels are marked, however, since those two nutrients are frequently mentioned. Over time, sodium intake has gone up while potassium intake has gone down - not by a large amount, but it's worth noting. \n \n \n \nThat being said, excessive sodium intake will lead to water retention which has a weight of approximately 8.3 lbs per gallon (1kg per liter). So, while sodium does not contribute to fat gain, it does lead to body weight gain holding on to all that water internally. \n \n \n \nEven including sodium, the micro-nutrients in our food have remained rather stable. Therefore, it is reasonable to assume weight gain in the U.S. isn't attributable to this particular aspect of our food. \n \n \nConclusion \n \nAlcohol, leisure-time activity and micro-nutrients - when taken as a whole - do not appear to be factors for U.S. citizens gaining weight. More than likely there are individual cases where this isn't true, but this article refers to overall trends. It should be noted that this article isn't cause to drink more, exercise less or eat junk food - doing one or more of those activities will probably make you fatter. What is being said is that Americans don't drink enough for it to be a factor, nor do they exercise too little in their leisure-time (as opposed to other times), nor has our food become less nutritious (at the micro level) - on average. \n \nSo why are we getting fatter if the above hold true? Come back next week for Part 3 of this series to find out. \n \n \n Continue to Part 3 \n \n \n Questions: \n1) Will somebody ever make alcoholic drinks packed with vitamins and minerals? \n2) Is there a link between malnutrition and democracy index? \n3) What other surprising phenomena aren't related to weight gain? \n \n Data: \n \n http://stats.oecd.org / \n http://www.cdc.gov/ \n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' and ' maps ' packages within the R programming language . Additional graphics were created/edited using GIMP . \n \n 1st graph: \nggplot(subset(alcohol.frame, Country==\"United States\"), aes(x=Year, y=Value, group=Year)) +\n geom_point(color=\"blue\", size=2.5) +\n geom_line(aes(group=1), color=\"blue\", size=1.1) +\n\n \n ylab(\"Amount (Liters per Capita)\") +\n xlab(\"Year\") +\n \n scale_y_continuous(limits = c(5,15)) +\n \n opts(title=\"Annual (per capita) United States Alcohol Consumption\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank())\n \n \n 2nd graph: \nggplot(sedentary.frame, aes(x=Year,y=Percent.Sedentary.During.Leisure)) +\n geom_point(size=2.5, color=\"blue\") +\n geom_line(size=1.1, color=\"blue\") +\n \n ylab(\"% Sedentary\") +\n xlab(\"Year\") +\n\n scale_y_continuous(limits = c(0,100)) +\n \n opts(title=\"% Sedentary During Leisure Time\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank(),\n  axis.line = theme_segment(),\n  plot.margin = unit(c(0, 3.5, 0, 0), \"cm\"))\n \n \n Further Reading:"], "link": "http://www.graphoftheweek.org/feeds/1977844432150600259/comments/default", "bloglinks": {}, "links": {"http://www.graphoftheweek.org/": 1, "http://www.gallup.com/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 3, "http://www2.potsdam.edu/": 1, "http://www.r-project.org/": 1, "http://www.livestrong.com/": 1, "http://www.organicsoul.com/": 1, "http://en.wikipedia.org/": 1, "http://www.gimp.org/": 1, "http://www.ihrsa.org/": 1, "http://cran.r-project.org/": 1, "http://www.memphisconnect.com/": 1, "http://stats.oecd.org/": 1, "http://www.cdc.gov/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["The Problem \n \n \nIn the United States, people are getting fatter and they are doing so at an alarming rate. \n \n \n \nSo What? \n \n \n \nBeing fat isn't just a social stigma - it's unhealthy in nearly every facet of life. Staying in this condition brings high blood pressure, diabetes, asthma and arthritis to name but a few. Additionally, an obese person has a much harder time 'doing stuff' in terms of physical activity. \n \n \n \nWant to know what it feels like? Strap on a fifty pound backpack and go for a walk. Better yet, try running with that extra weight and you will see just how much it impacts your ability to exercise let alone your ability to enjoy it. Do this daily for years and your joints will be set up perfectly for a lifetime of pain and stiffness. \n \n \n \nKudos to our military personnel (and any other job where this is required) who wear at least that much gear every day while performing their duties. \n \n \n \nFor the rest of us, an honest assessment is needed to reverse this trend. \n \n \nBMI \n \n \n \nDo you know your BMI (Body Mass Index)? Click here to access the National Heart, Lung and Blood Institute's calculator. \n \n \n \nOnce you have your BMI, look at the above chart. Where do you stand? If you are muscular, the calculator tends to overestimate while if you are older it may underestimate. That being said, it will still be in the ballpark because humans all share the same basic anatomy. \n \n \n Heavier People \n \n \n \nIgnoring BMI and only looking at body weight, it is obvious that people are heavier. Adult men on average have gained about 25 lbs (11.3 kg) from 1960 through 2002: \n \n \n \n \n  \n Average weight for adult men. \n \n \nThat's about 0.6 lbs (0.27 kg) per year. Like many trends, it doesn't seem so bad when describing the rate, but over time it adds up rather quickly. \n \n \nTaller People \n \nSince 1960, people have grown taller - about 0.9 inches (2.29 cm) taller for women and about 1.1 inches (2.79 cm) taller for men. So we are taller and heavier. That would explain some weight gain, but does it account for all 25 lbs? A little bit of math will reveal the answer: \n \n \n1960:     166.3 lbs / 68.3 inches \n →  2.43 lbs/inch \n \n \n \n \n \n2002:     191.0 lbs / 69.4 inches \n →  2.75 lbs/inch \n \n \n \nThe above calculations show that we are heavier per inch of height - about 1/3 lb more. Therefore the extra height does not explain all of the extra weight gain. \n \n \n \nHow much should an average height male weigh today? \n \n \n \nIf we were to measure how much we would weigh in 1960 given our extra height, it would come out to about 169 lbs ! Compare that to 191 lbs - a difference of 22 lbs (10 Kg)! \n \n \n \n \n \nConclusion \n \nPeople in the United States are getting taller and heavier. The rate of the former (height) is much slower than the latter (weight). People are becoming more unhealthy as a result. Additionally, it can be difficult to enjoy life when toting around those extra pounds. The only resolution to this problem is to lose weight - permanently. The next two articles will present information why this trend has occurred while also shedding light on ways to possibly reverse it. \n \n \n Continue to Part 2 \n \n \n Questions: \n1) How long can this trend continue? \n2) What is the burden on health care due to obesity? \n3) Are other countries experiencing similar problems? \n \n Data: \n \n http://www.cdc.gov/ \n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' and ' maps ' packages within the R programming language . Additional graphics were created/edited using GIMP . \n \n 1st graph: \nggplot() +\n geom_line(data = subset(bmi.frame, Description == \"Obese (BMI >= 30.0)\"), aes(x=Year, y=Median, color=\"Obese (BMI >= 30.0)\"), size=2) +\n geom_line(data = subset(bmi.frame, Description == \"Overweight (BMI >= 25.0 and BMI <= 29.9)\"), aes(x=Year, y=Median, color=\"Overweight (BMI >= 25.0 and BMI <= 29.9)\"), size=1) +\n geom_line(data = subset(bmi.frame, Description == \"Neither overweight nor obese (BMI <= 24.9)\"), aes(x=Year, y=Median, color=\"Neither overweight nor obese (BMI <= 24.9)\"), size=1) +\n \n geom_point(data = subset(bmi.frame, Description == \"Obese (BMI >= 30.0)\"), aes(x=Year, y=Median, color=\"Obese (BMI >= 30.0)\"), size=3) +\n geom_point(data = subset(bmi.frame, Description == \"Overweight (BMI >= 25.0 and BMI <= 29.9)\"), aes(x=Year, y=Median, color=\"Overweight (BMI >= 25.0 and BMI <= 29.9)\"), size=2) +\n geom_point(data = subset(bmi.frame, Description == \"Neither overweight nor obese (BMI <= 24.9)\"), aes(x=Year, y=Median, color=\"Neither overweight nor obese (BMI <= 24.9)\"), size=2) +\n  \n ylab(\"% of Population\") +\n xlab(\"Year\") +\n \n scale_colour_manual(values=cbPaletteNoGray) +\n \n opts(title=\"Body Mass Index (BMI) in the United States\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank(),\n  axis.line = theme_segment())\n \n \n 2nd graph: \nggplot(weight.frame, aes(x=Date.Range, y=Weight.lb)) +\n geom_point(aes(size=Weight.lb), color=\"dark red\") +\n geom_line(aes(group=1, size=Weight.lb), color=\"dark red\") +\n geom_smooth(aes(group=1), size=1, color=\"black\", method=\"lm\", na.rm=FALSE, fill=NA, linetype=2) +\n \n \n ylab(\"Weight (pounds)\") +\n xlab(\"Year Range\") +\n \n opts(title=\"Weight Gain in the United States\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank(),\n  axis.line = theme_segment())\n \n \n Further Reading:"], "link": "http://www.graphoftheweek.org/feeds/1507768278941679373/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.graphoftheweek.org/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.r-project.org/": 1, "http://www.nhlbisupport.com/": 1, "http://www.gimp.org/": 1, "http://cran.r-project.org/": 1, "http://www.cdc.gov/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Fires are natural - most of the time (click on image for larger view). \n \n \n \n \n \nNatural Global Fires \n \n \n \nMany plants and animals have evolved to depend on fires periodically occurring in certain parts of the world. This phenomenon has been occurring for millions of years, successfully replenishing and rejuvenating the areas in which it is allowed to happen. The ashes enrich the soil, animal populations are re-balanced and new life springs into existence. Additionally, these fires do not reduce the amount of land on which forests grow, thereby preserving the ecosystems contained within (with no loss of forest land). \n \n \n \nUnnatural Global Fires \n \n \n \nUsing the word 'unnatural' is always risky, but here it is meant to convey control by humans - which in itself is 'natural', but introduces many variables not before seen in history. Unlike natural fires which are beneficial, unnatural forest fires often have the opposite effect - especially when used to clear land of trees to make way for agriculture or construction. Over time, the number of trees decreases while the number of humans increases. More humans require more agriculture which means more deforestation. \n \n \n \nCarbon Dioxide \n \n \n \nCarbon dioxide is a major product of wood combustion. Looking at the above map, the produced amounts of this gas from fire can be seen over a thirteen year period from 1997-2010 (click on the image for a larger view). It's fairly obvious that fires tend to arise in the same places year after year. In most cases, the carbon dioxide produced is a result of naturally occurring fires as described above. However, in a few cases - particularly the Amazon Rainforest - much of this carbon output arises from unnatural fires. \n \n \n \nThe Amazon Rainforest \n \n \n \nWhat is so special about the Amazon rainforest? For starters, it represents over half of the world's remaining rainforests. It has been around for over 50 million years during which time numerous animals and plants have evolved and thrived within its confines. One in ten known species (of both plants and animals) lives in this area, representing a mind-boggling array of biodiversity . In a universe where life is scarce (see previous article about finding Earth II), the Amazon is brilliant diamond to be admired and respected. \n \n \n \nHumans (nay, all animals) rely upon the rainforest as well. Not only does it produce oxygen, but it also consumes carbon dioxide - necessary for all breathing animals. NASA has estimated the number of trees world-wide at around 400 billion. The human population is nearly 7 billion which gives us around 57 trees per person. In the past, that ratio was much higher in favor of the trees. That being said, there are still enough trees to support the oxygen requirements for life as we know it presently, but the ratio is still going down. \n \n \n \nOxygen from Oceans \n \n \n \nIt should be noted that about half of the world's oxygen supply does not come from trees or plants, but from the phytoplankton in the world's oceans (which itself has changed, but that's another story for another time). That's a good thing, given the amount of deforestation which has occurred. Otherwise, we might already be able to notice tangible differences in our air. \n \n \n \n \n \n \n  \n Brazil's GDP has gone up recently, perhaps reducing the need for deforestation. \n \n \n \n \nSince 1970, about 80% of the Amazon rainforest remains. In terms of actual forest loss, that equates to about 745,000 square kilometers - that's larger than the size of France! However, as the chart above shows, the rate of deforestation has been going down since 2004 due to a number of reasons. Hopefully this trend will continue - not only in the Amazon, but other forests as well. \n \n \n \n \nConclusion \n \nFires are a naturally occurring phenomenon which are beneficial to the world's ecosystems. However, when fire is used to remove forests for agriculture or construction, what remains has a greater burden to support a larger population of humans. This harms our symbiotic relationship with the trees so this cannot continue indefinitely. Like any good relationship, we must respect and nurture our partners while they do the same for us. Perhaps the recent trend in the Amazon is an indication that we understand this. Short-term gain is not a bad thing, but if it means a long-term loss then it is surely the wrong path. \n \n \n \n Questions: \n1) Will the Amazon rainforest be preserved? \n2) What is going on in the world's oceans in terms of oxygen production? \n3) When will a 'breaking point' occur at which time resources cannot support future population levels? \n \n Data: \n \n http://www.globalfiredata.org/ \n \n http://www.mongabay.com/ \n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' and ' maps ' packages within the R programming language . In the future, different plotting packages will begin to be seen here, including 3d plots and trellis plots. Stay tuned! \n \n 1st graph: \nggplot(countries, aes(long, lat, group=group)) +\n \n geom_polygon(data = global.carbon.1997.map.frame, aes(x=long, y=lat, fill=value, group=group), size=0.2) +\n geom_polygon(colour=\"black\", alpha=0.2) +\n \n ylab(\"Latitude\") +\n xlab(\"Longitude\") +\n \n scale_fill_continuous(low=\"light grey\", high=\"red\",\n  space = \"Lab\"\n ) +\n opts(title=\"1997 Global Carbon Emissions from Fire (1e12 grams Carbon per year)\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank())\n \n \n 2nd graph: \nggplot(amazon.frame, aes(x=Period, y=Annual_forest_loss)) +\n geom_point() +\n geom_line(aes(group=1),size=1.0) +\n geom_smooth(aes(group=1), method=\"lm\", na.rm=FALSE, fill=NA, size=1.0) +\n \n ylab(\"Annual Forest Loss (square kilometers)\") +\n xlab(\"Period\") +\n opts(title=\"Amazon Deforestation Loss\",\n  axis.text.x=theme_text(angle=45, hjust=1),\n  panel.background = theme_blank(),\n  plot.margin = unit(c(0,6,0,0), \"lines\")) +\n scale_y_continuous(labels = mysep)\n \n Further Reading:"], "link": "http://www.graphoftheweek.org/feeds/1688699124522687615/comments/default", "bloglinks": {}, "links": {"http://www.graphoftheweek.org/": 1, "http://www.mongabay.com/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://news.mongabay.com/": 1, "http://www.thefreedictionary.com/": 1, "http://www.r-project.org/": 1, "http://bloomfieldmichael.wordpress.com/": 1, "http://www.globalfiredata.org/": 1, "http://4.blogspot.com/": 2, "http://cran.r-project.org/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Surprising results \n \n \n \nFor purposes of this article, any mention of homicide rates refers to reported homicide rates. \n \n \nOpen vs Closed \n \nIn mostly open countries (full democracies), the homicide rates are rather low when compared to other types of governments - except for authoritarian regimes. Left open to speculation, the reasons can be many. Perhaps people in free societies are happier - happy people don't tend to murder other people, otherwise they wouldn't be happy. In a previous articles, it was shown that full democracies produce longer life spans and are world leaders in technological advancements . So, not only do people thrive when free, but they live longer and pursue creativity. \n \nIn mostly closed countries (authoritarian regimes), the homicides rates are also low (comparatively speaking). It's very well possible that not all homicides are reported in these countries - especially given recent events regarding the revolts in the Arabian countries (see Arab Spring ). Many thousands have died during this time which would not be reported as a 'homicide.' When the government murders a person, it is viewed as eliminating a criminal - not a homicide (in all countries, that is). But if the rates are somewhat accurate, then why so low? Perhaps it is due to fear - people who are afraid for their own lives probably will not kill others if that means their own death. \n \n \n \n \nWho Reports the Most Homicides? \n \nFlawed democracies. \n \nThese are the 2nd tier most 'free' countries. That begs the question - what exactly is a flawed democracy? It's not a simple answer - it's a rating based on a country's democracy index . In summary, it is based on five categories: electoral process and pluralism, civil liberties, the functioning of government, political participation and political culture. Click here for a full description. \n \nWhy is this? Perhaps those countries have unemployment problems, gender equality problems or culture problems. The question begs further research in this area and this author has not yet found a statistical correlation. If interested, the worst offenders include Honduras, Jamaica, El Savador, Trinidad and Tobago, South Africa, Brazil, and Columbia. \n \nAnybody with insight into this area is welcome to comment. At any rate, if you are planning on visiting or moving to a country with a 'flawed democracy', you should keep the data presented here in mind. \n \n \n \n  \n Too many authoritarian regimes. \n \n EDIT: Originally published on 2012-05-16, the above map was out of date (showing USSR instead of current global makeup). On 2012-05-25 it was replaced using current political boundaries. \n \nFor a global map categorized by government type, see the chart above. Nearly 40% of the world is under authoritarian rule (much of that is China), while only 13% are under a full democracy. It would be interesting to see a similar map at one hundred year intervals going back in time. \n \n \n \nA country can indeed make the transition from authoritarian regime to full democracy, but usually not without significant loss of life. Both Germany and Japan were authoritarian before and during World War II, but have since become very free countries. Hopefully this will occur in the aforementioned Arabian countries as well - time will tell. \n \n \n \n \n \nConclusion \n \nThis is the third article showing a relationship between freedom and its effects on people (the first two are here and here ). Based on the data, this series of articles (strongly) suggests that people thrive more in free countries than oppressed ones. In this particular instance, there is a relationship between freedom and low homicide rates as well as a similar one for authoritarian regimes. All things being equal, this author chooses to live freely. Without that freedom, it wouldn't be possible to even find data for such an article as this much less publish it. Oppression is only beneficial to the oppressors. \n \n \n \n Questions: \n1) When looking at history, is there an increasing or decreasing trend in the number of full democracies? \n2) How many homicides are not reported? \n3) What would this map look like if all wrongful deaths were accurately reported? \n \n Data: \n \n http://data.un.org/ \n \n http://www.eiu.com/ \n \n Code: \nThese graphs were generated using the ' ggplot2 ' package within the R programming language . In the future, different plotting packages will begin to be seen here, including 3d plots and trellis plots. Stay tuned! \n \n 1st graph: \n\nggplot(subset(homicide.merge.frame, Source.Level.1=='Police'), aes(x=Index, y=Rate, group=Category, fill=Category)) +\n geom_boxplot() +\n ylab(\"Homicides per 100,000\") +\n xlab(\"Democracy Index\") +\n opts(title=\"Flawed Democracies Produce Hightest Homicide Rates\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank()) \n 2nd graph: \n\nggplot(globe, aes(long, lat, group=group)) +\n\n geom_polygon(data = dem.globe.index.frame, aes(x=long, y=lat, fill=Category, group=group), size=0.2) +\n geom_polygon(colour=\"black\", alpha=0.2) +\n \n ylab(\"Latitude\") +\n xlab(\"Longitude\") +\n \n opts(title=\"Government Category Map\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank())\n \n \n Further Reading:"], "link": "http://www.graphoftheweek.org/feeds/1680794793140928655/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.graphoftheweek.org/": 4, "http://www.eiu.com/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.r-project.org/": 1, "http://data.un.org/": 1, "http://www.economist.com/": 2, "http://en.wikipedia.org/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["The rushing game is slowly disappearing. \n \n \nHeave That Sucker \n \n \nWhen it doubt, chunk the pigskin. Whether you like it or not, NFL (National Football League) teams are relying upon passing more and more. Looking at the above chart, the average passing yards per game tends to go up by 25 yards every two decades - or 1.25 yards per year. \n \n \nCan't Touch This \n \n \n \n \nAs the game has progressed, rule changes (especially since 1974) have allowed receivers nearly unrestricted movement down field. The result? A wide receiver can basically sprint thirty or forty yards, ' juking ' defenders without being touched. The ball can then be rocketed to them in no time resulting in huge gains - given you have a great quarterback. \n \n \n \nIn other words, if you don't have the ball in your hands, you are allowed free movement at full speed. \n \nTry doing that with the ball in your hands - you will be gang tackled. Which is one reason why rushing is slowly losing favor and trending downward slightly each year (0.3 yards per year). \n \nAnd also why rushers have the shortest NFL careers - they get hit relentlessly and often. \n \n \n \nTime \n \nSo why rush at all? Time. It keeps the clock running which keeps the other team's offense off the field. Not to mention giving the offense a chance to beat up the defense a little. There are several other reasons to run the ball, but this is not a football primer , so we'll stop there. \n \n \nCase in Point - 2011 \n \n \nIn 2011, there was a relationship between passing and winning. How much of a relationship? Well, about 33% of a team's winning percentage can be attributed to its passing yardage total. Admittedly, that's not a very strong relationship, but teams should pay attention to it regardless. Look at the graph below to see the trend as well as the teams employing it more effectively. \n \n \n  \n Don't Rush to Win \n \n \n \nThe Quarterback with the Golden Arm \n \n \n \nThere is a financial scrum every time a good quarterback hits the market which is a rare phenomenon in and of itself. Teams which understand how important the passing game is will go to extreme measures to obtain the right QB (see Peyton Manning). Having the ability to read the defense, react accordingly, understand the passing routes and deliver a crisp pass to the receiver are sought-after qualities leading to a significant number of wins. \n \n \n \nRushing for Support \n \n \n \nPerhaps the more surprising statistic is that rushing has no relationship to winning in terms of yardage. That being said, it is likely that rushing helps to open up the passing game. If the defense knows you can run, then they have to 'play honest' (prevents them from setting up only to defend the pass). Regardless, there is no doubt that rushing for 200 yards per game will not get you wins as there is no correlation. \n \n \n \n \n \nConclusion \n \nThe NFL has changed the rules over time to protect the offense - especially the quarterback and receivers. Therefore, if you have premium players capable of exploiting the niches made available via these rule changes, then you most likely have yourself a winning team. Additionally, the fans seem to love a 'wide open' style of play which involves lots of passing. On the other hand, nothing is more deflating than seeing a team run it up the middle for no gain. Expect to see more passing as the game evolves unless the rules change in favor of rushing. \n \nNext year this author is going to use data such as this to make a few predictions. It shouldn't be difficult to out-perform the ESPN analysts . \n \n \n Questions: \n1) Just how little can a team rush the ball and still be competitive? \n2) Will we see a team average 400 yards passing per game in the future? \n3) Will the NFL change the rules to make rushing more viable (again)? \n \n Data: \n \n http://www.pro-football-reference.com/ \n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' package within the R programming language . In the future, different plotting packages will begin to be seen here, including 3d plots and trellis plots. Stay tuned! \n \n 1st graph: \nggplot(nfl.passing.win.frame, aes(x=W.L., y=Y.G, color=\"Passing\", label=Tm)) +\n \n geom_point(data=nfl.passing.win.frame, aes(x=W.L., y=Y.G, color=\"Passing\")) +\n geom_point(data=nfl.rushing.win.frame, aes(x=W.L., y=Y.G, color=\"Rushing\")) +\n \n geom_text(size=2.5, angle=0, hjust=.5) +\n \n geom_smooth(data=nfl.passing.win.frame, aes(x=W.L., y=Y.G, color=\"Passing\"), fill=NA, size=1.1, linetype=2, method=\"lm\", na.rm=FALSE) +\n geom_smooth(data=nfl.rushing.win.frame, aes(x=W.L., y=Y.G, color=\"Rushing\"), fill=NA, size=1.1, linetype=2, method=\"lm\", na.rm=FALSE) +\n \n ylab(\"Yards per Game\") +\n xlab(\"Win Percentage\") +\n \n opts(title=\"NFL 2011: Pass to Win\", \n  legend.title = theme_blank(),\n  panel.background = theme_blank())\n \n 2nd graph: \n\nggplot(nfl.sub.frame) +\n \n geom_line(data=nfl.sub.frame, aes(x=Year, y=Yds.1, color=\"Passing\"), size=1.1) +\n geom_line(data=nfl.sub.frame, aes(x=Year, y=Yds.2, color=\"Rushing\"), size=1.1) +\n geom_line(data=nfl.sub.frame, aes(x=Year, y=Yds, color=\"Total\"), size=1.1) +\n \n geom_smooth(data=nfl.sub.frame, aes(x=Year, y=Yds.1, color=\"Passing\"), fill=NA, size=1.1, linetype=2, method=\"lm\", na.rm=FALSE) +\n geom_smooth(data=nfl.sub.frame, aes(x=Year, y=Yds.2, color=\"Rushing\"), fill=NA, size=1.1, linetype=2, method=\"lm\", na.rm=FALSE) +\n geom_smooth(data=nfl.sub.frame, aes(x=Year, y=Yds, color=\"Total\"), fill=NA, size=1.1, linetype=2, method=\"lm\", na.rm=FALSE) +\n \n ylab(\"Yards per Game\") +\n xlab(\"Year\") +\n \n opts(title=\"NFL: More Passing, More Yards\", \n  legend.title = theme_blank(),\n  panel.background = theme_blank())\n \n \n Further Reading:"], "link": "http://www.graphoftheweek.org/feeds/499094234149501147/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.pro-football-reference.com/": 1, "http://www.graphoftheweek.org/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.r-project.org/": 1, "http://www.nfl.com/": 2, "http://4.blogspot.com/": 1, "http://nflhealthandsafety.com/": 1, "http://www.urbandictionary.com/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["By 2030, we will have found approximately 10,000 exoplanets. \n \n \n\" If it is just us... seems like an awful waste of space.\" \n -- from the movie Contact \n (1997) based on the book Contact \n by Carl Sagan . \n \nBy the year 2030, it's possible that over ten thousand exoplanets (planets outside our solar system) will have been discovered if the above trend continues. That assumes a couple of things: \n \n The rate at which they are being discovered continues to grow in an exponential manner. \n There aren't other limiting factors. \n \n \n \n \n \n \nHurdles \n \n \n \nThere is a huge amount of variability that exists in real life. For example, there are only a finite number of telescopes capable of detecting exoplanets in existence - and all of those are time-shared for other purposes. In addition, there is a finite number of astronomers who's interests lie in this area. Other factors would include budgets, detection methodologies , automation techniques, political stability and others which cannot be foreseen. \n \nIn other words, don't take that prediction too seriously. \n \nOr perhaps you should. After all, we may discover far more exoplanets in that same time frame. \n \n \nFarther and Smaller \n \nStudying the above graph, it can be seen that planets are being discovered farther and farther away, which says something about the techniques used to discover them. It is mind-boggling to think that we can sense the presence of objects so far away mostly by inference. The thought of travelling to any of these distant planets is even more mind-blowing as we face many problems 'just' getting to Mars. \n \nLooking at the chart below reveals our ability to see smaller and smaller planets as our techniques and knowledge grow. If that trend continues, it is only a matter of time before we can detect Earth-sized exoplanets and perhaps smaller. This will be more exciting than finding all of the current gas giants since we can't land or live on those - the Earth-sized rocky planets are another matter. In those cases, not only is the gravity of those planets (probably) comparable to ours, but we have something to land on and if it has oxygen (and other gases favorable for respiration) then perhaps we might someday set foot there. \n \nExciting, yes? \n \n \n  \n It won't take long. \n \n \n \nEarth II \n \n \n \nIf we were to ever set foot on another planet that harbors intelligent life, it would be very illuminating to discover their political systems, social norms, history and culture to name a few. Would they have lots of countries like us? And could we attribute a democracy index to them as well? \n \n \n \nIf it is mostly uninhabited (not likely if it has an oxygen-rich atmosphere), then how might we re-create civilization there? Would we learn from our past mistakes? And how might relations be between Earth I and Earth II? Eventually (if not immediately) Earth II would be independent - would they have to fight Earth I for it? \n \n \n \nThe possibilities seem endless. \n \n \n \n \nConclusion \n \nThe human species has gone from traveling by horse and carriage to landing on the moon in less than a century. Forty years after that we have begun to detect exoplanets. As time marches on, it will be interesting to see developments in this area, especially if we find life elsewhere. It might actually be more interesting to find a planet capable of sustaining terrestrial life as that would give us a target for migration. After all, if it 'just us', then maybe we can make better use of the space. \n \n \n \n \n Questions: \n1) If life is discovered elsewhere, how will that affect humanity? \n2) Will we ever be able to launch a manned expedition to another world outside our solar system? \n3) Which will be the first country to make it to Mars, if ever? \n \n Data: \n \n http://exoplanets.org/ \n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' package within the R programming language . In the future, different plotting packages will begin to be seen here, including 3d plots and trellis plots. Stay tuned! \n \n 1st graph: \n\nggplot(exo.planets.sub.frame, aes(x=factor(DATE), y=`Size (in Jupiters)`)) +\n geom_point(aes(size=`Size (in Jupiters)`, color=`Size (in Jupiters)`)) +\n xlab(\"Year\") +\n ylab(\"Planet Radius\") +\n \n opts(title=\"Just a Matter of Time before finding Earth II\",\n  panel.background = theme_blank()) \n 2nd graph: \n\nggplot(exo.planets.sub.frame, aes(x=DATE, group=`Distance (in parsecs)`, fill=`Distance (in parsecs)`)) +\n geom_histogram(binwidth=1) +\n\n xlab(\"Year\") +\n ylab(\"Number of Exoplanets Discovered\") +\n \n opts(title=\"We've Only Just Begun\",\n  panel.background = theme_blank())\n \n \n Further Reading:"], "link": "http://www.graphoftheweek.org/feeds/7766149848755807640/comments/default", "bloglinks": {}, "links": {"http://www.graphoftheweek.org/": 1, "http://www.novacelestia.com/": 2, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.r-project.org/": 1, "http://exoplanets.org/": 1, "http://4.blogspot.com/": 1, "http://www.amazon.com/": 2, "http://www.carlsagan.com/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Full democracy countries are the ones in which to live. \n \nThis week's story could start and end with the above graph with almost no further explanation. \n \nBut that wouldn't do it justice. \n \nSo, like so many of the past articles on \" Graph of the Week \", a bit of analysis will be provided based on collected data and research. Starting with what is shown above, it is clear that people tend to live longer under full democracies . The range of life spans under this type of government nearly always are above 80. Compare that with other forms of government where only a select few nations have longevity near that age. \n \nAnd as might be expected, authoritarian regimes have the most countries with comparatively short life expectancies. \n \nWhy? \n \n \n \nGovernment Spending on Healthcare \n \nIn the first graph, the countries in blue are the ones under a full democracy and also rank very high on the democracy index scale. Using those same colors below, it is plainly obvious that these same countries spend more per capita on healthcare than do other forms of government - a lot more: \n \n \n \n  \n The Nordic countries lead the way again. \n \n \n \nFreedom, Compassion and Longevity \n \nIn many of these countries, there is some form of universal healthcare which accounts for much of the spending. Regarding the U.S., a significant amount is spent on Medicare and Medicaid, but there is no universal health care. There certainly seems to be a relationship between freedom, compassion and longevity in countries embracing full democracies (see previous chart showing democracy index and internet penetration). In other words, those countries that look after their own tend to live longer lives. Since humans are a social species, this isn't a surprise. \n \n \nUniversal Health Care - Quality \n \nThere is usually some form of universal health care in authoritarian regimes as well. On the surface, it would appear that all things are equal until the amount of spending on health care is examined. Clearly, full democracies spend much more on their systems than the others. That, combined with the longevity factor paints a picture which suggests more spending is needed to increase life spans. It is not enough to simply have a universal health care system; rather, the quality of that system is what drives longevity. \n \nThat being said, the quality of a health care system isn't reflected by the amount spent. It is useful to see expenditure as an indicator, but not as a cause of a quality system. To more accurately evaluate this aspect, further research would be needed and is out of the scope of this article. \n \n \nConclusion \n \nCountries in which their citizens have little voice in their own destinies would do well to make changes to reverse this situation. Unfortunately, most leaders in power are loathe to give up said power due to its many perks - at the cost, health, happiness and freedom of its citizens. This is a tragedy on a global scale. \n \nThis has been the 2nd article to identify a relationship between democracy and other factors. The first showed that internet availability is much higher in countries with a high democracy index. Stay tuned for more articles in this series. \n \n \n \n \n Questions: \n1) When might we see the highest average life span creep into the 90 year range? \n2) The Arab Spring has started - will something similar happen in other authoritarian countries? \n3) Has quality of life (not the same as standard of living) also been improved along with longevity? \n \n Data: \n http://www.who.int/ \n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' package within the R programming language . In the future, different plotting packages will begin to be seen here, including 3d plots and trellis plots. Stay tuned! \n \n 1st graph: \n\nggplot(health.frame, aes(x=Category, y=Life.expectancy, group=Category, fill=Category, label=Location)) +\n geom_boxplot() +\n \n ylab(\"Life Expectancy\") +\n xlab(\"Government Type\") +\n \n opts(title=\"Life Expectancy by Government Type (2009)\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank(),\n  axis.text.x=theme_text(angle=0, hjust=0.5)) \n 2nd graph: \n\nggplot(health.frame, aes(x=Index, y=Per.capita.government.US, label=Location, color=Category)) +\n geom_point(size=0.5, colour='dark grey') +\n geom_text(size=3.5, angle=0, hjust=.5) +\n \n ylab(\"Per Capita Government Spending (U.S. Dollars)\") +\n xlab(\"Democracy Index\") +\n \n opts(title=\"Gov't Health Care Expenditures vs. Democracy Index (2009)\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank())\n \n \n Further Reading:"], "link": "http://www.graphoftheweek.org/feeds/93812592970847619/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.graphoftheweek.org/": 2, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.r-project.org/": 1, "http://www.economist.com/": 1, "http://graphoftheweek.org/": 1, "http://www.who.int/": 1, "http://www.co.uk/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Smaller countries lead the way. \n \nWhen you think of 'high-tech', which countries come to mind? \n \n \n \nWhat is 'High-Tech'? \n \nBefore continuing, what is meant by the term 'high-tech'? As defined by the World Data Bank, high-technology exports are products with high R&D (Research and Development) intensity, such as aerospace, computers, pharmaceuticals, scientific instruments and electrical machinery. That doesn't necessarily mean 'end products' - the gadgets, drugs, meters, etc. that end up in your hands for use; rather, it often means the parts or chemicals that go into those devices which are often assembled elsewhere. \n \n \n \nIt's Not Who You Might Think \n \nWe tend to associate that term with countries such as Japan, the United States, Great Britain, the Nordic Countries , France, India, Taiwan and China to name a few. It's reasonable to make that assumption because those countries do indeed export high-tech products in large amounts. However, that's not the only thing they export since most are large enough to diversify. Therefore, when we look at their high-tech exports as a percentage of their total exports, it mostly rises no higher than 30%. \n \n \n \nSmaller Countries Lead the Way \n \nThis week we focus on several small countries which have chosen to primarily focus on high-tech exports as a means to bolster their economy. This tends to net two benefits: \n \n \n Foreign investment which brings in much-needed capital. \n Local jobs which lowers unemployment. \n \nTake Costa Rica , for example: prior to 1995, they had virtually no exports in the technology sector. However, since they offered tax exemptions for those willing to invest in the country, several technology-based companies have begun to develop in the area such as Intel and GlaxoSmithKline . Looking at the above chart, it is plain to see how smart, smaller countries are embracing high-technology and using it to gain a foothold in the global market. \n \n \nForeign Investment \n \nDo the countries shown above also show healthy foreign investment as argued above? \n \nLook at the graph below. Most of them are in the upper echelon with some having significant investment from abroad. It is interesting to look at Ireland in this scenario. Given that country's other problems , even their high-tech exporting business suffered mightily, which suggests that some problems are just too large to overcome by being smart investors. \n \n \n  \n These high-tech exporting countries attract foreign investors. \n \n \n \nHigh-tech Investment Produces Local Jobs \n \nHave these same countries seen an increase in local jobs due to producing high-tech exports as argued above? \n \nFor the most part, their unemployment rates hover beneath the global average (a good thing). Even the Philippines , with a history of economic turmoil, has recently seen lower unemployment figures and is predicted to be one of the ' Next Eleven ' largest economies. For a chart showing these countries' unemployment figures, see below: \n \n \n  \n With the exception of Ireland, these countries are looking good. \n \n \nKeep an Eye on These Countries \n \n \n \n In addition to the 'Next Eleven', this author is suggesting that the other five countries highlighted here should also be included when making rosy economic predictions due to reasons described above (with Ireland a possible exception until they get their problems straightened out). The only country showing problems recently is Ireland for reasons cited above. No matter what data you have on hand, however, sometimes situations come along that ruin the party. \n \nRecessions Affect Everyone \n \nWhen the world economy takes a dive, it tends to affect everybody. \n \nDuring the global recession in 2008, nearly everyone was affected which can also be reflected in the above graphs to a certain degree. However, the high-tech industry was amazingly resilient and only dipped a little. That being said, it would be prudent for these countries to diversify, thereby bolstering their ability to withstand global financial downturns. \n \n \nConclusion \n \nPresented here are several examples of smaller countries gaining a foothold in the global economy via high technology exporting. While it doesn't guarantee success, it does trend towards a robust economy for those countries willing to take the risk. When other extenuating circumstances are not intervening (as noted with Ireland), these countries seem to exhibit stable economies. This is not to say that other types of exports would not also produce a similar effect; only high-tech exports were examined here. For those smaller, struggling countries, they might consider allowing foreign investment to bolster this sector - it certainly seems to net positive gains. \n \n \n \n \n Questions: \n1) Many of the countries highlighted here are island nations - coincidence? \n2) Will other small countries follow suit and allow foreign investment in this sector? \n3) What other types of export allow for a resilient economy? \n \n Data: \n \n http://data.worldbank.org/ \n \n Code: \nThese graphs were generated using the ' ggplot2 ' package within the R programming language . In the future, different plotting packages will begin to be seen here, including 3d plots and trellis plots. Stay tuned! \n \n 1st graph: \n\nggplot(exports.melt.frame, aes(x=year, y=value, group=year), na.rm = TRUE) +\n geom_boxplot(na.rm = TRUE) +\n geom_point(data=subset(exports.melt.frame, Country.Name == \"Costa Rica\"),\n aes(x=year, y=value, color=\"Costa Rica\")) +\n geom_point(data=subset(exports.melt.frame, Country.Name == \"Ireland\"),\n aes(x=year, y=value, color=\"Ireland\")) +\n geom_point(data=subset(exports.melt.frame, Country.Name == \"Malaysia\"),\n aes(x=year, y=value, color=\"Malaysia\")) +\n geom_point(data=subset(exports.melt.frame, Country.Name == \"Malta\"),\n aes(x=year, y=value, color=\"Malta\")) +\n geom_point(data=subset(exports.melt.frame, Country.Name == \"Philippines\"),\n aes(x=year, y=value, color=\"Philippines\")) +\n geom_point(data=subset(exports.melt.frame, Country.Name == \"Singapore\"),\n aes(x=year, y=value, color=\"Singapore\")) +\n \n geom_line(data=subset(exports.melt.frame, Country.Name == \"Costa Rica\"),\n aes(x=year, y=value, group=1, color=\"Costa Rica\", linetype=5), size=1.1) +\n geom_line(data=subset(exports.melt.frame, Country.Name == \"Ireland\"),\n aes(x=year, y=value, group=1, color=\"Ireland\", linetype=5), size=1.1) +\n geom_line(data=subset(exports.melt.frame, Country.Name == \"Malaysia\"),\n aes(x=year, y=value, color=\"Malaysia\", group=1, linetype=5), size=1.1) +\n geom_line(data=subset(exports.melt.frame, Country.Name == \"Malta\"),\n aes(x=year, y=value, color=\"Malta\", group=1, linetype=5), size=1.1) +\n geom_line(data=subset(exports.melt.frame, Country.Name == \"Philippines\"),\n aes(x=year, y=value, color=\"Philippines\", group=1, linetype=5), size=1.1) +\n geom_line(data=subset(exports.melt.frame, Country.Name == \"Singapore\"),\n aes(x=year, y=value, color=\"Singapore\", group=1, linetype=5), size=1.1) +\n \n scale_colour_manual(values=cbPalette) +\n \n ylab(\"% of Exports Which are High Tech\") +\n xlab(\"Year\") +\n \n opts(title=\"Percentage of Country's Exports which are High Tech\",\n legend.title = theme_blank(),\n panel.background = theme_blank(),\n axis.text.x=theme_text(angle=45, hjust=1)) \n ***The other two graphs are very similar to the 1st graph, just using a different data set, so that code is not included here.*** \n Further Reading:"], "link": "http://www.graphoftheweek.org/feeds/8680729076529882491/comments/default", "bloglinks": {}, "links": {"http://www.intel.com/": 1, "http://3.blogspot.com/": 1, "http://www.visitcostarica.com/": 1, "http://www.graphoftheweek.org/": 1, "http://www.lonelyplanet.com/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.r-project.org/": 1, "http://data.worldbank.org/": 1, "http://www.discoverireland.com/": 1, "http://en.wikipedia.org/": 1, "http://4.blogspot.com/": 1, "http://2.blogspot.com/": 1, "http://www.co.uk/": 1, "http://www.gsk.com/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Data represents all planes (not just commercial planes) for the United States \n \n\"There are only two emotions on a plane: boredom and terror.\" \n-- Orson Welles, interview to celebrate his 70th birthday, The Times of London, 6 May 1985. \n \n \n \n \n \n \n \n \n \nFor some people, flying represents their worst fears. Not only are you helpless if something goes awry, but you will most likely have some time to ponder it before the end arrives. \n \n \nTerror \n \nTakeoff can be the worst as you feel the chassis shudder and moan with the strain. This is the time when many accidents occur, due to the forces involved getting a massively heavy object off the ground. That being said, there aren't enough o's in smooth to describe the sensation once you arrive at altitude. Unless, of course, you hit turbulence... \n \n \n \n \nBoredom \n \nDuring the main leg of the flight, Orson Welles was correct about boredom - before all of the entertainment options sprung up on airplanes. In his time, imagine flying across country in a smoke-filled airplane with nothing to do except immerse yourself in a book. These days most passengers play games, watch movies or listen to music to keep themselves occupied. Of course, there is always the option of actually talking to your neighbor. \n \n \nTerror \n \nInevitably, the plane must land and the fear factor usually rises again. Crosswinds, runway conditions and pilot skill all play a role in landing. Looking out the window and seeing the wing rise and fall as the airplane rotates to counter various atmospheric effects can certainly make one nervous. Depending on the above factors, sometimes you are greeted with a jolting sensation as the plane touches (sometimes bounces) down. \n \n \nAccidents are Fewer and Less Catastrophic \n \nLooking at the above chart (which shows all accidents for all types of planes), two main trends emerge: \n \n The number of accidents is decreasing as a trend. Since 1982, this number has basically been cut in half. \n The percentage of planes being destroyed from an accident has fallen dramatically. \n \n \n \nIt is refreshing to see that aviation safety is looking up. One reason might be from advancements such as the Traffic Collision Avoidance System , which is designed to reduce mid-air collisions. As the TCAS and other systems evolve, accidents should continue to trend downward in the years to come. \n \n \nOther reasons might include the composition of the planes themselves, procedural changes, better pilot training methods or perhaps aircraft design. Come back and visit this site again for further exploration of this topic. \n \n \n \n \nConclusion \n \nIf the news reported the number of safe flights on a daily basis, the papers would be overflowing with that one theme. Unfortunately, that aspect isn't news; what is news is when an airplane crashes. When that happens, we have no reference point to remind ourselves that we have a 1 in 2 million chance of being involved in an aviation accident and have at least a 60% chance of surviving it. If one were to think that news is reality, then nobody would fly. News generally only represents something way out of the ordinary - a statistical outlier. While nothing is guaranteed in this world, flying is still a pretty safe bet. \n \n \n \n \n Questions: \n1) What advancements have been made in aircraft technology? \n2) What other flight management systems are being considered to improve flight safety? \n3) Will newspapers ever put stories in context? \n \n Data: \n \n http://www.ntsb.gov/ \n \n Code: \nThese graphs were generated using the ' ggplot2 ' package within the R programming language : \n \n 1st graph: \ngraph.cols <- c(\"dark red\",\"red\",\"pink\",\"grey\")\n\nggplot(subset(accidents.prior.frame, Country == 'United States'), aes(x=Accident.Date,fill=factor(Aircraft.Damage))) +\n geom_histogram(binwidth=365.2) +\n \n ylab(\"Number of Accidents\") +\n xlab(\"Year\") +\n \n opts(title=\"Yearly Aviation Accidents\",\n legend.title = theme_blank(),\n panel.background = theme_blank(),\n axis.text.x = theme_text(angle=60)) +\n scale_fill_manual(values = graph.cols)\n \n Further Reading (the following all have at least 3 stars or are unrated):"], "link": "http://www.graphoftheweek.org/feeds/5761552447003561656/comments/default", "bloglinks": {}, "links": {"http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://adsb.faa.gov/": 1, "http://www.ntsb.gov/": 1, "http://www.r-project.org/": 1, "http://4.blogspot.com/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Tax rates were higher in the past... \n \n \n \n \n \n \n \n \n \n \nJoe derisively snorted at the pay stub in his hand. Crumpling it into a ball, he wound up like a baseball pitcher and fast-balled the wad of paper across the room. It bounced unsatisfying off the wall and onto the floor, coming to a rest near his feet. \n \n \n \n\"Guess I'm not cut out for the big leagues,\" he muttered to himself. Flopping down on the couch, he snatched the remote and jabbed it towards the high-def TV, hoping to take his mind off it all. With his head in one hand he began to channel surf with the other, staring blankly at the flickering screen. \n \n \n \nThe cell phone on the coffee table suddenly buzzed while playing \"In the Mood\" by Glenn Miller. Joe jerked out of his trance, leaning over to catch the spinning device. \"Hi Dad,\" he dejectedly said, \"what's up?\" \n \n \n \n\"You interested in watching the NCAA tournament at Mac's? They've got great specials during the games,\" his dad asked. \n \n \n \n\"I can't afford it, Pops. All of my money goes to taxes,\" Joe answered. \n \n \n \nAs outrageous laughter burst forth from the other end of the phone, Joe pulled it away from his ear and scowled at it. Snapping it back, he said annoyingly \"Dad, this is serious. I'm getting taxed to death!\" \n \n \n \nMore laughter. \n \nHis dad laughed so hard that he went into a coughing fit. After hacking and spitting, he finally calmed down telling Joe \"you have no idea what you are talking about.\" \n \n \nDad Had It Worse \n \nHis brow furrowed in confusion, Joe's mood changed from anger to curiosity. \"What do you mean?\" he asked. \n \n\"Son, the income tax you are paying now is much lower than what we paid when I was in my prime,\" he replied. \"Back in my day, over 50% of my income was taxed. 50%! And I didn't have it as bad as those who earned more - some of them were taxed at over 80%,\" he calmly informed Joe. \n \n\"Eighty percent? You're kidding!\" \n \n\"Not at all. The taxes from World War II were sky high. And the government didn't drop those rates until nearly twenty years later,\" he recalled. \n \nJoe put his finger to his chin in thought. Maybe I don't have it so bad . Standing up, he said \"Dad, let's go watch the game - my treat.\" \n \n \nPerspective \n \nThe above short story only illustrates a lower-middle income tax family. If you were really wealthy back in the 40s and 50s, a great deal of your income was taken by the government. Even if you were quite poor, your tax rates were still above today's rates, so it affected everyone to varying degrees. \n \nThe above graph is called a 'box and whisker' chart. The lower line represents the bottom 25%, the lower half of the red bar the next 25% up, the top half of the red bar the next 25% and the top line is the top 25% of all the marginal tax rate brackets. Although the prior statement seems like a mouthful, you can generally see how the tax rate has fluctuated wildly over time. \n \nThe single person tax tables were used to generate the above chart. When plotting other charts such as married (filing separately or jointly), they all looked nearly identical to the one above. \n \nFor the political inclined, the graph is also colored to show the party of the president in power at the time. Read into that what you will! \n \n \nA Few Facts \n \nThe author is not a tax lawyer nor an accountant. Therefore, what is presented here is just one part of the taxation story. A few items, however, are undeniable: \n \n Before 1913, there was no permanent income tax. There were, however, previous income taxes that expired - mostly to pay for the civil war, which brings up point #2: \n Wars are hideously expensive, not to mention horrifying (see last week's graph \" U.S. Soldiers Died from What? \"). In the above graph, tax rates skyrocketed during both world wars, gradually coming down later (much later in the case of WWII). \n The poorest 25% in this country have had their tax rates vary by about 20%. \n The wealthiest 25% have had their tax rates vary by nearly 90% which has sparked considerable debate. \n Today's tax rates are relatively low. \n \n \nTax Rate Are (Relatively) Low \n \n \n \nIf you didn't have a chart to look at, point #5 would seem unbelievable. With so much economic turmoil affecting American life, it probably seems that tax rates feel high. However, this is clearly not the case. As a side note, a period of low taxation preceded both the Great Depression as well as our current recession . More research will be required to help explain that phenomena. \n \n \n \nMany people will no doubt be taken aback when looking at historical tax rates. It wasn't all that long ago when the entire populace was taxed at extremely high rates over a span of twenty years. If you have felt like Joe recently, perhaps this will bring some peace of mind. Although the size of government has grown and certain liberties are being assailed, our tax rates are still comparatively low. \n \n \n \nYou might be wondering how the government can be so large with low tax rates? Only personal income tax was examined here - there are many other sources of revenue for the government. Additionally, the population is larger which means a larger tax base which means more absolute dollars available as well. Further, the federal deficit is enormous, meaning that the U.S. has borrowed a lot of money to keep its programs functioning. \n \n \n \nIn short, economics is a complex subject due in part to the fact that it is based on human behavior, therefore the best anyone can do is make educated guesses regarding its performance. \n \n \nConclusion \n \nIt's easy to feel like a victim when it comes to taxation, especially since it comes in so many forms. However, residents are enjoying very low personal income tax rates when compared to historical numbers. Whether or not income should be taxed at all is another issue which will not be discussed here. As we dig deeper into this sensitive issue, there will be future charts on taxes featured here on 'Graph of the Week', so stay tuned. Until then, enjoy taking home more of your pay than your parents did. \n \n \n \n \n Questions: \n1) What are the other sources of governmental revenue? \n2) Will tax rates ever stabilize for more than a few years? \n3) Tax rates shot up after the Great Depression - will they go up in response to our recession? \n \n Data: \n \n http://taxfoundation.org/ \n \n Code: \nThese graphs were generated using the ' ggplot2 ' package within the R programming language : \n \n 1st graph: \n \n ggplot() +\n geom_boxplot(data=tax.rates.frame, aes(x=Year, y=Single_Tax_Rate, group=Year),fill=\"red\") +\n geom_rect(data=presidents.frame, aes(NULL, NULL, xmin=start_year, xmax=end_year,\n  fill=party), ymin=0, ymax=1) +\n scale_fill_manual(values=alpha(c(\"blue\",\"red\"),0.1)) +\n \n ylab(\"Range of Tax Rates (Marginal)\") +\n xlab(\"Year\") +\n \n opts(title=\"United States Personal Income Tax Rates (Marginal)\",\n legend.title = theme_blank(),\n panel.background = theme_blank())\n \n \n \n Further Reading (the following all have at least 3 stars or are unrated):"], "link": "http://www.graphoftheweek.org/feeds/8976927870189061115/comments/default", "bloglinks": {}, "links": {"http://www.graphoftheweek.org/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.r-project.org/": 1, "http://en.wikipedia.org/": 2, "http://taxfoundation.org/": 1, "http://4.blogspot.com/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Prior to WWII, the majority of soldiers died from disease and infection. \n \n \n \n \n \n \n \n \n \nThe Invisible Enemy Often Killed You Before Your Political Enemy \n \nImagine the scene: thousands of military men laying on cots, makeshift beds, or the floor - any place that was available was filled with a wounded soldier. Understand that these aren't the scratches you see in everyday life; rather, these are war wounds from heavy lead balls that shatter the bones of an arm or a leg. Take one into the gut or head and death was all but certain. This knowledge was not lost on the men of the Civil War as their screams echoed throughout the makeshift hospitals like the wails of the damned. It's not from lack of chloroform; no, it's from the horror of seeing a surgeon literally saw off a man's arm, tossing the lifeless appendage into a grotesque pile of discarded flesh on the floor. Or perhaps you scream in terror when the surgeon, facing you with a bloody saw as bits of human flesh hang off of it, quietly informs you that your leg is next to join the rotting mass. \n \n \nAnd it doesn't stop there. \n \nPerhaps you are a fresh Union recruit setting up camp. The first couple of days aren't so bad, but things begin to change. A putrid stench assails your nostrils wherever you go - the vast majority of the men have some form of chronic diarrhea and relieve themselves fairly close to camp. In need of any able bodies, the Union also recruited the frail and weak - they are sick with typhoid fever and other diseases, spreading it to other soldiers. Further, the area looks like a dump site as refuse covers the ground, spreading bacteria like wildfire. Indeed, many of the men here will die before ever seeing their Confederate foes (who had it even worse). \n \nLook at the above graph. During the Civil War (only Union casualties shown), over 60% of deaths did not come during battle (for wars prior, that figure was even higher). They came from disease, infections, malnourishment and exposure. Death by bullet was a greatly preferred end for most soldiers. \n \n \nWorld War I Was Better, Right? \n \nNo. \n \n \nTrench Warfare \n \nPicture yourself as a new arrival to the front lines. Before you even spot the first trench, you are overcome with a number of horrific smells forcing you to retch on the spot. As you slog your way around, there are thousands of dead bodies lying around, mostly in shallow graves, but that hardly protects them (or you). The putrid stench of decaying flesh clings to your skin, enveloping you. You see something brown scurrying around near a corpse: it's a cat-sized rat feeding on a noble soldier. They typically go for the eyes first, then the liver, leaving an already frightful body grossly misshapen. \n \nTurning your head away in disgust, you finally make your way to the trenches. Inside there are men going about their tasks, yet one of them is moaning. He is the victim of ' trench fever ' - a nasty disease from lice that sometimes required weeks from which to recover. All sorts of frogs, beetles, rats and other vermin crawl around with the men spreading disease and filth, not to mention the oozing latrines. If ever there was a Hell on Earth, surely this must have been it. \n \nAlthough some medical improvements had been made, over 50% of the men died from non-battle causes during this war. Luckily(?), this would be the last time history would witness such overwhelming war-related deaths from disease. \n \n \nMedical Science Progress \n \nAfter World War I, there were several key advances made in the medical field which had a drastic effect upon warfare. During World War II, mass vaccinations against such diseases as Yellow Fever were implemented with very successful results. Additionally, infections were being cured at a significantly higher rate due to the invention of antibiotics (notably Penicillin ). Further, blood transfusions were finally practical due to the discovery of the four main blood types (in the past, ignorance of these blood types often led to death with a transfusion). \n \nThese changes in medical procedure prevented many soldiers from what a few decades ago would have been certain death. As a result, the number of troops surviving their wounds skyrocketed since that time. Looking at the chart below, we can see that the ratio of wounded soldiers to those killed in action has gone up significantly. \n \n \n  \n More soldiers are surviving their wounds. \n \nThis has changed the dynamics of war considerably, especially when it comes to treatment. Our soldiers are surviving horrific wounds: many return missing appendages, are disfigured, or have severe mental trauma just to name a few. The cost for ongoing care for these brave souls surely has gone up. Hopefully all of this is budgeted before the United States enters into any further military action. \n \n \n \nKeep Yourself Healthy \n \nSwitching gears a bit, consider this: if you have a roof over your head, it would be prudent to keep yourself clean and healthy. After all, hundreds of thousands have gone before you and died horrific deaths to provide that opportunity. The fact that this country is becoming less healthy (future graph coming) is a troubling trend. \n \n \n \nConclusion \n \nWar has existed since the dawn of mankind. It is sometimes a necessary action to take to prevent aggressors from destroying our freedoms. While investment into our military has provided many technological advances, there is no doubt that the cost for this is quite high in terms of human life as well as money. Further, the cost of war now extends far beyond the actual conflict; these soldiers often need care for the remainder of their lives. All things being equal, the rise of robotics should reduce the number of casualties and wounded alike - at least for the side who is wielding them. No matter how you slice it, war certainly reveals our dualistic nature to simultaneously exhibit both honorable and horrifying traits. \n \n \n \n \n Questions: \n1) To what capacity can drones replace soldiers? \n2) Will deaths from disease increase again if warfare is waged with biological weapons? \n3) Will there ever be a time when wars are no longer necessary? \n \n Data: \n \n http://www.fas.org/ \n \n http://www.defense.gov/ \n \n \n Code: \nThese graphs were generated using the ' ggplot2 ' package within the R programming language : \n \n 1st graph: \nggplot(total.deaths.long.frame, aes(x=reorder(WarConflict, Index), weight=(value/Total_Deaths*100), fill=variable)) + \n geom_bar(position=\"dodge\") +\n coord_flip() +\n\n ylab(\"Percentage of Total Deaths\") +\n xlab(\"War/Conflict\") +\n \n opts(title=\"United States War-Related Deaths\",\n legend.title = theme_blank(),\n panel.background = theme_blank()) \n \n\n 2nd graph: \nggplot(total.deaths.frame, aes(x=reorder(WarConflict, Index), weight=(Total_Wounds/Total_Deaths))) + \n geom_bar(aes(fill=`Wounds to Deaths Ratio`)) +\n coord_flip() +\n \n ylab(\"Ratio of Total Wounded (not fatal) to Total Deaths\") +\n xlab(\"War/Conflict\") +\n \n opts(title=\"Number of U.S. War Survivors Climbing\",\n panel.background = theme_blank()) \n\n \n \n \n Further Reading (the following all have at least 3 stars or are unrated):"], "link": "http://www.graphoftheweek.org/feeds/2318355945929876510/comments/default", "bloglinks": {}, "links": {"http://www.defense.gov/": 1, "http://www.redcrossblood.org/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.r-project.org/": 1, "http://en.wikipedia.org/": 2, "http://www.fas.org/": 1, "http://www.firstworldwar.com/": 1, "http://2.blogspot.com/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Something about that cold weather... \n \n \nThe number of internet users in the Nordic countries has greatly outpaced the world by comparison. Denmark, Iceland, Norway, Sweden, Finland - all in the elite echelon. These countries share a common ancestry - the 'Vikings' or the Norse peoples - we've all read about in history classes and seen dramatized in the movies. Honor and battle were highly emphasized; fallen warriors were thought to be sent to Valhalla shared with the Norse gods such as Odin and Thor. \n \n \n \nThese are Vikings, after all... \n \nDo those aggressive tendencies exist today? Apparently not. Although these countries are as tough as the next guy, most of them attempted to stay neutral during WWII (Norway excepted) to avoid civilian casualties. Today, the Nordic countries are peaceful, yet quite advanced technologically. It's possible that the Viking spirit is alive and well, manifesting itself along the electronic frontier. However, there are many countries that would fit that description (Russia, for example), but have yet to establish the same level of internet penetration as their Nordic counterparts. \n \n \nTaxation \n \nWhat else do they have in common? High tax rates, for starters. Perhaps all of that money was used to build the infrastructure to enable this kind of technological leap. While there is some truth to that, there are several other countries with high tax rates that have yet to attain the same levels identified above (Hungary, Italy, Czech Republic and Poland, for example). How high are the tax rates? Click here for a list. If you live in the United States, maybe it doesn't seem so high anymore. \n \n \nDemocracy Index \n \nAfter some intense research, we found a relationship between internet usage and the democracy index . Although democracy has eroded in some countries (like the United States), there is an undeniable link between that and a country's internet usage. How much of a link? We need to dive into a bit of statistics for a brief explanation. There is a measurement called the Coefficient of Determination that can be used to see if there is a link between two variables. It can range from -1 to 1 such that, either a -1 or 1 fits the data perfectly (negatively or positively) while a 0 indicates no relationship at all. \n \nWhen we look at this coefficient here (for the statisticians: using linear regression, Pearson method), it computes as 0.41. Which, in basic terms means that 41% of a country's internet penetration can be explained by its democracy index. Evidently, when people aren't repressed, they tend to want technological advancements (not surprise there). Authoritarian regimes, however, do not want their citizens sniffing freedom, so do everything in their power to keep technologies like the internet repressed (and filtered). This can be quickly grasped by viewing the chart below: \n \n \n  \n Authoritarian regimes aren't good for the internet. \n \n \n \n \nInterestingly, not all countries follow this pattern. What gives? \n \n \nCulture Club \n \nSome countries have a high democracy index, yet their citizens do not use the internet much by comparison. Obviously, other factors are at play here. The first item that comes to mind is culture. Not everybody cares about being \"plugged in.\" Take Costa Rica, for example: the universal greeting there is something akin to \"Pura Vida,\", which means \"this is living!\" In countries such as this, maybe sitting at a computer looks pretty lame when surrounded by lush vegetation and beaches. Conversely, the internet would provide a welcome relief from the dark and depressing winter of the Nordic countries. \n \n \nGrowing Pains \n \nAnother reason that some high-democracy, low-internet countries exist may be because they have only recently began to experience gains in technology. Consider Botswana who gained independence from Britain in 1966. Given that they were extremely poor when they gained their freedom, it will take a significant amount of time before the necessary framework can be installed to allow for sophisticated technologies such as the internet to thrive. That being said, this is a country to watch along this sector. They could become Africa's leaders sooner rather than later given their high democracy rating. \n \n \nConclusion \n \nWhen considering a worldwide phenomenon such as internet penetration, many variables exist to explain it. Occasionally, a significant factor can be found through research; in this case, it is the democracy index. It certainly seems that although freedom bears many fruits, one particularly tasty treat exists in the form of technological advancement. While other factors such as culture and history must also be considered, one cannot deny that a link exists here as explained above. The Nordic countries certainly have led the internet charge into the 21st century. For other countries considering advances in the same area, it would be prudent for them to study this region. \n \n \n \n Questions: \n1) Will the world become more or less free as time marches on? \n2) How long before the 'democratized' countries have 100% internet penetration? \n3) Will we ever see a time when there are no authoritarian regimes? \n \n Data: \n \n http://databank.worldbank.org \n \n Code: \nThese graphs were generated using the ' ggplot2 ' package within the R programming language : \n \n 1st graph: \nggplot(subset(gdp.melt.frame, Indicator.Name == \"Internet users (per 100 people)\"), \n  aes(x=substr(variable,2,5), y=value)) +\n geom_boxplot() +\n geom_point(data=subset(gdp.melt.frame, Country.Name == \"Denmark\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"Denmark\")) +\n geom_point(data=subset(gdp.melt.frame, Country.Name == \"Finland\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"Finland\")) +\n geom_point(data=subset(gdp.melt.frame, Country.Name == \"Iceland\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"Iceland\")) +\n geom_point(data=subset(gdp.melt.frame, Country.Name == \"Norway\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"Norway\")) +\n geom_point(data=subset(gdp.melt.frame, Country.Name == \"Sweden\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"Sweden\")) +\n geom_point(data=subset(gdp.melt.frame, Country.Name == \"United States\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"United States\")) +\n \n geom_line(data=subset(gdp.melt.frame, Country.Name == \"Denmark\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"Denmark\", group=1), size=1.1) +\n geom_line(data=subset(gdp.melt.frame, Country.Name == \"Finland\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"Finland\", group=1), size=1.1) +\n geom_line(data=subset(gdp.melt.frame, Country.Name == \"Iceland\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"Iceland\", group=1), size=1.1) +\n geom_line(data=subset(gdp.melt.frame, Country.Name == \"Norway\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"Norway\", group=1), size=1.1) +\n geom_line(data=subset(gdp.melt.frame, Country.Name == \"Sweden\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"Sweden\", group=1), size=1.1) +\n geom_line(data=subset(gdp.melt.frame, Country.Name == \"United States\" & Indicator.Name == \"Internet users (per 100 people)\"),\n aes(x=substr(variable,2,5), y=value, color=\"United States\", group=1), size=1.1) +\n \n ylab(\"Internet Users (per 100 people)\") +\n xlab(\"Year\") +\n \n opts(title=\"Nordic Countries Growth of Internet Users\",\n legend.title = theme_blank(),\n panel.background = theme_blank()\n\n\n 2nd graph: \n\n ggplot(subset(gdp.melt.frame, Indicator.Name == \"Internet users (per 100 people)\" & variable == \"X2010\"), aes(x=Index, y=value, label=Country.Name)) + \n  geom_point(size=0.5, colour='dark grey') + \n  geom_smooth(size=1.1, method=\"lm\", na.rm=FALSE) + \n  geom_text(size=2.5, angle=0, colour='black', hjust=.5) + \n \n  ylab(\"Internet Users (per 100 people)\") + \n  xlab(\"Democracy Index\") + \n\n  opts(title=\"2010 Internet Penetration by Democracy Index\", \n  legend.title = theme_blank(), \n  panel.background = theme_blank()) \n\n \n \n \n Further Reading (the following all have at least 3 stars or are unrated):"], "link": "http://www.graphoftheweek.org/feeds/7353119276845085860/comments/default", "bloglinks": {}, "links": {"http://graphics.eiu.com/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.r-project.org/": 1, "http://en.wikipedia.org/": 1, "http://upload.wikimedia.org/": 1, "http://2.blogspot.com/": 1, "http://databank.worldbank.org/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Description: \nWinning percentage of all NCAA Men's Basketball Tournament Champions. \n \n \n Analysis: \nDown by one, the ball spins in his hand as he dribbles up the floor. With tennis shoes squeaking, he feints left, then right. Glancing up at the clock, he sees only five seconds left. Out of the corner of his eye, he spies a teammate break towards the basket. With a knowing glance he lobs the ball upward. The crowd, already standing, goes silent and everybody's eyes follow \"the dime.\" His teammate crouches like a panther and lurches upward. The ball floats into his hands while he twists his upper body, slamming it through the metal hoop with authority. Hanging onto the rim, his own roar is drowned out by the crowd. The buzzer blares and the game is over. They win! \n \n \n There is nothing quite like the NCAA Basketball Tournament. The fans love it so much that they become somewhat mad, hence the name \"March Madness.\" Their brackets marred with eraser shavings, enthusiasts the world over fret over who they think will win. In every office pool, there is 'the guy' who has 'a theory' that will guarantee him a winner. \n \nIf only that were true... \n \nThat being said, the above graph shows an interesting trend: the teams that are winning the tournament lately have lower season winning percentages than in years past. In fact, no team with fewer than three - count 'em, three - losses have won the tournament for the last eleven years: \n \n \n \n \nTake a close look at the above graph. The colors which denote the decades 2000-2010 and 2010-2019 can only be seen in the bars showing three or more losses. Assuming this trend continues, then neither Syracuse (31-2) nor Kentucky (32-2) will win the 2012 tournament, as they are 'too' good. Missouri, sitting at 30-4 seems to be a strong bet, if you go along with the data presented here. \n \nThe tournament started in 1939 with only eight teams, expanding between 22 and 25 teams up through 1978. It was during this time that we saw a few undefeated teams win the title. After that, the tournament expanded greatly, taking 40 teams in 1978, 48 from 1980-1982 and finally settling on 64 since 1985 (although later editions featured 'play-in' games). \n \nSince the expansion to 64 teams, it seems that the larger number of entrants (and thus games) has given the 'good, but not *too* good' teams a real shot to win it all with some regularity. It would be an interesting exercise to review this particular aspect (perhaps it has already been done). At any rate, March Madness is upon us. To all of those participating in some way: good luck! \n \n Questions: \n1) Will Kentucky or Syracuse break the trend (both have only 2 losses)? \n2) Will the NCAA expand the tournament further? \n3) Based on this story's angle, the author thinks Missouri will win - will they? \n \n \n Data: \n \n http://www.hoopstournamement.net/ \n \n \n Code: \nThis graph was generated using the ' ggplot2 ' package within the R programming language : \n ggplot(hoops.champions.frame, aes(x=Year, y=(Season.Wins/(Season.Wins+Season.Losses)), xmin=Year, xmax=Year+0.5, ymin = 0, ymax=(Season.Wins/(Season.Wins+Season.Losses)))) +\n \n geom_rect(aes(NULL, NULL, xmin=2010, xmax=2019, fill=\"2010-2019\"), alpha=.01) +\n geom_rect(aes(NULL, NULL, xmin=2000, xmax=2009, fill=\"2000-2009\"), alpha=.01) +\n geom_rect(aes(NULL, NULL, xmin=1990, xmax=1999, fill=\"1990-1999\"), alpha=.01) +\n geom_rect(aes(NULL, NULL, xmin=1980, xmax=1989, fill=\"1980-1989\"), alpha=.01) +\n geom_rect(aes(NULL, NULL, xmin=1970, xmax=1979, fill=\"1970-1979\"), alpha=.01) +\n geom_rect(aes(NULL, NULL, xmin=1960, xmax=1969, fill=\"1960-1969\"), alpha=.01) +\n geom_rect(aes(NULL, NULL, xmin=1950, xmax=1959, fill=\"1950-1959\"), alpha=.01) +\n geom_rect(aes(NULL, NULL, xmin=1940, xmax=1949, fill=\"1940-1949\"), alpha=.01) +\n geom_rect(aes(NULL, NULL, xmin=1930, xmax=1939, fill=\"1930-1939\"), alpha=.01) +\n \n geom_rect(fill=\"black\") +\n geom_smooth(size=1.1, method=\"lm\", na.rm=FALSE) +\n \n ylab(\"Regular Season Winning Percentage\") +\n xlab(\"Year\") +\n \n opts(title=\"Wanna win March Madness? Be Good, But Not *Too* Good\",\n legend.title = theme_blank(),\n panel.background = theme_blank(),\n panel.grid.minor=theme_blank(),\n panel.grid.major=theme_blank())\n \n \n \n Further Reading (the following all have at least 3 stars or are unrated):"], "link": "http://www.graphoftheweek.org/feeds/5521673552761286304/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.r-project.org/": 1, "http://4.blogspot.com/": 1, "http://www.hoopstournamement.net/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Description: \nYearly average airline fare since 1995. \n \n Data: \n \n http://www.bts.gov/ \n  \n Analysis: \nWhen taking the average price of domestic airline fares, there is a clear trend indicating that flying is becoming more affordable - when adjusted for inflation. This may seem impossible when you look at the current price of your ticket and see that it is higher than last year. That's because the last two years have seen an increase, but the overall trend is still downward. \n \nHow can the airlines sustain this downward price trend with the cost of fuel going up? In an earlier article , it was shown that gas isn't as expensive as it appears - again, when adjusted for inflation. That being said, gas prices have increased in the last couple of years, which may explain the air fare prices going up in the same period. \n \nAccording to the Bureau of Transportation Statistics (BTS), baggage fees have gone up each year since they have been tracked (since 2007); perhaps this has also kept airline fees in check. When you calculate the total baggage fees collected for a flight and divide that by the number of passengers, you get the average baggage fee per passenger. That table looks like this: \n \n Average Baggage Fee: \n2007 - $0.60 / passenger \n2008 - $1.53 / passenger \n2009 - $3.85 / passenger \n2010 - $4.67 / passenger \n2011 - $4.61 / passenger (only through 3 quarters - BTS doesn't have 4Q 2011 as March 2012) \n \nIf you add the average baggage fee to the average airline fee, then the total cost to fly only goes up by less than $5 in all cases. Thus, the downward trend in ticket prices would still continue. \n \nMaybe this is affecting the airlines since their population appears to be dwindling (mostly due to mergers): \n \n Active Airline Carriers : \n2007 - 22 \n2008 - 21 \n2009 - 22 \n2010 - 20 \n2011 - 17 \n \nWhether or not this has anything to do with reduced fares is open for speculation and warrants an investigation in its own right. That being said, the upward trend of ticket prices in the last 2 years corresponds with the drop in carriers during that same time. This will be something to monitor as time progresses. \n \nAnother point to consider is the cost of meals and drinks on airlines. In the past these were complimentary, but now a passenger must pay for anything beyond the typical \"bag of peanuts.\" Undoubtedly this has saved airlines millions of dollars and thus enabled them to keep their prices competitive. \n \nOne can only hope that the fares remain stable so that we can all afford to fly for the foreseeable future. \n \n Questions: \n1) Will more fuel-efficient planes help to reduce ticket prices? \n2) What are the barriers for low-cost airlines to enter the market? \n3) Is there an alternative fuel solution for large planes? \n \n Code: \nThis graph was generated using the ' ggplot2 ' package within the R programming language : \n ggplot(adjusted.airfare.frame, aes(ymin=250, x=Year, y=Average_Fare)) + geom_line(size=1.1) +\n geom_point() +\n geom_smooth(size=1.1, method=\"lm\", na.rm=FALSE) +\n \n ylab(\"Average Fare (in U.S. Dollars)\") +\n xlab(\"Year\") +\n \n opts(title=\"Airline Average Fare (adjusted for inflation)\",\n panel.background = theme_blank(),\n plot.margin = unit(c(0,4,0,0), \"lines\"))\n \n \n \n Further Reading (the following all have at least 3 stars or are unrated):"], "link": "http://www.graphoftheweek.org/feeds/4022366298579919956/comments/default", "bloglinks": {}, "links": {"http://www.graphoftheweek.org/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.r-project.org/": 1, "http://www.bts.gov/": 2, "http://2.blogspot.com/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Description: \nYearly production of Ethanol in the United States since 1980. \n \n Data: \n \n http://www.ethanolrfa.org/ \n \n  \n Analysis: \nWhen it comes to fuel - especially for transportation - oil is king. In 2010, the United States imported 180.8 billion gallons of crude oil which doesn't include the amount produced locally. That's a lot of oil! \n \nAlthough there are many competing factors which drive the demand for foreign oil, there are some which are pushing for a reduction in this dependence. While there are a number of ways to accomplish this, one obvious path lies in replacing oil as a fuel source. \n \nSince the internal combustion engine is ubiquitous in automobiles in the United States (and world-wide for that matter), it is not a simple matter to switch fuels to something like electricity (which does not use internal combustion). In practical terms, it might be advantageous to gradually reduce this oil dependence using the technology already out on the road. \n \nEnter ethanol. \n \nEthanol is an alternative fuel which is produced from starches via yeast - a technology which has been around since our ancestors figured out how to become intoxicated. In many parts of the world the starch used comes from sugar cane while in the United States it begins as corn. Since ethanol can be burned in internal combustion engines, it can be added to existing oil-based fuel in varying quantities, thus reducing the amount (and need) for imported oil. \n \nIn 2010, the United States produced 13.2 billion gallons of ethanol. That sounds like a lot until you compare it with the amount of imported oil (180.8 billion gallons for the same year). In other words, for each gallon of ethanol produced locally, the U.S. imports nearly 14 gallons of crude oil. \n \nIt will be quite interesting to see how ethanol shapes our future fuel consumption. \n \n Questions: \n1) Will production of ethanol continue to increase exponentially? \n2) By how much can we reduce our dependence on foreign oil, in practical terms? \n3) How has this affected agriculture in the United States? \n \n Code: \nThis graph was generated using the ' ggplot2 ' package within the R programming language : \n ggplot(us.ethanol.frame, aes(ymin=0, ymax=gallons_millions, xmin=year, xmax=year+0.5, \n  x=year, y=gallons_millions,\n  label=gallons_millions)) +\n geom_rect(fill=\"dark green\") +\n geom_text(size=3.5, colour='black', hjust=0.1, vjust=-1) +\n ylab(\"Quantity (millions of gallons)\") +\n xlab(\"Year\") +\n opts(title=\"Annual United States Ethanol Production\",\n legend.title = theme_blank(),\n panel.background = theme_blank(),\n plot.margin = unit(c(0,4,0,0), \"lines\")) +\n scale_y_continuous(formatter = sep) \n Further Reading (the following all have at least 3 stars or are unrated):"], "link": "http://www.graphoftheweek.org/feeds/7256235729013477158/comments/default", "bloglinks": {}, "links": {"http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.ethanolrfa.org/": 1, "http://2.blogspot.com/": 1, "http://www.r-project.org/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Description: \nMajor League Baseball payrolls for all teams since 1985. The New York Yankees payroll is highlighted with results defined by the shape of the point. \n \n Data: \n http://www.baseball-databank.org/ \n \n  \n Analysis: \nFor years fans of Major League Baseball (MLB) have been crying 'foul!' at the New York Yankees regarding their spending habits. The primary complaint is that the Yankees have 'bought' their championships, leaving the other teams to squander in mediocrity. \n \nWhat does it means to 'buy' a championship? Is there an implication that the Yankees are the only team to pay players while the rest rely on volunteers? Of course not - all players get paid (handsomely - see previous article on the rising MLB payroll ). \n \nLooking at the above graph, it is clear that the Yankees have been a top-tier paying team since 1985. However this has not resulted in a championship every year. In fact, during their world series run in the late 90s, their payroll was not always the highest. \n \nIt wasn't until after 2000 that their payroll began to quickly outpace everyone else, resulting in a high water mark in 2005 (where they failed to make it past the first round of playoffs). Since then, a slow downward trend has occurred in their payroll - perhaps they have realized that throwing money at players isn't the path to world series rings. \n \n\"But,\" you ask, \"does a high payroll equal a better winning percentage?\" Analysis of payroll vs winning percentage (not shown) does seem to indicate a relationship, but not a strong one (r = 0.496, r 2 =0.214). This makes sense because a high salary does not indicate actual skill; rather, it has a lot to do with player contract composition and the subjective opinions of team management. \n \n Questions: \n1) Will the Red Sox catch up in terms of payroll? \n2) How long can the Yankees sustain their current spending habits? \n3) What will the low-payroll teams do in order to close the gap to the high-payroll teams? \n \n Code: \nThis graph was generated using the ' ggplot2 ' package within the R programming language : \n ggplot(adjusted.salaries.frame, aes(x=yearID, y=payroll)) +\n geom_point() +\n geom_point(aes(x=adjusted.yankees.frame$yearID, y=adjusted.yankees.frame$payroll, \n  color=\"Yankees\", colour=adjusted.yankees.frame$Result, \n  shape=adjusted.yankees.frame$Result), size=5) +\n geom_line(aes(x=adjusted.yankees.frame$yearID, y=adjusted.yankees.frame$payroll, \n  color=\"Yankees\"), size=1.1) +\n \n ylab(\"Team Payroll (in U.S. Dollars)\") +\n xlab(\"Year\") +\n \n opts(title=\"MLB Payrolls: The New York Yankees vs All Other Teams (adjusted for inflation)\",\n legend.title = theme_blank(),\n panel.background = theme_blank()) +\n scale_y_continuous(formatter = mysep) \n \n \n Further Reading (the following all have at least 3 stars or are unrated):"], "link": "http://www.graphoftheweek.org/feeds/4337032780976210571/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.baseball-databank.org/": 1, "http://www.graphoftheweek.org/": 1, "http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.r-project.org/": 1, "http://mlb.mlb.com/": 1, "http://newyork.mlb.com/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Description: \nNumber of blogs aggregated into the R-Bloggers news site. \n \n Data: \n http://www.r-bloggers.com/ \n \n \n Analysis: \n \nR-Bloggers is a website devoted to news and tutorials related to the R programming language . The content is generated by a growing number of R statisticians (as reflected in the chart above), providing a wealth of information. \n \nThe site itself is aesthetically pleasing, showing the header of each article. It's based on RSS , so once your site has been approved and linked, any new articles are automatically loaded onto the site. This provides important exposure for the original author of the work as well as a valuable back link to their blog. \n \nUnlike other news aggregation sites (which work by submitting links, not by automatically feeding RSS), you aren't penalized for promoting your own site. This is especially important for authors wanting to contribute something meaningful to the world. \n \nFor those visiting the site mining for information, R-Bloggers provides full search capability as well as a listing of the contributing blogs should a user want to visit them directly. \n \nLooking at the graph, you can see that the site has had a stable supply of R-related blogs coming in each month, with a steady linear trend upwards as the years progress. A cap exists out there somewhere, as there are a finite number of R blogs out in the wild, but that number appears to be unknown. For now, the site continues to grow and provide a valuable service to the R community. \n \n Questions: \n \n1) How many R bloggers are still out there not yet feeding into this site? \n2) Will development on the R platform continue? \n3) Are there other blog aggregator sites like this one for other niches? \n \n Code: \nThis graph was generated using the ' ggplot2 ' package within the R programming language : \n ggplot(rblogger.frame, aes(Date)) +\n geom_line(aes(y = as.numeric(row.names(rblogger.frame))), size=1.1) +\n geom_smooth(aes(y = as.numeric(row.names(rblogger.frame))), size=1.1, method=\"lm\", na.rm=FALSE) +\n scale_x_datetime(major=\"1 month\", format='%b %Y') +\n ylab(\"Total Bloggers\") +\n opts(title=\"R-Bloggers Growth\", \n axis.text.x = theme_text(angle = 270, hjust = 1, size = 7),\n panel.background = theme_blank(),\n plot.margin = unit(c(0,4,0,0), \"lines\")) \n \n \n \n \n Further Reading (the following all have at least 3 stars or are unrated):"], "link": "http://www.graphoftheweek.org/feeds/4303543503206226550/comments/default", "bloglinks": {}, "links": {"http://had.co.nz/": 1, "http://feedads.doubleclick.net/": 2, "http://www.r-project.org/": 2, "http://en.wikipedia.org/": 1, "http://www.r-bloggers.com/": 2, "http://4.blogspot.com/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Description: \nAverage age of passenger cars and light trucks in the United States since 1995. The gray area represents the possible variance of the trend line with 95% confidence. \n \n Data: \n https://www.polk.com/company/news/average_age_of_vehicles_reaches_record_high_according_to_polk \n \n \n Analysis: \nIn the last 16 years, there is a clear trend showing that people hold on to their cars and trucks longer than in the past. Two factors come to mind: 1) a less robust economy and 2) better made vehicles. \n \nThere are numerous sources of data which have indicated a poor economy in recent years. If this were true, then only recently would we see a trend in the average age of cars increasing. This is because the cars have to age first which obviously takes time. Although more pronounced in the light truck category, we do indeed see this trend starting around 2008. To the degree in which the economy improves, we should see a corresponding drop in the average age of cars. \n \nAre vehicles better made? That is a separate question and requires a graph in its own right. However, a cursory internet search reveals that the overall dependability of newer vehicles is indeed better than in years past. For more information on this, visit http://jdpower.com/ for dependability ratings. \n \n Questions: \n1) The average age trend is upward - will this continue if we have an economic boom? \n2) A previous graph shows that the transportation sector is growing faster than any other - how will this affect the average age of vehicles? \n3) The author's vehicle is nine years old - will he keep it another nine? \n \n Code: \nThis graph was generated using the ' ggplot2 ' package within the R programming language : \n ggplot(car.age.frame, aes(Year)) +\n geom_line(aes(y = Passenger.Cars, colour = \"Passenger Cars\"), size=1.1) + \n geom_line(aes(y = Light.Trucks, colour = \"Light Trucks\"), size=1.1) + \n \n geom_smooth(aes(y = Passenger.Cars, colour = \"Passenger Cars\"), size=1.1, method=\"lm\", na.rm=FALSE) +\n geom_smooth(aes(y = Light.Trucks, colour = \"Light Trucks\"), size=1.1, method=\"lm\", na.rm=FALSE) +\n \n ylab(\"Average Age\") +\n xlab(\"Year\") +\n \n opts(title=\"United States Average Vehicle Age\",\n  legend.title = theme_blank(),\n  panel.background = theme_blank())"], "link": "http://www.graphoftheweek.org/feeds/167682764983638957/comments/default", "bloglinks": {}, "links": {"http://www.graphoftheweek.org/": 1, "https://www.polk.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.r-project.org/": 1, "http://jdpower.com/": 1, "http://had.co.nz/": 1, "http://4.blogspot.com/": 1}, "blogtitle": "Graph of the Week"}, {"content": ["Description: \nTotal energy consumption in the United States by sector. Vertical gray lines represent periods of recession. \n \n Data: \n http://www.eia.gov/totalenergy/data/annual/index.cfm#consumption \n \n http://en.wikipedia.org/wiki/List_of_recessions_in_the_United_States \n \n \n Analysis: \nIn the above graph, each recession is marked by a gray vertical bar at the time it occurred. In almost all cases, energy consumption drops significantly. This would give an indication that periods of recession are actually beneficial to the environment due to less pollution. \n \nThe Transportation sector is gaining faster than the rest. By the year 2085, it will surpass the Industrial sector to become the dominant sector in terms of energy consumption. \n \n Questions: \n1. Can we reduce energy consumption while simultaneously existing in an economic boom? \n2. How long can these upward trends continue? \n3. Does energy consumption by the rest of the world match the same pattern as the U.S.?"], "link": "http://www.graphoftheweek.org/feeds/764616797132244908/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.eia.gov/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Graph of the Week"}]