[{"blogurl": "http://hackaday.com\n", "blogroll": [], "title": "Hack a Day"}, {"content": ["LED Marquee Pumpkin \n \n Here’s an LED marquee as the mouth of a Jack-o’-lantern which [Mike Skoczen] made. This comes hot on the heels of that playable Tetris Pumpkin . [Thanks Jacob] \n Arduino-powered robot costume \n \n This is a sideways view of the Arduino-powered costume [Dan] and his wife made for their son. It has lights, buttons, a character display, and makes noise. \n Cylon Centurion from a pumpkin \n \n Stuck inside because of the hurricane, [Shawn] and his girlfriend carved this Cylon Centurion pumpkin complete with lights and sound . \n 8×8 LED costume ‘face’ \n \n [Matthew] built this helmet which features an 8×8 RGB LED matrix as the face. He calls it the digital reaper. You can see him testing the electronics in this clip . \n Makerspace costume roundup \n \n [Jeff] wrote in to tell us about the Halloween preparations at the Port City Makerspac e in Portsmouth, New Hampshire. Here we have a Ghost Busters Proton Pack, weeping angel wings from Dr. Who, and an Arc Reactor from Ironman. \n Filed under: Hackaday links"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/kDhiwpJRszM/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://imgur.com/": 1, "http://hackaday.com/": 2, "http://feedads.doubleclick.net/": 2, "http://www.portcitymakerspace.com/": 1, "http://danwake.blogspot.com/": 1, "http://www.youtube.com/": 3}, "blogtitle": "Hack a Day"}, {"content": ["We don’t remember hearing about the One Laptop Per Child initiative distributing tablet computers but apparently a couple of shipments were distributed to rural communities in Ethiopia . The problem one might think of in this scenario is that the literacy rate in the two test villages was basically zero. But that’s exactly the population targeted with thr technology. The tablets were loaded with a software package called Nell. It was designed to guide a child in self learning by telling them engaging stories that include teachable moments. If you check out the white paper (PDF) you’ll find it’s pretty much the exact same teaching technique that [Neal Stephenson] wrote about in his book  The Diamond Age . But keep reading that paper and you’ll see that this is because the researchers took their inspiration from that very novel. \n Well the results are in and apparently [Neal] knows exactly what he is talking about. Not only did the children learn from the software, but within five months they were hacking the device (which runs Android) to get the disabled camera working. \n [Thanks Alexander via Dvice ] \n Filed under: lifehacks , tablet pcs hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/Fd8NdNrIko4/", "bloglinks": {}, "links": {"http://dvice.com/": 1, "http://feeds.wordpress.com/": 1, "http://cscott.net/": 1, "http://www.technologyreview.com/": 1, "http://hackaday.com/": 2, "http://feedads.doubleclick.net/": 2}, "blogtitle": "Hack a Day"}, {"content": ["Don’t get us wrong, we love these Rock ‘Em Sock ‘Em Robot costumes . But as with that Samus Helmet it must make party conversation a bit weird. And how do you hold on to your beer? But you’ve got to commend [EyeHeartInk] and his friend for their commitment. Not only did they wear them to the party, but they spent two months building the things. \n Pretty much everything was made from cardboard. All of it was hand cut with a box cutter and a hobby knife. Duct tape and glue were the adhesives of choice, and according to this thread a total of fifteen rolls of tape were used. The half spheres on the side of either helmet were molded from expanding spray foam inside a ping-pong ball which had been lopped in half. And of course there are a pair of LEDs for the eyes of each bot. \n We usually try to link to other articles that are related, but it doesn’t look like we’ve seen this concept before So you’ll have to settle for this non-Halloween wristwatch controlled robot boxing game. \n \n Filed under: Holiday Hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/wzDSs_C1FXU/", "bloglinks": {}, "links": {"http://www.reddit.com/": 1, "http://feedads.doubleclick.net/": 2, "http://feeds.wordpress.com/": 1, "http://imgur.com/": 1, "http://hackaday.com/": 3}, "blogtitle": "Hack a Day"}, {"content": ["[Dan] took a $13 electronic dartboard and made it work with an Android device . The idea behind it is that these cheap electronic models feature a very sparse display. At this price that doesn’t surprise us. He wanted to add the features you’d find on a coin-op model like the ones found in bars. So he added some hardware that lets him use Android as the scoreboard. \n To do this all he needs is the ability to detect when a dart has hit the board and what value was registered. The board is really nothing more than a 62-button input device organized as an 8×8 matrix. He soldered jumpers between the pins and a DIP socket. After the work was done he programmed his Cordium BASIC microcontroller, a 28-pin chip, and dropped it right in. It communicates with a serial Bluetooth module which provides the connectivity with an Android phone. You can see a very quick clip of the app embedded after the break. \n This would be just perfect if you’re using an Android set-top-box on a TV near the dart board. \n \n \n Filed under: android hacks , home entertainment hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/yc9AxPqhyUM/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://feedads.doubleclick.net/": 2, "http://amqsoftware.com/": 1, "http://hackaday.com/": 2}, "blogtitle": "Hack a Day"}, {"content": ["This Portal gun will really make [aNoodleJMC's] costume pop this year. He actually built the video game weapon replica from scratch . It even includes some electronics to light it up blue or orange depending on which portal he’s planning to fire at an available flat surface. \n There’s a lot of parts that went into the project, but by far our favorite one on the list is an acrylic toilet plunger. Its handle serves as a light pipe for the colored LEDs and can be seen above as a cloudy rod at the center of the clear barrel. A 4″ and 3″ PVC pipe helped to form the rest of the barrel, along with a 3″ clear acrylic pipe for the transparent areas. The bulbous parts of the body were sculpted from florist’s foam. Once he had all of the parts roughed out it’s obvious that [aNoodleJMC] spent a ton of time filling problem areas with Bondo, sanding everything smooth, and giving it a paint job he can be proud of. We hope he didn’t forget to include GLaDOS in the fun . \n We actually just bought our Portal gun. But that’s because we had the big plans of adding the ability to levitate objects . \n [vai Reddit ] \n Filed under: Holiday Hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/2g2q0IyFa-A/", "bloglinks": {}, "links": {"http://www.reddit.com/": 1, "http://feedads.doubleclick.net/": 2, "http://feeds.wordpress.com/": 1, "http://imgur.com/": 1, "http://hackaday.com/": 3}, "blogtitle": "Hack a Day"}, {"content": ["The greatest of Halloween costumes start with an idea, but they’ve also got to have strong execution to pull the whole thing off. This year  [Johanna Jenkins] decided to put together a  Fembot Halloween costume which is a wonderful example of this concept. Going as a Fembot from  Austin Powers: International Man of Mystery sounds like a lot of fun right off the bat, but a bit of work at the sewing machine and access to a wig shop in Hollywood really brought it to the next level. But [Johanna] didn’t stop at that. The Fembots have machine guns in their bras. After they’ve torn through all of their ammo they’re left with smoking barrels as nipples, and that final touch even made it into the costume. In the video after the break you can see [Johanna] showing off the small battery operated fog system she piped into the costume bra. \n \n \n [via Reddit ] \n Filed under: Holiday Hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/TphjOWEFa-E/", "bloglinks": {}, "links": {"http://www.reddit.com/": 1, "http://feedads.doubleclick.net/": 2, "http://feeds.wordpress.com/": 1, "http://johannajenkins.com/": 1, "http://hackaday.com/": 1}, "blogtitle": "Hack a Day"}, {"content": ["The folks at the London-based startup GoCardless have a pool table at their office. Being the techies they are, they decided to build a system that automatically scores games. The results, while not fully complete, are still pretty impressive for something whipped up during a 48 hour hackathon. \n The automated score keeper uses a webcam duct taped to the ceiling right above the center of the pool table, The balls – red and yellow balls replace the rainbow of solids and stripes to make things easier – are found using OpenCV . \n This build isn’t quite finished yet. The people at GoCardless are looking to improve the accuracy of their setup by using a camera with a higher frame rate and possibly moving on to physics simulation to predict where the balls should be. If these guys get the time, they could add something like  augmented reality pool table  to improve shot accuracy. \n Vidia after the break. \n \n \n \n Filed under: misc hacks , Software Development"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/qcjRXaNelyU/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://feeds.wordpress.com/": 1, "http://blog.gocardless.com/": 1, "http://opencv.willowgarage.com/": 1, "http://hackaday.com/": 3}, "blogtitle": "Hack a Day"}, {"content": ["[Joonas] has been following TI’s ‘getting started’ tutorials for their new Stellaris Launchpad. Everything had been going swimmingly until [Joonas] reached the fourth tutorial on interrupts. To the ire of LEDs the world over, implementing PWM on the new Stellaris Launchpad is a somewhat difficult task. After banging his head against the documentation for hours, [Joonas] finally cracked his PWM problem  and decided to share his discoveries with the world. \n The Stellaris has a PWM mode for its six hardware timers, but unfortunately there are no PWM units on the chip. Solving this problem required making two 16-bit timers out of a single 32-bit one. This allowed [Joonas] to specify a ‘load’ and ‘match’ value. \n After coding this up, [Joonas] discovered the PWM timer only works on two of the Launchpad’s pins. Hours of Googling later, he had real PWM on his Stellaris Launchpad. \n Given the amount of time [Joonas] spent on this problem, we’re glad to help all the other frustrated Stellaris tinkerers out there by sharing this. \n Filed under: ARM , hardware"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/yIHSU-M2cvo/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://feedads.doubleclick.net/": 2, "http://codeandlife.com/": 1, "http://hackaday.com/": 2}, "blogtitle": "Hack a Day"}, {"content": ["At Hackaday, we’ve seen enclosures built out of just about every material. From wood, glass, epoxy resin, plastic, and even paper, all these different types of enclosures provide some interesting properties. Sometimes, though, you need an enclosure made out of metal and welding together steel cases isn’t exactly easy or cheap. [manekinen] came up with a really great solution to the problem of welding together sheet metal. It’s a very easy to build spot welder  perfect for fabbing steel cases. \n The core of the build is a transformer pulled from a Technics stereo amplifier. [manekinen] removed the stock secondary winding and rewound the transformer four turns of 35mm ² wire (about 2 AWG). This made the transformer put out 2.6 Volts a 1 kA – more than enough to weld 22 ga sheet. \n For the control mechanism, [manekinen] put a limit switch on the electrode arm and wired that to a timer. A knob on the front of the welder allows him to vary the time the welder is on from 0 seconds to 4 seconds. \n The results are fantastic – trying to rip apart a weld only results in the metal itself tearing; exactly what you want to see in a welder. It’s a great build made even more fantastic by the welder building its own enclosure. \n \n \n Filed under: tool hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/5UfQV8UDJeg/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://feeds.wordpress.com/": 1, "http://hackaday.com/": 1, "http://mdiy.pl/": 1}, "blogtitle": "Hack a Day"}, {"content": ["What do you get when you combine motion sensors , a Raspberry Pi, and a pumpkin? When it’s Haloween, a headless scarecrow with a light-up carved pumpkin in its lap ! The execution of this hack is really great, and the resulting effect, as shown in the video after the break, should be extremely scary to any kids that come knocking. \n One neat effect of this hack is that it uses X10 home automation modules to turn off the porch lights for an extra scary effect. After this, the jack-o-lantern lights up and says “help me!” If you’d like to duplicate, or build on this hack, instructions are provided as well as source code for everything on the page. While you’re there, be sure to poke around on [Insentricity] as there are quite a few other hacks available for your perusal! Don’t forget sure to send us any other Halloween hacks that you come up with. \n \n Filed under: Holiday Hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/8yNhUvng5nM/", "bloglinks": {}, "links": {"http://www.insentricity.com/": 2, "http://feedads.doubleclick.net/": 2, "http://feeds.wordpress.com/": 1, "http://hackaday.com/": 2}, "blogtitle": "Hack a Day"}, {"content": ["Enjoy your Halloween and be safe. Keep reading for a thermite project preview. \n \n I was actually out testing out some stuff with thermite. I’m seeing how little you can use and still completely destroy a hard drive as part of an upcoming project. I just thought an exploding pumpkin might be a fun way to say happy Halloween. \n \n Before someone points out that this reaction seems a little odd. I had just burnt this drive with thermite but didn’t record it. The drive is actually full of water here. However, 3 tablespoons of thermite did a perfect job of creating a tiny hole and destroying the platters. Keep an eye out for an upcoming project using this information! \n Those two pieces that are alone in the picture were found on the ground after the explosion. \n\n \n \n \n\n Filed under: Holiday Hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/JASbLRjCkT0/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://feeds.wordpress.com/": 1, "http://hackaday.com/": 4}, "blogtitle": "Hack a Day"}, {"content": ["Seriously, this Nyan Cat hat is the only part needed for a fantastic Halloween costume. It looks pretty good in this still image, but we dare you to watch the clip of it in action (embedded after the break) without letting a beaming grin creep onto your face. Everyone’s going to just love this… until it starts to get really annoying. \n When switched on, the iconic meme rotates around the headgear, bobbing its head and tail as she sings the song of her people. There are also stars made of white LEDs that twinkle very brightly in the process. The presentation is quite good, but even better is seeing the build process. Luckily [Ben Katz] posted a series of detailed articles during the adventure. The mechanism responsible for driving the cat around the hat was laser cut from acrylic. It includes a large gear with teeth on the inside, which is interface by a continuously rotating servo motor with a much smaller gear. The head and tail bobbing are purely mechanical, using the revolving motion to turn a spindle as the cat makes its way around the brim. \n \n \n Filed under: Holiday Hacks , wearable hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/FZtfbMoTCKM/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://feeds.wordpress.com/": 1, "http://build-its.blogspot.com/": 1, "http://hackaday.com/": 2, "http://build-its-inprogress.blogspot.com/": 1}, "blogtitle": "Hack a Day"}, {"content": ["Seeed Studios has launched a contest centered around the DSO Quad . In case you’re unfamiliar with the hardware, the DSO Quad is a low-cost standalone oscilloscope . It’s got four channels, two of which are analog, and includes an ARM Cortex-M3 processor as well as an FPGA. Why are we recapping the hardware with the contest announcement? Because the contest rules state that you  are allowed to alter the hardware despite the fact that this is more of a software-focused event. \n But what you really should know about are the cash prizes going to the winners. Rank in the top four and you’ll claim $3000, $1500, $800, and $300 in cold hard cash. But even if you don’t take one of the top spots everyone still wins. That’s because all entries are open source and will be found in Seeed’s DSO Quad forums. \n If judging people is more your thing Seeed needs some help with that too. They’re looking for qualified judges and application details are includes at the bottom of the contest page. \n [Thanks Petteri] \n Filed under: contests"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/nLemLOtCEeY/", "bloglinks": {}, "links": {"http://www.seeedstudio.com/blog": 1, "http://feeds.wordpress.com/": 1, "http://feedads.doubleclick.net/": 2, "http://hackaday.com/": 2}, "blogtitle": "Hack a Day"}, {"content": ["This furry Halloween decoration proves to be a simple build, but it’s still quite popular with the little ones. [Chris] had a Halloween party for a group of 2-5 year olds and this monster that peeks out of a box was a huge hit. The trick really isn’t in the complexity of the build, but in the interactivity. \n The enclosure is just a shoe box which has been covered in synthetic black fur. The lid was hinged on the back, and a hobby servo with a bit of an extension on the arm is used to lift the front which reveals the monster’s paper eyes. Inside you’ll find an Arduino, breadboard, and battery pack. It’s not visible above, but a distance sensor on the front of the box is monitored by the Arduino. When it detects something in front of it the servo fires up and pops open the lid. The firmware includes a timer so that the monster waits a bit before taking its next peek at the party. \n Filed under: android hacks , Holiday Hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/6T3x3EV26T4/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://feeds.wordpress.com/": 1, "http://thexlc.co.uk/": 1, "http://hackaday.com/": 2}, "blogtitle": "Hack a Day"}, {"content": ["[Dmitry] really went the distance with this project. It started as a broken DVD player scrapped for parts, and turned into this clock with way too many features . That link is a pretty a dry technical collection of the work. You’ll definitely want to have a look at it, but we’d suggest first watching the demo video after the break which is initially much more exciting. \n The donor DVD hardware included a Vacuum Fluorescent display which is the nugget which [Dmitry] was after. But that board came along with some other nice things, like an integrated IR receiver. He also chose to use the PSU from the device. An Arduino is used to drive the clock. We’re not sure where he found it, but the video shows the service manual for the DVD player which must have a been a real help in interfacing with the display. The white dome on the right is a PIR motion sensor. It brings the device out of sleep mode when someone is in the room. \n The case is laser-cut and started as cardboard to ensure everything fit as designed. The enclosure makes it a showpiece, but the features of displaying day, date, time, and temperature make it functional as well. Since the VFD is alpha-numeric we think this could even see future upgrades to be used as a new-mail/tweet/IM alert as well. \n \n \n Filed under: arduino hacks , clock hacks"], "link": "http://feedproxy.google.com/~r/hackaday/LgoM/~3/WlxXApyPYu4/", "bloglinks": {}, "links": {"http://atmega.magictale.com/": 1, "http://feeds.wordpress.com/": 1, "http://feedads.doubleclick.net/": 2, "http://hackaday.com/": 2}, "blogtitle": "Hack a Day"}]