[{"blogurl": "http://harvestimaging.com/blog\n", "blogroll": [], "title": "Harvest Imaging Blog"}, {"content": ["In this discussion, dead pixels are defined as pixels that do not react to light at all.  There are two types of dead pixels : \n -       Stuck at “1”, or pixels that are always saturated (white defects), \n -       Stuck at “0”, or pixels that are always empty (black defects). \n The location of dead pixels can be of importance in the case defect pixel correction algorithms will be used in the camera, and in the case these algorithms rely on a priori knowledge of the defect pixel coordinates.  The technique to find the location of dead pixels is very simple : because the defect pixels do not react to light, they show a pretty low value for the temporal noise under light conditions.  So what can be done is the following : \n -       grab several images (e.g. 100), with sufficient light on the sensor to fill the pixels to a level of (about) 50 % of saturation, \n -       calculate on pixel level the temporal noise that the pixels demonstrate in the images grabbed, \n -       rank all pixels according to the calculated noise, the pixel with the lowest noise level comes first.  If this noise level is close to zero, the pixel is most probably a dead pixel, \n -       track the value of these suspected dead pixels over the frames grabbed. \n The result of this exercise is shown in the Figure 1 (the images used for this measurement is different from the data used in previous blogs). \n  \n Figure 1 : Behaviour of a first group of five dead pixels as a function of time. \n The test images are taken with an exposure time of 20 ms.  On the horizontal axis the number of the image grabbed is shown (this can be seen as a time axis), and on the vertical axis the value of 5 dead pixels is shown.  (The pixel with the lowest number shows the lowest temporal noise.)  All five pixels shown demonstrate a noise level almost equal to 0 DN because all five pixels are fully saturated. \n Another group of five pixels is shown in Figure 2. \n   \n Figure 2 : Behaviour of a second group of five dead pixels as a function of time. \n In Figure 2, two more “white” pixels are shown, but also three “black” defects.  Although not visible in this graph, the temporal noise of the black pixels is not 0 DN, it still contains the noise of the output stage and the ADC.  This is not necessarily the case for the “white” defects, because they can be clipped by the ADC. \n A final remark : this noise-based method to localize defect pixels cannot be used to find the “sick” pixels.  The latter ones are defined as pixels with a much larger or much smaller sensitivity than the average sensitivity of the sensor.  Because sick pixels still react to light, they can be found as being the outliers in the histogram of all pixels with light input. \n Albert, 17-10-2012."], "link": "http://harvestimaging.com/blog/?p=1074", "bloglinks": {}, "links": {"http://harvestimaging.com/blog": 2}, "blogtitle": "Harvest Imaging Blog"}, {"content": ["RTS stands for Random Telegraph Signal and is a very specific type of noise.  The pixels that do show RTS effects seem to switch between different (more or less) discrete states.  In most case they flip up and down between two signal levels.  This RTS effect can originate through : \n -       dark current effects in the pixel itself, then the two flipping signal levels will be observed also as 2 RTS levels, or, \n -       the effect of a single trap in the source follower, then the two flipping signal levels in combination with the CDS can be observed as 3 RTS levels, without CDS they remain as 2 RTS levels. \n How can these RTS pixels be characterized or located ?  Actually the technique is very simple : because RTS pixels flip up and down between different states, they show a pretty large temporal noise.  So what can be done is the following : \n -       grab several images (e.g. 100), with a relative long exposure time (100 ms or longer), \n -       calculate on pixel level the temporal noise that the pixel demonstrates in the images grabbed, \n -       rank all pixels according to the calculated noise, the pixels with the highest noise level come first and these are most probably RTS pixels, \n -       track the value of these suspected RTS pixels over the frames grabbed. \n The result of this exercise is shown in the Figure 1(the data used for this measurement is different from the data used in previous blogs). \n  \n Figure 1 : Behaviour of a first group of five RTS as a function of time. \n The images are taken with an exposure time of 2 s.  On the horizontal axis the number of the image grabbed is shown (this can be seen as a time axis), and on the vertical axis the value of 5 RTS pixels is shown.  (The pixel with the lowest number shows the largest temporal noise.)  Pixel 0, 1 and 2 change only once over the time of (90 x 2 s =) 3 min.  Pixel 3 is more lively and has several changes, notice that the time the pixel remains in the low state or the high state seems to be completely unpredictable. \n Another group of five pixels is shown in Figure 2. \n  \n Figure 2 : Behaviour of a second group of five RTS as a function of time. \n In Figure 2, pixel 5 is the one that attracts the attention : not only several transitions can be seen, but apparently the pixel switches between 3 states.  It is not immediately clear whether the third state is due to : \n -       RTS of the dark current, \n -       RTS of the source follower, or, \n -       (most likely) due to a switching between two states somewhere half way the exposure time. \n As can be learned, the RTS pixels can have very strange transition patterns, which are not predictable at all.  This leads to the challenge of calibrating these pixels during the manufacturing of the cameras.  In the case such a pixel behaves in the low state during calibration and in a high state during the application, the camera can show a white spot in the image captured … \n Albert, 04-10-2012."], "link": "http://harvestimaging.com/blog/?p=1066", "bloglinks": {}, "links": {"http://harvestimaging.com/blog": 2}, "blogtitle": "Harvest Imaging Blog"}, {"content": ["This blog will contain some further information on how to construct the Photon Transfer Curve, because it is possible to obtain the same information in various ways. What actually is needed for the PTC is a curve representing : \n - the noise (standard deviation, variance, signal-to-noise ratio), versus, \n - the sensor output signal (output signal, output signal corrected for offset or effective output signal), or, \n - the sensor input signal (that was needed to generate the noise under consideration). Although none of the previous blogs did discuss this option, it is also a possible way to deduce the quantum efficiency by means of the PTC. This is the preferred way of using the PTC in the EMVA1288 standard. Unfortunately when measuring the input of the light level that goes to the sensor, one of the attractive features of the PTC is lost, being the fact that no absolute measurements of the light input is needed. For that reason here it is left out of the discussion. \n To create a PTC curve the following options are available : \n 1) Grabbing images in dark : the dark current itself and the temporal noise measured in dark can be used to generate a PTC curve, although it would not be the first choice of doing ! But the dark current itself can be easily changed/modified and the noise can be very simply measured. Changing the dark current can be done by changing the exposure/integration time and/or by changing the temperature. Grabbing several images at the same setting (exposure time and temperature) can be used to calculate the temporal noise for each pixel. Averaging the obtained noise values and averaging the output signals can give rise to a single point on the PTC curve. Notice that more images and more pixels per image will lead to better results. In the case the noise distribution from pixel to pixel turns out to be too large, one can eliminate the outliers, or one can work with a smaller area instead of working with the complete sensor area. In principle the limited sensor area can be reduced to a single pixel, this is still enough to generate decent data for a PTC curve. \n 2) Grabbing images with uniform light input : the average output signal of a sensor under uniform illumination and the noise on pixel level can be easily calculated for a given integration time of the sensor. Also in this way a single point on the PTC curve can be obtained. It should be noted that the PTC curve is used to evaluate temporal noise and not non-uniformities of the light source. So special attention needs to be paid to the uniformity and stability of the light source. If a uniform light input over the total area of the sensor cannot be guaranteed, a reduced sensor area can be used to generate a PTC curve. In the extreme, one single pixel can be used to create the PTC curve. \n 3) Grabbing images with non-uniform light input : from the previous it can be learned that a single pixel can deliver the data for a PTC if the light intensity to this pixel is changed. On the opposite, if the light intensity across the various pixels of a sensor is changed, then each individual pixel can generate a particular point on the PTC curve. If one takes care that these pixels get a large variety of light input, then a complete PTC curve can be obtained. For example by means of : \n a. Two sets of images, a first set with non-uniform light input and a second set with no light input. The second set is needed to generate a decent dark reference frame used to cancel the offset of every pixel. The first set is needed to generate the average signal as well as the temporal noise figure for every single pixel. It should be clear that the more images one gets in each set of images, the higher the accuracy will be of the PTC curve. \n b. One set of images with a non-uniform light input and a single image in dark. In this case the single dark image can be used to compensate for the offset, but one should take into account that this dark frame is not noise free. Also in this case, a higher number of images in the first set will increase the accuracy of the PTC curve. \n c. One set of images with a non-uniform light input. These are used to calculate the average output level and the temporal noise level of each pixel. In the case no dark reference frame is available, one can rely on the darkest area in the average output frame to define the offset. Although only an “educated” guess can be made of the offset, the accuracy of the PTC curve and the obtained results can be increased by grabbing as many as possible images. \n In the training developed by Harvest Imaging, the construction of a Photon Transfer Curve gets a lot of attention.  It is amazing how low the number of input images/data needs to be to create a valuable evaluation tool for the camera or sensor.  For more information and exploration of the PTC method, you should attend one of the Harvest Imaging courses and say “Thank You” to Jim Janesick, who originally developed this technique. \n Albert, 19-09-2012."], "link": "http://harvestimaging.com/blog/?p=1054", "bloglinks": {}, "links": {}, "blogtitle": "Harvest Imaging Blog"}, {"content": ["When characterizing the noise of an imager (temporal or fixed-pattern) by means of a single number (that is what we did in the previous blogs), one should be cautious with the interpretation of that single result.  A single number does not tell anything about the distribution of the noise, does not give any information about outliers, does not give any information about the physical location of pixels with a high or low noise level.  Performing a global noise measurement and characterizing the noise behavior of an imager by means of a single number can still work well in the case the noise is dominated by a global noise source, e.g. the output amplifier of a CCD.  On the other hand, a single number for the noise is very often found in data sheet, but actually it can hide a lot of information. \n But these days with amplifiers in every CMOS pixel, addressing circuitry on row level and analog circuitry on column level, it is absolutely recommended to perform more noise analysis to get a better insight in the origins of the noise.  The following techniques can be of interest : \n -       Generating a noise distribution histogram if the noise is present on pixel level.  In the case that the average noise level is dominated by outliers, it may be worthwhile to correct these outliers (by menas of a simple defect correction algorithm) and perform the noise calculation again, \n -       Calculating the noise on row level and on column level : this can give information about the origin of the noise, whether the dominant noise source is located in the column circuitry or row circuitry, \n -       Performing frequency analysis (by means of a FFT) on the row level and column level noise to find out if there exists any repetitive pattern in these noise sources, \n -       Calculating the noise on pixel level, by subtracting the column and row noise from the total noise, \n -       Calculating the minimum quantisation noise of the ADC (if present on the chip), \n -       Measuring the noise of the “global” output stage by applying different gains to this output amplifier (if possible). \n The technique of noise measurements is not that difficult.  With a computer and a frame grabber one can do an excellent job.  In most cases it is just a matter of calculating average values and standard deviations on the data present in images.  The trick is to perform them in the right order ! \n Over the last decade the noise performance of the imagers has increased quite a lot, for instance due to semiconductor technology improvements and advanced circuitry/design techniques.  As a result, the characterization of the noise with a high accuracy is becoming more and more challenging.  For that reason one should pay more and more attention to the measurement set-up as well.  A few hints : \n -       Temperature of the sensor (which is not necessarily the same as the environment temperature) should be stable within 1 o C.  Even the smallest temperature increase will increase the dark current and its shot noise component, \n -       In the case that light is used as an input signal, the light source should be stable (intensity and colour temperature) and a DC light source has to be used.  Uniformity of the light across the pixels should be “perfect” when various pixels will be compared with each other, as for instance done with PRNU measurements.  If the case noise measurements are performend, one is should measure non-uniformities of the sensor and not non-uniformities of the light source. \n -       Measurements without light need to be done in dark !  Just avoiding light input by simply capping the camera lens is not enough to put a sensor in complete darkness. \n Good luck with the measurements and have fun ! \n Albert, 09-09-2012."], "link": "http://harvestimaging.com/blog/?p=1049", "bloglinks": {}, "links": {}, "blogtitle": "Harvest Imaging Blog"}, {"content": ["Over the last few years a lot of information about the Photon Transfer Curve (PTC) is being published in this blog.   The influence of many different sensor parameters on the PTC was studied and described.   For those of you that are still hungry to get more information, please remember that Jim Janesick wrote a complete book about the PTC.   It was Jim who developed this wonderful technique in the ‘80s for CCDs, but the PTC is perfectly applicable to CMOS imagers as well.   The great advantage of this measuring method is the fact that no absolute measurements of any light input is needed.    \n In this blog, the application of the PTC on the data/images collected earlier will be described.   So the same images (with light on the sensor) as used in the previous blogs are being re-used.   What was done to generate these images : the sensor under test was uniformly exposed to light, while varying the exposure time.   For every exposure time applied, several images were grabbed, the average value of the obtained images as well as the temporal noise on pixel level was calculated.    \n The measured signal of the sensor can be written as : \n S tot = kN o + S off      (1) \n While the measured temporal noise on pixel level can be written as : \n s tot 2 = k 2 s R 2 + k 2 s o 2   (2 ) \n with : \n -         S tot : measured output signal [DN], \n -         k : conversion gain [DN/e - ], \n -         N o : number of optically generated electrons, \n -         S off : offset signal [DN], \n -         s tot : total temporal noise measured [DN], \n -         s R : temporal noise associated with the readout channel [e - ], also the noise floor in dark at 0 s exposure time, \n -         s o : photon shot noise [e - ]. \n And with : \n s o 2 = N o = (S tot – S off )/k         (3) \n the total noise can be written as : \n s tot 2 = k 2 s R 2 + k(S tot – S off ).      (4) \n The signal-to-noise ratio of the system under consideration can be written as : \n                                     S tot / s tot = (S tot -S off )/( k 2 s R 2 + k(S tot – S off )) 0.5 .       (5) \n The obtained measurement data/images can be used to create : \n 1)      Standard deviation versus average effective signal, both on a log-scale (“Mean-Standard Deviation”). \n   \n The standard deviation is representing the temporal noise of the pixels, the effective signal is equal to the average output signal minus the DC-offset of the output signal.   The obtained curve is shown in Figure 1. \n  \n   Figure 1. Photon Transfer Curve : standard deviation versus effective output signal. \n From left to right, one can recognize three parts in this PTC graph : \n -         A flat part in which the temporal noise of the readout channel or the noise floor at 0 s exposure time, is dominant, in the example shown this noise is equal to 10 0.605 DN = 4.03 DN .   This can also be derived from equation (4) and scrapping the photon shot noise : \n              s tot 2 = k 2 s R 2     or      s tot = k s R . \n -         A part with increasing noise for increasing effective signal, in this region the photon shot noise is dominant, and the slope of the curve needs to be equal to 0.5 (or at least very close to this value).   The regression line drawn through this part of the curve is characterized by the relation shown in the graph.   Using equation (4) again, but this time focusing on the photon shot noise, it reduces to : \n   \n        s tot 2 = k(S tot – S off )     or     k = 1/(S tot – S off ) at s tot = 1 DN. \n   \n In this way the conversion gain k can be found by extrapolation of the regression line towards the crossing with the horizontal axis.   The value found for k is : 10 -(0.2285/0.4781) = 0.33 DN/e - . \n   \n -         The part at which the noise reaches a maximum value and for any further increase in effective signal, the curve collapses.   This is the point at which the pixels reach their saturation level.   In the example shown, this happens for an effective output signal equal to 10 3.515 DN = 3273.0 DN . \n   \n 2)      Variance versus average effective signal, both on a linear scale (“Mean-Variance”). \n The curve obtained is illustrated in Figure 2. \n  \n Figure 2. Photon Transfer Curve : noise variance versus effective output signal. \n Also this figure shows some interesting features from left to right : \n -         Crossing with the vertical axes (= 0 DN effective signal) for a noise variance equal to 15.61 DN .   This value corresponds to the temporal noise at very low signal values or noise floor in dark for 0 s exposure time, and actually should represent the variance of the noise associated with the readout channel.   The value found here is 15.61 0.5 DN = 3.95 DN . \n   \n -         A linear part in the curve for which the relation is shown in the figure.   In this region again formula (4) is valid : \n       s tot 2 = k 2 s R 2 + k(S tot – S off ). \n   \n Taking into account the relationship of the regression line, it should be concluded that the conversion gain k (being the slope of the line) is equal to 0.23 DN/e - .   This value is lower than the one previously found with the Mean-Standard Deviation method.   This is due to the fact that there is a relative large error introduced in the calculation because the slope of the noise versus signal curve is not perfectly equal to 0.5 ! \n   \n -         A saturation part with a collapsing curve for a maximum signal level of 3275 DN , being the saturation level of the pixels. \n   \n 3)      Signal-to-noise ratio versus average effective signal, both on a log-scale (“Mean-Signal-to-Noise”). \n The relation between signal-to-noise ration and effective signal is shown in Figure 3. \n   Figure 3. Photon Transfer Curve : signal-to-noise ratio versus effective output signal. \n A similar story as before can be repeated about three different regions in the curve : \n -         At the very left end a first part that can be linearized is indicated by the relation between signal-to-noise and average effective signal.   In this region the noise of the readout channel is dominant, and based on equation (5), the signal-to-noise ratio can be written as : \n          S tot / s tot = (S tot -S off )/(k s R )     or     k s R =S tot -S off at S tot / s tot = 1. \n In this example, the readout noise is equal to 10 11.388/18.941 = 3.99 DN . \n -         Just before saturation, a second linear part can be recognized in the region where the photon shot noise is the dominant noise source, and based on equation (5), the signal-to-noise ratio can be simplified to : \n            S tot / s tot = ((S tot -S off )/k) 0.5     or     k = 1/(S tot -S off ) at S tot / s tot = 1. \n In this example, the conversion gain is equal to 10 4.7219/10.452 = 0.35 DN/e - .   Also this value deviates from the previously calculated values, because the extrapolation of the data can introduce some nasty errors. \n -         Finally the signal-to-noise ratio is becoming extremely large, due to the fact that the temporal noise of the sensor is reduced to almost zero at saturation of the pixels for a value of 10 3.515 DN = 3273 DN . \n In conclusion, parameters such as the readout noise or noise floor in dark, the conversion gain and the saturation level can be found by means of the Photon Transfer Curve.   But the most accurate and reliable data for (although 3 different curves are used, the input data for these curves is the same) : \n -         the conversion gain can be obtained via the Mean-Variance curve, \n -         the readout noise or noise floor in dark at 0 s exposure time, can be obtained via the Mean-Standard Deviation curve, \n -         the saturation level can be obtained by any form of PTC.     \n The PTC curve can be constructed in various ways.   In this blog uniform illuminated sensor areas at various exposure times are used, in the next blog a few alternatives will be highlighted. \n Albert, 27-08-2012."], "link": "http://harvestimaging.com/blog/?p=1034", "bloglinks": {}, "links": {}, "blogtitle": "Harvest Imaging Blog"}, {"content": ["It is again time to switch on the light and to measure the temporal noise of a sensor with light input.   Actually, do not expect that much new information with this measurement as far as noise is concerned.   Once there is light shining on the sensor and once the sensor is delivering enough signal, the photon shot noise will be the largest noise component and the measurement results will be dominated by this photon shot noise .   And it is known that the photon shot noise (expressed in electrons) has a square-root relation with the amount of electrons generated in the pixels.   There is no real need to proof the Poisson statistics again, others have done this already millions of time.    \n When measuring the temporal noise, it must be admitted that most interesting information is already found in the sessions without light input and with an exposure time equal to 0 s.   Nevertheless, to complete the story about temporal noise measurements, also the evaluation of temporal noise with light will be discussed in this blog.    \n Figure 1 repeats the average output signal of the sensor, with light input, as a function of the exposure time.   This information is already shown in an earlier blog. \n  \n   \n Figure 1. Average output signal, with light input, as a function of the exposure time. \n As can be expected, the various colours in Figure 1 represent the four colour channels of the device (red, green in red line, green in blue line and blue).   The following remarks can be made : \n -         Offset at 0 s exposure time, being equal for all colour channels, being 820 DN, \n -         Saturation level being equal for all colour channels, the saturation levels are equal to 4095 DN.   So the saturation level of the signals is determined by the maximum level of the ADC (being 2 12 -1 DN = 4095 DN).  With the correction of the offset, the sensor delivers maximum 3275 DN, \n -         Sensitivity of the blue channel is lowest, next is red, and the most sensitive channels are the two green ones.   This observation is the case for the light input parameters indicated, 5600K colour temperature, and 5 lux on the sensor. \n Figure 2 illustrates the measured temporal noise under the same light and sensor conditions as the one used in Figure 1. \n  \n   \n Figure 2. Temporal noise of the sensor with light input, as a function of the exposure time. \n Also from this graph a few interesting remarks can be made : \n -         For an exposure time 0 s, the minimum noise is equal to 3.92 DN.   This is the noise floor of the sensor in dark at 0 s exposure time, \n -         For increasing exposure times, the noise increases as well, but in a non-linear way.   This is due to the fact that for larger exposure times, the noise is dominated by the photon shot noise, and the latter has a square-root relation with the average signal (in the charge domain), \n -         Because the sensitivity of the green channels is the largest of all, and the sensitivity of the blue channel is the lowest, the same is true for the noise levels at a particular exposure time, \n -         As soon as the signals saturate, the temporal noise is quickly dropping to a very low level.   This is due to the fact that the ADC is saturating and fixing the output value of the signal to 4095 DN and any further noise content in the analog signal does not show up in the digital representation of the output signal. \n Figure 3 shows the temporal noise histogram, obtained at an exposure time of 0.032 s, at which the green channels reach 25 % of saturation. \n  \n   \n Figure 3. Noise histogram for the sens  or with light, only one of the green channels is shown. \n   At the left side in Figure 3, the Poission distribution of the photon shot noise can be recognized.   The tail at the right side in the histogram is representing the pixels of which the temporal noise is dominated by 1/f and RTS noise. \n    \n Albert, 13-07-2012."], "link": "http://harvestimaging.com/blog/?p=1028", "bloglinks": {}, "links": {}, "blogtitle": "Harvest Imaging Blog"}, {"content": ["After measuring the noise in dark on column level, it is important to check noise in dark on row as well.   This discussion will be very much the same as the last one about column level noise.   The row level noise can be calculated based on the same data/images used for the FPN in dark and for the noise in dark on pixel and column level.   It is just a matter of applying the right order of statistical calculations.   To evaluate the noise in dark on row level, all pixels in each row are averaged and next the rms value is calculate on these averaged row values.   Once the noise for each row is known, the average value of all these rms values is calculated. \n The result of this process is shown in Figure 1.   Both the temporal noise on pixel level (previous blog) and the temporal noise on row level are shown as a function of integration time. \n  \n   \n Figure 1. Temporal noise measured in dark on pixel level and on row level, as a function of the exposure or integration time. \n As can be expected, the row level noise is much lower than the pixel level noise, the difference between the two curves is minimum at 0 s exposure time and at saturation.   At lower exposure times, the temporal noise of the electronic circuitry plays an important role.    For larger values of the exposure time, the dark shot noise is dominant and in that case, the averaging effect on the data removes this pixelized noise component.   At saturation, the noise is reaching its minimum value. \n Numbers that are obtained from this analysis : \n -         At 0 s exposure time, the temporal noise on row level is 1.20 DN , \n -         At 25 % of saturation, and for an exposure time of 8 s, the temporal noise on column level is 1.81 DN . \n  \n   \n Figure 2.   Temporal row noise (in dark) of the pixel at 0 s and 8s exposure time. \n Figure 2 shows the row noise in dark for two integration times : 0 s (to get the noise without dark shot noise) and at 8s (when the pixels contain 25 % of the full well capacity).   In both cases no repetitive pattern in the noise can be recognized, this is also verified by means of a FFT calculation.   The result of this is shown in Figure 3. \n  \n   \n   Figure 3.   FFT of the row noise calculated for an exposure time of 0 s. \n As can be observed in Figure 3, there is no specific FFT signal available at a particular frequency.   From this one can conclude that the temporal row noise is randomly distributed. \n Albert, 05-07-2012."], "link": "http://harvestimaging.com/blog/?p=1019", "bloglinks": {}, "links": {}, "blogtitle": "Harvest Imaging Blog"}, {"content": ["I am writing this blog after finishing two in-house trainings in North America.  It was the first time that my hands-on class went overseas, but also the first time that the hands-on class was organized as an in-house course.  So two premieres at the same time.  A big thank you for my customers who invited me to fly over to North America and organized the in-house trainings. \n This hands-on class is very unique in the training world I think, but it also costed me a lot of effort to get it running the way it now does.  Constantly changing, updating and improving is the message.  Especially the feedback I received from the participants is of crucial importance in this process.  After conducting 130+ trainings an, of course you get a very good feeling yourself whether a course is running well or not, and where to improve.  But the feedback of the participants is of crucial importance.  For that reason I would like thank all people attended the hands-on course for their great cooperation and feedback.  Including the two classes of this week, in total about 100 people have already attended the hands-on course.  Next open hands-on course will be organized in Amsterdam, Dec. 3-4, 2012.  Maybe I will meet there some of my blog-readers.   \n Albert, 29-06-2012."], "link": "http://harvestimaging.com/blog/?p=1014", "bloglinks": {}, "links": {}, "blogtitle": "Harvest Imaging Blog"}, {"content": ["After measuring the noise in dark on pixel level, it is important to check the noise in dark on column level and on row level.   This time we will discuss the temporal noise on column level.   The latter can be calculated based on the same data/images used for the FPN in dark and used for the noise in dark on pixel level.   It is just a matter of applying the right order of statistical calculations.   To evaluate the noise in dark on column level, all pixels in each column are averaged and next the rms value is calculate on these average column values.   Once the noise for each column is known, the average of all rms values is calculated. \n The result of this process is shown in Figure 1.   Both the temporal noise on pixel level (previous blog) and the temporal noise on column level are shown as a function of integration time. \n  \n   \n Figure 1. Temporal noise measured in dark on pixel level and on column level, as a function of the exposure or integration time. \n As can be expected, the column level noise is much lower than the pixel level noise, although the difference between the two curves is minimum at 0 s exposure time and at saturation.   At lower exposure times, the temporal noise of the electronic circuitry plays the most important role, and because the difference between pixel and column noise is not that much, it can be expected that most of the total temporal noise in dark is coming from the column circuitry.   For larger values of the exposure time, the dark shot noise is dominant and in that case, the averaging effect on the data removes this pixelized noise component.   At saturation, the noise is reaching its minimum value. \n Numbers that are obtained : \n -         At 0 s exposure time, the temporal noise on column level is 2.40 DN , \n -         At 25 % of saturation, and for an exposure time of 8 s, the temporal noise on column level is 2.66 DN . \n   \n   \n Figure 2.   Column noise in dark for two different integration times. \n  Figure 2 shows the column noise in dark for two integration times : 0 s (to get the noise without any dark shot noise) and at 8s (when the pixels containing 25 % of the full well capacity).   In both cases no repetitive pattern in the noise can be recognized, this is also verified by means of a FFT calculation.   The result of this is shown in Figure 3. \n  \n   \n   Figure 3.   FFT of the signal of the column noise calculated for an exposure time of 0 s. \n As can be observed in Figure 3, there is no specific FFT signal available at a particular frequency.   From this, one can conclude that the column noise is randomly distributed. \n Next time a similar exercise will be done for the temporal noise in dark on row level. \n Albert, 27-06-2012."], "link": "http://harvestimaging.com/blog/?p=1006", "bloglinks": {}, "links": {}, "blogtitle": "Harvest Imaging Blog"}, {"content": ["Over the last two days, IMS Fraunhofer organized their bi-yearly CMOS imager workshop.  The workshop was attended by (about) 90 people I guess.  Presentations were done by invitation only.  It was already the sixth time this workshop took place, always in a very good atmosphere and always accompanied by an excellent workshop dinner on the first night. \n Of course the most important part are the presentations held at the workshop.   It is impossible to comment on all of the details (because I did not take enough notes), but what I can recall from the top of my head : \n - the undersigned had the honour to open the workshop with a talk on the effects of CMOS scaling versus scaling of photonics, \n - two interesting presentations followed about the pinned photodiode as the heart of modern CMOS pixels.  TowerJazz gave a lot of details about the pinned diodes, its optimization in technology and in driving circuitry.  Several artifacts were illustrated and explained, like lag, noise, full well, transfer, etc.   After this presentation, Viimagic illustrated how to implement the diodes in a high-performance image sensor.  Focus was paid on CMOS pixels with a global shutter. \n - from the application side, Dirk Viehmann gave an overview of solid-state imaging in space.  Many people are used to camera modules for mobile phones, but in the presentation, camera systems almost as large as a complete house were shown.  Impressing technology ! \n - ToF was covered in 3 talks, coming from PMD, SoftKinetic and Fraunhofer themselves.  Very nice overview of the various methods to perform depth sensing by ToF imagers. \n - With respect to non-visible imaging, there were 2 presentations.  First one from Holger Vogt on uncooled microbolometers.  The second one from Jan Bosiers about wafer-scale CMOS imagers.  The bolometer paper described a technology somewhat outside the classical image configurations and technologies, but maybe just for that reason, it was very interesting.  Bosiers on his side gave a very nice overview of large area CMOS devices published recently. \n - Next two presentations on optics and camera testing.  Ziv Attar got the attention of the audience by his ideas and explanation of array cameras.  Bernd Jaehne explained in his enthousiastic style the benefits of the EMVA1288 measurement standard. \n - The workshop concluded with 3 presentations in the SPAD field : University of Edinburgh, Philips and Politecnico di Milano.  Robert Henderson gave a great overview of the recent published SPAD work.  Philips was focusing on implementing their specific SPAD technology into a medical product and from Politecnico the introduction of SPADs in InGaAs technology was shown. \n I do realize that much and much more information was given on many more topics than listed over here.  But I just want to give my readers an idea of what happened over the last couple of days in Duisburg. \n Thanks to Werner, Bedrich, Cornelia and all the others for organizing this workshop.  Looking forward to the next on in 2014 ? \n Albert. \n 14-06-2012."], "link": "http://harvestimaging.com/blog/?p=1002", "bloglinks": {}, "links": {}, "blogtitle": "Harvest Imaging Blog"}]