[{"blogurl": "http://scharrheds.blogspot.com\n", "blogroll": [], "title": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["New and updated Cochrane Reviews from October are available for those listed below. Exercise interventions on health-related quality of life for cancer survivors New treatments compared to established treatments in randomized trials (Methodology Group) General health checks in adults for reducing morbidity and mortality from disease Collaborative care for depression and anxiety problems Cranberries for preventing urinary tract infections Combined pharmacotherapy and behavioural interventions for smoking cessation Vaccines for preventing herpes zoster in older adults"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/652832546039319674", "bloglinks": {}, "links": {"http://www.thecochranelibrary.com/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["Four treatments to be precise; nebulised colistimethate, colistimethate sodium dry powder inhaler (DPI), nebulised tobramycin and tobramycin DPI. It was also a MTA, which means that the Assessment Group (our own ScHARR-TAG) got to build their own model rather than have to rely on the manufacturers’ models. Due to changes in the manufacturer’s evidence, the AG - Paul Tappenden, Sue Harnan, Lesley Uttley, Matthew Mildred, Chris Carroll, and Anna Cantrell – got to produce several reports, all of which are available here . In summary : “The Committee noted that there was no economic analysis which compared colistimethate sodium DPI with nebulised colistimethate, the preferred comparator, according to clinical specialists on UK clinical practice. The results of the Committee's preferred economic analysis showed that colistimethate sodium DPI was less effective and less costly than nebulised tobramycin. The Committee concluded that although the analysis showed potential for cost savings, the clinical evidence for colistimethate sodium DPI was not robust enough to conclusively show that it is a cost-effective use of NHS resources. The Committee noted that the results of the economic analysis for tobramycin DPI compared with nebulised tobramycin showed that tobramycin DPI was cheaper and slightly more effective, although associated with some uncertainty. Despite the limitations of all the data and the uncertainty in the model, the Committee agreed that it was reasonable to conclude that tobramycin DPI was a cost effective use of NHS resources in people with cystic fibrosis who would otherwise have been treated with nebulised tobramycin.” Of interest: Several analyses produced ICERs for one of the new drugs in the SW quadrant of the cost-effectiveness plane, which complicated the discussion in the ACD . The Assessment Group carried out a sensitivity analysis using the Commercial Medicines Unit (CMU) Electronic Marketing Information Tool (E-MIT) price rather than the BNF list price for nebulised tobramycin. In September 2012, the estimated price of tobramycin paid by the NHS was £970.12 rather than the list price of £1187. This is in the ACD and was clearly considered by the Committee. One of the manufacturers – Novartis – didn’t submit a model and instead argued for cost-minimisation analysis, which was rejected by the Committee ."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/1292785572805737721", "bloglinks": {}, "links": {"http://guidance.org.uk/": 4, "http://cmu.gov.uk/": 1, "http://www.org.uk/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["The NICE technology appraisal group within HEDS – ScHARR-TAG – has had it’s next set of appraisals agreed with the NIHR. These include two STAs and a non-NICE Short Report. They are: Degarelix (Firmagon, Ferring Pharmaceuticals) for the treatment of advanced hormone-dependent prostate cancer (STA) Bevacizumab (Avastin, Roche) for the adjuvant treatment of triple negative early breast cancer (STA) Sexual health of people with severe mental health illness (Short Report)"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/1762579493373774834", "bloglinks": {}, "links": {}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["Twice each month the CEA Registry Blog lists recently published cost utility studies and associated papers. 47 papers were listed this time. Here's a few in our areas of research interest: Hettle R, Wouters H, Ayres J, et al. Cost-utility analysis of tiotropium versus usual care in patients with COPD in the UK and Belgium. Respir Med. 2012 Oct 3. [Epub ahead of print] PubMed PMID: 23040833. Hannouf MB, Xie B, Brackstone M, et al. Cost-effectiveness of a 21-gene recurrence score assay versus Canadian clinical practice in women with early-stage estrogen- or progesterone-receptor-positive, axillary lymph-node negative breast cancer. BMC Cancer. 2012 Oct 2;12(1):447. [Epub ahead of print] PubMed PMID: 23031196. McCullagh L, Walsh C, Barry M. Value-of-Information Analysis to Reduce Decision Uncertainty Associated with the Choice of Thromboprophylaxis after Total Hip Replacement in the Irish Healthcare Setting. Pharmacoeconomics. 2012 Oct 1;30(10):941-59. PubMed PMID: 22667458. Stroupe KT, Lederle FA, Matsumura JS, et al. Cost-effectiveness of open versus endovascular repair of abdominal aortic aneurysm in the OVER trial. J Vasc Surg. 2012 Oct;56(4):901-909.e2. Epub 2012 May 27. PubMed PMID: 22640466. Yang M, Rajan S, Issa AM. Cost effectiveness of gene expression profiling for early stage breast cancer: A decision-analytic model. Cancer. 2012 Oct 15;118(20):5163-70. doi: 10.1002/cncr.27443. Epub 2012 Feb 22. PubMed PMID: 22359236."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/8222129573677851275", "bloglinks": {}, "links": {"https://research.tufts-nemc.org/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["From the NICE website : “Tranexamic acid (Cyklokapron, Pfizer) for significant haemorrhage (severe bleeding) following trauma is the first topic to be covered by NICE as part of its new service to provide high quality information to the NHS and patients in England about the use of unlicensed and off-label medicines. Produced by NICE's Medicines and Prescribing Centre (which was formed following the transfer into NICE of the National Prescribing Centre in April 2011), these outputs provide a summary of the published evidence for selected unlicensed or off-label medicines that are considered to be of significance to the NHS, where there are no clinically appropriate licensed alternatives. They will provide information for clinicians and patients to inform their decision-making and support the construction and updating of local formularies. Although the strengths and weaknesses of the relevant evidence of a drug's efficacy, safety and cost are critically reviewed within the NICE evidence summaries, the summaries do not constitute formal NICE guidance.” So although it is clear that tranexamic acid reduces all cause mortality and the economic evaluation came up with an ICER of £43 per life year saved, NICE doesn’t formally recommend it. But providers and commissioners across the world must surely sit up and take notice. The following topics will form the first tranche of NICE evidence summaries for unlicensed or off-label medicines: Melatonin - sleep disorders in children Diltiazem cream 2% - anal fissure Glyceryl trinitrate 0.2% ointment - anal fissure Midodrine - postural hypotension Metformin tablets - Polycystic ovary disease Modafinil tablets - decreasing fatigue in MS Magnesium glycerophosphate oral - hypomagnesaemia Clonidine - ADHD as sole treatment and adjunct Rituximab in mantle cell lymphoma"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/7632903084169170646", "bloglinks": {}, "links": {"http://www.org.uk/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["Separate to the HEDS programme, the ScHARR seminar programme covers all aspects of Health Service Research. However, the next seminar is modelling based: \"Modelling Demand and Deployment of Emergency Medical Services\" Prof. Paul Harper, Operational Research Group, Cardiff University It is on at 12.30-1.30pm on Tuesday, 23rd Oct in Pemberton Room. Abstract: Response time targets for the Welsh Ambulance Service Trust (WAST) are not currently being met, particularly for high priority emergencies in rural areas. Collaborative work between WAST and the Cardiff OR Group, has explored the use of different research methodologies to assist WAST with decisions on ambulance locations, capacities and deployments. This talk will provide an overview of the different approaches and tools developed, including forecasting demand, time-dependent queueing models and optimisation for crew rostering, a geographical discrete event simulation and location theory for locations and deployment, and phase-type models to explore the impact of ambulance turn-around times at hospitals. Future seminars, same time and place are: Tuesday, November 6 Alice Pitt, Emily Wilson, Josie Reeve - \"An overview of IRise\" Tuesday, November 20 Dr Farshid Amirabdollahian - \"Robotic Rehabilitation Technology\" Tuesday, December 4 Dr Peter Allmark - \"Capability and Justice\""], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/2483816617577472954", "bloglinks": {}, "links": {}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["The NICE Decision Support Unit has just published A review of the use of statistical regression models to inform cost effectiveness analyses within the NICE Technology Appraisals programme. By Ben Kearns, Roberta Ara and Allan Wailoo. From the Executive Summary: “Of the 79 technology appraisals examined, 47 included at least one regression analysis and a total of 91 separate regression analyses were reported. 56 were de novo analyses provided by the manufacturer/sponsor of the technology (34 from Single Technology Appraisals and 22 from Multiple Technology Appraisals), while the remaining 35 were sourced from existing published literature. Over 50% involved health state utility values with the balance involving health care costs (11%) or probabilities of clinical events (35%). For the de novo analyses, reporting was poorest around the sample size used, the justification of the type of model estimated, the selection of covariates used, the strategy for identifying the preferred final model and any validation used. Across all the analyses, there was potential for improvement in the reporting of: the description of the dataset, the model type, the rationale for inclusion of model covariates, the validity of the final model and the uncertainty in the model. Statistical regression models are in widespread use in NICE TAs yet reporting standards relating to basic information are poor. Whilst some of this may be due to the word limit imposed on TAs, there is still scope for improvement. This is important as increasing levels of reporting transparency enable policy decision makers to have increasing levels of confidence in the resulting estimates of cost-effectiveness. We suggest a series of recommendations that could be used for the minimum reporting requirements for any statistical regression analyses used in a DAM.”"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/4857785375479104071", "bloglinks": {}, "links": {"http://www.org.uk/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["The NICE Decision Support Unit has just published A review of studies examining the relationship between progression-free survival and overall survival in advanced or metastatic cancer , by Sarah Davis, Paul Tappenden, Anna Cantrell. From the Executive Summary: “Nineteen papers were included in the review covering eight different tumour types. Four studies used aggregate data from multiple trials to examine the relationship between PFS and OS for individual trial arms. Seven studies used individual patient data to examine the relationship between PFS and OS for individual patients. Thirteen studies examined the trial level relationship between treatment effect on PFS and treatment effect on OS with three using individual patient data, whilst the remainder used aggregate data from multiple trials. A variety of statistical techniques were employed within these studies, with the most commonly used being rank correlation coefficients, linear regression and landmark analysis. The lack of a standardised approach made it difficult to establish whether there is a consistent relationship between PFS/TTP and OS. The majority of the studies found a positive correlation between PFS/TTP and OS for individual patients, individual trial arms and the treatment effect between trial arms, although, the size of the correlation and its statistical significance varied considerably across studies. This is not surprising given the variety of methods employed and the variation in studies characteristics such as differences in the tumour type and the line of therapy considered.” As for the conclusions, you’ll have to read the report….."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/6082881336574232345", "bloglinks": {}, "links": {"http://www.org.uk/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["The following articles were published by researchers within HEDS in September.  LosingSight of the Wood for the Trees: Some Issues in Describing and Valuing Health,and Another Possible Approach.  Dolan P, Lee H, Peasgood T Pharmacoeconomics 14 Sep 2012 DOI  Usinghealth state utility values in models exploring the cost-effectiveness ofhealth technologies  Ara R, Wailoo A Value Health 15(6):971-974 Sep 2012 DOI  It is thelifetime that matters: public preferences over maximising health and reducinginequalities in health  Dolan P, Tsuchiya A J Med Ethics 38(9):571-573 Sep 2012 DOI"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/880782872022975630", "bloglinks": {}, "links": {"http://www.nih.gov/": 3}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["Onoing collaboratons between several research teams has led to the formation of Emergency Medicine Research in Sheffield (EMRiS) within ScHARR. Between them, the group has around 150 publications relating to emergency medicine. Past and future research by the group covers a wide range of methods and topics. Research methods include single-centre and multi-centre clinical trials, cluster trials, observational studies, organisational evaluation, qualitative research, meta-analysis and cost-effectiveness analysis with HEDS. You can deep track of EMRiS via their blog , twitter feed and facebook ."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/413293462718441360", "bloglinks": {}, "links": {"http://emmedris.co.uk/": 1, "https://twitter.com/": 1, "http://www.mendeley.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["This course examines in detail the requirements for utility data in health technology assessment for agencies such as NICE. The course covers both how to measure and use utility to meet the current requirements of NICE and recent research including EQ-5D-5L valuation and use of social value weightings for example in Value Based Pricing. It is running on 14th & 15th March 2013. Course team includes Professor John Brazier, Professor Ben van Hout, Dr Tracey Young, Roberta Ara & Dr Tessa Peasgood. Cost to oommercial organizations is £1,200. Cost to academic/government organizations is £700. We are also offering a half day workshop running 13th March in the afternoon at a cost of £200 Please contact us for further information about discounts for block bookings of 5 or more people Further details, flyer and booking form can be found here ."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/5682898306324175403", "bloglinks": {}, "links": {"http://www.ac.uk/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["Collaborations for Leadership in Applied Health Research and Care (CLAHRC) are collaborative partnerships between universities and the surrounding NHS organisations, focused on improving patient outcomes through the conduct and application of applied health research. Their emphasis is on the translation and implementation of research in the NHS, rather than treating research as an end product. Nine CLAHRCs were funded by the NIHR and the CLAHRC for South Yorkshire is based in Sheffield. Their latest newsletter showcases five research projects where health economists within ScHARR have played important roles. They are: Neonatal screening Assissted living for patients with chronic conditions Self management of diabetes in adolescents Services for long-term depression Health inequalities Details of these projects are available here ."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/3967155447664046689", "bloglinks": {}, "links": {"http://clahrc-sy.ac.uk/": 2}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["From the Academic Health Economists’ Blog : “The Academic Health Economists’ Blog oversees the Health Economics Twitter Journal Club . The club meets on the first Monday of every month at 8pm London time, using #HEJC on Twitter. Everybody is welcome to contribute. How it works The chosen paper is announced 1 week in advance of the discussion, with a summary of the article and proposed discussion points. A copy of the paper is not provided. To suggest a paper tweet us @aheblog. A tweet is posted at 8pm to mark the beginning of the discussion and another at 9pm marking the end of the discussion. A transcript of each discussion is available at http://aheblog.com/category/hejc including all tweets with the hashtag #HEJC between these 2 tweets.” The inaugural virtual meeting will take place Monday 1st October, at 8pm London time. The paper for discussion is an Early View article in Health Economics by Warren G. Linley and Dyfrig A. Hughes of Bangor University. The title of the paper is: “ Societal views on NICE, Cancer Drugs Fund and value-based pricing criteria for prioritising medicines: a cross-sectional survey of 4118 adults in Great Britain ”"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/3178051283761099303", "bloglinks": {}, "links": {"http://aheblog.com/": 3, "http://onlinelibrary.wiley.com/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["Twice each month the CEA Registry Blog lists recently published cost utility studies and associated papers. 36 papers were listed this time. Here's a couple in our areas of research interest: Reed SD, Dinan MA, Schulman KA, Lyman GH. Cost-effectiveness of the 21-gene recurrence score assay in the context of multifactorial decision making to guide chemotherapy for early-stage breast cancer. Genet Med. 2012 Sep 13. [Epub ahead of print] PubMed PMID: 22975761. Blohmer JU, Rezai M, Kümmel S, et al. Using the 21-gene assay to guide adjuvant chemotherapy decision-making in early-stage breast cancer: a cost-effectiveness evaluation in the German setting. J Med Econ. 2012 Sep 11. [Epub ahead of print] PubMed PMID: 22966753."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/2525508386106565256", "bloglinks": {}, "links": {"https://research.tufts-nemc.org/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["ISPOR's seven Modeling Good Research Practice Reports are available from September 18, 2012 at the ISPOR website (or via the linked titles below). Individual reports are available on the following: Modeling Good Research Practices - Overview  Conceptualizing a Model  State-Transition Modeling  Modeling using Discrete Event Simulation  Dynamic Transmission Modeling  Model Parameter Estimation and Uncertainty  Model Transparency and Validation"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/9219624559621476861", "bloglinks": {}, "links": {"http://www.ispor.org/": 7}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["A publicly accessible repository - ISPOR Oncology Outcomes Research Resources (OORR) - developed by the ISPOR Oncology Outcomes Research Resources Working Group, is now available. It contains details of oncology-realted organisations, databases and seminal articles/books by geographic region."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/7319754227087484040", "bloglinks": {}, "links": {"http://www.ispor.org/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["“NICE, the healthcare guidance body, has .....issued draft guidance updating its previous recommendations on the use of alteplase (Actilyse, Boehringer Ingelheim) for the treatment of acute ischaemic stroke. NICE has recommended alteplase within the NHS as long as treatment is started as early as possible within 4.5 hours after onset of stroke symptoms, and after intracranial haemorrhage has been excluded by appropriate imaging techniques. The update was prompted by a change in the drug's licence which allows an extension in the time period it can be used, from within 3 hours to within 4.5 hours of the onset of symptoms.” ( Source, NICE ) The Evidence Review Group that undertook the review was ScHARR-TAG, with Sarah Davis, Michael Holmes, Emma Simpson and Anthea Sutton leading the work. All ICERs uner £20K and no complicating issues? Surely not. Their work can be found here ."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/4602679828736617", "bloglinks": {}, "links": {"http://guidance.org.uk/": 1, "http://www.org.uk/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["The following articles were published by researchers within HEDS in August. Valuation of the child health utility 9D index Katherine J Stevens Pharmacoeconomics 30(8):729-747 01 Aug 2012 DOI Improvement in Nutritional Status Reduces the Clinical Impact of Infections in Older Adults Forster SE, Powers HJ, Foulds GA, Flower DJ, Hopkinson K, Parker SG, Young TA, Saxton J, Pockley AG, Williams EA J Am Geriatr Soc 10 Aug 2012 DOI Estimating Health State Utility Values for Joint Health Conditions: A Conceptual Review and Critique of the Current Evidence. Ara R, Wailoo AJ Med Decis Making 27 Aug 2012 DOI"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/735318910433076633", "bloglinks": {}, "links": {"http://www.nih.gov/": 2, "http://www.blogger.com/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["To follow up on yesterday’s post, it is worth reading a recent BMJ editorial titled “ Improving comparative effectiveness research ”. This sets the PCORI guidelines in the context of other methodological work. It also highlights that all background papers produced for the PCORI draft guidelines are available online ( here ). These are detailed examinations of key methods including value of information analysis. The Editorial also makes reference to, and provides links to, AHRQ and EUNetHTA guidelines."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/442381764058849577", "bloglinks": {}, "links": {"http://www.pcori.org/": 1, "http://www.bmj.com/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["“The Patient-Centered Outcomes Research Institute (PCORI) is an independent, non-profit organization authorized by Congress. Its mission is to fund research that will provide patients, their caregivers and clinicians with the evidence-based information needed to make better-informed health care decisions. PCORI is committed to continuously seeking input from a broad range of stakeholders to guide its work. PCORI has a Methodology Committee whose role is to advise the PCORI Board of Governors on defining methodological standards and creating a translation table to guide health care stakeholders towards the best methods for patient-centered outcomes research (PCOR). This first draft PCORI Methodology Report focuses on the patient’s perspective. Future reports will address clinicians’, healthcare purchasers’ and policy-makers’ perspectives in more detail. PCORI is now accepting public comment on the draft report. The comment period began Monday, July 23, 2012, and concludes at 11:59 p.m. ET on Friday, September 14, 2012.” Reproduced from http://www.pcori.org/get-involved/opportunities-for-public-comment/methodology/"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/8622196384404963168", "bloglinks": {}, "links": {"http://www.pcori.org/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["The ISPOR Good Reporting Practices Task Force has a draft set of guidelines “ Consolidated Health Economic Evaluation Reporting Standards (CHEERS) ,” open for comment. Comments are due by Tuesday, September 11, 2012. The leadership group of the Task Force has representation from Medical Decision Making, Health Economics, Pharmacoeconomics, Value in Health and the British Medical Journal so they are likely to be very influential at least, and possible adopted by those and other journals. So, definitely worth a read."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/1253956148079928172", "bloglinks": {}, "links": {"http://www.ispor.org/": 2}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["The NICE appeals process is to be amended from April 2013 by having a chair and other members from outside NICE. This follows pressure from the ABPI to have a more ‘independent’ appeals process. Although this dialogue was with Andrew Lansley – who has now left his post as Secretary of State for Health – the changes are expected to continue. His replacement – Jeremy Hunt – is well known for his fervent support for multinational companies. Consequently, keep an eye out for further changes to NICE as requested by the ABPI ."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/3880649616888134244", "bloglinks": {}, "links": {"http://www.blogger.com/": 2}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["Twice each month the CEA Registry Blog lists recently published cost utility studies and associated papers. 11 papers were listed this time. Here's a couple in our areas of research interest: Pan F, Goh JW, Cutter G, et al. Long-Term Cost-Effectiveness Model of Interferon Beta-1b in the Early Treatment of Multiple Sclerosis in the United States. Clin Ther. 2012 Aug 17. [Epub ahead of print] PubMed PMID: 22906738. Retèl VP, Joore MA, Linn SC, et al. Scenario drafting to anticipate future developments in technology assessment. BMC Res Notes. 2012 Aug 16;5(1):442. [Epub ahead of print] PubMed PMID: 22894140."], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/2753799426173592913", "bloglinks": {}, "links": {"https://research.tufts-nemc.org/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["We published the following DPs this quarter and they are available freely online here . Monica Hernandez, Allan Wailoo, Fred Wolfe, Kaleb Michaud. The relationship between EQ-5D, HAQ and pain in patients with rheumatoid arthritis: further validation and development of the limited dependent variable, mixture model approach. DP 12/10  Paul Tappenden, Glynne Jones R, Andrew Shorthouse, Janine Youssef, Hazel Squires, Jim Chilcott. Colorectal cancer and it's detection, diagnosis, treatment and follow-up: Disease and Treatment pathways. DP 12/09 Brendan Mulhern, Louise Longworth, John Brazier, Donna Rowen, Nick Bansback, Nancy Devlin, Aki Tsuchiya. Health state valuation and mode of administration: Head to head comparison of online and CAPI. DP 12/08  Eva Kaltenthaler, Paul Tappenden, Suzy Paisley. Reviewing the evidence to inform the population of cost- effectiveness models within health technology assessments. DP 12/07"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/6994164819248351264", "bloglinks": {}, "links": {"http://www.ac.uk/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}, {"content": ["New and updated Cochrane Reviews from August are available for those listed below. Pharmacotherapy for mild hypertension Interactive computer-based interventions for weight loss or weight maintenance in overweight or obese people Omega 3 fatty acid for the prevention of dementia Effect of cocoa on blood pressure Exercise interventions on health-related quality of life for cancer survivors Exercise interventions on health-related quality of life for people with cancer during active treatment Nicotine vaccines for smoking cessation Minocycline for acne vulgaris: efficacy and safety"], "link": "http://www.blogger.com/feeds/4587359407049192416/posts/default/3579610769446748206", "bloglinks": {}, "links": {"http://www.thecochranelibrary.com/": 1}, "blogtitle": "Health Economics and Decision Science Blog @ ScHARR"}]