[{"blogurl": "http://www.hilarymason.com\n", "blogroll": [], "title": "hilarymason.com"}, {"content": ["I moderated a panel at DataGotham  with Adam Laiacano from Tumblr ,  Fred Benenson from Kickstarter , and  Roberto Medri from Etsy  about being the first data scientist at a company. We covered everything from what people’s job responsibilities are, the tools they use, successes, failures, how they are integrated into an organization, and how they have hired other data scientists to join them. The panelists were concise, articulate, and intelligent. Watch it below!"], "link": "http://www.hilarymason.com/blog/help-im-the-first-data-scientist-at-my-company/", "bloglinks": {}, "links": {"http://www.fredbenenson.com/": 1, "http://www.datagotham.com": 1, "http://robertomedri.com/": 1, "http://www.kickstarter.com": 1, "http://tumblr.com": 1, "http://adamlaiacano.tumblr.com/": 1, "http://etsy.com": 1}, "blogtitle": "hilarymason.com"}, {"content": ["I was visiting my grandparents yesterday, and my grandfather asked for help e-mailing an article to some of his friends. I asked him to show me how he normally writes an e-mail, and taught him the magic of copy and paste (it is amazing if you haven’t seen it before) but I noticed that in the course of sending an e-mail and checking on his inbox, he clicked on this ad three times. \n \n When I asked about it, he didn’t realize he had clicked the ad — he just thought these screens popped up randomly — because he didn’t realize that his hands were shaking on the trackpad. \n I’m sure the data says that that’s the optimal place on the screen for the ad. I’m sure tons of people ‘click’ on it. I’m also sure it’s wrong, and it results in a terrible experience. \n It’s common sense, but experiences like this are great reminders that data only takes us so far, and creativity and clear thinking are always required to find the best solutions. \n Yahoo, please fix this!"], "link": "http://www.hilarymason.com/blog/hey-yahoo-youre-optimizing-the-wrong-thing/", "bloglinks": {}, "links": {}, "blogtitle": "hilarymason.com"}, {"content": ["One of the most fun and challenging parts of my job is setting bitly’s research agenda. We’re a startup, so this means prioritizing the set of questions we look into in the context of what will be most beneficial for the rest of the business, for the short and long-term, by creating opportunity and opening up potential futures. We work on a wide variety of projects, from pure research to press collaborations to infrastructure and experimental products . \n We always have a list of research questions way longer than we have time and resources to pursue, so we developed a process for evaluating whether a given question is worth pursuing at a particular time. \n This is the kind of process that I’ve only discussed with several people over whisky (thanks!), but not seen written up. I initially had a much longer list of questions but have decided to keep it as simple as possible, to frame a discussion but not dictate or burden it. I hope it’s helpful and I would love to hear about other appproaches. \n For each research question that we might look into, we ask the following: \n \n State the research question. \n How do we know when we’ve won? \n Assume we’ve solved this question perfectly. What are the first things that we’ll build with it? \n If everyone in the world uses this, how does it change human behavior? \n What’s the most evil thing that can be done with this? \n \n State the research question. \n It’s important to state the question in language that everyone can understand. The bitly team comes from a variety of scientific and business backgrounds, and we’ve developed some of our own common vocabulary, but it still takes a bit of effort to make sure that everyone understand the fundamental challenge and why it’s interesting. \n How do we know when we’ve won? \n Here we define the metrics that we’ll use to measure our success. For some questions, this is obvious, and for others it’s impossible to define — we can at least acknowledge that ahead of time. \n Assume we’ve solved this question perfectly. What are the first things that we’ll build with it? \n This question allow us to assess the potential business and product impact. What capabilities will we have with this that we don’t have now? It allows us to keep the long-term research vision in mind while still optimizing for shorter-term opportunities. \n If everyone in the world uses this, how does it change human behavior? \n What’s the maximum potential impact of this work? If it’s not inspiring, is it worth pursuing at all? \n What’s the most evil thing that can be done with this? \n I don’t ask this question to encourage evil (>:]) but as a creative tool for expanding how we think about validity, impact, and potential applications of the research. The label evil is so ridiculous that it permits people share their craziest ideas. Plus, it’s always a fun conversation to have. \n Finally \n I’m always revising this list, and I would love to hear how you think about prioritizing your work."], "link": "http://www.hilarymason.com/blog/how-do-you-prioritize-research/", "bloglinks": {}, "links": {"http://dev.bitly.com/": 1, "http://bitlyscience.github.com/": 1, "http://rt.ly/": 1}, "blogtitle": "hilarymason.com"}, {"content": ["I’m extremely excited about DataGotham , a conference that I’m co-hosting with friends and fellow New York data nerds Drew , John , and Mike . \n DataGotham is a celebration of the NYC data community, and will bring together professionals from all industries in New York that are built around data, from finance to fashion and from startups to the Fortune 500 and government. The event is September 13th – 14th at NYU, with tutorials and The Great Data Extravaganza Show (with cocktails!) at the Tribeca Rooftop Thursday evening, and a single track conference Friday. Our speakers and sponsors are all amazing. You can register now . \n While DataGotham is definitely a labor of love, there are numerous reasons to do it. I believe that New York has a distinct data philosophy — the study of human behavior — that is unique and should be celebrated. We have an large population of local badass data hackers, and our community will only grow stronger if we can build relationships across the industry divides. Finally, there’s an opportunity for all of us to influence the future of data science, and this event will highlight some voices that might not otherwise be heard. \n I hope to see you there! \n (Also, anyone who made it this far through can register with code “dataGothamist” for 25% off )"], "link": "http://www.hilarymason.com/blog/datagotham-the-empire-state-of-data/", "bloglinks": {}, "links": {"http://www.eventbrite.com/": 1, "https://twitter.com/": 1, "http://www.drewconway.com/": 1, "http://www.datagotham.com/": 2, "http://www.johnmyleswhite.com/": 1, "http://datagotham.com": 1}, "blogtitle": "hilarymason.com"}, {"content": ["New York is infinite. \n A human can only explore a place at a particular speed. The rate of change in New York exceeds the rate at which a person can possibly experience the city, and so it is impossible to run out of city to experience. \n New York is a neighborhood. \n At the same time, New York is a mosaic of wonderful little neighborhoods. What many visitors miss and all residents know is that you rarely have to walk more than a few blocks from home for any of life’s essentials, and enough people do the same that you find yourself saying hello. \n New York is chaotic. \n You are never the weirdest thing you see. The city will give you things to think about, and more. It is never boring, and you cannot take it for granted. \n New York is opportunity. \n Everyone comes through New York, eventually. Whatever food, material goods, or unexpcted experiences you look for can be found or made here, including Japanese Hotdogs, Cuban Chinese restaurants, salons only for curly-haired girls, and spontaneous art and even opera. \n But what, no tech scene? \n New York does have a thriving tech community full of wonderful people that I’m excited to work alongside for many years, but I fell in love with the city long before it belonged to us. \n BTW, if you’ve seen Avengers or Batman , you know that no city is destroyed so beautifully as ours."], "link": "http://www.hilarymason.com/blog/why-i-love-new-york-city/", "bloglinks": {}, "links": {"http://imdb.to/": 2}, "blogtitle": "hilarymason.com"}, {"content": ["I spoke at devs love bacon back in April on Everything You Need to know about Machine Learning in 30 Minutes or Less . The talk is geared toward engineers with no prior knowledge of machine learning, and it’s designed to lay out the basic vocabulary and way that we think about the world to provide an amusing foundation so that attendees will have a head start in investigating which techniques they might want to learn more about or implement. This talk is not an in-depth tutorial. \n \n Hilary Mason – Machine Learning for Hackers from BACON: things developers love on Vimeo ."], "link": "http://www.hilarymason.com/presentations-2/devs-love-bacon-everything-you-need-to-know-about-machine-learning-in-30-minutes-or-less/", "bloglinks": {}, "links": {"http://vimeo.com": 1, "http://devslovebacon.com": 1, "http://vimeo.com/": 2}, "blogtitle": "hilarymason.com"}, {"content": ["The awesome team over at dropbox invited me to come by and give a talk. They have a great post up at their blog, but you can also grab the slides here and see the full video on youtube ."], "link": "http://www.hilarymason.com/presentations-2/short-urls-big-fun-i-spoke-at-dropbox/", "bloglinks": {}, "links": {"http://tech.dropbox.com/": 1, "http://www.slideshare.net/": 1, "http://www.dropbox.com": 1, "http://www.youtube.com/": 1}, "blogtitle": "hilarymason.com"}, {"content": ["I have an old, short, and concise gmail address (my first initial and last name at gmail.com). There are many other hmasons in the world who have since signed up for gmail, with variations on the “hmason” theme. Every so often, they mistype the address, or someone mishears it. I now receive between four and ten pieces of e-mail per week meant for other hmasons . This was pretty amusing until someone opened an amazon account on that address (which I had to shut down). Poor Holly has never seen a single Citibank credit card statement (and Citibank won’t remove the e-mail address from the account when I call, since I’m not the account holder). Heidi hasn’t linked her Paypal account to her bank account, but I’m waiting for someone to send her money. \n This sort of unwitting misattribution results in an identity slippage that could actually have some fairly interesting consequences. We’ve settled on e-mail as a unique identifier across platforms, but we increasingly cannot rely on that assumption. \n I saw Chris Adam ‘s comment on Twitter this morning and can’t agree more — it should become standard practice to confirm an e-mail address before sending personally identifiable or sensitive data. Now, please."], "link": "http://www.hilarymason.com/blog/identity-slippage-and-whats-the-weirdest-thing-youve-been-e-mailed-by-accident/", "bloglinks": {}, "links": {"https://twitter.com/": 2}, "blogtitle": "hilarymason.com"}, {"content": ["Are you planning to attend Strata in Santa Clara at the end of February? Reach out for a discount registration code."], "link": "http://www.hilarymason.com/blog/going-to-strata-in-feb/", "bloglinks": {}, "links": {"http://strataconf.com/": 1}, "blogtitle": "hilarymason.com"}, {"content": ["I keep missing Google calendar invites on both my personal and work accounts. I’ve had my google account for years (since 2004?) and assumed it was some quirk of how I had configured something along the way. \n Today I was following Google’s instructions for syncing calendars with an iOS device  and discovered that if you click calendar settings (which means click the gear icon then ‘calendar settings’), then ‘calendar’, then ‘notifications’ next to the calendar that you care about, you can turn on e-mail and SMS notifications for any given calendar. \n (I’ll save my ranting about the number of clicks to find and configuration anything on google’s properties right now for another time.) \n I’m sharing this on the theory that I’m not the only one with this particular frustration. I hope it saves someone from missed opportunities and useless rage!"], "link": "http://www.hilarymason.com/blog/why-do-i-miss-google-calendar-invites/", "bloglinks": {}, "links": {"http://support.google.com/": 1}, "blogtitle": "hilarymason.com"}]