[{"blogurl": "http://www.homolog.us/blogs\n", "blogroll": [], "title": "Homologus"}, {"content": ["An integrated map of genetic variation from 1,092 human genomes \n The study combined low-coverage genome sequencing and exome sequencing from 14 population from Europe (CEU, TSI, GBR, FIN and IBS), Africa (YRI, LWK and ASW), East Asia (CHB, JPT and CHS) and the Americas (MXL, CLM and PUR). \n Population abbreviations: ASW, people with African ancestry in Southwest United States; CEU, Utah residents with ancestry from Northern and Western Europe; CHB, Han Chinese in Beijing, China; CHS, Han Chinese South, China; CLM, Colombians in Medellin, Colombia; FIN, Finnish in Finland; GBR, British from England and Scotland, UK; IBS, Iberian populations in Spain; LWK, Luhya in Webuye, Kenya; JPT, Japanese in Tokyo, Japan; MXL, people with Mexican ancestry in Los Angeles, California; PUR, Puerto Ricans in Puerto Rico; TSI, Toscani in Italia; YRI, Yoruba in Ibadan, Nigeria. Ancestry-based groups: AFR, African; AMR, Americas; EAS, East Asian; EUR, European. \n Major finding? Successful cloning of Evan Eichler at University of Washington."], "link": "http://www.homolog.us/blogs/2012/10/31/snp-map-of-human-population-of-entire-world-published/", "bloglinks": {}, "links": {"http://www.nature.com/": 1, "http://www.homolog.us/blog": 1}, "blogtitle": "Homologus"}, {"content": ["Our ‘science teacher’ JCV laments - \n  \n Yet WSJ reports (emphasis ours) - \n Jason Schenker of Texas-based Prestige Economics said hurricanes like Sandy usually lead to a bump in economic growth , mainly through stronger retail sales. In a note to clients, he cited to “the last minute run to hardware stores and supermarkets, or after-the-storm replacement of furniture, windows, cars, and other damaged durable and non-durable goods.” \n The above conclusion is based on theory of Paul Krugman, who, unlike JC Venter, is a Nobel Laureate. \n That leaves us totally confused. \n ———————————— \nFew related posts on global warming climate change, broken window fallacy and the real lessons of the Sandy disaster. \n Drowned Subway System and Interest Rate Swaps \n Is a More Devastating Storm Better for the USA? \n On Global Warming"], "link": "http://www.homolog.us/blogs/2012/10/31/well-dr-venter-wsj-says-hurricane-will-boost-economic-growth/", "bloglinks": {}, "links": {"http://blogs.wsj.com/": 1, "http://www.homolog.us/blog": 4}, "blogtitle": "Homologus"}, {"content": ["NY Subway May Take Weeks to Restore Service, 5 Million Affected; 80 Flooded Homes Destroyed by Fire; Stunning Flood and Fire Images \n \n Unfortunately your browser does not support IFrames. \n People around the world are shocked to see images flooded NY subway system. After all, how can such a critical infrastructure not be retrofit properly to be protected from floods? \n The answer turns out to be ‘interest rate swaps’. The topic was covered here in the context of Cold Spring Harbor Lab with detailed analysis of balance sheet. \n Can Cold Spring Harbor Lab’s Tumor Turn Malignant? \n A Quick Note on CSHL’s Derivative Losses \n We do not have time to go through the financial numbers of New York transit authority (MTA), but we doubt the situation is any different. Here is a report on the extent of losses - \n We got wind of the report, “Riding the Gravy Train – How Wall Street is Bankrupting our Public Transit Agencies,” through WNYC, which ran a story on how the deal has caused the New York Metropolitan Transportation Authority (N.Y. MTA) to lose almost $114 million a year and how the agency will likely continue to lose money on the deals for the next 30 years. \n Massive swap-based losses are hollowing out public infrastructures in all parts of USA. Remember strikes by public schoolteachers in Chicago few weeks back? Swap losses were there too . \n Last week, the Chicago Teachers Union launched a campaign for the Chicago Public School system to renegotiate costly interest rate swaps with four major banks: Bank of America Corp., Goldman Sachs Group Inc., Royal Bank of Canada and Loop Capital LLC. The union claims the interest rate swaps cost the Chicago Public School System $35.9 million in the last year and that the deals with the banks have produced a $120.7 million net loss for the school system since 2003."], "link": "http://www.homolog.us/blogs/2012/10/31/drowned-subway-system-and-interest-rate-swaps/", "bloglinks": {}, "links": {"http://inthesetimes.com/": 1, "http://globaleconomicanalysis.blogspot.com/": 1, "http://www.homolog.us/blog": 2, "http://www.metro-magazine.com/Blog": 1}, "blogtitle": "Homologus"}, {"content": ["We came across a fantastic response of a question at stockoverflow that readers may like to take a look at. \n Here is the question. \n What is the best algorithm to achieve the following: \n 0010 0000 => 0000 0100 \n The conversion is from MSB->LSB to LSB->MSB. All bits must be reversed; that is, this is not endianness-swapping. \n Please take a look at the first response in this link . \n \nNOTE: All algorithms below are in C, but should be portable to your language of choice (just don’t look at me when they’re not as fast \nOptions \n Low Memory (32-bit int, 32-bit machine)(from here): \n The answer is relevant, if you are trying to find optimal way to determine reverse complement of a nucleotide sequence represented in binary. \n If you want a ‘crazy looking’ algorithm for for bit reversal, please try this - \n \nvoid swapit(unsigned char *msg, int length) { \n for(;length>0;length--, msg++) { \n *msg = ((*msg * 0x0802LU & 0x22110LU) | \n   (*msg * 0x8020LU & 0x88440LU)) * \n   0x10101LU >> 16; \n } \n}"], "link": "http://www.homolog.us/blogs/2012/10/30/best-algorithm-for-bit-reversal/", "bloglinks": {}, "links": {"http://stackoverflow.com/": 3}, "blogtitle": "Homologus"}, {"content": ["There Are Two Kinds of People In The World: Those Who Think There Are Two Kinds of People In The World and Those Who Don’t. \n Ever since we heard the above quote, we started noticing patterns of threes in the world \n ——————- \n There are three ways to deal with NGS data analysis. The most common way is to download published programs (assemblers, aligners, etc.) , learn about its parameters and command line options, and run them on your data set. Second way is to understand the inner working of the programs and adjust your data to optimize the run. Third way is to start from algorithms instead of programs, write your own code and analyze the data. \n Most people use the first method, because it is the only way to process many different data sets in a ‘core facility’ mode. An example of second way is digital normalization approach developed by Titus Brown’s group . In this method, one typically uses Velvet or other commonly used assemblers, but libraries are reduced in size to remove redundancy. The third method ( writing an assembler like SPAdes ) is considered ‘reinventing the wheel’ by some and ‘bread and butter’ by others. Surely it is the best way to get the most out of data, and in some cases the only way to solve challenging problems (such as single-cell assembly addressed by SPAdes). \n —————— \n If you follow the third way above, there are three steps in writing a good program. The first step is to implement the algorithm in a scripting language like PERL/python and make it work on a very small data set. In this step, you are essentially making sure that your implementation of algorithm works, and do not care about efficiency gained through optimal use of hardware. \n In the second step, the same program is ported in C/C++ by using data structures from standard libraries. At the end of this step, you have the exact replica of your program in the low level language of your choice. \n In the third step, we go through every function and data structure of the above program and try to make sure they are optimally designed. It is very difficult work and needs good understanding of underlying hardware ( (processors, memory, cache structure, hard drive, etc.). In the following post, we will present an excellent example from stackoverflow that can be used for bioinformatics. \n One advantage of using three steps mentioned above is that even if you cannot optimize all stages of the program, you can be sure it works. The worst program is the one that does not run at all. \n ——————- \n There are three ways to let the community know about your discoveries. First way is to use the old practice to keep sending papers to various journals and get rejected for minor technicalities. Second was is to post your preprint in arxiv.org, discuss results in your blog and argue with journals in parallel. Third way is to publish your original papers in the blog and send the journals packing. \n ——————– \n There are three ways to do biology these days. \n First way – you can continue to do ‘one gene at a time’ analysis using small-scale lab work. \n Second way – you can scale up the same with large-scale techniques (microarray, high-throughput sequencing, etc.) and publish one hundred unusual genes at a time without realizing that noise also scaled up . \n Third way is to understand that large-scale experiments are different beasts and need to be analyzed properly. \n —————- \n Finally, there are three ways to deal with US election. The first way is to go gaga about Obama and flood social media . Second way to go gaga about Romney and flood unsocial media. Third way is to laugh at the sheer idiocy of the entire process and pray that it stays the same to provide more materials for laughter"], "link": "http://www.homolog.us/blogs/2012/10/29/rules-of-three/", "bloglinks": {}, "links": {"http://www.youtube.com/": 2, "http://www.homolog.us/blog": 3, "http://www.wired.com/": 1}, "blogtitle": "Homologus"}, {"content": ["Paul Krugman often makes the argument that more devastating a natural or unnatural disaster is, better it is for the economy, because more people will get hired to fix things. That defies common sense, but common sense is considered a negative to judge who gets Nobel prize in economics (and peace as well ). \n To understand the fallacy in Krugman’s argument, one needs to start with Bastiat’s parable of the broken window . \n Have you ever witnessed the anger of the good shopkeeper, James Goodfellow, when his careless son has happened to break a pane of glass? If you have been present at such a scene, you will most assuredly bear witness to the fact that every one of the spectators, were there even thirty of them, by common consent apparently, offered the unfortunate owner this invariable consolation—”It is an ill wind that blows nobody good. Everybody must live, and what would become of the glaziers if panes of glass were never broken?” \n Now, this form of condolence contains an entire theory, which it will be well to show up in this simple case, seeing that it is precisely the same as that which, unhappily, regulates the greater part of our economical institutions. \n Suppose it cost six francs to repair the damage, and you say that the accident brings six francs to the glazier’s trade—that it encourages that trade to the amount of six francs—I grant it; I have not a word to say against it; you reason justly. The glazier comes, performs his task, receives his six francs, rubs his hands, and, in his heart, blesses the careless child. All this is that which is seen. \n But if, on the other hand, you come to the conclusion, as is too often the case, that it is a good thing to break windows, that it causes money to circulate, and that the encouragement of industry in general will be the result of it, you will oblige me to call out, “Stop there! Your theory is confined to that which is seen; it takes no account of that which is not seen.” \n It is not seen that as our shopkeeper has spent six francs upon one thing, he cannot spend them upon another. It is not seen that if he had not had a window to replace, he would, perhaps, have replaced his old shoes, or added another book to his library. In short, he would have employed his six francs in some way, which this accident has prevented. \n \n For good laugh, you can also find what Krugman thinks about the broken window fallacy at this link . \n ——————— \n P. S. When we wrote this article, we did not expect anyone to be stupid enough to suggest that the storm would be beneficial for the economy. Apparently, we overestimated the intelligence levels of economists from academia (hat tip Mish ). \n Economists say some of the impact caused by businesses closing will be offset by reconstruction efforts, and point to catastrophic storms like Katrina, which devastated New Orleans but did not deal lasting damage to the national economy. \n Peter Morici at the University of Maryland estimates that Sandy will cause about $35 billion to $45 billion in losses and damages but then be followed by as much as $36 billion in recovery spending. \n  \n Here is an interesting find that may explain the above comment from Peter Morici - \n Morici is noted for wearing bow ties. He is the second cousin to American comedian Patton Oswalt."], "link": "http://www.homolog.us/blogs/2012/10/29/is-a-more-devastating-storm-better-for-the-usa/", "bloglinks": {}, "links": {"http://www.homolog.us/blog": 2, "http://www.acting-man.com/": 1, "http://globaleconomicanalysis.blogspot.com/": 1, "http://en.wikipedia.org/": 2, "http://krugman.nytimes.com/": 1, "http://finance.yahoo.com/": 1}, "blogtitle": "Homologus"}, {"content": ["A puzzling observation made by Richard Young’s group challenges standard assumptions made in gene expression analysis and suggests that most published expression studies need to be reanalyzed. The study is published in Cell . \n \nAlmost all global expression analysis involves isolation of RNA \nfrom two or more cellular sources, introducing similar amounts \nof RNA from the sources into the experimental platform and \nanalyzing the data by using algorithms that normalize the signal \nfrom the samples. If the cellular sources \nproduce equivalent amounts of RNA/cell, and the yields of \nRNA and its derivatives are equivalent throughout experimental \nmanipulation, then normalized expression data should produce \nan accurate representation of the relative levels of each gene \nproduct. \n We recently found that cells with high levels of c-Myc can \namplify their gene expression program, producing two to three \ntimes more total RNA and generating cells that are larger than \ntheir low-Myc counterparts. This discovery has led us to question the common assumption that cells produce similar levels of RNA/cell and the general practice of introducing similar amounts of total RNA into analysis platforms without including standardized controls that would \nreveal transcriptional amplification or repression. As described \nbelow, it is likely that this assumption and practice has led to \nerroneous interpretations. \n Here is more from the author of the study - \n Researchers led by Richard Young at the Whitehead Institute for Biological Research in Cambridge, Massachusetts, found that aggressive cancer cells produce several times more RNA than other cells. Moreover, three different commonly used methods for gene expression analysis—DNA microarrays, RNA sequencing, and digital molecular barcoding—masked these differences. \n “We then realized that the common assumption that cells contain similar levels of mRNA is badly flawed and can lead to serious misinterpretations,” Jakob Lovén, a postdoc in Young’s lab, said in a press release. Thus, expression data being used to gain insights into cancer cell behavior and regulation should be interpreted with caution."], "link": "http://www.homolog.us/blogs/2012/10/29/do-we-need-to-reinterpret-all-published-gene-expression-studies/", "bloglinks": {}, "links": {"http://www.the-scientist.com/": 1, "http://download.cell.com/": 1}, "blogtitle": "Homologus"}, {"content": ["Full List of talks/posters at RNA-seq blog \n Title: Quantitative trait locus analysis for next-generation sequencing with the functional linear models.(20) (11:30AM-11:45AM on Wed) (Platform) \nAuthor(s): M. Xiong, L. Luo, Y. Zhu \nKeywords: Statistical Genetics and Genetic Epidemiology, KW059 – family linkage analysis, KW073 – genetic epidemiology, KW080 – genome-wide association, KW079 – genome sequencing, KW083 – genotype-phenotype correlations \n Title: Discovering SNPs Regulating Human Gene Expression Using Allele Specific Expression from RNA-Seq data.(39) (11:45AM-12:00NOON on Wed) (Platform) \nAuthor(s): E. Eskin, E. Kang, B. Han, A. J. Lusis, L. Martin, S. Shiffman \nKeywords: Bioinformatics and Genomic Technology, KW008 – bioinformatics, KW151 – regulation of transcription, KW169 – transcription \n Title: RNA-Seq identifies differentially expressed genes and mutations in oligodendrogliomas.(1236W) (3:15PM-4:15PM on Wed) (Poster) \nAuthor(s): E. Schrock, K. Szafranski, J. A. Campos Valenzuela, S. Schauer, D. Krex, A. Rump, K. Hackmann, G. Schackert, L. Kaderali, M. Platzer, B. Klink \nKeywords: Cancer Genetics, KW011 – brain/nervous system, KW012 – cancer, KW079 – genome sequencing, KW126 – oncogenesis \n Title: Widespread novel RNA editing in human brain tissue, identified by RNA-Seq.(2622W) (3:15PM-4:15PM on Wed) (Poster) \nAuthor(s): L. Hou, N. Akula, J. Wendland, D. T. Chen, X. Jiang, K. Choi, B. K. Lipska, J. E. Kleinman, F. J. McMahon \nKeywords: Psychiatric Genetics, Neurogenetics and Neurodegeneration, KW155 – RNA, KW102 – massively parallel sequencing, KW134 – phenotype \n Title: Transcriptome sequencing of nPOD type 1 diabetes pancreatic samples for viral sequence identification.(3600W) (3:15PM-4:15PM on Wed) (Poster) \nAuthor(s): S. Morfopoulou, G. Zhao, R. Ferreira, A. Pugliese, J. Petrosino, L. Thackray, V. Plagnol, nPOD-Virus group \nKeywords: Bioinformatics and Genomic Technology, KW031 – computational tools, KW041 – diabetes, KW087 – immune system, KW089 – infectious disease \n Title: Rapid and Efficient Methods for Preparing Globin- and rRNA-Depleted Directional RNA-Seq Libraries.(3668W) (3:15PM-4:15PM on Wed) (Poster) \nAuthor(s): C. Kinross, J. Hitchen, N. Caruccio, R. Sooknanan \nKeywords: Bioinformatics and Genomic Technology, KW155 – RNA, KW081 – genomic methodologies, KW079 – genome sequencing \n Title: RNA-seq uncovers the influence of structural variants on transcriptome diversity.(3674W) (3:15PM-4:15PM on Wed) (Poster) \nAuthor(s): E. Ait Yahya Graison, A. Reymond \nKeywords: Bioinformatics and Genomic Technology, KW034 – copy number/structural variation, KW155 – RNA, KW004 – alternative splicing, KW102 – massively parallel sequencing, KW113 – model organisms \n Title: Selective sequencing of mature transcripts in the human brain by cytoplasmic RNA-Seq.(3728W) (3:15PM-4:15PM on Wed) (Poster) \nAuthor(s): A. Zaghlool, A. Ameur, J. Halvardson, L. Cavelier, L. Feuk \nKeywords: Bioinformatics and Genomic Technology, KW155 – RNA, KW079 – genome sequencing, KW004 – alternative splicing \n Title: The ENCODE effort combining RNA-seq and RT-PCR-seq allows to catalog thousands of novel lncRNAs.(506W) (3:15PM-4:15PM on Wed) (Poster) \nAuthor(s): C. Howald, A. Tanzer, J. Chrast, F. Kokocinski, T. Derrien, N. Walters, J. Manuel Gonzalez, A. Frankish, B. L. Aken, T. Hourlier, J. Vogel, S. White, S. M. J. Searle, J. Harrow, T. Hubbard, R. Guigò, A. Reymond \nKeywords: Genome structure, variation and function, KW004 – alternative splicing, KW155 – RNA, KW068 – gene localization, KW082 – genomic structure, KW125 – noncoding RNA \n Title: Comparative analysis of strand-specific RNA sequencing approaches.(512W) (3:15PM-4:15PM on Wed) (Poster) \nAuthor(s): D. Munafo, P. Liu, C. Sumner, L. Apone, B. Langhorst, E. Yigit, L. Merrill, F. Stewart, E. Dimalanta, T. Davis \nKeywords: Genome structure, variation and function, KW044 – digital gene expression, KW111 – micro RNA, KW125 – noncoding RNA, KW155 – RNA, KW169 – transcription \n Title: Transcriptome genomic analysis using RNA-seq in three tissues of a twin cohort.(546W) (3:15PM-4:15PM on Wed) (Poster) \nAuthor(s): A. Buil, A. Brown, M. Davies, A. Viñuela, M. Gallardo, D. Glass, M. Blasco, R. Durbin, T. D. Spector, E. T. Dermitzakis for the EUROBATS Consortium \nKeywords: Genome structure, variation and function, KW004 – alternative splicing, KW044 – digital gene expression, KW151 – regulation of transcription, KW155 – RNA \n \n Title: “Seq-ing” the Myotonic Dystrophy Transcriptome.(Sess. 24) (09:40AM-10:00AM on Thu) (Invited Scientific) \nPresenter(s): E. Wang \n Title: A Study of Asthma Pharmacogenomics Using RNA-Seq.(638T) (3:15PM-4:15PM on Thu) (Poster) \nAuthor(s): B. E. Himes, R. Hu, P. Wagner, D. Chan, B. Klanderman, R. A. Panettieri Jr., K. Tantisira, S. T. Weiss, Q. Lu \nKeywords: Pharmacogenetics, KW130 – pharmacodynamics, KW131 – pharmacogenetics, KW153 – respiratory system, KW155 – RNA \n Title: Massively-parallel sequencing of the brain transcriptome reveals differential expression of novel genes in bipolar disorder.(260) (08:15AM-08:30AM on Fri) (Platform) \nAuthor(s): N. Akula, J. Barb, X. Jiang, J. Wendland, K. Choi, S. Sen, B. K. Lipska, J. E. Kleinman, H. C. Bravo, D. T. Chen, P. J. Munson, F. J. McMahon \nKeywords: Psychiatric Genetics, Neurogenetics and Neurodegeneration, KW004 – alternative splicing, KW011 – brain/nervous system, KW155 – RNA, KW008 – bioinformatics, KW169 – transcription \n Title: Discovery of genomic variants from RNA-sequencing data.(289) (08:45AM-09:00AM on Fri) (Platform) \nAuthor(s): R. Piskol, G. Ramaswami, J. B. Li \nKeywords: Bioinformatics and Genomic Technology, KW159 – SNP analysis/discovery, KW155 – RNA, KW169 – transcription, KW008 – bioinformatics, KW102 – massively parallel sequencing \n Title: Multivariate profiling approach to inference on differential expression in RNA-Seq data with small sample size.(3567F) (2:15PM-3:15PM on Fri) (Poster) \nAuthor(s): S. Oh, M. Kim, S. Song \nKeywords: Bioinformatics and Genomic Technology, KW008 – bioinformatics, KW031 – computational tools, KW044 – digital gene expression, KW071 – genes in development, KW081 – genomic methodologies \n Title: Golden Helix GenomeBrowse: Cloud-enabled visual analytics of DNA and RNA-Seq NGS data.(3579F) (2:15PM-3:15PM on Fri) (Poster) \nAuthor(s): G. Rudy, S. Gardner, M. Thiesen \nKeywords: Bioinformatics and Genomic Technology, KW008 – bioinformatics, KW031 – computational tools, KW079 – genome sequencing, KW155 – RNA, KW159 – SNP analysis/discovery \n Title: Identification of human RNA editing sites using publically available RNA-sequencing data.(543F) (2:15PM-3:15PM on Fri) (Poster) \nAuthor(s): G. Ramaswami, J. B. Li \nKeywords: Genome structure, variation and function, KW155 – RNA, KW011 – brain/nervous system, KW008 – bioinformatics \n Title: The genetics of gene expression, splicing and transcriptional efficiency through Poly-A selection and ribosomal depletion RNA sequencing in humans.(547F) (2:15PM-3:15PM on Fri) (Poster) \nAuthor(s): M. Pala, M. Marongiu, A. Mulas, R. Cusano, F. Crobu, F. Reinier, R. Berutti, M. G. Piras, C. Joens, D. Schlessinger, G. Abecasis, A. Angius, S. Sanna, F. Cucca, S. B. Montgomery \nKeywords: Genome structure, variation and function, KW004 – alternative splicing, KW151 – regulation of transcription, KW102 – massively parallel sequencing, KW140 – population genetics, KW155 – RNA \n Title: Functional RNA Editing Sites Identified by Comparative Transcriptome Analysis.(577F) (2:15PM-3:15PM on Fri) (Poster) \nAuthor(s): R. Zhang, G. Ramaswami, L. P. Keegan, T. Deng, M. A. O’Connell, J. B. Li \nKeywords: Bioinformatics and Genomic Technology, KW008 – bioinformatics, KW056 – evolution, KW078 – genome scan, KW155 – RNA, KW124 – nervous system \n Title: Whole transcriptome analysis of Velocardiofacial Syndrome (VCFS) using next-generation sequencing.(579F) (2:15PM-3:15PM on Fri) (Poster) \nAuthor(s): Y. Zhang, J. Jin, X. Zhu, M. Haney, Y. Kluger, S. Weissman, A. Urban \nKeywords: Genome structure, variation and function, KW034 – copy number/structural variation, KW102 – massively parallel sequencing, KW079 – genome sequencing, KW151 – regulation of transcription \n Title: The Gamma Method for gene set analysis of RNA-Seq data: Simulation results and application to a smallpox vaccine study.(1426F) (3:15PM-4:15PM on Fri) (Poster) \nAuthor(s): B. L. Fridley, G. D. Jenkins, D. E. Grill, J. M. Biernacka, R. B. Kennedy, G. A. Poland, A. L. Oberg \nKeywords: Statistical Genetics and Genetic Epidemiology, KW155 – RNA, KW008 – bioinformatics, KW031 – computational tools, KW079 – genome sequencing, KW087 – immune system \n Title: Constructing biological network using RNA-seq data.(1504F) (3:15PM-4:15PM on Fri) (Poster) \nAuthor(s): Y. Choi, M. Coram, H. Tang \nKeywords: Statistical Genetics and Genetic Epidemiology, KW105 – mathematical modeling, KW155 – RNA \n Title: RNA-SEQ survey of human lymphoid and myeloid cells – a resource for identifying causal genes in validated immune-mediated disease loci.(1982F) (3:15PM-4:15PM on Fri) (Poster) \nAuthor(s): S. Foisy, C. Beauchamp, A. Alikashani, F. Latour, M. Ladouceur, S. Lessage, J. D. Rioux \nKeywords: Complex Traits and Polygenic Disorders, KW008 – bioinformatics, KW031 – computational tools, KW044 – digital gene expression, KW102 – massively parallel sequencing, KW155 – RNA \n Title: Analysis of Whole Transcriptome specific to the Temporal Pole of Late-Onset Alzheimer’s disease.(341) (04:45PM-05:00PM on Fri) (Platform) \nAuthor(s): C. E. Humphries, M. A. Kohli, P. W. Whitehead, W. F. Hulme, L. Nathanson, D. C. Mash, M. A. Pericak-Vance, J. R. Gilbert \nKeywords: Complex Traits and Polygenic Disorders, KW011 – brain/nervous system, KW123 – neurogenetics, KW125 – noncoding RNA, KW122 – neurodegeneration, KW004 – alternative splicing"], "link": "http://www.homolog.us/blogs/2012/10/26/many-good-rna-seq-presentationsposters-at-ashg-conference-san-francisco/", "bloglinks": {}, "links": {"http://www.homolog.us/blog": 1, "http://www.rna-seqblog.com/": 1}, "blogtitle": "Homologus"}, {"content": ["Few days back, we posted on Software Licenses in Bioinformatics Programs and Their Legal Implications . In that thread, readers Dogface Macgee and Joey left thoughtful comments that cleared up some of our confusion about GPL. We already incorporated Dogface Macgee’s comment in the previous thread. Here is Joey’s comment - \n Just another step past what dogface has said, the grad student has the copyright. He can release it as GPL, make updates to the code, and sell it for millions of dollars and never release the code. Only the code originally released as GPL is considered GPL. If he is hired by a company and wants to use that in their products, he can. He has to give a different license to the company, which he absolutely can, as the copyright holder. It does get trickier when you use other libraries and tools, but it’s not automatic. \n If you hold the copyright, this could make you more valuable as they would have to hire you or purchase from you another licensing set-up if they wanted to avoid the GPL. \n A detailed analysis must be done, but many GPL libraries can be considered as a “System Library” and if you use that then your code does not have to be GPL from the use of that library(others not so much). \n GPL is also a license between the user and the copyright holder, you do not have to release any of your code publicly, ever. You can sell it and then you must provide it to them, and they may provide it for free to the world. This won’t work well except for very common systems, as there are millions of GPL programs out there with no support that no one uses (and no one is charging for). You can also charge a fee for the source code not exceeding the original fee of the binaries, however the downstream users may provide it to the world. \n Just wanted to clear up some misconceptions. I’m not a fan of GPL myself and will avoid libraries and components(although separate components where you are only acting on the output are fine and don’t ‘gpl-infect’). I much prefer BSD but can see some situations where a GPL code would be preferred. \n We researched the ‘systems library’ concept he mentioned, and believe it is covered under GPL linking exception . \n \nA GPL linking exception modifies the GNU General Public License (GPL) to create a new, modified license. Such modified licenses enable software projects which provide library code, to be “linked to” the programs that use them, without applying the full terms of the GPL to the using program. Linking is the technical process of connecting code in a library to the using code, to produce a single executable file. It is performed either at compile time or run-time in order to produce functional machine-readable code. There is a public perception, unsupported by any legal precedent or citation, that without applying the linking exception, code linked with GPL code may only be done using a GPL-compatible license.[1] The license of the GNU Classpath project explicitly includes a statement to that effect. \n Many free software libraries which are distributed under the GPL use an equivalent exception, although the wording of the exception varies. Notable projects include GNU Guile,[2] the run-time libraries of GNAT,[2] GNU Classpath [3] and the famous GCC Runtime Library Exception.[4] \nCompiler runtime libraries also often use this license, e.g. the libgcc library in the GNU Compiler Collection uses a very similar linking exception,[5] as well as all libraries of the Free Pascal project. \n In 2007, Sun Microsystems released most of the source code to the class libraries for the Java SE and Java EE projects under version 2 of the GPL license plus the Classpath linking exception,[6] and used the same license as one possible license for their enterprise server GlassFish.[7] and for their NetBeans Java IDE.[8] \n Version 3 of the GNU Lesser General Public License (LGPL)[9] is likewise constructed as an exception to the GPL.[10]\n \n Please feel free to add what you know about GPL, MIT license and other open-source options. \n P. S. Here is the master source that answers every question about GPL. It is the GPL FAQ from GNU."], "link": "http://www.homolog.us/blogs/2012/10/26/more-on-gpl-licensing-of-bioinformatics-programs/", "bloglinks": {}, "links": {"http://www.homolog.us/blog": 1, "http://en.wikipedia.org/": 1, "http://www.gnu.org/": 1}, "blogtitle": "Homologus"}, {"content": ["From yahoo finance: \n Total Cash : 137M \n Total cash/share : 2.46 \n Book value: 2.66 \n Why is stock price below book value or cash/share? \n \n Full Time Employees: \t326 \n If the company spends $200K/employee/year, that is a cash burn of $65M/year. Those estimates are roughly in line with their 8-K filing from Sept. 2012 and their cash level is down another ~20M from 137M of June. \n I think the market is saying that the company is burning cash too fast, and market wants to force its hand. The company will have to respond by drastically reducing R&D expense. \n Big layoffs coming?"], "link": "http://www.homolog.us/blogs/2012/10/25/pacb-this-does-not-look-right/", "bloglinks": {}, "links": {"http://www.homolog.us/blog": 1, "http://yahoo.edgar-online.com/": 1}, "blogtitle": "Homologus"}]