[{"blogurl": "http://damarisbsarria.blogspot.com\n", "blogroll": [], "title": "How I Am Becoming An Astronaut"}, {"content": ["This month NASA has commenced the delivery of its four Space Shuttle orbiters to their final destinations. After an extensive decommissioning process, the fleet -- which includes three former working spacecraft and one test orbiter -- is nearly ready for public display.  Space Shuttle Enterprise:  Enterprise is scheduled to take off Wednesday from Washington Dulles International Airport to New York's John F. Kennedy International Airport for display at the Intrepid Sea, Air & Space Museum in Manhattan .  Space Shuttle Discovery:  This week Discovery took her last flight, piggybacking a modified 747 from Kennedy Space Center to Washington D.C., where it will replace Enterprise as part of the Smithsonian’s National Air and Space Museum .  Space Shuttle Endeavour:  Endeavour will go to Los Angeles in mid-September to be displayed in the California Science Center . Space Shuttle Atlantis:  In early 2013, Atlantis will take its place on permanent display at Florida's Kennedy Space Center ."], "link": "http://damarisbsarria.blogspot.com/feeds/8388683861269939648/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.si.edu/": 1, "http://www.kennedyspacecenter.com/": 1, "http://www.intrepidmuseum.org/": 1, "http://www.californiasciencecenter.org/": 1, "http://4.blogspot.com/": 2, "http://2.blogspot.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["If you recall from a previous post , I applied to the HI-SEAS ( Hawaii Space Exploration Analogue & Simulation ) Mission and Food Study by Cornell University/University of Hawaii. I received some pretty excited news this past weekend that I've advanced to the next stage of the \"highly qualified\" pool!!! About 700 applications were submitted, of which 150 applicants were selected as \"highly qualified\". After even more review, about 30 applicants have moved on to this next stage. This next stage involves a phone interview and the selection committee contacting references. So fingers crossed as I am super excited about this opportunity and contributing to eventual long-duration space flight missions to Mars!"], "link": "http://damarisbsarria.blogspot.com/feeds/6186391271993980118/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://damarisbsarria.blogspot.com/": 1, "http://3.blogspot.com/": 1, "http://manoa.hawaii.edu/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["We think space exploration is beneficial to everyone on earth. We know space exploration matters. And we want to hear what you think. So tell us, America - Why explore space? • Why is space exploration important to you? • How does space exploration inspire you? • Why should we explore space? Sound off – share ideas about why we should explore space by participating in our \"Why Explore Space?\" video contest. • Send us a 1-2 minute video • Share your entry with friends and family - let them know that space is important to you Once uploaded, the contest begins! the public will vote on the best submissions. The grand prize is an iPad 3...We want to hear from YOU! Enter Now! Deadline: April 29th, 2012"], "link": "http://damarisbsarria.blogspot.com/feeds/1478581427461687541/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://spacecoalition.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["Finally submitted my application late last night to the Mars Analog Mission and Food Study with Cornell/University of Hawaii! It was an intense week typing away in for the application! The application process has now closed and they have received an estimated 700 applications. Good luck to everyone who applied! This is such a great opportunity and we really need to support studies such as this one to contribute to understanding the physiological and psychological effects of long-duration missions on humans. Selected or not, it will be interesting to see the progress of the study on the possibilities of food prepared/consumed and how the crewmembers are effected. FYI...On Saturday, Earth and Mars will arrive at their closest point from one another since the last 26. Martian features and polar caps should be visible through moderate-sized backyard telescopes! Several observatories plan to mark the occasion with web casts of the neighboring planet. One webcast that will be available is Slooh’s homepage or by visiting Slooh’s G+ page . The Slooh Space Camera Homepage: http://events.slooh.com/ The G+ Slooh Space Camera Page is available at: https://plus.google.com/u/0/108176209664415419112/"], "link": "http://damarisbsarria.blogspot.com/feeds/2013528864883146154/comments/default", "bloglinks": {}, "links": {"http://events.slooh.com/": 2, "http://3.blogspot.com/": 1, "https://plus.google.com/": 2, "http://manoa.hawaii.edu/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["Wish I would have learned of this study sooner! Regardless, I working rather quickly on submitting my application to this study. Wish me luck! http://manoa.hawaii.edu/hi-seas"], "link": "http://damarisbsarria.blogspot.com/feeds/2435715580543791321/comments/default", "bloglinks": {}, "links": {"http://1.blogspot.com/": 1, "http://manoa.hawaii.edu/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["A fun video by Toronto 17-year-olds Mathew Ho and Asad Muhammad shows their homemade balloon launch of a Lego minifigure into the stratosphere to catch views of near space.  http://www.space.com/14397-teens-lego-man-space-stratosphere.html"], "link": "http://damarisbsarria.blogspot.com/feeds/170163354772298880/comments/default", "bloglinks": {}, "links": {"http://www.space.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["The other day someone asked me what the chances are for someone to be selected as an astronaut candidate. \"To illustrate how hard it is to become an astronaut, Kimbrough assumed 4,000 applicants. Approximately 10 percent, 400 people, will be selected as \"highly qualified.\" Roughly the top 100 will get invited to NASA for a first interview. Thirty or 40 will be brought back for a second interview and final selection. Of that number, typically nine to 15 become astronauts.\" From: http://blog.al.com/space-news/2012/01/astronaut_tells_huntsville_sol.html After the 2009 selection, Brian Shiro made a figure illustrating the various stages of the selection. He was also amongst the \"highly-qualified\" selected group!  From: http://www.astronautforhire.com/2009/01/update-nasa-has-selected-all.html Good luck to the 2012 astronaut applicants! Looking forward to hearing some applicant updates!!! :)"], "link": "http://damarisbsarria.blogspot.com/feeds/1729252402534822971/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://blog.al.com/": 1, "http://www.astronautforhire.com/": 2}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["Astronaut application official submitted!!! :-)"], "link": "http://damarisbsarria.blogspot.com/feeds/909308629381241912/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": [], "link": "http://damarisbsarria.blogspot.com/feeds/2755509923378543899/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["Want to ask a question to an astronaut in space? Now's your chance! If you have a question for the commander of the International Space Station, let SPACE.com know! This Wednesday (Oct. 19), SPACE.com will be speaking to NASA astronaut Mike Fossum, who is currently living and working aboard the station. He also happens to be my favorite Aggie! http://www.space.com/13303-space-station-astronauts-reader-questions.html"], "link": "http://damarisbsarria.blogspot.com/feeds/6770010662023963609/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://www.space.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["Fall 2011 - Vacancy Announcement opens in USAJOBS January 13, 2012 - Vacancy Announcement closes March-July 2012 - Qualified Applications reviewed to determine Highly Qualified applicants. Qualifications Inquiry form sent to Supervisors/References and civilian applicants contacted by mail to obtain an FAA medical exam. June-September 2012 - Highly Qualified applications reviewed to determine Interviewees August-October 2012 - Interviewees brought to JSC for preliminary interview, medical evaluation, and orientation. Interviewees will be selected from the Highly Qualified group and contacted on a week-by-week basis. October 2012 - Finalists determined November 2012-January 2013 - Finalists brought to JSC for additional interview and complete medical evaluation March 2013 - Astronaut Candidate Class of 2013 announced June 2013 - Astronaut Candidate Class of 2013 reports to the Johnson Space Center Reference: http://astronauts.nasa.gov/content/timeline.htm"], "link": "http://damarisbsarria.blogspot.com/feeds/221363060519571109/comments/default", "bloglinks": {}, "links": {"http://astronauts.nasa.gov/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["NASA WILL ACCEPT APPLICATIONS IN THE FALL OF 2011 FOR AN ASTRONAUT CANDIDATE CLASS OF 2013. PLEASE CHECK THIS WEBSITE FOR UPDATES. http://astronauts.nasa.gov/"], "link": "http://damarisbsarria.blogspot.com/feeds/2075107046023144012/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://astronauts.nasa.gov/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["It really hasn't hit me yet that this is the last space shuttle mission. I am sure that if I still worked out at Kennedy Space Center, I would most definitely have that eerie feeling as the co-workers you worked with for so long start taking different paths and the workload starts decreasing. You don't realize how much of the country is in the dark about spaceflight until you're not in states like Florida or Texas where shuttle missions and spaceflight are always in the news. Space Shuttle Atlantis is the shuttle that I worked on the most as a lead for the Thermal Protection System. I worked with an amazing team, learned so much, and am grateful to have worked on what has always been a key part to the United States history, spaceflight. Hopefully we will establish a path forward to continue our spaceflight exploration efforts. Even though there is a high chance of rain in the forecast for tomorrow (70%), NASA is pressing along with flight preparations. If all goes as planned, The last shuttle flight will take off tomorrow from Kennedy Space Center at 11:26am EDT."], "link": "http://damarisbsarria.blogspot.com/feeds/480047140986097348/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["So far the countdown is going smoothly! Shuttle Endeavour is poised for blastoff at 8:56 a.m. EDT (1256 GMT) on a 16-day flight to deliver an exotic particle physics experiment and a hefty load of spare parts to the International Space Station. Mission Status Center Updates"], "link": "http://damarisbsarria.blogspot.com/feeds/2161817386792539994/comments/default", "bloglinks": {}, "links": {"http://spaceflightnow.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["Endeavour's final space shuttle mission is scheduled for next week, April 29, 2011. The mission will include four-spacewalks, deliver supplies, spare parts and a $2 billion particle physics detector (Alpha Magnetic Spectrometer) to the International Space Station."], "link": "http://damarisbsarria.blogspot.com/feeds/2001521299188915834/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["The United States and Russia are joined at the hip in space as the world marks the 50th anniversary of the first human space flight, Soviet Cosmonaut Yuri Gagarin's solo mission around the Earth on April 12, 1961. The day also marks the 30th anniversary of NASA's first shuttle flight, another milestone that has the Russian concerned as the orbiters near retirement, leaving both countries at least temporarily unable to transport large cargos to and from Earth orbit."], "link": "http://damarisbsarria.blogspot.com/feeds/5082067619092494294/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 2}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["I'm excited for an upcoming talk I have at Lowell High School!!! On April 5, 2011 I will be talking to Lowell High School students on my engineering career and the cool stuff I do as an engineer. The talk will be in support of Vibes & Waves in Action , a K-12 education project that involves a cross-disciplinary network of researchers in the Colleges of Engineering, Education and Arts & Sciences at the University of Massachusetts Lowell and high-school teachers and students in the school districts of Lowell and Lawrence, Massachusetts. http://vibes.uml.edu/Profiles/damarissarria.html"], "link": "http://damarisbsarria.blogspot.com/feeds/6685163366505379789/comments/default", "bloglinks": {}, "links": {"http://vibes.uml.edu/": 3, "http://3.blogspot.com/": 1, "http://lhs.ma.us/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["The largest full moon in more than 18 years – a so-called \"supermoon\" – did not disappoint eager skywatchers around the world Saturday when it rose, big and bright, into Earth's night sky. The full moon of March was 221,565 miles (356,575 kilometers) on Saturday, March 19 just 50 minutes after it hit its full phase, making it the biggest and brightest full moon since 1993. The \"supermoon\" phenomenon occurred because the moon was in its full phase and just 50 minutes past perigee – the point of its orbit that brings it closer to Earth. Below are some shots by some photographers that capture the beauty of the full moon. Check out more images at http://www.space.com/11178-supermoon-photos-2011-skywatcher-images.html"], "link": "http://damarisbsarria.blogspot.com/feeds/8227336929831998068/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://www.space.com/": 1, "http://3.blogspot.com/": 1, "http://2.blogspot.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["A unique photo was taken designed to honor the space shuttle program's 30-year legacy and the people who contribute to safely processing, launching and landing the vehicle."], "link": "http://damarisbsarria.blogspot.com/feeds/4931701369077724842/comments/default", "bloglinks": {}, "links": {"http://1.blogspot.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["Discovery landed last week ending not only a 13-day mission, but a 27-year spaceflight career. Preparations are now in work to retire the orbiter which will eventually be placed on public display in a museum.  Endeavour now sits on the launch pad awaiting a launch for April 19. On Monday, an accident involving in the death of James D. Vanover occured from the launch pad during preparations of Endeavour. The incident is being investigated it was a very sad day at Kennedy Space Center. This will be the final mission for Endeavour and it has been confirmed that the commander will still be Mark Kelly, husband of congresswoman Gabrielle Giffords."], "link": "http://damarisbsarria.blogspot.com/feeds/8794120045291497712/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://1.blogspot.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["Since last summer I was actively planning an outreach event for girls in grades 6-8. Together with the MIT Lincoln Laboratory and the Society of Women Engineers in Boston, we hosted a full day of engineering workshops to engage and encourage these young girls in the fields of math, science, and engineering. After the students checked in, they were directed to tables with all sorts of different donated hardware such as Rock Band guitars, printers, computers, old cell phones, etc. The girls were given screwdrivers and allowed to take any item apart to explore its technology. Best of all, they didn't have to put it back together!! Throughout the day, group rotated in 4 workshops: Robotics, Solar Energy Car, Electrical Circuit, and Lip Gloss mixing. Each workshop was hands on and the girls got to leave with what they built during the activity. During lunch, we had a Liquid Nitrogen demonstration where the girls had the opportunity to smash pennies, flowers, and marshmallows that were dipped in liquid nitrogen. The event was such a success, that we're planning the next one for this July!!!"], "link": "http://damarisbsarria.blogspot.com/feeds/3793372567266331848/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["During this 11-day mission, Discovery will deliver two key components—an Italian-built Permanent Multipurpose Module and the Express Logistics Carrier—that will provide spare parts and storage capacity to the ISS. Discovery will also deliver Robonaut 2, which will become the first humanoid robot in space. Launch is set for today, Thursday, Feb. 24, 2011, at 4:50 p.m. EST. Follow the launch at: http://spaceflightnow.com/shuttle/sts133/status.html"], "link": "http://damarisbsarria.blogspot.com/feeds/4579559050069439905/comments/default", "bloglinks": {}, "links": {"http://damarisbsarria.blogspot.com/": 1, "http://2.blogspot.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["NASA shuttle managers need more time to investigate and repair the cracks in shuttle Discovery's external fuel tank. Thursday, they delayed the launch of Discovery's final mission again, moving out of the next launch window, which extended from Feb. 3 to Feb. 10. No new date was established, but the next window extends from Feb. 27 through March 6. The date could be advanced some, but February is a busy month for the launching of Russian, Japanese and European cargo capsules to the station. Meanwhile, engineers continue to investigate why the cracks appeared during a Nov. 5 launch scrub. (full story)"], "link": "http://damarisbsarria.blogspot.com/feeds/6146047141161730812/comments/default", "bloglinks": {}, "links": {"http://www.spaceflightnow.com/": 1, "http://3.blogspot.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["Belgian astrophotographer Thierry Legault's picture of Tuesday's partial solar eclipse also shows the International Space Station passing over the sun's disk."], "link": "http://damarisbsarria.blogspot.com/feeds/4596193421672910058/comments/default", "bloglinks": {}, "links": {"http://legault.sfr.fr/": 1, "http://1.blogspot.com/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}, {"content": ["Happy New Year, everyone! Let's start this year off with a blog post! It's hard to believe that I have been in Boston for 8 months now. I absolutely love my job and living in this city. I think 8 months is good enough to say I've gotten settled into the area, the new job, my first experience with an actual snowy winter, new friends, and a puppy (Higley)!  Now time for the realistic \"how-can-I-improve\" list. There are so many things that I want to work towards. My main priority for the first quarter is an event I'm coordinating for the Society of Women Engineers this coming March. We're planning a full Saturday of engineering workshops for girls in grades 6-8 . While I knew it was going to be a lot of work, I'm blown away by everything that has to come together to make an event this big happen. Other personal things on my list include: Blog! Take a photography class to really make the most out of my camera Eat healthy and keep my exercise routine going Teach myself sign language Read more books Plan a ladies camping escape trip in the woods Keep in touch with friends better Run a half marathon Learn Japanese Become a Big Sister Let's be thankful for all that we have and for the support we've had from either family or friends. I hope everyone has a successful 2011 an good luck if you're working towards any personal goals! Welcome, 2011!"], "link": "http://damarisbsarria.blogspot.com/feeds/3149422343783310799/comments/default", "bloglinks": {}, "links": {"http://sweboston.org/": 1, "http://3.blogspot.com/": 1, "http://www.bigsister.org/": 1}, "blogtitle": "How I Am Becoming An Astronaut"}]