[{"blogurl": "http://danallenby.wordpress.com\n", "blogroll": [], "title": "Ideas for Annual Giving"}, {"content": ["I think everyone should have a chance to work in a restaurant.  It’s a good place to learn about fundamental business principles like the importance of customer service or the way that incentives (e.g., tips) can impact employee performance.  On a personal note, I can also say (15 years later) that working in a restaurant is also a good place to meet a future spouse. \n Like most industries, the restaurant world has its own unique character and culture.  It even has its own language.  For example, “eighty six” means to remove a dish from the menu because the kitchen no longer has it in stock.  “In the weeds” refers to a waiter or waitress who is overwhelmed and can’t keep up with their orders. \n Annual Giving has its own unique culture too with its own set of characteristics and its own language.  “Lybunts”, for example, are donors who made a gift last year but who have not yet made a gift this year and “retention rate” is the percentage of prior year donors who also made a gift in the following year. \n Learning the language is a good first step for newcomers to any business or culture.  Leaders , though, need to understand the new ideas, trends, and techniques as they evolve.  We call these “best practices.” \n Don’t confuse best practices with solutions or answers.  Every organization is unique in some way.  However, best practices provide leaders with context for their industry.  They represent conventional wisdom.  They suggest what has (or hasn’t worked) for others so that they can think about what to include in their own strategy.  There are many ways to learn about best practices: \n \n Hire a consultant who has worked with other similar organizations to tell you what they are seeing and hearing \n Pick up the phone and ask a colleague what their programs are doing \n Attend a conference \n Read an article or an expert’s blog \n Conduct a survey \n \n Understanding best practices comes with many benefits.  The most important benefit of all, though, is that understanding best practices helps keep leaders out of the weeds."], "link": "http://danallenby.wordpress.com/2012/10/25/in-the-weeds/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://danallenby.wordpress.com/": 1}, "blogtitle": "Ideas for Annual Giving"}, {"content": ["This past spring, we asked 262 annual giving professionals to rate the importance of various tactics and programs on their fundraising performance  last year .  \n Here’s what they said: \n \n \n \n   \n Very Important \n Important \n Moderately Important \n Not Important \n \n \n Call Center \n 42% \n 19% \n 14% \n 25% \n \n \n Direct Mail \n 80% \n 14% \n 5% \n 1% \n \n \n Email \n 31% \n 36% \n 22% \n 11% \n \n \n Texting \n 0% \n 2% \n 3% \n 94% \n \n \n Staff Outreach \n 46% \n 24% \n 16% \n 13% \n \n \n Social Media \n 8% \n 24% \n 41% \n 28% \n \n \n Events \n 20% \n 33% \n 30% \n 17% \n \n \n Board Giving \n 53% \n 23% \n 13% \n 11% \n \n \n Volunteers \n 33% \n 25% \n 20% \n 22% \n \n \n Leadership Gift Society \n 39% \n 30% \n 14% \n 17% \n \n \n Loyalty Program \n 18% \n 26% \n 16% \n 40% \n \n \n Recurring Gifts \n 13% \n 22% \n 34% \n 30% \n \n \n Predictive Modeling \n 4% \n 12% \n 23% \n 61 \n \n \n International Outreach \n 3% \n 8% \n 22% \n 68% \n \n \n \n Click here to download a free copy of this 2012 annual giving research study."], "link": "http://danallenby.wordpress.com/2012/10/15/how-important-is-it/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://danallenby.wordpress.com/": 1}, "blogtitle": "Ideas for Annual Giving"}, {"content": ["Kenny Rogers, country music legend and writer of some great love songs, recently released his memoirs in which he tells his readers, “there is a fine line between being driven and being selfish.”  He makes a great point. \n For those of us who work in philanthropy, there are a few fine lines that we need to be mindful of ourselves.  For example, there’s a difference between: \n \n An annual fund and annual giving \n Being friendly and being phony \n Personalization and computerization \n A receipt and a thank you \n Research and prying \n Hearing and listening \n A volunteer and a volunteer leader \n Fundraising and development \n \n We should also remind ourselves of one other great piece of advice that Kenny has echoed through the years – you got know when to hold ‘em, know when to fold ‘em ."], "link": "http://danallenby.wordpress.com/2012/10/09/fine-lines/", "bloglinks": {}, "links": {"http://www.amazon.com/": 1, "http://www.youtube.com/": 1, "http://feeds.wordpress.com/": 1, "http://danallenby.wordpress.com/": 1}, "blogtitle": "Ideas for Annual Giving"}, {"content": ["In the broadest context, campaigns are an excuse to do something the right way. \n We launch campaigns because they work, because people respond to goals and deadlines, and because (deep down) everyone wants to belong to something larger and more important than themselves.  The important ingredients in any campaign (annual, capital, other) are: \n \n a compelling case \n prospects \n infrastructure (staff, volunteers, budget) \n leadership \n \n It’s #4 on this list that’s probably the most overlooked, but also probably the most important.  That’s because when campaigns succeed, it’s usually not just because a lot of people got involved.  It’s usually because great leaders got involved. \n I know someone who likes to say:  when campaigns fail, it’s usually not for a lack of giving but rather for a lack of asking .  While that makes its point, I think that a greater truth is that when campaigns fail, it’s usually for a lack leadership."], "link": "http://danallenby.wordpress.com/2012/10/01/the-reason-campaigns-fail/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://danallenby.wordpress.com/": 1}, "blogtitle": "Ideas for Annual Giving"}, {"content": ["If you don’t know Josh Birkholz, you’ve missed one of the most interesting people in development.  He’s a writer, analyst, consultant, and entrepreneur.  He’s got a great blog and a great book on analytics for fundraising.  Check him out here ! \n Last May, I got to hear Josh address a group of fundraisers at a conference in Portland, OR.  He was talking about some research that his company had done around what donors expect from the organizations they support.  As usual, he cited some good data points and made a funny joke or two, but then he said one of the most interesting things I’d ever heard:  Stewardship , he said, may not be your #1 priority, but you can bet it’s the #1 priority for your donors. \n That’s brilliant, I thought.  I’ll have to use that line someday. \n Six months later I got my chance when I found myself addressing a class of college students in a course on philanthropy.  About ten minutes into my talk, I decided to go for it:  Stewardship , I said, may not be your #1 priority, but you can bet it’s the #1 priority for your donors. \n That went well, I thought to myself, and continued talking until one of the students interrupted with a question.  I keep hearing that term stewardship , she said, but what does it actually mean?  There was an awkward silence until I managed to answer (without much confidence) that stewardship was the way we thank our donors . \n On the way home from class I thought to myself, that was the wrong answer. \n What I should have said is that part of stewardship is the way we thank our donors.  Indeed, the promptness of a gift receipt or the personalization of a handwritten thank you note are important ingredients of stewardship.  But it’s also a newsletter story about gift impact or a picture of those impacted smiling in a magazine.  It’s a name on a recognition list, an invitation to a party, coffee with a gift officer, or even a simple birthday card.  It’s also the next solicitation and the one after that and the one after that. \n Stewardship, I realize now, is everything we do."], "link": "http://danallenby.wordpress.com/2012/09/20/what-is-stewardship/", "bloglinks": {}, "links": {"http://joshbirkholz.com/": 1, "http://feeds.wordpress.com/": 1, "http://danallenby.wordpress.com/": 1}, "blogtitle": "Ideas for Annual Giving"}, {"content": ["What annual giving best practices emerged at educational organizations in 2011?  \n Who is using video successfully?  What tactics are reactivating lapsed donors?  When do you need better stewardship?  How can the social web support annual giving campaigns?  \n Find out as Brian Kish, Senior Vice President at the University of Arizona Foundation, leads us through a 1 hour webinar that reveals the “Ah-ha” moments uncovered in the 2011 donorCentrics benchmarking season.  \n Click here to view this recorded presentation."], "link": "http://danallenby.wordpress.com/2012/09/12/2011-ah-ha-moments/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.youtube.com/": 1, "http://danallenby.wordpress.com/": 1}, "blogtitle": "Ideas for Annual Giving"}, {"content": ["Registration for the 2012 Canadian Higher Education Annual Giving Congress is now open! \n This spectacular two-day event brings together annual and leadership giving staff from schools across Canada, so that they can share success stories, discuss challenges and best-practices and exchange information about the work. \n When: Thursday October 25 th & Friday October 26 th , 2012 \n \n Where: Toronto, Canada at Ryerson University’s International Living and Learning Centre \n Cost: $150 per attendee – includes some meals \n Registration: September 5 – October 12. \n Hotel: Hilton Garden Inn Toronto City Centre, preferred rate $139.00+gst \n \n Click here to register now."], "link": "http://danallenby.wordpress.com/2012/09/06/canadian-annual-giving-congress/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://danallenby.wordpress.com/": 1, "http://my.utoronto.ca/": 1}, "blogtitle": "Ideas for Annual Giving"}, {"content": ["Thanks to the 262 organizations that participated in the 2012 Survey of Annual Giving Programs, which provides data on the characteristics, trends, and strategic priorities in the field annual giving today.   Click here  to download a FREE copy of the survey report. \n For more information about this study, or to request a customized report or annual giving program review, please email annualgifts@gmail.com ."], "link": "http://danallenby.wordpress.com/2012/08/29/2012-annual-giving-survey-3/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://danallenby.wordpress.com/": 2}, "blogtitle": "Ideas for Annual Giving"}, {"content": ["The most difficult job in the world is being a parent.  The expectations are boundless and the mere idea of making a mistake is terrifying.  What’s worse, there is no rule book. \n However, there is plenty advice out there and “they” seem to always be coming up with new ways to help make you a better parent.  At the end of the day, though, you’re left to your own devices to set limits and examples for your children.  Most likely, this will be based on your own experiences and (if you’re lucky) one or two pearls of wisdom that ring true for you, if no one else. \n The best advice that I ever received about parenting is this:  Be the person that you want your children to be. \n I think this is good advice for fundraisers too.  Do you do what you ask your donors to do?  Do you make a gift every year?  If so, would it be considered visibly generous by your peers?  Do you give a little more every year?  Have you included your organization in your will? \n If not, you should.  Be the donor you ask others to be."], "link": "http://danallenby.wordpress.com/2012/08/20/be-the-donor/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://danallenby.wordpress.com/": 1}, "blogtitle": "Ideas for Annual Giving"}, {"content": ["Step 1 – Buy 18 pieces of 3×2 foot poster board, half in one color and half in another color. \n Step 2 – Cut out the letters/symbol T-H-A-N-K-Y-O-U-! in one color and glue them to the other color. \n Step 3  – Recruit 9 people who have benefited from the good work of your organization and line them up, each holding a letter/symbol. \n Step 4  – Take a picture and email to your recent donors. \n Step 5  – Let simmer for 12 months. \n Step 6 – Repeat as needed."], "link": "http://danallenby.wordpress.com/2012/08/10/recipe-for-renewal/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://danallenby.wordpress.com/": 1}, "blogtitle": "Ideas for Annual Giving"}]