[{"blogurl": "http://igraphicsexplained.blogspot.com\n", "blogroll": [], "title": "iGraphics explained"}, {"content": ["Data as ArtThere is something both arresting and appealing about this visualisationCalming, and slow enough to understand the informationWith thanks to Jeff Cambron who writes:A new project with GE, the science of dynamic breaking (a key to GE's in-development hybrid diesel-electric trains) gets broken down via super slow motion video captureBasically it is a simple illustration of the physics"], "link": "http://igraphicsexplained.blogspot.com/feeds/2273735401004306262/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["SND: Multimedia and interactive awards winners of 2009The Best of Multimedia Design winners were awarded at the 2009 Society for News Design annual workshop and exhibition in Buenos Aires on Sept. 24. The competition recognizes skill, innovation and high-quality visual journalism in Web and other new-media design with quarterly and annual awardsDeservedly so, as their work is completely top-notch"], "link": "http://igraphicsexplained.blogspot.com/feeds/8777124646909772337/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Pakistan: drone strike doubleEx-Telegraph infographic genius Ciaran Hughes has produced this excellent flash interactive for Channel 4 tv network, his new office since leaving later this yearIn the last 12 months there have been at least 113 attacks by secret US drones in Pakistan's mountainous Waziristan region.   It is double the number of strikes in 2009, which itself saw a dramatic"], "link": "http://igraphicsexplained.blogspot.com/feeds/614704850095404870/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["F1 glamor from the Middle EastAgain, the most fantastic and innovative work coming from Luis Chumpitaz and his teamAmazing detail, over many spreads in an entire print-run devoted to the coverage of Formula One, in graphic formA huge project similar to the award-winning Olympic project poster set design by the very same manBeautiful and well deliveredWonderful!Merry Christmas"], "link": "http://igraphicsexplained.blogspot.com/feeds/322320823670859903/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["NYT maps every city and every block in the United StatesA wonderful interactive, as always, from the New York TimesBased on samples taken from the Census Bureau's American Community Survey during 2005 and 2009, this interactive enables us to understand the distribution breakdown of racial and ethnic groups across the countryLooking at the data viz in the map of Manhattan, check out the ethnic"], "link": "http://igraphicsexplained.blogspot.com/feeds/641816105698012650/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Kevin Nolan v LiverpoolInfographic premonition from Alan SmithSmith, the author of the column in the Telegraph Sport section, writes;\"Pardew must ensure proper Carroll service. Rather than try to beat his full-back, Barton [Joey] has made a habit this season of swinging in crosses from anything up to 30 yards out. And if the delivery is right this afternoon, Carroll will fancy his chances of"], "link": "http://www.101greatgoals.com/videodisplay/kevin-nolan-liverpool-7828590/", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["New Zealand mine explosion at Pike RiverWe've cobbled together this infographic on the recently redesigned Telegraph website, which shows where the mine is, and where the access tunnel meets the \"coal seam\"Basic graphicBut adds to the reporting"], "link": "http://igraphicsexplained.blogspot.com/feeds/494318808233431428/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Chile miners infographic from the TimesI completely forgot to pass this onBusy timesIndeed a busy time at The TimesThis was printed the day of the rescueRead it, paw over it. It had everythingI don't often like the \"kitchen sink\" approach to graphics, but I have to admit that I really did likeAbove all - it feels like the team at the Times had fun;With the researchWith the planningWith the"], "link": "http://igraphicsexplained.blogspot.com/feeds/7134909323023670288/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Chilean miners trapped in San Jose mine – update from Channel4Looking forward to seeing more animator Ian Watkins"], "link": "http://igraphicsexplained.blogspot.com/feeds/6075876942870513917/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Chilean miners trapped in San Jose mine – excellent animation work from Channel4Click here to see their TV animationThanks to Ciaran Hughes"], "link": "http://igraphicsexplained.blogspot.com/feeds/60764406346024954/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Chilean miners trapped in San Jose mine – online at the TelegraphConrad Quilty-Harper, Data Reporter for Telegraph.co.uk has been updating the content online, and building the graphicsClick here to view the full graphic"], "link": "http://igraphicsexplained.blogspot.com/feeds/1705419506170082928/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Chilean miners trapped in San Jose mine – more amazing interactivesGreat work at the BBCClick here to see the wonderful animated infographics that show everything you need to knowReally well rendered, they remind me of the great work that came out of el Pais and el Mundo of Spain in late nineties and the turn of the millenniumI would love to see what Rafa Hohr is up to with the Sunday Times, but"], "link": "http://igraphicsexplained.blogspot.com/feeds/2672182620515777728/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Chilean miners trapped in San Jose mine: latest infographics from Sunday newspapersThe Independent on Sunday eschewed the trend for \"rock textures\" to give a stylised guide to the rescue. Informative, and designed to work with the page, the \"yellow brick road\" approach offers quite a lot of bite-sized information in a small space. Also important to note the reappearance of Glenn Swan's byline in"], "link": "http://igraphicsexplained.blogspot.com/feeds/664768862854202900/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Globe and Mail goes greenThe Globe And Mail finally unveiled it's new redesign on FridayMoving away from broadsheet (pic1) to a slightly larger than Berliner format (pic2), The Globe And Mail is now full-colour throughout and uses glossy paper for certain areas of the paperThe new KBA Commander CT presses provide unparalleled colour and registration quality coupled with an extremely fast output."], "link": "http://igraphicsexplained.blogspot.com/feeds/268787147257030822/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Lifetime achievement award: Javier ErreaHere is a transcript from the SND websiteJavier has had an incredibly broad impact in our industry. It’s an impressive list. So let’s get to it! First, there’s the design work he’s done with Innovation International Media Consulting Group and his own company, Errea Comunicación. His team, based in Pamplona, Spain, specializes in newspaper design, editorial,"], "link": "http://igraphicsexplained.blogspot.com/feeds/6995073329136049789/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Enjoy the best of the Daily and Sunday Telegraph with our new iPad appThe app brings you the editors' selections from our award winning daily newspaper – from the sharpest political reporting to in-depth sports analysis and must-read columnistsThe best includes UK news, World news, Sport, Business, Comment, Features and Analysis and award winning cartoonist of the year, Matt"], "link": "http://igraphicsexplained.blogspot.com/feeds/1982219756739228369/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Pope's visit to the UKPope Benedict XVI will visit the UK this week, during which he will beatify Cardinal John Henry Newman, putting him on the Path to sainthoodTwo very different interactives from Telegraph.co.uk and the GuardianOur insightful Telegraph offerings, focus on history of Catholicism and diocese data, where as the Guardian has also excellent background information on Newman and"], "link": "http://igraphicsexplained.blogspot.com/feeds/7578937786231847821/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Deadly Genomes and Virus around the worldThe chart shows the genomes of a variety of bacteria and virus that cause disease among usEach coloured line represents the genome of the bacterium or virus. The size of the genome and percentage of the guanine or cytosine (both are paired with in the double-stranded DNA) are also noted. This is labeled as GC contentThis great and fascinating project by"], "link": "http://igraphicsexplained.blogspot.com/feeds/8660657684117360254/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["The fantastic Mr EstebanJuan Antonio Giner of Innovation has produced a worthy homage to Chiqui Esteban who leads the New Visual Naratives department of lainformacion.com in MadridHis team: he, Carlos Gamez and Sarah PottsYes3! (three)They use Flash, Illustrator, Photoshop, Cinema 4d, Dreamweaver, Soundbooth, Premiere and Click2Map for Google MapsJAG commentsChiqui and Carlos are fast like the"], "link": "http://igraphicsexplained.blogspot.com/feeds/7507143654566636613/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["A bee hive of activity of world wide flights in 24 hrsAs the light of day moves across from east to west, you can see evening air traffic leaving the United States overnight to arrive in UK and Europe in the morningAs nightfall spreads east, see the flow change, leaving Europe to arrive in AmericaHow many people are in the sky at any given moment?Fascinating"], "link": "http://www.blogger.com/video-play.mp4?contentId=481847281269b88c&type=video%2Fmp4", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Councils spending millions on website redesigns as job cuts loomA Telegraph.co.uk interactive shows the fees for the revamps, which come on top of salaries, were criticised by campaigners who say money would be better used ensuring workable internet access for residentsOne council refreshed the look of its website eight times in a decade, another paid more than thousand pounds for a spellchecker"], "link": "http://igraphicsexplained.blogspot.com/feeds/438086365413019899/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Cloned cow chaos born of supreme champion cow from United StatesFrom a prize winning cow in Wisconsin to Nairn near Innverness in ScotlandIn today's Daily Telegraph, Gordon Rayner provides great insight into the scandalReconstruction (infographic) of events:Mark Rueth, a farmer in Oxford, Wisconsin, paid £9,800 ($15,500) to Cyagra Clone, a genetics firm, to create a copy of his Holstein cow,"], "link": "http://igraphicsexplained.blogspot.com/feeds/3368943084298963734/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["NYT Stop, Question and Frisk interactiveClick here to enjoy another fantastic data interactive by the NYTNew York City’s police force, in its fight against crime, has increasingly used a strategy known as “stop, question and frisk,” which allows officers to stop someone based on a reasonable suspicion of crime. One expert has estimated New Yorkers are stopped at twice the national rateCircles"], "link": "http://igraphicsexplained.blogspot.com/feeds/1976522663987818833/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Top Secret America investigation by the Washington PostToday, the third installment of the Washington Post's investigation into the growth of top-secret government work after Sept. 11, 2001, takes readers to the capital of Top Secret America. Fort Meade, anchors the largest of a dozen clusters of top-secret government organizations and the companies that do work for them.They are in otherwise"], "link": "http://igraphicsexplained.blogspot.com/feeds/578706679113694583/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}, {"content": ["Inside the New York Times graphics department with GestaltenGestalten.tv in Berlin, have produced THE MUST SEE interview with Steve Duenes, Graphics Director and Archie Tse, Graphics Editor of the NYT. The graphic department at the NYT have won countless awards for their ground-braking and peerless graphic journalism. This video podcast offers an incredible insight into the minds of two leaders"], "link": "http://igraphicsexplained.blogspot.com/feeds/7538113777214120171/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "iGraphics explained"}]