[{"blogurl": "http://infographicworld.com\n", "blogroll": [], "title": "Infographic World"}, {"content": ["Our most recent winner of our infographic submission contest is John Hopkins from Tyler, Texas. John submitted a GREAT idea; the Evolution of Equality. With this idea in mind, we had our team build an infographic looking back at the history of various equality topics, such as race and sexual orientation. \n The voting for the final winner took place over at our good friend’s website, www.SodaHead.com \n If you have an idea you would like to submit for next month’s contest, simply fill out the form here: http://infographicworld.com/infographic-submission-contest/"], "link": "http://infographicworld.com/infographic-submission-contest-winner-evolution-of-equality/", "bloglinks": {}, "links": {"http://infographicworld.com/": 1}, "blogtitle": "Infographic World"}, {"content": ["An infographic we did for Mount Sinai hospital, looking into the stats and facts around prostate cancer in the United States"], "link": "http://infographicworld.com/mount-sinai-infographic-striking-out-prostate-cancer/", "bloglinks": {}, "links": {}, "blogtitle": "Infographic World"}, {"content": ["A really interesting infographic we did for Veracode, looking deep into mobile security, and all the risks/info associated."], "link": "http://infographicworld.com/veracode-infographic-mobile-security/", "bloglinks": {}, "links": {}, "blogtitle": "Infographic World"}, {"content": ["With the ref labor dispute going on, ESPN had us create an infographic looking at the life of an NFL ref, how much they make, and a look into some of the most controversial calls in NFL history"], "link": "http://infographicworld.com/espn-infographic-life-times-of-an-nfl-official/", "bloglinks": {}, "links": {}, "blogtitle": "Infographic World"}, {"content": [], "link": "http://infographicworld.com/michael-phelps/", "bloglinks": {}, "links": {}, "blogtitle": "Infographic World"}, {"content": ["Click the play button below to see our interactive infographic on how Infographic World’s viral marketing effect takes place, utilizing our infographics as the main driver. Once inside the graphic, follow the path by clicking the flashing area to see the full story."], "link": "http://infographicworld.com/viral-effects/", "bloglinks": {}, "links": {}, "blogtitle": "Infographic World"}, {"content": ["An infographic we did for ESPN looking at the biggest deadline deals in baseball over the years."], "link": "http://infographicworld.com/espn-infographic-mlb-biggest-trade-deadline-deals/", "bloglinks": {}, "links": {}, "blogtitle": "Infographic World"}, {"content": ["After receiving several hundred submissions to our infographic submission contest (in partnership with Daily Infographic ), we narrowed down the selections to our 5 favorite ideas. We then had the awesome folks at SodaHead create a poll and have their community vote on which of the 5 was the best idea. With that, we present the winning idea, submitted by David L. Smith, CEO of Mediasmith out of San Francisco. His idea was to compare the Olympics of old versus the modern day games. \n With the Olympics starting on Friday, this was a perfect timely idea, and a very fun infographic to build. Great idea David. \n You can submit your ideas for consideration for next month’s contest (we’re running it every month) here: http://infographicworld.com/infographic-submission-contest/"], "link": "http://infographicworld.com/infographic-submission-contest-winner-olympics-then-vs-now/", "bloglinks": {}, "links": {"http://www.Sodahead.com": 1, "http://www.DailyInfographic.com": 1}, "blogtitle": "Infographic World"}]