[{"blogurl": "http://infographiq.com\n", "blogroll": [], "title": "Infographiq"}, {"content": ["The application industry is young, dynamic, and rapidly evolving. For the Application Developers Alliance, an essential component of representing and serving their members is understanding the industry and providing information and research to guide them. In conjunction with this, infogr8 produced an infographic showing the growth of the ever-evolving app market, using data collected by Appalliance from Frank N. Magid Associates Inc. The infographic reveals how many people in the US are now online and using mobile apps and smartphones, and hints that the growth of the industry is showing no signs of slowing just yet. \n \n (image URL:  GrowingAppMarket_AppsAlliance.jpg )"], "link": "http://infographiq.com/the-growing-app-market/", "bloglinks": {}, "links": {"http://assets.appdevelopersalliance.org/": 1}, "blogtitle": "Infographiq"}, {"content": ["The Walking Dead marathon: With the third series of the show’s imminent release, we were tasked to run through all nineteen hours (in two days!) of the first two series with pen and pad at the ready, on the glorious task of counting walker kills! (zombie kills to some of you mere mortals).  Number crunching completed, and a new superfan in the camp, here’s The Walking Dead’s first two series by the numbers. Find out who’s the top walker slayer, the top weapons used and more… \n \n (image URL:  walking-dead-infographic.jpg )"], "link": "http://infographiq.com/the-walking-dead-weapon-and-kill-stats-season-1-2/", "bloglinks": {}, "links": {"http://infogr8.com/": 1}, "blogtitle": "Infographiq"}, {"content": ["“When a man is tired of London, he is tired of life.” So said eighteenth-century author Samuel Johnson, and here at infogr8, we struggle to disagree.  So, in honour of our hometown, we here at infogr8 have decided to produce an infographic highlighting some illuminating and potentially surprising facts about London. \n Who would have thought that the London’s first fish and chip shop would come along a whole half a century after the first Indian restaurant? Or that the total length of the London Underground is the same distance that could take you all the way to Brussels? (with some to spare!) Well dive in and take a look – (Even the perennially grey London weather comes across pretty well!). \n \n (image URL:  infogr8_London_calling.jpg )"], "link": "http://infographiq.com/london-calling-2/", "bloglinks": {}, "links": {"http://infogr8.com/": 1}, "blogtitle": "Infographiq"}, {"content": ["The folks over at Starfine furniture released this interesting infographic. It’s not really my style but I think it warrants posting because of it’s originality – how many infographics have you seen about furniture?"], "link": "http://infographiq.com/how-to-design-a-country-style-bedroom-infographic/", "bloglinks": {}, "links": {"http://www.starfinefurniture.com/": 1}, "blogtitle": "Infographiq"}, {"content": ["Updates have been few and far between recently, for the most part due to a lack of time. \n However, after receiving this infographic by email today I couldn’t resist posting it right away. I’m a big fan of The Rat Pack, Frank Sinatra and all things Vegas – so here you go."], "link": "http://infographiq.com/the-legendary-history-of-vegas-infographic/", "bloglinks": {}, "links": {"http://www.palms.com/": 1}, "blogtitle": "Infographiq"}, {"content": ["This creative visualization of what factors affect the search engine rankings of your website has to be mo current favourite. \n The thought and care taken to display the various aspects of seo rankings is really impressive. The comparison between SEO alchemy probably feels appropriate to some also! \n See the original here ."], "link": "http://infographiq.com/the-periodic-table-of-seo-infographic/", "bloglinks": {}, "links": {"http://searchengineland.com/": 2}, "blogtitle": "Infographiq"}, {"content": ["One of today’s info graphics comes from FreeDating.co.uk . \n \n Dating in a virtual world means creating your optimal identity, where who you are online becomes you, and ‘I love you’ doesn’t always mean forever. \n \n Credit to the designer for creation an interesting infographic with some great stats. Here’s some highlights; \n \t The Online Dating Industry is estimated to be worth $4 billion USD \n 27% of women have been dumped via text or email \n 38% of men have said ‘I Love You’ simply to have sex!"], "link": "http://infographiq.com/dating-infographic/", "bloglinks": {}, "links": {"http://www.co.uk/": 2}, "blogtitle": "Infographiq"}, {"content": ["According to this  infographic  from termlifeinsurance.org, the average U.S. adult sleeps only six hours and 55 minutes per night. It’s widely acknowledged that most adults require a minimum of 8. \n Here’s some headline data from the graphic - \n I know the US is not alone in this issue, but those are some worrying numbers. What do you think? Are they reliable stats, or off the mark? \n \n  \n \n  The average U.S. worker pays $20 a week for coffee. Fatigue lowers testosterone levels on average of 10 to 15 percent. Tired employees cost businesses approximately $136 billion a year. Alarmingly, 1 in 3 US adults have reported drifting off at the wheel. \n 1 in 5 road accidents are as a result of tiredness."], "link": "http://infographiq.com/3-in-10-us-office-workers-fall-asleep-at-their-desk-infographic/", "bloglinks": {}, "links": {"http://infographiq.com/": 1, "http://www.termlifeinsurance.org/": 1}, "blogtitle": "Infographiq"}]