[{"blogurl": "http://infographicsnews.blogspot.com\n", "blogroll": [], "title": "Infographics news"}, {"content": ["Barack Obama and Mitt Romney will be face-to-face again on TV for their second debate. A debate, bi its nature, shouldn't be a subject easy to visualize, but day after the day, media gets to publish great graphics, in a record time, about what is said on these spaces. These are some examples of graphics on this topic, new and old. \n \n \n \n The New York Times: the replay \n \nNo surprises. NYT uses to do spectacular (and effective graphics) with almost any topic. Debates are not an exception. \n \n \n \n   \n \n \n \nThis interactive way to replay the vice-presidential debate may not be a graphic. I don't mind the name: graphic, design, layout... It's a different way to present the information, easy to navigate and with fact-checking embedded. \n \n \n \n Boston Globe: the intensity \n \nDaigo Fujiwara and Alvin Chang created this graphic visualizing the intensity of the Biden and Ryan answers at the VP debate. \n \n \n \n \n \n \n \nClick in the image and, in less than 30 seconds, tell me the three most controversial topics of the debate: taxes, defense and medicare jump to your eyes. And you easily see how abortion was not something to discuss. And you can also have more detailed information with just a mouse-over. That's what graphics can do: give you a good summary at a glance and allow you to get deeper without problems. \n \n \n \n Publico: everything else \n \nFour years ago, Rajoy and Zapatero had a TV debate, after many years without this kind of face-offs in Spain. So Publico, a very political newspaper where I was working with other very talented infographic journalist, wanted to cover it with a breaking news double spread explaining all the details around the candidates and their performing. The political analysis will have pages of text. This was something else. \n \nThis was the result. \n \n \n \n \n \n \n \nThe body language, the bets moments, the mentions, the timeline... we focused on the most visual details of the confrontation. \n \n \n \n NPR: the details \n \nThis is not a debate graphic. Not even a graphic, maybe, but as I told before, I dont mind the names. \n \nBut they created the debate from speeches and presented it in a very different way, as an homage to the famous pop-up videos. \n \n \n \n \n \n \n \nThey focus on some details, fact checking and curiosities. What is behind the declarations. \n \n \n \n \n \n UPDATE \n \n \n \n Periscopic: the issues \n \n Periscopic has also its own way to visualize the presidential debate words through Politilines.com ., 'Connecting the issues to the candidates' is the motto of this initiative. And so it is. \n \n \n \n   \n \n \n \nA direct way to know what the candidates are saying about certain topics... and who's talking about the topic chosen (and what are they saying)."], "link": "http://infographicsnews.blogspot.com/feeds/2413439438741628199/comments/default", "bloglinks": {}, "links": {"http://www.bostonglobe.com/": 1, "http://politilines.periscopic.com/": 2, "http://www.blogger.com/": 2, "http://www.npr.org/": 1, "http://feedads.doubleclick.net/": 2, "http://chiquiesteban.com/": 1, "http://www.periscopic.com/": 1, "http://www.nytimes.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["You've read so many times here news about Alberto Cairo. Usually talking about his superpowers as infographics evangelist, teaching graphics all around the world. \n \nWell, now Alberto Cairo could be your teacher too . You just have to join him at the first Massive Open Online Course about infographics and data visualization at the Knight Center for Journalism in the Americas. \n \nThe starting date is October 28. But notice it will be a course for newbies or people coming from other professional expertises, so you won't need previous knowledge but it might be too basic for infographics professionals. \n \nMore information: \n- Course page at the Knight Center \n- How to get enroled"], "link": "http://infographicsnews.blogspot.com/feeds/1403698958693314057/comments/default", "bloglinks": {}, "links": {"http://www.thefunctionalart.com/": 1, "http://knightcenter.utexas.edu/": 1, "http://2.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "https://knightcenter.utexas.edu/": 1}, "blogtitle": "Infographics news"}, {"content": ["The ÑH9 Awards, a competition by the Spanish Chapter of the SND recognize the best media design in Spain and Portugal. ( Complete list here ). \nAs usual, this blog will focus on infographics, print and online. I've gathered all the links and most of the images, but stay tuned for further updates! \n \n Print \n \n BREAKING NEWS \n \n Mention \nDiario de Burgos (Burgos) \nLa nueva calle Vitoria \n \n Mention \nLa Verdad (Murcia) \nEl nuevo ajuste presupuestario. \n \n FEATURES \n \n Silver \nLa Vanguardia (Barcelona) \nTender un cable a Baleares \n \n \n \n \n \n Silver \nLa Vanguardia (Barcelona) \nTitanic. 100 anys de l'enfosament \n \n \n \n \n \n \n \n \n Silver \ni (Lisbon) \nFutebol. Um guia gráfico \n \n \n \n \n \n Silver \ni (Lisbon) \nDia de Reis \n \n \n \n \n \n Silver \nExpresso (Lisbon) \n 366 pedaços de céu \n \n Mention \nDiario de Pontevedra (Pontevedra) \nUna contrarreloj con trampa \n \n Mention \nEl Correo (Bilbao). \nUn día con Helena, en una Grecia al límite \n \n \n \n \n \n \n Mention \nEl Correo (Bilbao) \nLos argumentos de los 'pies descalzos' \n \n Mention \ni (Lisbon) \nMessi & Ronaldo. Mapas de golos \n \n \n \n \n \n \n \n \n Mention  \ni (Lisbon) \nBurton & Depp \n \n \n \n \n \n \n PORTFOLIOS \n \n Gold \nEl Correo (Bilbao) \nDeportes olímpicos. Josemi Benítez y Aberto Lucas \n \n Gold \nLa Vanguardia (Barcelona) \nPortafolio. Raúl Camañas y Alan Jürgens \n \n Mention  \nDiário de Notícias (Lisbon) \nO Estado do Ambiente. Tânia Sousa y Cristina Santos \n \n Mention \nExpresso (Lisbon) \nPrivatizações. Jaime Figueiredo, Olavo Cruz y Carlos Esteves \n \n Mention \nExpresso (Lisbon) \nPortugal 2012. Sofia Miguel Rosa \n \n \n Magazines \n \n \n FEATURES \n Mention  \nMongolia (Madrid) \nEl poder financiero. Juanjo Torralvo \n \n \n \n \n \n Mention  \nPanenka (Barcelona) \nEl gran partido de la historia. Chiqui Esteban \n \n \n \n \n \n PORTFOLIOS \n Mention  \nEs, La Vanguardia (Barcelona) \nEn forma. Raúl Camañas y Alan Jürgens \n \n  \n  Online \n  \n \n BREAKING NEWS \n \n Mention \nmarca.com (Madrid) \n Compara el nuevo Ferrari F2012 con su antecesor \n \n Mention \nelpais.com (Madrid) \n Muro de la memoria \n \n \n FEATURES \n \n Gold \nmarca.com (Madrid) \n Final de la Copa Davis 2011 \n \n Silver \n20minutos.es (Madrid) \n Eurocopa 2012: los números de la selección española \n \n Mention \nconsumer.es (Elorrio, Vizcaya) \n Aprender a comer bien \n \n Mention  \nexpresso.pt (Lisbon) \n Chefe Tiger: cozido serrano... light \n \n Mention \n20minutos.es (Madrid) \n Causas de mortalidad en España \n \n Mention  \nmarca.com (Madrid) \n ¿Cuánto tiempo tardas en formar las escuderías? \n \n Mention \nmarca.com (Madrid) \n Lo que hay que saber de la Super Bowl \n \n SPECIALS \n \n Silver \npublico.pt (Lisboa) \n Do mar ao prato: A viagem do bacalhau \n \n Mention  \nlainformacion.com (Madrid) \n Especial Patrimonio de los Diputados"], "link": "http://infographicsnews.blogspot.com/feeds/6767083976777297065/comments/default", "bloglinks": {}, "links": {"http://snd-e.com/": 2, "http://expresso.sapo.pt/": 2, "http://www.20minutos.es/": 2, "http://www.marca.com/": 4, "http://especiales.lainformacion.com/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.consumer.es/": 1, "http://static.publico.pt/": 1, "http://4.blogspot.com/": 5, "http://2.blogspot.com/": 5, "http://politica.elpais.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Alberto Cairo's latest book is here... and in english. ' The Functional Art ' has been translated, updated, improved and completed in the last months and now is available . I read the spanish version and the sensation I had is that I was reading what I should have read when I was in my first years in this work. But then you notice it keeps being useful anyway. The reading is completely different now, what I learn from the reading changes with your experience. Is, undoubtedly, time well spent. Is not just theory, also practical cases through discussions with some of the greatest names as John Grimwade, Fernando G. Baptista, Steve Duenes, Hannah Fairfield, Geoff McGhee... \n \nBut this is 'Show Don't tell', so I'll stop talking and let you enjoy the intro... \n \n \n \n...and the interview with John Grimwade \n \n \n \n Related  - The best design advice I ever got - Alberto Cairo - Index of the book"], "link": "http://infographicsnews.blogspot.com/feeds/5097550702748429105/comments/default", "bloglinks": {}, "links": {"http://www.thefunctionalart.com/": 2, "http://www.peachpit.com/": 2, "http://2.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "Infographics news"}, {"content": ["Share \n \n Pinterest is the new social network in fashion. A visual pinboard with recommendations form your contacts. And a perfect showroom for (static) infographics. These are some of the boards you may follow if you like infographics. Feel free to recommend more in comments or if you think I've forgotten any. \n \n \n \n \n Alberto Cuadra - My graphics - Graphics \nAlberto Cuadra works for the Washington Post, in these boards you may find his own works and other infographics he likes. \n \n \n \n  Boston Globe Infographics \n Javier Zarracina , Monica Ulmanu , Patrick Garvin , David Schutz , Daigo Fujiwara and Tom Giratikanon curate this board showing some of the department's works. Some of them also have interesting particular boards as the ones by Zarracina , Ulmanu or Garvin . \n \n \n Juan Colombato - Infografías/Infographics \nColombato show some of his works at La Voz del Interior. Beautiful handcrafted graphics with the best of the argentinian tradition. \n \n \n \n Ben Golder - Illustrations/Measurements \nThe name of the board is already telling you that you'll find here more things than infographics, but it worths a visit: amazing examples of old and new visual communication pieces. \n \n \n \n Linda Eckstein - Malofiej 20 Awards \nSome of the graphics awarded at the last edition of the Malofiej are present in this board. \n \n-------- \n \nI'm not including this into the top five, but you can find more graphics (and others) in my own Design/graphics pinterest board ."], "link": "http://infographicsnews.blogspot.com/feeds/6797133697869704382/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 2, "http://pinterest.com/": 17, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 2, "http://4.blogspot.com/": 1, "http://2.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Tweet Share \n \nEvery single newspaper and news site has produced its new Titanic graphic for the 100th anniversary. But none of them have been so impressing as the one published by 'The Graphic' and other media in 1912. Without Google. Without Illustrator. Without Flash. \n \nMost of them can be considered illustrations, but all of them have the goal of a visual explanation of the event. These are some examples from a special issue of  The Graphic published on April 27th. Some sources says it was published on april 1912, otrhers April 2014. Maybe there was a reedition two years after, and the most reliable sources use 1912 as the date, but the work is impressive anyway. \n \nThe evacuation, one of the big controversies of the Titanic accident. \n \n  \n \n \n More..."], "link": "http://infographicsnews.blogspot.com/feeds/6277468001402647174/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://feedads.doubleclick.net/": 2, "http://3.blogspot.com/": 1, "http://infographicsnews.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Share \n \n  \n There's a lot of buzz in social networks about the little game The New York Times has used to illustrate their feature Just One More Game ... Actually, what they publish is a version of the Kick Ass game by Rootof Creations, as indicated in the source. Usually, these ideas look absolutely mad when proposed in other newsrooms. Then, The New York Times or any other respected newspapers uses it and all those who banned the idea in their media clap like crazy. Maybe that's why NYT is so innovative. They don't mind how important they are, they are open to new ideas and don't think a game or an animated GIF (as published today on its frontpage) is not as serious as they should be. \n \n  \nBut is not the first time The New York Times uses a game to explain something. And, in my opinion, not, by far, the best. In fact, this is just some amusement, meanwhile other times NYT has used those games as a really effective way to explain some concepts. \n \nMy favorite is the Rock-Paper-Scissors game to understand how robots think. Smart and completely amazing. \n  \n It's not a game just for the sake of having a game in the page (as the one on the top of the article). It's actually an explanation in disguise. And a really good one. \n The same they did when they wanted you to know why is dangerous to text and drive. Other incredible piece called Gauging your Distraction . \n  \n Better than a text and giving you the reasons, they give the experience. The classical Show Don't Tell! as its best. \nThis particular piece made me think much about it, and from them I always try to look for the possibility of using games to explain information. Sometimes just slightly , sometimes on a more evident way . \n \nGames are not just about making things funny. Means better understanding of the information. Reader engagement. Success in social networks. Scarce content. Time spent by the user/reader. Many many reasons for, at least, try to think on the possibility."], "link": "http://infographicsnews.blogspot.com/feeds/4127095866402024444/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://erkie.github.com/": 1, "http://chiquiesteban.com/": 2, "http://www.nytimes.com/": 6, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Share \n \nMaybe these were not the best pieces of the contest (I won't say 'graphics' because the limits of what is a graphic nowadays are blurry), not even the five I liked the most, but five examples I'll remember when thinking on how to tell stories in the future (and the present) \n \n 1. Use of audio \n Trial excerpt: Getting to not Guilty | The Boston Globe \n \n \n  \n \nThe idea is simple, actually: they wanted to explain how things happen on the Court, so what they give is the complete audio of a session, the transcript and a colored bar marks what's playing the audio. This particular case explains the story of the judgement of a person who confessed being guilty of driving drunk and cause an accident in the moment it happened but was declared not guilty after all. \n \n Why I like it? \nIt really explains the information in the best possible way. No fireworks. I can't figure myself reading a long article about this topic, and I guess won't be enough just hearing the audio. But they way The Boston Globe mixed both created a very effective piece: the voices, the doubts, how they talked, wth the transcript to follow the action on an easier way... Smart, effective, objective journalism. \n \n \n 2. Multimedia Integration \n At the Metropolitan Museum, a new wing, a new vista | The New York Times \n \n \n  \n \nThe Metropolitan Museum was opening a new islamic wing and The New York Times created this virtual visit to all lounges, with navigable panoramas, image details, audio explanations and other details. \n \n Why I like it? \n \nNone of the separated elements is very original. I've seen better navigable panoramas, better image details, better audio explanations, better wing maps... but all the stuff is brought together on a really great way. Multimedia pieces are not just juxtaposed, but integrated. So here 1+1+1+1 is more than 4. And with really good details, like the tiny map on the left, advancing with the scroll and changing depending on the lounge you're watching each moment. \n \n 3. Use of social networks \n Cast Your Vote, 2011 Oscar | The New York Times \n \n \n  \n \nThe Oscar 2011 special by The New York Times invites you, as many others, to fill your own ballot. But there's an extra point: the possibility to share it on Facebook with your friends and play against them. \n \n Why I like it? \n \nAll media know they have to do things with social networks, but no one knows exactly what to do. This is what to do. This special piece by the Grey Lady is a perfect demonstration of how social pieces can be without complex developments. A really social product. \n \n 4. Different use of video \n Pop up politics | National Public Radio \n \n \n  \n \nDo you remember VH1 Pop Up Videos ? NPR has adapted that idea to politics: videos showing funny things about what's happening on them, but here NPR is using speeches of the republican candidates instead of music videos. \n \n \n Why I like it? \n \nOk, the idea is not original, but changing the context to politics add a very interesting layer (and changes the sometimes hieratic face of elections info). Maybe this particular example by NPR has too many 'funny' things rather then 'important', but is a very good way to analyze speeches, and on videos, so important for advertising revenues nowadays. \n \n 5. Vertical narratives \n How Osama Bin Laden was located and killed | The New York Times \n \n \n \n  \n \nA colection of graphics and multimedia pieces about the capture of Osama Bin Laden by, yes, again, The New York Times. This vertical system completing the information step by step is not exclusive of the Times, but a format each time more popular in the United States media. \n \n Why I like it? \n \nIf the example of the Metropolitan was great because of the integration over the juxtaposition, here is the opposite: the juxtaposition works over the integration. The format creates a linear narrative, with differentiated pieces, indexed with the tiny fixed menu at the left. The story is told by steps, like the successful Mariano Rivera video infographic. \n \n Complete list of awards, SND Digital 2012"], "link": "http://infographicsnews.blogspot.com/feeds/2892552702702528314/comments/default", "bloglinks": {}, "links": {"http://www.bostonglobe.com/": 2, "http://www.snd.org/": 1, "http://oscars.nytimes.com/": 2, "http://www.npr.org/": 2, "http://feedads.doubleclick.net/": 2, "http://infografistas.com.es/": 1, "http://www.vh1.com/": 1, "http://www.nytimes.com/": 4, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Tweet Share \n \nThis is the key week to end sticking portfolios together, gathering URLs and decide the best graphics of this year on each department. This week we meet the deadline to send graphics for two of thebig events of the year: the SND Digital and the Malofiej Awards . \n \n \n  \n SND Digital \n Deadline: January 15th \nThe online edition of the SND awards, focused on design but with infographic categories. Not as veteran as the print SND or Malofiej, but with the intention (if not a reality already) of becoming the most important online media design awards. Special attention to apps for mobile and tablets, \n \n \n  \n Premios Malofiej \n Deadline: January 17th \nThe classic among the classics of the infographics awards celebrates its 20th anniversary in a big way. \nPrint, online and mobile graphics can participate in this specialized and prestigious competition. \n \nIt's late, so 'don't rest on your laurels' as says the motto of the Malofiej Awards. \nAnd good luck!"], "link": "http://infographicsnews.blogspot.com/feeds/1720506006673268881/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://digital.snd.org/": 1, "http://feedads.doubleclick.net/": 2, "http://www.malofiej20.com/": 1, "http://twitter.com/": 1, "http://2.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Tweet Share \n \n  \n \nThe   Malofiej Awards , the most important awards-summit-workshops-party of infographics in this world, is becoming 20 in 2012. As John Grimwade says and malofiej20.com  remebers  \"You must attend Malofiej at least once in your life\" . And this is the right time, as the infographics Mecca is preparing a great program of high-class events to commemorate its anniversary. \n \n More..."], "link": "http://infographicsnews.blogspot.com/feeds/8176916575752702621/comments/default", "bloglinks": {}, "links": {"http://malofiej20.com/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.malofiej20.com/": 1, "http://twitter.com/": 1, "http://infographicsnews.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Share \n \nI've seen today a superb job by one of myy favourites infographics journalists, Jay Carr from the Houston Chronicle . It was a graphic showing the evolution of weather in Texas. \n \n  \nBut I had a problem. It resembles too much to an example I loved form a neighbour newspaper some years ago, The Dallas Morning News . \n \n More..."], "link": "http://infographicsnews.blogspot.com/feeds/8710538169645381953/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://chron.com/": 1, "http://infographicsnews.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Share \n  \nIf you're reading this blog, you may know who Alberto Cairo is. Former graphics director at elmundo.es, infographics professor at Chapel Hill, Infographics director at Globo (Brazil) and, most recently, infographics professor at the University of Miami. \nAfter this (useless) introduction, there's something you need to know: his most recent book, El Arte Funcional , is being translated to english and The Functional Art will be available in summer 2012. \n More..."], "link": "http://infographicsnews.blogspot.com/feeds/1589904110041934375/comments/default", "bloglinks": {}, "links": {"http://elartefuncional.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.visualopolis.com/": 1, "http://thefunctionalart.com/": 2, "http://infographicsnews.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Share \n \n \n Amanda Cox - Eyeo Festival 2011 from Eyeo Festival on Vimeo . \n \nA very interesting video of Amanda Cox (one of the persons I admire the most in the world of infographics) talking abut her work (and the work of all the infographics team) in The New York Times. \nI think this introduction is more than enough to know this video will be interesting and I don't need to encourage you to watch it! \n \n PS. Thanks to Amanda for her kind words. I can die happy now :)"], "link": "http://infographicsnews.blogspot.com/feeds/1168925844706424941/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://vimeo.com/": 3, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Share \n \nI was hired by  lainformacion.com two years and a half ago, a just-online young information site in Spain. I came from Publico , a print national newspapers. My task at lainformacion.com was leading the New Narratives Department. I could call it the infographics department, but the concept it's wider than that. \nBy then, I always had thought than infographics were very useful for readers, give very good image to the media and helped to build that scarcity that made people buy one newspaper and not another. What I didn't knew and was about to discover, is that infographics could become so important for media, not just in terms of quality, journalism and image, but also in visits and time in page. \n \n \n More..."], "link": "http://infographicsnews.blogspot.com/feeds/1747324008678896419/comments/default", "bloglinks": {}, "links": {"http://lainformacion.com/": 1, "http://feedads.doubleclick.net/": 2, "http://infographicsnews.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Tweet Share \n \nPúblico, La Verdad de Murcia, Heraldo de Soria, Yorokobu, elpais.com and eitb.com have been chosen the best designed media of Spain and Portugal in the 8th edition of the ÑH awards, the prizes awarded by the Spanish Chapter of the SND which select the best design of the iberian countries. You can see the complete list at the web of the SND-E . But here you will find the infographics awards (and it will be updated) \n \n NEWSPAPERS \n \n \n Breaking news \n \n \n Silver \nEl Correo (Bilbao) \nLa Vuelta looks to the Basque Country again \n \n Mention \nHeraldo de Aragón (Zaragoza) \nBad synchronization of the traffic lights \n \n Features \n \n  \n Gold \nPúblico (Madrid) - Samuel Granados \nFlamenco. From prosecution to salvation \n \n \n More..."], "link": "http://infographicsnews.blogspot.com/feeds/1235063851114213423/comments/default", "bloglinks": {}, "links": {"http://snd-e.com/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://twitter.com/": 1, "http://infographicsnews.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Google+ is the new Twitter, the new Facebook... or not. \nBut, anyway,is the new social network everybody talks about. \nIf you are one of those early adopters already enjoying it, here you are a list with some people related with infographics you can find in Google+ to create your Infographics circle \n \n More..."], "link": "http://infographicsnews.blogspot.com/feeds/7452608418554708692/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://plus.google.com/": 1, "http://1.blogspot.com/": 1, "http://infographicsnews.blogspot.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Tweet Share \n \n  \n \n Golden Section Graphics , the Germany-based infographics studio, has reeased the second issue (third counting the Berlin wall special) of their already famous just-graphics magazine InGraphics . \n \nThis issue is released after being one of the big winners of the last Malofiej awards , some of the InGraphics products were awarded, including a gold medal for the transfer market calligraphy stunning work. \n \nSo, what to expect from the second issue? The same as the first one, a good bunch of high quality works: 3d, diagrams, maps, visualizations... \n \n (Continue clicking on more information...) \n \n More..."], "link": "http://infographicsnews.blogspot.com/feeds/6375353553509037537/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.golden-section-graphics.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.ingraphics.info/": 2, "http://twitter.com/": 1, "http://infographicsnews.blogspot.com/": 2, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Tweet Share \n \nThere was something that many of us were expecting from a long time, the final release of Visual.ly , a web which tries to be the big showcase of infographics and visualizations.  And it has been finally inaugurated. \nAnyway, many of us (me included), feared that it can become a bunch of  infoposters or tower-graphics . \n \n  \nAt first sight,  I see just a few things that I really like, with many decorated texts on an hypervertical format. \n \n More..."], "link": "http://infographicsnews.blogspot.com/feeds/4561946323358804099/comments/default", "bloglinks": {}, "links": {"http://www.maxgadney.com/": 1, "http://feedads.doubleclick.net/": 2, "http://4.blogspot.com/": 1, "http://visual.ly/": 1, "http://twitter.com/": 1, "http://infographicsnews.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Tweet Share \n \nYou should visit these five links if you really like infographics, visualizations, visual narratives or however you call it. \n \n 10 significant visualisation developments: January to June 2011 \n Visualising Data \n \n  \n \nThese frists months of 2010 has been really interesting for the graphics world: good works, tools, statements , discussions ... Ten of the top worth-visiting liks of the year on VisualisingData. \n \n 22 free tools for data visualization and analysis \n Computer World \n \n \n  \n \n \n \nMaking graphics and visualizations is getting easier day by day (the quality of interest of those is another discussion). The technological barrier is falling down and now you don't even have to pay for licences. People got plenty of tools online, free and easy to use. From the ones by the omnipresent Google ( Fusion Tables , Refine ...) to others, independent but interesting like Impure . \nHere you got a good list with a good bunch of them. \n \n Visual pieces by Antonio Pasagali \n lainformacion.com \n \n  \n \nAntonio Pasagali is Art Director at lainformacion.com , the news web I work for . He has published a couple of Visual Pieces, with really nice aesthetics, but also informative. Something different. And that's a good thing. \n1. Pedestrians in New York \n2. Madrid-BCN: train and plane \n \n The functional art \n Alberto Cairo \n \n \n  \n \nAlberto Cairo's book (called in spanish 'El arte funcional' and which could be translated as 'The Functional Art') has become famous before being in the shops. And now it's on its last steps before being released. By the moment, we know that it will be published between spetember and novembre, 2011, at least in spanish. And also what does Nigel Holmes thinks about it: \n \n Welcome to Alberto’s world. Cairo has done it all here: history, theory, practice, examples. And he's done it brilliantly. It's the most comprehensive and sensible book yet on real-world information graphics; we won’t need another for a long time (or until he writes his next one!)\""], "link": "http://infographicsnews.blogspot.com/feeds/4142141066132360410/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://2.blogspot.com/": 1, "http://elartefuncional.com/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://4.blogspot.com/": 1, "http://code.google.com/": 1, "http://lainformacion.com/": 1, "http://twitter.com/": 1, "http://www.impure.com/": 1, "http://www.visualisingdata.com/": 1, "http://www.facebook.com/": 1, "http://especiales.lainformacion.com/": 3, "http://infographicsnews.blogspot.com/": 3, "http://www.google.com/": 1, "http://www.computerworld.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Tweet Share \n \nSome time ago (maybe years) I saw this coffee infographic at Lokesh Dhakar 's web, maybe you know it. \n \n \n \nSince then, I've seen many many graphics inspired by it (sometimes that 'inspired' told in the best of the meaning,s sometimes on the worst) \n \nI've seen it done with cocktails ( watch all ) \n \n  \nOr about italian coffee \n \n  \nRe-thought as part of an horrible poster \n \n  \nOe directly in coffee shops (via noisebetweenstations ) \n \n  \nThe same idea with a different visualization \n \n  \nOr even published in The Independent , mixed with another graphic by David McCandless ans signed as if him was the author. \n \n  \n \nBut, after all these examples, my favourite is still the original one."], "link": "http://infographicsnews.blogspot.com/feeds/2155158641009345877/comments/default", "bloglinks": {}, "links": {"http://www.informationisbeautiful.net/": 1, "http://3.blogspot.com/": 2, "http://feedads.doubleclick.net/": 2, "http://noisebetweenstations.com/": 1, "http://1.blogspot.com/": 1, "http://theoatmeal.com/": 1, "http://4.blogspot.com/": 1, "http://datavisualization.ch/": 1, "http://twitter.com/": 1, "http://2.blogspot.com/": 2, "http://www.co.uk/": 1, "http://www.innovationsinnewspapers.com/": 1, "http://www.lokeshdhakar.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Tweet Share \n \n  \n \nFrom March 18th to 23rd, 2012 . Malofiej 20 has confirmed its dates and shown its new identity, as we can see at the SND-E web . An edition with surprises, according to the Spanish Chapter of the SND. \nJudges will start their work on 18th and the International Summit will be inaugurated the 21st."], "link": "http://infographicsnews.blogspot.com/feeds/2679141217181848414/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://www.snd-e.com/": 1, "http://2.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Share \n \nUnited States is not just the 'land of opportunities', but also the land of Open Data . From Spain, we are really jealous of how the government offers data in different lenguages and formats to be used and consulted by citizens and media. \n \nOne good example is the 2010 census: all kind of data about the population of such big and heterogeneous country is a very big opportunity to show what can we do with all that data and make it easy to access for citizens. Global and local, giving a general idea of the country, but also allowing people to check information of their own neighborhoods. \n \nThese are some examples of work with this information: \n (If you know other interesting examples, just tell me in the comments of this post) \n \n \n The New York Times \n Mapping America: Every city, every block \n \n  \nI've talked about it separately . It really amazed me when I first looked at it. The different layers of information, the details, the fact that you can take a look to all the country, but also look for the data not just of your neighborhood but, in some cases, your own building! \n \n Moonshadow Mobile \nCensusmaps 2010: Washington , California ... \n \n  \nIt gives you the possibilty to go really deep and with many options, but only state by state (and just some of them). The creators of this technology think that what makes these maps different is the speed and the amount of data they can handle: \"Our technology is software only and it is typically hosted in the cloud. As a result of our speed advantage we can work with much larger databases. Whereas others visualize 1,000 to 10,000 records in Google Maps we have visualized databases with over 100 million records. \" \n \n The Washington Post \n Explore the 2010 Census \n \n  \nThe Washington Post graphic is not as complete as the previous one, but gives you the option to compare the data with previous census. You could also seacrh for different visual stories on their main page of the census . \n \n The Wall Street Journal \n America in 2010 \n \n  \nAlthough you can find different graphics of the census on WSJ.com , they are not as easy to use as WaPo's or NYT. The good thing is you can reach the information of each county, with goes more local than WaPo's, but not as detailed as its neighbour, the Gray Lady. \n \n----------- \n \nThese are just some examples. Share in comments other interesting things if you know them, and I'll add them to this post."], "link": "http://infographicsnews.blogspot.com/feeds/5840696121710052369/comments/default", "bloglinks": {}, "links": {"http://www.washingtonpost.com/": 3, "http://ca.censusmaps2010.com/": 1, "http://feedads.doubleclick.net/": 2, "http://wa.censusmaps2010.com/": 1, "http://projects.nytimes.com/": 2, "http://graphicsweb.wsj.com/": 2, "http://wsj.com/": 1, "http://4.blogspot.com/": 1, "http://online.wsj.com/": 1, "http://infographicsnews.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Tweet Share \n \n  \n \n Dimitris Kabitis , Galatsidis Achileas (both former Eleftheros Typos ) and some other journalists and designers have released iGraphics , the first independent greek infographic agency according to themselves. \n \nThey create print and online information graphics, and they have even translated some of them to english. From here, good luck!"], "link": "http://infographicsnews.blogspot.com/feeds/4616880786748599627/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.igraphics.gr/": 1, "http://twitter.com/": 1, "http://2.blogspot.com/": 1, "http://infographicsnews.blogspot.com/": 2, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Share \n \n \n \n Al Bayan and Emirates 24/7 are two Dubai newspapers with a very good infographics department. The peruvian Luis Chumpitaz leads a great and heterogeneus team, showing every day the quality of their works, winning international awards on each contest they participate. \n \nNow, SND jobs announces two information graphic designers positions in their team . They ask for someone who can talk in english or arabic, with journalistic background. They are also looking for two online developers (AS3-HTML5) and one digital illustrator . \n \nSo, if you feel attracted by working in Emirates, with am award-winning team in two quality newspapers, this is your chance."], "link": "http://infographicsnews.blogspot.com/feeds/9082428718361895238/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.onemoregraphic.com/": 1, "http://office.snd.org/": 1, "http://1.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}, {"content": ["Share \n \n Fernando Baptista , graphics editor at NG, explains it on the spanish blog La Buena Prensa (amazing images...). It's in spanish, but it's Show-Don't-Tell-expalined... So it's worths a visit. \n \n  \n \n \nAnd if, even with those images, you don't get the whole picture, National Geographic has released a video with explanation (click on iamge to watch it at NG's web)"], "link": "http://infographicsnews.blogspot.com/feeds/3599372314811597443/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://ngm.nationalgeographic.com/": 1, "http://labuenaprensa.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.facebook.com/": 1}, "blogtitle": "Infographics news"}]