[{"blogurl": "http://www.infographicsblog.com\n", "blogroll": [], "title": "Infographics Blog"}, {"content": ["What It Shows Super simple, not much as far as style, but a fun concept done cleanly and clearly. This infographic shows relative sizes of the sun in the sky depending on which planet you would be looking at it from. Why It’s Good I know there isn’t a ton going on here, but I’m [...]"], "link": "http://www.infographicsblog.com/the-size-of-the-sun-in-the-sky-as-seen-from-each-planet/", "bloglinks": {}, "links": {}, "blogtitle": "Infographics Blog"}, {"content": ["What It Shows This infographic gives an overview of acne suffering, people’s psychological relationships with acne, and treatment statistics. Why It’s Good Acne is a tough thing to go through, and it’s nice to see it addressed seriously. The statistics are good and surprising. Friends of mine have ended up with acne scarring and it’s [...]"], "link": "http://www.infographicsblog.com/getting-over-acne-acnetreatment/", "bloglinks": {}, "links": {}, "blogtitle": "Infographics Blog"}, {"content": ["What It Shows This infographic shows the release timeline for Apple products, from the Apple I in 1976 to today’s iPad. Why It’s Good The art of it works really well, capturing a hint of the bright cleanliness of the modern Apple brand. Maybe it’s a bit cheesy, but I like the fact that a [...]"], "link": "http://www.infographicsblog.com/apple-tree-mike-vasilev/", "bloglinks": {}, "links": {}, "blogtitle": "Infographics Blog"}, {"content": ["What It Shows This infographic presents a collection of statistics to do with sleeping disorders, insomnia in particular, and how it tends to be treated. Why It’s Good As someone with sleep issues my whole life, I was keen to talk about this topic. I attribute my inability to fall asleep to an over-thinking mind [...]"], "link": "http://www.infographicsblog.com/whos-most-prone-to-insomnia-canada-drug-center/", "bloglinks": {}, "links": {}, "blogtitle": "Infographics Blog"}, {"content": ["What It Shows This video infographic shows the map of Japan and marks the locations of 2011′s earthquakes. The magnitude of each earthquake is expressed in the size of the circle marking its location. It’s impossible to not react when the big one hits. Why It’s Good This infographic is very reminiscent of the nuclear [...]"], "link": "http://www.infographicsblog.com/japan-earthquakes-2011-visualization-map/", "bloglinks": {}, "links": {}, "blogtitle": "Infographics Blog"}, {"content": ["What It Shows This infographic gives some background about the lack of footwear and visual impairment problems that exist in developing nations, and the TOMS program that, through numerous partnerships, is working towards solving these problems. Why It’s Good First and foremost, it is a good cause, and recognizing the efforts of charitable individuals is [...]"], "link": "http://www.infographicsblog.com/toms-giving-back-one-for-one-autism-united/", "bloglinks": {}, "links": {}, "blogtitle": "Infographics Blog"}, {"content": ["What It Shows This infographic visually breaks down web tool use based on a polling of 180 designers, for documents, file storage, wireframing, visual design, note taking, text editing, web hosting, video editing, invoicing, and email. Why It’s Good It’s a nice idea, as designers tend to be a web savvy bunch. It’s nice to [...]"], "link": "http://www.infographicsblog.com/the-designers-toolkit-bestvendor/", "bloglinks": {}, "links": {}, "blogtitle": "Infographics Blog"}, {"content": ["What It Shows This timeline infographic indicates which toys created Christmas crazes over the last century, from yo-yos to the Microsoft Kinect. Why It’s Good As much they’re not exactly brimming with creativity, I do find I get a lot out of timeline infographics. I suppose a straight list of toys and their years would [...]"], "link": "http://www.infographicsblog.com/historys-hottest-holiday-toys-1903-2010-black-friday/", "bloglinks": {}, "links": {}, "blogtitle": "Infographics Blog"}, {"content": ["What It Shows This infographic presents numerous facts and figures about life insurance, with an Australian focus. Why It’s Good I know I complain about stats-driven infographics, but it’s nice to see one with some decent and original artwork. Usually it’s lame vector cutouts and crappy pie charts. Ok, so there are some pie charts [...]"], "link": "http://www.infographicsblog.com/the-game-of-life-lifebroker/", "bloglinks": {}, "links": {}, "blogtitle": "Infographics Blog"}, {"content": ["What It Shows This interactive infographic lets you visually explore race, ethnicity, income, home value, and education level – census data, basically – across block of every city in the US. Seriously. Color-coded for easy big picture, mouse over a given block for its data. Why It’s Good I love this infographic. It’s so so [...]"], "link": "http://www.infographicsblog.com/mapping-america-matthew-block-shan-carter-alan-mclean/", "bloglinks": {}, "links": {}, "blogtitle": "Infographics Blog"}]