[{"blogurl": "http://www.infographicsshowcase.com\n", "blogroll": [], "title": "Infographics Showcase"}, {"content": ["With the stability of our economy being unpredictable, particularly since the downfall of the Global Financial Crisis, it comes as some relief that Australian families will now benefit from remarkable cuts in home loan interest rates. In the past twelve months, the official interest rate issued by the Reserve Bank of Australia (RBA) has being cut by a drastic 150 basis points, helping to renew the faith of home owners Australia wide. While this news comes as a positive turn of events for many Australians, what exactly does it mean for home owners? \n Basing calculations on an average Australian mortgage of $300, 000 home owners will have the opportunity to save $50 per month, with each 25 point decrease, an enormous help for many Australian families. This $50 per month saving, however, will only be received by home owners whose lenders pass on the full extent of the interest rate cut. \nMany reputable financial institutions and debt solutions companies are recommending that home owners do not pocket the savings, but continue to pay off their mortgage as they are currently doing so. While this may sound like an odd piece of advice, it is calculated that those who choose to continue their regular payments could be eligible to save more than $100, 000 in interest payments and 8 years off their loan term. \n If you are unsure of how the RBA interest rate cut will affect your family, it is a smart decision to talk to a debt solutions specialist. The team at Fox Symes are leading experts in the finance industry and can provide assistance in making the right decisions for your future. \n \n Infographic Review \n Infographic Design: B+ \n \n \n Infographic Information: B \n Related Infographics: Australian Bank Notes Infographic The Australian bank notes are a little different that most ... Recession Statistics for UK Families \n\nFamilies around the UK feel financially strained as unemployment and ... Accounting Salaries Statistics Infographic \n\nFinance and Accounting jobs can be some of the hardest ... Choose Your Own Savings Adventure Infographic \n\nIt's a treasure map!  It's a choose-your-own adventure!  It's a ... How to Save with Mortgage Rates \nScorecard\nDesign:  A-\n\nA colorful and visually appealing infographic that takes a ..."], "link": "http://www.infographicsshowcase.com/what-do-interest-rate-cuts-mean-for-australian-families/", "bloglinks": {}, "links": {"http://www.com.au/": 1, "http://www.infographicsshowcase.com/": 6}, "blogtitle": "Infographics Showcase"}, {"content": ["We all dream about the day we can retire and travel the world to some of the best places. This infographic list the top 10 places you should retire to when you finally get out away from the daily grind. \n  \n Infographic Review \n Infographic Design: A \n \n The design for this infographic is great with the use of pictures and big writing that makes the information standout. I like that each place is shown in an actual image that represents that place. They are numbered so that readers can follow the list. I like that they are separate from each other in their own little section with different fonts and backgrounds. \n Infographic Information: B+ \n The information may seem simple but it clearly gives a description of each place and why it is nice to retire there. I was surprised by some of the places but I know that many people would enjoy these exotic places. I think that this may not have been the most informative infographic but the infographic gave the reader exactly what the title said it offered. \n Infographic provided by Castle Cover \n Related Infographics: 5 Ways On How To Save For Retirement We all know that we should be saving towards our ... Hiking The USA The USA has some of the most scenic places in ... Hotel Room With No Bed Bugs Moxie Pest Control Services at www.moxiepestcontrol.com has a 7 easy step guide ... Work Place Fatality Data There are many jobs that have a high risk involved ... Gymkhana Viral Phenomenon \n\nGymkhana is a new viral phenomenon where drivers skillfully drive ..."], "link": "http://www.infographicsshowcase.com/top-10-places-to-retire/", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://www.infographicsshowcase.com/": 6}, "blogtitle": "Infographics Showcase"}, {"content": ["Vehicle Theft can be a serious problem in many areas of the Unite States. This hot spots by miami locksmith infographic breaks down the areas of the country that are the worst for vehicle theft and gives some advice on how to protect your vehicle. \n  \n Infographic Review \n Infographic Design: C \n \n The title for this infographic is long and not bold enough to stand out to readers. It looks like the Infographic just starts off with a sentence. I would have chosen a shorter title and then put a subtitle underneath if it was necessary. I like the black and grey colors because they give the infographic a sleek car feel. The graphs are good and display the information in a unique and fun way. \n Infographic Information: B \n The information actually gives good data that readers will find interesting. I like the breakdown of the actual number s of auto thefts. I like the last section because it tells readers exactly what they should do to protect themselves from car theft. I think that section is the most important part of the infographic. \n Infographic Provided by Miami Locksmith  \n Related Infographics: Shoplifting and Employee Theft Infographic Many companies have to be careful when they are hiring ... Employee Deception & Theft – Remote Asset Management Infographic \n10 Things Your Employees Might be Getting Away With\n\n\tFraudulent overtime ... Employee Theft Statistics Infographic While office theft by employees has been a problem since ... Identity Theft Facts and Figures \n\nThis gorgeous graphic, provided by blog.kgbpeople.com should give you a ... What Impacts Your Car Insurance Premium? \n\nWow, is there a lot of information on this infographic. ..."], "link": "http://www.infographicsshowcase.com/vehicle-theft-infographic/", "bloglinks": {}, "links": {"http://locksmith-in-miami.net/": 2, "http://www.infographicsshowcase.com/": 6}, "blogtitle": "Infographics Showcase"}, {"content": ["We all know that we should be saving towards our retirements, however, most of us don’t know how or where to begin. Online Trading Academy’s guide on 5 ways to begin your retirement savings, shows you how and where you can start your savings with these simple tips. \n  \n Infographic Review \n Infographic Design: B \n \n I think the design of this infographic works well to create a fun an interesting way to read the infographic.  I like that each of the 5 ways are divided into their own sections with an image that matches the overall theme of the infographic. I like the divider between sections making sure that each section is separate from the other so the information cannot be confused. \n Infographic Information: C+ \n The information gives god general advice for ways to save for retirement but no real detailed information. There are no facts or statistics to back up the advice and I just feel like there could have been a lot more information put into the infographic. \n Graphic by Online Trading Academy \n Related Infographics: Top 10 Places to Retire We all dream about the day we can retire and ... Feed The Pig – Savings Strategies for 25-34 Year Olds \n\nAny time is a good time to start saving.  Obviously, ... How to Save Money for Your Pot of Gold \nScorecard\nDesign: C+\n\nThe type is hard to read, even at the ... Energy Saving Tips Infographic \n\nThis is pretty.  And complicated.  At first.  And then you ... Recycle Moving Boxes and Save Trees Infographic \n\nA green infographic that shows you how recycling your moving ..."], "link": "http://www.infographicsshowcase.com/5-ways-on-how-to-save-for-retirement/", "bloglinks": {}, "links": {"http://www.tradingacademy.com/": 2, "http://www.infographicsshowcase.com/": 5}, "blogtitle": "Infographics Showcase"}, {"content": ["Here at MommyRelief.com, we know how difficult it can be to get your newborn on a sleep schedule. With our strategy guide, we can assist you with your sleep training, so you and your new little one can rest better! \n \n Infographic Review \n Infographic Design: B \n \n The design for this infographic has a nice, sweet and colorful look to it that many women will appreciate. The title clearly states what the information is about and gives a sort subtitle. The colors work well together and I like the idea of the tree and the leaves. I think having the information broken down into numbered lists makes the information easier for the reader to follow. \n Infographic Information: C \n The information matches perfectly what the title says and gives great advice on what to try and do to sleep train a baby. The only think I would have liked to have seen was a little more statistics or facts about how this has worked and affected other parents. Also a little more detailed instruction about each step would have made sure that parents can clearly understand. \n Sleep Training Graphic from Mommy Relief \n Related Infographics: Best Guide to Interval Training Infographic \n\nThis infographic isn't kidding, this really is a complete guide ... Are You Likely to Suffer from Insomnia? \nVia: Canada Drug Center\n\nDo you struggle for hrs to get ... Get a Better Night’s Sleep with this Mattress Infographic \n\nHumans share a lot of activities, but there is nothing ... Super Mums \n\nHere is the blurb from the creator.  I liked it, ... Early Childhood Development Infographic I know that as a child grows there are certain ..."], "link": "http://www.infographicsshowcase.com/5-strategies-assisting-you-with-sleep-training-your-baby/", "bloglinks": {}, "links": {"http://www.mommyrelief.com": 1, "http://www.mommyrelief.com/": 1, "http://www.infographicsshowcase.com/": 5}, "blogtitle": "Infographics Showcase"}, {"content": ["Halloween is less than week away and many children are ready to get dressed up and go out trick or treating. This infographic breaks down all of the different numbers about Halloween including how many Americans participate and just how much we spend on all that candy. \n  \n Infographic Review \n Infographic Design: B \n \n The design for this infographic definitely has the Halloween feel with images familiar that are familiar at Halloween time. I like that there are different scenes that break up the infographic and showcase different information. The title is big and right from the beginning readers will know what the infographic is about. The font that some of the text is in has a creepy scary look to it as well which again adds to the Halloween theme. \n Infographic Information: B \n The information was interesting and shocking to see. I think the biggest shock to read was how much Americans will spend on Halloween. I also liked the chart that broke down where people get costumes ideas from. The majority got them from the stores while my favorite place to get a costume idea is from pop culture. I was surprised to see such a low number of Americans actually take their kids trick or treating. I thought this number would have been higher as it seems so many children enjoy trick or treating. I think overall the information is interesting to read about. \n Thanks to Traidcraft Fairtrade \n Related Infographics: Halloween: Dress up Your Eyes For centuries, people have claimed that the eyes are windows ... Halloween Facts Infographic \n\nWhat a very cool infographic we have here, Dotty. I'm ... A Laser-Carved Pumpkin Infographic \n\n\nCan you say \"A\" for originality? Scott Heimendinger, a ... Snow White vs. The Evil Queen…Who is the Fairest of them all? \n\n\n\nThe story of Snow White has been around for years ... Funeral Costs Infographic \n\nNot a happy topic, but something everyone needs to know ..."], "link": "http://www.infographicsshowcase.com/halloween-by-the-numbers/", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://www.infographicsshowcase.com/": 6}, "blogtitle": "Infographics Showcase"}, {"content": ["This payday loans infographic breaks down these loans how people perceive them. Some people use these payday loan resources as a way to make ends meet until they get paid. Others see it as a vicious cycle that traps people in debt. This infographic looks at who hates payday loans the most and why. \n  \n Infographic Review \n Infographic Design: C \n \n The first thing I notice about the design is that there are very few images and lot of numbers. When I see something that has a lot of numbers I am already not willing to read it. It is important to create an infographic that will attract people to read it. Unfortunately this infographic does not do that. There are just too many numbers and statistics that overpower the infographic. \n Infographic Information: B \n The information is interesting because it shares some thoughts on payday loans and why people either love them or hate them. It was interesting to see the difference of opinions between borrowers and non-borrowers. I like how they do show the demographic information about payday loans because it shows the people who are using it really do appreciate and need it. The main people who “hate” against payday loans are the ones who do not use them. The main point I think the infographic shares is that if you are going to use a payday loan you need to be educated about them. \n Related Infographics: Financial Aid Roadmap Infographic \n\nAh Financial Aid. At first, it seems like a gift ... Debt Problems in the U.K.: Facts and Figures \n\nThis infographic, supplied by MoneyDebtandCredit.com examines the debt problems plaguing ... Housing & Household Sizing Statistics \nInfographic Scorecard\nInfographic Design: B-\n\nWhile the design in this infographic isn't ... Appliances – The Vicious Cycle \n\nMost people have been in a shaky financial boat for ... Banks vs Credit Unions | Pros and Cons and Which is Better Infographic \n\nBank or Credit Union? Which is right for you, considering ..."], "link": "http://www.infographicsshowcase.com/payday-loans-infographic/", "bloglinks": {}, "links": {"http://www.co.uk/": 2, "http://www.infographicsshowcase.com/": 6}, "blogtitle": "Infographics Showcase"}, {"content": ["Many Americans are spending more and more time outside during the warmers months so it is important to have a comfortable outdoor living area. One trendy landscaping feature that many people are getting for their outdoor areas, are Pergolas .  This infographic takes a look at pergolas from how they are made and the best materials to choose as well as the many different types of pergolas. Check out this infographic if you are looking for a new and trendy feature to add to your outdoor living area. \n  \n Infographic Review \n Infographic Design: A \n \n I really think the design for this infographic works perfectly for the information. The tan and white background has an outdoors feel and the pergola is clearly shown at the top of the infographic. The title clearly communicates what the infographic is about. All of the subsections are divided perfectly allowing the information to be taken in bit by bit. All of the images that are used are appropriate and I especially like the image at the very bottom which shows all of the different plants that can grow on a pergola. I like that the images slowly take on color as the reader approached the bottom and then at the bottom the whole image is in color. \n Infographic Information: A \n The information gives a clear understanding of what a pergola is and the many styles that are available. I like the facts about pergolas because it breaks up the information with something fun.  The benefits of a building a pergola I think is the most important part because this section would convince the reader one way or the other about getting a pergola for their home. Overall, the infographic has great information that will help someone who is looking for thing to put in their outdoor living area. \n Infographic provided by Rick’s Fencing . \n Related Infographics: How To Customize Your Privacy Fence Many people use privacy fences in their yards to so ... Top House Plan Styles By State We took a look at the most sought-after architectural styles ... Greatest Explorers of the Last 100 Years \n\nFrom the biggest names in worldwide exploration to their most ... DIY Deck Inspection \n\nNow that the warm months are upon us, it's time ... Reasons for Buying a Condominium Infographic \n\nThis infographic is appealing.  Like cake or candy.  The pictures ..."], "link": "http://www.infographicsshowcase.com/pergolas-outdoor-living-in-style/", "bloglinks": {}, "links": {"http://www.ricksfencing.com/": 2, "http://www.infographicsshowcase.com/": 6}, "blogtitle": "Infographics Showcase"}, {"content": ["What would the world be like without magnets? This seems like a simple question but as this infographic shows magnets make up a major part of our world. Read this infographic to see just how much a life without magnets would affect you. \n  \n Infographic Review \n Infographic Design: B \n \n I think the design for this infographic is nice and clean looking. I like the giant title because the first word you see is Magnets which obviously tells the reader what the infographic is about. The charts and graphs display the information appropriately and in a fun way. I like the red and blue colors on the beige background. All of the images work well with the information and help to give the reader a better understanding. \n Infographic Information: A \n I found the information to be highly interesting. It is amazing to think of all the things we have and depend on that are made up of magnets. The biggest one being electricity which pretty much runs everything in our lives. I think it is quite scary to think of a world without electricity now that we have become so accustomed to having it. I think the information really showed how important magnets are in our world. \n Infographic provided by Magnets.com, Inc. \n Related Infographics: You Know You’ve Made It When… \n\nThere are some things in this world that only the ... FIFA World Cup Infographic \n\nWith the Football (or is it Futbol?) World Cup underway, ... World Airport Facts & Figures Infographic \n\nMost people don't enjoy flying, not just for the perceived ... Top World Football Earners Infographic This infographic sports a very detailed and large collection of ... Infographic Facts about Struggling Countries around the World \n\nThis dazzling infographic (from a design standpoint, certainly not from ..."], "link": "http://www.infographicsshowcase.com/a-world-without-magnets/", "bloglinks": {}, "links": {"http://www.magnets.com/": 1, "http://www.infographicsshowcase.com/": 6}, "blogtitle": "Infographics Showcase"}, {"content": ["This road congestion infographic breaks down the cost of traffic jams and how much they are really costing us. \n  \n Infographic Review \n Infographic Design: B \n \n I think the design for this infographic is organized very well with different sections clearly labeled. I think the information is broken down so that readers are able to follow it better. I like the creative use of charts and graphs to display the information. The colors go well together with the simple background and blue and orange text colors. I appreciate the title being so large and then having a subtitle to sum up what the whole thing is about. \n Infographic Information: B+ \n The information was interesting and thought-provoking for anyone who drives or operates a car. We may not think how much time we are wasting sitting in traffic. I also like that the information gave reasons for traffic so that readers can hopefully keep them in mind to avoid. The facts on the cost of congestion were amazing and frankly shocking to think about. I really found this information to be a great read. \n Infographic provided by Nationwide Insurance \n Related Infographics: Zodiac Sign vs. Horoscope Sign Infographic \n\nZodiac signs are a way for people to understand themselves ... Safe Road to Santa’s Workshop – Road Sign Safety \n\nNo matter what time of year, it's important to follow ... The 10 Most Beautifully Challenging Highways in America America has some of the best roads to take when ... Stages of Pregnancy A woman is pregnant for nine months, a long time ... Most Expensive Road Cars Infographic \n\nThis infographic explores the fast lives of the rich and ..."], "link": "http://www.infographicsshowcase.com/the-cost-of-traffic-congestion/", "bloglinks": {}, "links": {"http://www.nationwide.com/": 2, "http://www.infographicsshowcase.com/": 6}, "blogtitle": "Infographics Showcase"}]