[{"blogurl": "http://InfographicDesign.org\n", "blogroll": [], "title": "Infographic Design"}, {"content": ["Social media is defined as primarily Internet- and mobile-based tools for sharing and discussing information among human beings.[1] The term most often refers to activities that integrate technology, telecommunications and social interaction, and the construction of words, pictures, videos and audio. ( source ) \n Here are a few of our favorite infographics focused on Social Media: \n \n How Executives Are Using Social Media \n  \n Facebook Fact Book \n \n The Current State of Social Networks \n \n Youtube – The Biggest Shift Since the Industrial Revolution \n \n Who Participates Online?"], "link": "http://www.infographicdesign.org/5-beautiful-social-media-infographics/", "bloglinks": {}, "links": {"http://www.infographicdesign.org/": 2, "http://images.businessweek.com/": 1, "http://www.flickr.com/": 1, "http://www.google.com/": 1, "http://www.ignitesocialmedia.com/": 1}, "blogtitle": "Infographic Design"}, {"content": ["Infographics are visual representations of information, data or knowledge. They can be fun, comedic, informational and emotional. One thing is for sure; they are popular. Over the last few years, infographics have started to show up frequently in online publications, blogs and corporate websites and look to only continue to grow in production. Many times though, infographic creators fail to take advantage of another equally important benefit for creating infographics: SEO link value. \n What Exactly Is This Stuff Called SEO Link Value? \nFor those that are familiar with online marketing and the value of links, you can go ahead and skip this part. For those that aren’t, welcome to the whole new world of search engine optimization and links. For search engines, links are the streets between pages. Using link analysis, the engines can discover how pages are related to other pages and in what ways. The engines themselves have significantly refined the use of link data, and incredibly sophisticated algorithms create nuanced evaluations of site and pages based on this information. These sophisticated link based algorithms control the search engine ranking order system. According to most SEO experts and all studies on the topic, links are the number one most important factor in search engine optimization. That is, links based on the following: \n \n Total Link Quantity (How many total links you have) – The majority of search engine algorithms are based on links. Each link essentially counts as a vote, with some votes carrying more weight than others based on the strength of the linker \n Linking Sources (Who is linking to you and how credible are those sources) – Think of this as search engines looking for references, sources, citations, etc. as trust factors on the web, just as research papers need credentials to be taken seriously. Diversity of the people linking to you and their various credibilities determines your credibility online. For example, 10 links from 10 sites is far more valuable than 10 links from only 1 site as diversity of linking sources is a critical ranking factor. \n Anchor text (Keywords used in the actual link text from other sources that often describe the destination, i.e. your site) – Anchor text is the actual text used in the linked part of a hyperlink. It’s usually used to give the visitor relatively descriptive or summarized information about the link destination. A search engine uses this text as the #1 most important SEO factor to help determine what the link destination page is about and associates the link anchor text with SEO value accumulated on the page. \n \n Back to Point About Infographics \n Getting back on topic . Infographics are great for SEO as they result in all the most desirable benefits of any SEO campaign: links. Most times, when you create an infographic online it gets spread across the web from a facebook share to a tweet to a mention in a blog post and on and on. At each instance, a link is created, directed back to the infographic and your site, prime for search engines to discover and associate more value to your site. And if you have thought about SEO and link value before or while you were creating your infographic and integrated it into the final product, you just earned hundred to thousands of new links and prime SEO value towards your site. What are the best tips and techniques for integrating SEO into infographics for link building success, you ask? \n 5 SEO Optimization Tips for Infographics \n \n Use Target SEO Keywords in the Infographic Title - Chances are when you share your infographic across the web, the sites that link back to you will use the name of the infographic in the link anchortext. Instead of just a catchy title, add in a target keyword you’d like to rank for and get some added SEO value. Having trouble creating ideas for a specific industry? Attach your target keyword onto a popular topic and run with it. LIMS or laboratory information management systems can be made interesting by the likes of CSI tv shows and forensic data made interesting. Subscription billing or recurring payments are dry by itself, but combined with interesting data and beautiful user centered design , it has potential. \n Add an Easy-to-Copy Embed code on the Landing Page - Make it easy for people to use your newly created infographic image the way you wanted them to. An embed code allows a visitor to copy the HTML code needed to add the image to their own site. Be sure to include a keyword rich link back to your site as part of your copyright distribution. \n Add large, easy-to-see Social and Share buttons on the Landing Page – This is a must. Once a visitor sees your infographic they won’t have the patience to then go spread it across their social profiles. Add one-click share buttons for all the major social sites for maximum promotion. \n Submit to Free Social News and Bookmarking Sites - This is commonly neglected as most people don’t know where or how to submit to external sites. Most of these sites are user submitted and all it takes is about 1 min to actually submit. Can’t think of any good sites? Start with this pretty good list . \n Promote the Infographic Through Your Personal and Company Distribution Channel - The most often forgot and neglected aspect of infographics: self promotion. What better way to start promoting your infographic then by posting a link from your blog, Twitter, Facebook or more? Not only do you create the initial burst of SEO value through a small addition of links from social media sites, you also promote it to those most likely to view and co-promote your infographic: colleagues, friends and family."], "link": "http://www.infographicdesign.org/using-infographics-for-seo-link-building-infographics/", "bloglinks": {}, "links": {"http://www.google.com/": 1, "http://www.lissettearias.com": 1}, "blogtitle": "Infographic Design"}]