[{"blogurl": "http://infographicpics.com\n", "blogroll": [], "title": "Infographic Pics"}, {"content": ["( via ) \n In this informative and traditionally themed infographic, London-based infographic design agency infogr8 dissect the QS World University Rankings 2012. The rankings are decided on classifications including size, focus and research intensity, and this data visualization looks at the top 10 in the list of 700 worldwide institutions, the rise of the Massachusetts Institute of Technology, and where around the world you can find the top 100 on the list."], "link": "http://infographicpics.com/world-university-rankings-2012/?utm_source=rss&utm_medium=rss&utm_campaign=world-university-rankings-2012", "bloglinks": {}, "links": {"http://www.infogr8.com/": 1, "http://infographicpics.com/": 1}, "blogtitle": "Infographic Pics"}, {"content": ["( Via ) \n By law, certain levels of rodent and insect filth (the legal term!) are actually permitted in food. Gross, eh? Well, maybe not. Infographic design agency infogr8 have created an illuminating and shocking visualization which reveals just what you may be eating without realizing it…"], "link": "http://infographicpics.com/theres-what-in-that/?utm_source=rss&utm_medium=rss&utm_campaign=theres-what-in-that", "bloglinks": {}, "links": {"http://www.infogr8.com/": 1, "http://infographicpics.com/": 1}, "blogtitle": "Infographic Pics"}, {"content": ["( via ) \n With Microsoft Office 2013 launching soon (see below), let’s go back in time \nto look at the Microsoft Office story so far. \n When launched in 1990 it was called “The Microsoft Office”. \n Which version was your favourite? Do you prefer an old faithful?"], "link": "http://infographicpics.com/the-history-of-microsoft-office/?utm_source=rss&utm_medium=rss&utm_campaign=the-history-of-microsoft-office", "bloglinks": {}, "links": {"http://www.microsofttraining.net/": 1, "http://infographicpics.com/": 1}, "blogtitle": "Infographic Pics"}, {"content": ["( via ) \n Domestic energy plays an important role in the overall energy consumption. It also holds a major share in the use of energy sources that exist. Starting from wood, kerosene, solid fuel, petroleum and natural gas to electricity, we use different kinds of energy sources to run the many appliances and also to meet the growing energy needs of our home."], "link": "http://infographicpics.com/life-recycled-eco-home-facts/?utm_source=rss&utm_medium=rss&utm_campaign=life-recycled-eco-home-facts", "bloglinks": {}, "links": {"http://www.ecologistnews.com/": 1, "http://infographicpics.com/": 1}, "blogtitle": "Infographic Pics"}, {"content": ["( via ) \n Before movies such as The Hangover, 21, and Ocean’s Thirteen, there were the classics such as Viva Las Vegas, Casino, and the original Ocean’s Eleven. Before the phrase “What happens in Las Vegas..” there were characters such as Wayne Newton, Elvis Presley, and the Rat Pack who depicted the rise of a cultural movement starting as early as the 1920′s and the birth of an entire city, the legendary Las Vegas, Nevada. Before the decadence and opulence of the strip there was the glitz and the glamour of Fremont Street. Before Las Vegas hotels, there were the casinos. Find out more about how the city of Las Vegas came to fruition, in the Legendary History of Las Vegas Infographic."], "link": "http://infographicpics.com/legendary-history-of-las-vegas/?utm_source=rss&utm_medium=rss&utm_campaign=legendary-history-of-las-vegas", "bloglinks": {}, "links": {"http://www.palms.com/": 1, "http://infographicpics.com/": 1}, "blogtitle": "Infographic Pics"}, {"content": ["( via ) \n As the popularity of social media continues to accelerate, it’s no surprise that famous faces and well-known brands are increasingly using these platforms to reach the people responsible for their fame. The power of these social media channels allows actors, comedians, athletes, and companies to interact with their followers, yet the casual comfort of these conversations can sometimes result in social slip-ups. MDG Advertising developed the following infographic that shows how the improper use of social media has caused some big names to gain unfavorable attention, but has also allowed them to quickly win back their faithful fans."], "link": "http://infographicpics.com/social-media-blunders/?utm_source=rss&utm_medium=rss&utm_campaign=social-media-blunders", "bloglinks": {}, "links": {"http://www.mdgadvertising.com/blog": 1, "http://infographicpics.com/": 1}, "blogtitle": "Infographic Pics"}, {"content": ["( via ) \n Do you Know that the United States has one of the highest rates of Drunk Driving related accidents and deaths in the world. When people are going to Learn?? Here is the List of Countries and respective Drunk Driving Laws provided by www.Idrivesafely.com"], "link": "http://infographicpics.com/international-drunk-driving-laws/?utm_source=rss&utm_medium=rss&utm_campaign=international-drunk-driving-laws", "bloglinks": {}, "links": {"http://expresslane.idrivesafely.com/": 1, "http://infographicpics.com/": 1}, "blogtitle": "Infographic Pics"}, {"content": ["( via ) \n Nursing is a profession wrought with a turbulent history. Through struggles with sexism, racism, deplorable healthcare systems and conditions and much more, nursing has evolved not simply because time has progressed, but because of several notable nurses who made an impression on the medical world. Learn more about these pioneers of nursing."], "link": "http://infographicpics.com/15-people-who-had-the-biggest-impact-on-nursing/?utm_source=rss&utm_medium=rss&utm_campaign=15-people-who-had-the-biggest-impact-on-nursing", "bloglinks": {}, "links": {"http://www.best-rn-to-bsn.com/": 1, "http://infographicpics.com/": 1}, "blogtitle": "Infographic Pics"}, {"content": ["( via ) \n With a major election approaching in November 2012, same-sex marriage is front and center in the national political spotlight. Learn more about the opposing perspectives on same-sex marriage, from political leaders to the average American voter."], "link": "http://infographicpics.com/politics-and-same-sex-marriage-in-2012/?utm_source=rss&utm_medium=rss&utm_campaign=politics-and-same-sex-marriage-in-2012", "bloglinks": {}, "links": {"http://www.marriageandfamilycounselingdegrees.com/": 1, "http://infographicpics.com/": 1}, "blogtitle": "Infographic Pics"}, {"content": ["( via ) \n The Bureau of Labor Statistics estimates the US will need over a half million more nurses and nursing care by 2018. But where is this need? Are some nursing specialties in greater demand than others?"], "link": "http://infographicpics.com/high-demand-vs-low-demand-nursing/?utm_source=rss&utm_medium=rss&utm_campaign=high-demand-vs-low-demand-nursing", "bloglinks": {}, "links": {"http://www.best-bsn-programs.com/": 1, "http://infographicpics.com/": 1}, "blogtitle": "Infographic Pics"}]