[{"blogurl": "http://ongenes.blogspot.com\n", "blogroll": ["\n"], "title": "Information on Genes"}, {"content": ["If you get half your genes from your mum and the other half from your dad why don't you have half your mums feature's and half of your dad's?   There is something wonderful about this simple question, and all of genetics could be used to answer it. Three points seem to be worth making.   1) Dominance . If a specific trait is conferred by a dominant allele and both parents are heterozygous, then their child can lack a trait that they share.   2) Features are not genes . Some traits (features) are affected by many genes, and many genes affect multiple traits.   3) Many traits are complex . Geneticists distinguish between simple (Mendelian) traits and complex traits. Traits can show the following sorts of genetic complexity:  epistasis (where the effect of one gene depends on other genes)  incomplete penetrance (where a specific genotype doesn't always have the usual effect)  polygenic inheritance (where multiple genes affect the trait)  genetic heterogeneity (where different genes cause the same trait in different families or populations)  phenocopy (when traits that often have a genetic basis arise without a genetic basis)   Explaining all of this in detail would require a complete course in genetics!"], "link": "http://ongenes.blogspot.com/feeds/23879927165065976/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Information on Genes"}, {"content": ["I did a post to my blog ( here ) about hybrid sunfish and wanted to ask the genetic experts for some clarification. As I understand it most sunfish can hybridize. The offspring are fertile but mostly male. What I don’t understand it why I seldom see hybrid sunfish in the wild. Is the success rate lower in producing hybrid offspring? Do fish tend to avoid mating with hybrids? Maybe this isn’t a question dealing with genetics as much as fish behavior. Perhaps you have some insights or could point me in the right direction.   I’m also curious what happens when hybrids do mate. Will some of the offspring revert back to “purer” sunfish? If two Bluegill/Sunfish hybrids mate what would the expected offspring be?   There is a lot known about hybrids in general, but I don't know anything about sunfish in particular. Comments from anyone who does are welcome (but you can't be anonymous)."], "link": "http://www.barblessfishing.com/hybrid-sunfish/", "bloglinks": {}, "links": {"http://www.barblessfishing.com/": 1}, "blogtitle": "Information on Genes"}, {"content": ["I received the following question, which I think is excellent.   Is there any software for plotting possible/probable relationships to MRCA [most recent common ancestor] for groups of 10-1,000 cousin matches suggested by various services, e.g. 23andMe, GEDmatch, FTDNA?      It seems to me that standard genealogical services are too rigid. Once you lay down a line of possible 3 rd cousins and another for 4 th cousins etc, linking them to various MRCAs who are perhaps 5 or 6 away becomes a bit of a nightmare.    The cousin matches referred to are typically based on shared segments longer than some threshold (typically 5 cM.) that appear to be identical by descent (IBD). In my case, 23andMe identifies 835 relatives but I know how I am related to only two (my mother and my sister).  I will contact scientists I know who work in this field to see if there is any software that is available to, and usable by, the general (informed, curious and sophisticated) public.  If you know of software that might be useful and want to see some of this data, I can send examples from 23andMe. It lists all IBD regions longer than the threshold that are shared with the user. Someone using this tool for genealogy will typically have such data for a small number of family members, and the information about most \"cousins\" is typically minimal. The person who posed this question can probably files to anyone who wants to see what they look like."], "link": "http://ongenes.blogspot.com/feeds/8743972801765229996/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Information on Genes"}, {"content": ["23andMe co-founder Linda Avey commented on a previous post (\" Identifying half-siblings by genetic tests \"), pointing out that 23andMe provides images that illustrate full-siblings and half-siblings. In fact, they will represent any relationship pictorially. If you have an account there, you can compare your genome to another, with regions of half-identity and full-identity marked differently.   This pair of images shows regions of half-identity (light blue), complete identity (black)and no identity (white). The comparison on the left shows two women who share a father but have different mothers. Since they both have their father's complete X chromosome, they are half-identical across this entire chromosome. The rest of the genome is an even mix of regions that are half identical and regions that show no identity. On the right, you see a 1:2:1 ratio of no identity, half-identity and full identity. The most telling difference between these comparisons is the complete lack of regions with full identity when half-siblings are compared. If you subscribe to 23andMe, you can make similar images between any pair of shared genomes using their family inheritance genome view tool, at https://www.23andme.com/you/inheritance/ .  Andrea Badger, who sent me these specific images, also collected data on the fraction of the genome identical by descent when different types of relative are compared. She found that full siblings shared between 41% and 55% of their genomes (16 comparisons) while half siblings shared between 21.7 and 31.4% of their genomes (four comparisons). The expected fractions are 50% and 25%, but there is some spread.  This is why having lots of markers is important. When the whole genome is analyzed, the difference is clear. With a smaller number of markers, statistical fluctuations are more likely to confuse the issue. 23andMe now uses over 1 million markers. Family Tree DNA uses fewer markers and charges more, but they use plenty of markers (hundreds of thousands) and have a greater focus on genealogy. I am aware of other services that charge almost as much but test only a few markers (less than 100). If you are shopping for a test, you can find a lot of information at dna-forums .  Thanks, Andrea!"], "link": "http://23andme.com", "bloglinks": {}, "links": {"https://www.23andme.com/": 1, "http://dna-forums.org/": 1, "http://ongenes.blogspot.com/": 1, "http://www.familytreedna.com/": 1, "http://ongenes.org/": 1}, "blogtitle": "Information on Genes"}, {"content": ["I have received a question about human cytogenetics (chromosome or karyotype analysis). I am doing a project in detecting the numerical abnormalities in chromosomes. Is it possible to get the microscopic chromosome images without any overlaps? ... mail me your suggestions. I'm mailing you a sample image. The chromosomes in this image are overlapped and have crossovers. Is it possible to have the microscopic image without this type of crossovers. When I try to count the number of chromosomes the chromosomes that have crossovers and overlaps are counted as one. And my research concept is not mainly on this overlaps. So I'm trying for images without overlaps and crossovers. My concept is based on classification of the chromosomes so I need good well spread image I have no training in cytogenetics per se , so I invite replies from those with such training (either academic human cytogeneticists or clinical laboratory specialists in cytogenetics (CLSp(CG)). As usual, answers should be provided in the form of comments from identified people with relevant expertise. It seems to me that there are two questions here. One concerns the technical issue of whether it is possible to routinely obtain spreads without overlapping chromosomes. The other is whether there are already standard methods for dealing with this problem in the image analysis."], "link": "http://www.agt-info.org/", "bloglinks": {}, "links": {"http://1.blogspot.com/": 1}, "blogtitle": "Information on Genes"}, {"content": ["I have received four related questions from different people. They all concern the issue of half-siblings, and the utility of genetic tests for establishing such a relationship. 1) Is it absolutely possible to tell if two females have the same father? These supposedly half sisters do not share the same mother. The father in question is deceased. Will our DNA reveal, certainly, that we share the same father? How do we find a reliable U.S. company to do this for us? Information from a company like 23andme will provide you with enough markers to be completely sure. I'm not entirely sure how their interface works, so I can't tell you how easy the interpretation will be, but there will be enough data for you to be sure, and you will be able to get help with the interpretation. The reason is that two women who share a father will have an entire X chromosome in common. That is extremely unlikely to occur otherwise. 2) My sister donated a kidney to me. We were told that we matched 5 out of 6 genetic markers. From that information, is it possible to make an \"educated guess\" as to whether we are more likely to be full or half sisters? We believed we were half-sisters but some interesting coincidences lead me to believe that we may be full-sisters. The six markers used for this test are not conclusive. As you know, even half-siblings can be a perfect match. A conclusive test would require many markers. Fortunately, companies like 23andme and Navigenetics provide information about many markers (about 450,000), and those tests could tell you definitively. If you are full siblings, then there will be parts of the genome (about one-fourth of the total) where you are identical for long stretches. That would be extremely unlikely if you are only half siblings. However, a small number of markers (less than 200 or so) would make it harder to make a definitive distinction between being half siblings and being full siblings. Six is definitely too few. 3) I wonder if you could help me. In trying to find my biological father, I came up with what could be two half siblings. The parents in both cases are deceased. I have been given a price of $500 for the three of us to test by saliva. Do you think without any parents, this could prove half siblings or would it be a waste of money? You will share one of your two alleles with a half-sibling at about half of the sites in your genome. So, the answer is that with enough markers (thousands) the answer will be absolutely clear. The source of DNA (saliva, cheek swab, blood) does not matter much. 23andme will do about 450,000 markers for $400 (per person) and give you lots of additional information. The technology is pretty standard so other firms are probably OK. Just make sure that there are many markers (more than 100,000) and that you get access to the data (not just their interpretation of the data). Once you get your results you'll want to look for large regions of the genome where you and the putative half-sibling share markers. Of course, your putative half-siblings will have to agree to this analysis. 4) I heard that a recent study proved that men don't have half children but any children by the same man are full brothers and sisters irregardless of all different birth mothers. Is there a genetic truth to this?   Two children with the same father and different mothers are referred to as half - siblings . What you are referring to is almost certainly a legal or cultural distinction, not the sort of thing that can be proved by a study. -------------------------------------- As usual, I invite additional answers in the form of comments. We are looking for answers from people with some expertise, and you will be asked to log in so that we know who you are (no anonymous answers)."], "link": "http://ongenes.blogspot.com/feeds/2827290834795327563/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Information on Genes"}, {"content": ["Could you please recommend me a few sites on the internet, blogs, or books that's sort of like a beginner's guide to genetics? I would like to learn more about genetics, but I don't exactly know where to begin. One of the books I've read is great, it's called \"Genes and DNA\" by Charlotte K. Omoto and Paul F. Lurquin. I'm looking for something like that. But most of the other books at the library that I find seem too complicated, and I believe I should begin with the basic stuff first. Unfortunately, I am not extremely familiar with books of this sort. I provide a link to the Amazon.com reviews of \" A Beginner's Guide to Genetics and its Applications .\" Amazon recommends \" Genetics for Dummies \" and \" Abraham Lincoln's DNA and Other Adventures in Genetics \" as similar books. The latter sounds like an interesting read. I also try to recommend informative sites via my Gene Info web site. I'm posting the question here in the hope that a reader will have suggestions. Although it would be nice to hear from non-experts, I will stick to the policy that while questions can be anonymous, comments (answers) are moderated, and I will only approves comments from people who identify themselves."], "link": "http://www.amazon.com/Genes-DNA-Beginners-Genetics-Applications/product-reviews/0231130139/ref=dp_top_cm_cr_acr_txt", "bloglinks": {}, "links": {"http://www.amazon.com/": 3, "http://ongenes.org/": 1}, "blogtitle": "Information on Genes"}, {"content": ["Can you determine if three sisters have the same father by DNA testing of the three sisters? This is a question about the availability of genetic tests that distinguish full siblings (such as sisters with the same mother and father) from half siblings (such as sisters with the same mother but different fathers). Although full siblings, like parent-child pairs, share half of their alleles, the analysis is a bit trickier. Consider these examples: The numbers here represents the allelic state of one marker. Each child inherits one allele (one version of the marker) from each parent. In this example, Amy has inherited allele 1 from her father and allele 3 from her mother. Because children must share one allele with each of their parents it is relatively easy to rule out paternity. For example, P2 cannot be Brooke's father because he has completely different alleles from her (1 and 5 vs. 2 and 3). Unlike parents and their children, full siblings can have completely different alleles ( e.g. Amy and Casey). Since the question refers to three sisters, it would be possible to rule out all three having the same father ( e.g. sisters with genotype 1/3 (Amy), 2/3 (Brooke) and 5/3 (Dawn) cannot all be full sisters because there are three different alleles in combination with the 3, and a single parent can only contribute two possible alleles). However, this is not always the case, and it is even possible for half-sisters to have the same genotype at any one marker (e.g. Amy and Erin) because any two possible fathers could share one or two alleles by chance. Thus, distinguishing full-siblings from half-siblings comes down to statistics, and \"results\" are reported as probabilities. Since that is the case, the more markers the better. Many of the genetic testing services probably aren't using enough markers (but they do provide guidance as to how (un)reliable their result is). On the other hand, a full genotyping service, like 23andme , which uses thousands of markers, would provide a reliable result. So, the bottom line is yes, you can determine, with confidence, whether three sisters have the same father by testing the sisters . However, you need to use a lot of markers to do it, and most genetics testing companies probably don't use enough. If you're going to have the testing done, ask the testing service how many markers they use."], "link": "http://ongenes.blogspot.com/feeds/2581928249933676019/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "https://www.23andme.com/": 1}, "blogtitle": "Information on Genes"}, {"content": ["We are interested in studying gene expressions in living animals, by means of different in-vivo and in-vitro imaging techniques. We also plan to execute tests on living organisms by using Affymetrix or Navigenics or equivalent DNA microarray test chips, but we know that interpretation of such tests are closely related to the ability to execute reliable and effective reannotation vs. existing validated databases of identified genes. We know that services provided by Affymetrix often provide little informative annotation for most known genes (identified as \"transcribed locus\"), and we would like to know if anyone in the world can provide an effective reannotation service using our DNA microarray test files, i.e. by executing rigorous tests of our Affymetrix chip probeset sequences against all currently available transcript sequences in latest database releases. This is a question about gene annotation. I think it's really about how to attach a small bit of truly useful information to many genes in a list. The specific question seems to concern Affymetrix data files in particular. A list of standard sources for information about human genes follows (in most cases I provide a sample link to the page for CFTR). Entries in these databases are extensively linked to each other. OMIM , Online Mendelian Inheritance in Man. ( CFTR ) Entrez Gene , NCBI 's searchable database of genes from RefSeq genomes. ( CFTR ) GeneCards , a searchable, integrated database of human genes.( CFTR ) HGNC , HUGO gene nomenclature committee, ( CFTR ) Ensembl , genome databases for vertebrates and other eukaryotic species. ( CFTR )  Ensembl's BioMart tool may be one answer to this question). GeneWiki , Wikipedia's gene pages. ( CFTR ; HBB )"], "link": "http://ongenes.blogspot.com/feeds/5613220381419403197/comments/default", "bloglinks": {}, "links": {"http://www.ensembl.org/": 3, "http://www.genenames.org/": 2, "http://www.nih.gov/": 6, "http://en.wikipedia.org/": 3, "http://www.genecards.org/": 2, "http://www.hugo-international.org/": 1}, "blogtitle": "Information on Genes"}, {"content": ["What is the probability that locus is homozygous due to inbreeding after a given number of generations? The answer should be an equation expressing this probability as a function of the number of generations. This question was inspired by a recent review of mouse genetics ( Peters et al. 2007 . \"The mouse as a model for human biology: a resource guide for complex trait analysis\" Nature Reviews Genetics 8 , 58-69. doi:10.1038/nrg2025), which states, without qualification, that \"Inbred mouse strains are derived from a single parental mating pair with subsequent repeated brother–sister intercrosses and no breeding from non-sibling mice. After 20 generations of inbreeding, the mice are genetically identical and homozygous at all loci.\" 20 generations is an accepted benchmark that leaves a very low probability of homozygosity, but that probability is not zero. What is it? This is really three questions (or more). 1) Selfing organisms like Arabidopsis thaliana or Caenorhabditis elegans present a simple case. Here, the probability that a given locus remains heterozygous is simply (1/2) n , where n is the number of generations. 2) The mouse, which represents all diploid species where crosses between full siblings is possible. Brothers and sisters that share the same two parents. I suspect the equation for this case has been worked out. What is the answer? 3) Species where females store sperm. In this case one can isolate a female each generation. She will have mated with her (possibly half-) brothers prior to isolation. Here the probability of homozygosity is a function not only of the number of generations, but also the probability of the female having mated with a full brother vs. a half-brother."], "link": "http://www.ncbi.nlm.nih.gov/sites/entrez?Db=pubmed&Cmd=ShowDetailView&TermToSearch=17173058&ordinalpos=2&itool=EntrezSystem2.PEntrez.Pubmed.Pubmed_ResultsPanel.Pubmed_RVDocSum", "bloglinks": {}, "links": {"http://www.nih.gov/": 1}, "blogtitle": "Information on Genes"}, {"content": ["My husband and I both have attached earlobes. Our newly born son has detached earlobes. How is this possible since attached earlobes are recessive? - Curious  That is a great question. Many of us learned in high school that attached earlobes are recessive, and it is easy to find that information repeated on the web as an illustration of dominance patterns. An example is the detailed treatment at the Singapore Science Center , which explores various possible parental combinations and concludes that \"if both parents were homozygous recessive, they could not have a child with the dominant allele.\" That is certainly true, and it seems to make a liar out of Curious. Was her child switched in hospital? Should Curious become Alarmed or Suspicious? I don't think so. I could not find the source of the \"fact\" that attached earlobes are recessive.  I consulted OMIM (the Online Mendelian Inheritance in Man), and they have very little ( OMIM 128900 ). What they do have calls into question the assumption that \"attached earlobes are recessive.\" Free earlobes are dominant in the view of some. Dutta and Ganguly (1965) suggested polygenic inheritance. There is a variety that is perhaps better classified as 'lobeless' than 'attached.' Lai and Walsh (1966) concluded that 'a simple Mendelian gene effect is unlikely to be responsible for the earlobe types.' The other issue raised here is whether or not free earlobes is even a bivariate trait (in which case everyone's earlobes could be categorized as either attached or detached). That is necessary for simple dominance to make sense. In the words of students from Willowbrook high school who did a study of this, \"it's harder to tell earlobes, so the count on these could be less accurate.\" OMIM states that \"there is a variety that is perhaps better classified as 'lobeless' than 'attached.'\" Different forms might show different patterns of inheritance. I suspect that this, along with a large number of ordinary traits, will be examined anew in the era of personal genomics. For example, the people at deCODE genetics just published a report on the genetics of hair and skin pigmentation (Sulem et al., 2007: Nature Genetics 39:1443 , PMID 17952075 ). Perhaps earlobes will be next.  This question may be most important as a cautionary tale about genetics education. Teaching students about earlobes seems very innocent, but this case illustrates why oversimplification might not be prudent."], "link": "http://www.ncbi.nlm.nih.gov/entrez/dispomim.cgi?id=128900", "bloglinks": {}, "links": {"http://www.ciese.org/": 1, "http://www.nih.gov/": 2, "http://www.nature.com/": 1, "http://library.thinkquest.org/": 1, "http://www.edu.sg/": 1}, "blogtitle": "Information on Genes"}, {"content": ["This question is inspired by an article in today's New York Times business section (\" DNA Tests Find Branches but Few Roots \"). The article is nice in that it compares the cost of ancestry testing by various companies, shows that results differ, and quotes Henry Louis Gates Jr. making reasoned assessments of the role that DNA testing can play. However, the article fails to say which companies provide customers with the raw genotype information that they can use to make their own assessments as more information becomes publicly available.  This map (from the article) shows the results returned to the author (Ron Nixon) from five different companies. Presumably, the actual genetic information they gathered is a bit less variable than their interpretation. If I paid to have my DNA analyzed, I would want the actual data so that I could make my own interpretations using the best information available from all sources. The article lists 20 companies that will test your DNA for the purpose of learning about ancestry. Can anyone tell us which ones provide the client with the actual information (sequence or polymorphism data) that can be compared with published genetic demographic data?"], "link": "http://www.nytimes.com/2007/11/25/business/25dna.html", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.nytimes.com/": 1}, "blogtitle": "Information on Genes"}, {"content": ["Someone wrote in \"wondering what the current stance is with geneticist in regards to whether different human races exist or not.\" This important question has been discussed at length already, and I refer readers to a Social Sciences Research Council forum on race , the special issue of Nature Genetics on race published in November of 2004, and an edited volume by Jefferson Fish . I side with those who feel that race, as it is normally understood, is a social construct. Those biological definitions that might be partially valid for humans differ significantly from the way the concept is normally used in our society. However, others argue for the importance of considering \"ethnicity\" in clinical trial design ( Taylor et al. 2005 ), and the drug BiDil has been licensed exclusively for African-Americans (for a recent news report in \"The Times\" click here ). So, my answer to this questions has been given before . It seems to me that if a drug differs in either safety or efficacy for one \"race\" or another, then the underlying basis is probably either a genetic difference or a cultural difference. In the first case, the relevant genetic difference itself, or a related biomarker, would be much more reliable than popular notions of race.  On the other hand, if the basis is cultural, the relevant practice (such as lifestyle or diet) should be identified.  I was therefore gratified to see Nature Genetics publish this letter from Jonathan Kahn making the case against the misuse of race, as well as a sidebar showing how the media has misrepresented their own statements. However, additional answers are welcomed."], "link": "http://raceandgenomics.ssrc.org/", "bloglinks": {}, "links": {"http://women.co.uk/": 1, "http://ongenetics.blogspot.com/": 1, "http://www.nature.com/": 2, "http://www.amazon.com/": 1, "http://circ.ahajournals.org/": 1, "http://raceandgenomics.ssrc.org/": 1}, "blogtitle": "Information on Genes"}, {"content": ["What can I learn about my ancestors from my DNA? What companies provide this information? How much does it cost? What exactly do I learn?"], "link": "http://ongenes.blogspot.com/feeds/5032648786077676546/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Information on Genes"}, {"content": ["This site, \"Information on Genes\" ( ongenes .com ) is a place where answers to questions on genes, genetics and genomics are provided by experts in the field. The site differs from a blog in that answers will be provided by many experts in the field. If a question falls in the area of expertise of a specific researcher, then an answer from that researcher may be sought. The site is like wikipedia in that many people will contribute to the final product, but it is different in that everyone who answers a question must identify themselves. Answers are posted as \"comments\" which must be approved. Inappropriate answers will not be approved. The site resembles a forum in that an ongoing discussion is possible, but differs in that every set of answers will be maintained as a permanent page. Questions on breaking news are encouraged only if the answers will still be of interest in a year or two. To ask a question, send email to questions@ongenes.info . All questions will be posted anonymously. Your question may be edited, merged with another question or published sometime in the future. However, you will get a reply to your question by email in any case, and if you don't want your question to be anonymous, then say so in your email. To answer a question, use the comment feature. We are looking for answers from people with some expertise, and you will be asked to log in so that we know who you are. If you have an account with blogger (Google) and are logged in, you can answer simply by clicking on the \"comments\" link. If not, create a Google account and a profile that tells us who you are. We are looking for answers from experts in the field, but have no desire to censor appropriate answers from anyone who lets us know their credentials. Our hope is that this site will provide useful information to anyone trying to understand genetic tests, including professionals in the field."], "link": "http://ongenes.com/", "bloglinks": {}, "links": {"http://ongenes.com/": 1, "http://www.blogger.com/": 1}, "blogtitle": "Information on Genes"}]