[{"blogurl": "http://www.infogra.ph\n", "blogroll": [], "title": "Infogra.ph"}, {"content": ["This infographic we made for Volunteer Match shows their vast network of volunteers, what causes they work for, as well as the new partnerships they made in 2011."], "link": "http://www.infogra.ph/volunteer-match", "bloglinks": {}, "links": {}, "blogtitle": "Infogra.ph"}, {"content": ["Philanthropy Northwest needed an infographic for its annual report. We outlined giving trends among northwest states for the year 2010 and compared it to previous years"], "link": "http://www.infogra.ph/philanthropy-northwest", "bloglinks": {}, "links": {}, "blogtitle": "Infogra.ph"}, {"content": ["We did this Infographic for Bald Girls Do Lunch, an organization that supports women with Alopecia Areata, an auto-immune disease that causes hair loss. This infographic illustrates how women today are affected by it."], "link": "http://www.infogra.ph/bald-girls-do-lunch", "bloglinks": {}, "links": {}, "blogtitle": "Infogra.ph"}, {"content": ["Gravy Train, a UK based marketing firm needed an infographic for a client of theirs. We designed this fun infographic for Motor Quote Direct, a car insurance company also based in the UK to explain how emotionally attached people become to their cars."], "link": "http://www.infogra.ph/gravy-train", "bloglinks": {}, "links": {}, "blogtitle": "Infogra.ph"}, {"content": ["People’s Emergency Center is a Philadelphia based non profit organization that supports homeless families by providing housing, job and skills training, and counseling services."], "link": "http://www.infogra.ph/peoples-emergency-center", "bloglinks": {}, "links": {}, "blogtitle": "Infogra.ph"}, {"content": ["This data visualization helps viewers understand the US job market before, during, and coming out of the latest recession. It paints a vivid picture that not only shows how many jobs we lost, but which sectors were hit the hardest."], "link": "http://www.infogra.ph/rising-unemployment", "bloglinks": {}, "links": {}, "blogtitle": "Infogra.ph"}, {"content": ["Full Circle Fund is a philanthropic organization based in the Bay Area that connects its members to local non profits and community leaders to affect real change. They needed an infographic to quickly explain their process in a fun way."], "link": "http://www.infogra.ph/full-circle-fund", "bloglinks": {}, "links": {}, "blogtitle": "Infogra.ph"}, {"content": ["Ever heard of the youth vote? It turns out the young people in politics represent a variety of levels of civic and political engagement far more diverse than the term implies. The College of Citizenship and Public Service at Tufts University completed an in-depth cluster analysis of these groups, and this data visualization explores a few of the key findings."], "link": "http://www.infogra.ph/diversity-of-youth-engagement-data-visualization", "bloglinks": {}, "links": {}, "blogtitle": "Infogra.ph"}, {"content": ["Back to the roots was created when its founders discovered a way to grow mushrooms from coffee grounds. This innovative idea has spurred a successful product that now sells nationally in retailers like Whole Foods. Back to the Roots wanted to capture their process from coffee beans to mushrooms and back in a cyclical design. This infographic tracks the life of their ingredients from start to finish."], "link": "http://www.infogra.ph/back-to-the-roots-infographic", "bloglinks": {}, "links": {}, "blogtitle": "Infogra.ph"}, {"content": ["Through a global network of building professionals, Architecture for Humanity brings design, construction and development services to communities in need. The organization noticed that people who were interested in it’s activities were not always completely clear on what it did. We created this infographic to give Architecture for Humanity a comprehensive tool that conveys their mission, services, and reach in a way that anyone can quickly understand."], "link": "http://www.infogra.ph/architecture-for-humanity-infographic", "bloglinks": {}, "links": {}, "blogtitle": "Infogra.ph"}]