[{"blogurl": "http://micheleguieu.blogspot.com\n", "blogroll": [], "title": "inspiration, etc..."}, {"content": ["On view until the end of 2011.    NextSpace Coworking + Innovation San Jose 97 S. 2nd St, Suite 100 San Jose, CA 95113  Open Monday to Friday, from 8:30am to 5:30pm. Phone (408) 351 1575 nextspacesj@nextspace.us"], "link": "http://micheleguieu.blogspot.com/feeds/5921271738192904176/comments/default", "bloglinks": {}, "links": {"http://1.blogspot.com/": 1, "http://nextspace.us/": 1}, "blogtitle": "inspiration, etc..."}, {"content": ["Session 4 - Doodling. Approximately one and a half hours. Starting with one element. Adding from there by proximity and expanding the drawing. Tool : a black fine line marker and a fine point Sharpie. For this second session of doodling we talked about using \"representational\" elements and about the fact that representational doodles are often either a collection of elements or constitute a story . To inspire the students, and because doodling is often associated with another activity (listening to music, the radio, giving a phone call), I proposed to them to listen to Steve Jobs' 2005 Stanford Commencement Address. Steve Jobs' death a few days earlier was the occasion for the teacher to talk with the students about his impact and his legacy. The commencement speech at Stanford is a powerful speech, maybe not very cheerful but right to the point: \"Love what you do - Follow your Heart\", through three short stories. Steve Jobs talks about connecting the dots and the circumstances of his birth, then what happened when he was fired by Apple and finally when he was diagnosed with cancer and his close encounter with death. He finished his speech with these famous words: \"Stay Hungry, stay foolish\". I thought it could be a wonderful inspiration for the students. But the doodle did not have to include elements of the speech. They started doodling as the speech started and then we talked about it. When the speech was finished, the students continued doodling listening to the speech a second time. Along the way, their doodling included more and more \"visual\" elements from the speech."], "link": "http://micheleguieu.blogspot.com/feeds/4273842453169471690/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 2, "http://2.blogspot.com/": 1, "http://3.blogspot.com/": 1, "http://1.blogspot.com/": 2}, "blogtitle": "inspiration, etc..."}, {"content": ["Session 3 - Doodling. Approximately one and a half hours. Starting with one element (preferably somewhere in the center area of the page). Adding from there by proximity and expanding the drawing. Tool : a black fine line marker.  At the beginning of the session, I showed the students a short Power Point presentation with a series of examples of abstract doodling. I want them to feel at ease with the idea of doodling without having to \"represent\" anything and to try to let go and draw whatever idea comes to their hand. For those who wanted to do otherwise, they could - of course.  In some cases, the doodles were abstract at the beginning and became representational somewhere along the way: like the ones with the women and their long decorated dresses.    I encouraged the students to do only one doodle during the session, to see where they could go, by adding more and more elements. But if they wanted, they could get another sheet of paper and start another doodle."], "link": "http://micheleguieu.blogspot.com/feeds/1333347621186156822/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://2.blogspot.com/": 2, "http://3.blogspot.com/": 1, "http://1.blogspot.com/": 3}, "blogtitle": "inspiration, etc..."}, {"content": [], "link": "http://micheleguieu.blogspot.com/feeds/9095793333526387911/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 4, "http://2.blogspot.com/": 1, "http://3.blogspot.com/": 1}, "blogtitle": "inspiration, etc..."}, {"content": ["Session 2 - Lines - Three short exercises. Approximately one hour. 1. Zig Zag lines Building patterns, Varying the thickness of the lines, varying the space between the lines. Tool: pencil 4B.                                    2. Using only a repetition of triangles (could have been any other shape)  As many or as few triangles as the student wishes. Any combination, superposition. Using empty and blackened triangle. Varying the thickness of the lines. Tool: sharpie fine point/marker.                          3. Curved lines Starting with a few lines going from an edge to another. Varying the thickness of the lines. Tool: sharpie fine point/marker."], "link": "http://micheleguieu.blogspot.com/feeds/5888633777718391895/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://2.blogspot.com/": 4, "http://3.blogspot.com/": 5, "http://1.blogspot.com/": 5}, "blogtitle": "inspiration, etc..."}, {"content": ["This year I proposed to the two classes I volunteer in (5th grade and 3rd grade) to work on a year-long art project: an art notebook. The idea is to keep everything together and to build a catalog of  visual  ideas and to work on an art-object .  I'd like the students to enjoy the journey and feel comfortable with what we are doing. I presented the project to the parents, with some examples of collages, drawings, doodling, layering, stencils, lettering. I am not looking for a specific result. It is a discovery process. We are trying things.  I like to browse through the art section at our public library and I came upon a couple of inspirational books about art journals. In The Journal Junkies Workshop by Eric Scott and David Modler , I found an amazing quote: The Journey is the Destination . That's exactly what I'd like the children in the classes this year to experiment: the excitement of the journey itself. I am very happy and thankful to work with two enthusiastic teachers who love art and who support this adventure!   The parents participated for the material. The Canson Field book is 9x12\", 90Lb, hardcover, bound with wide rings and coasts approximately $15 (on sale at my favorites online store, Dick Blick and ASW). I asked $20 per student, which should cover our need in nice pencils, pens and markers, brushes and paint.   We are still waiting for the art pads for the 5th graders. They were back ordered because of the large quantity we needed. Right now the 5th graders work on sheets of paper that they will glue in the art pads as soon as they get them.  First Session - Petroglyphs I take some time for a short Power Point presentation about the petroglyphs in the Southwest (history, location, description). That same week the teacher talked about the Pueblo civilization. I'd like to sometimes link what we do in art class with subjects the students are learning about. I gathered some images on the internet and some I've taken myself.    One of the slides         \"Newspaper Rock\" (detail), Utah                              We talk about shapes, composition.  I show photos of some of the engraved walls found in the Four Corners area.  Then I give them a few sheets printed with black shapes of petroglyphs and some compositions (photos of some of the walls).                           I ask the students to take their time and to chose as many - or as few - shapes they want to and to start with a large one and then to organize the space around it. They work directly with graphite pencils (no erasers), which are super smooth, glide on the paper and make wonderful dark silver greys/blacks.   The idea is to really look at shapes - and those shapes are very special. I'd like them to \"see\" the space of the page and organize it as they wish with different elements. And to take their time, which is not an easy thing to do for the students."], "link": "http://micheleguieu.blogspot.com/feeds/9169507026859525700/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 4, "http://www.amazon.com/": 1, "http://2.blogspot.com/": 5, "http://3.blogspot.com/": 2, "http://1.blogspot.com/": 1}, "blogtitle": "inspiration, etc..."}, {"content": ["I bought my first Mac a few years after I graduated from my art school in Paris, when Photoshop and Illustrator - and at the time QuarkXPress - bloomed, with the amazing possibility to work on beautifully designed fonts which looked slick at any size, color charts that were accurate, vector files with endless possibilities of transformation. The Mac was THE computer for graphic designers. And it looked beautiful! I immediately loved the interface and the way everything was thought to create professional contemporary design. At the time there was simply no equivalent whatsoever."], "link": "http://micheleguieu.blogspot.com/feeds/990216118072669275/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1}, "blogtitle": "inspiration, etc..."}, {"content": ["The ongoing show in Chicago started Monday, September 26, 2011 and runs until Sunday, October 23rd: four weeks of art interspersed among advertising (location: East Bound Interstate 90 just after the highway crosses over Oakton Street). Here are some photos of the billboards with my images. They were recently posted by the Billboard Art Project on Facebook. More photos can be seen here . And more will be posted soon, as the BAP is documenting the event through the weeks.  I am very much enjoying continuing the \"Mileage To\" series and seeing the photos taken in a new town and offering a different context and a different perspective each time.        For Chicago I sent to the BAP a series of 31 signs with mileage from Chicago to towns situated in North African and Middle Eastern countries: Algeria, Egypt, Iran, Iraq, Afghanistan, Jordan, Kuwait, Libya, Morocco, Oman, Pakistan, Bahrain, Syria, Tunisia, Palestine, Israel,Yemen, Saudi Arabia, Lebanon. The same towns I've made road signs with for the Savannah and the Duluth Billboard Art Project. Each time I recalculate the distances online, it makes each sign specific for each location.                          For the show in Chicago I sent a series of 36 new faux signs, playing with the two colors of the warning signs: bright yellow for the background and black for the abstract shapes.                              All photos: The Billboard Art Project    Artists participating in the The Billboard Art Project Chicago Show: Aaron Raymer – New York, NY, Al Wildey – Mt. Pleasant, MI, Alexandra Lee – Chicago, IL, Amanda Greive – Edinburg, IL, Amy Pleasant – Shoreline, WA, Andrea Lantz – Richmond, VA, Andres L. Hernandez – Chicago, IL, Barbara Lantz – Richmond, VA, Begi – Tel Aviv, Israel, Brenda Kofford – Wheatland, WY, Brian Nogues – Miami, FL, Brittany Ransom – Chicago, IL, Carrie Brady – Georgetown, CT, Channel TWo – Oak Park, IL, Chau Dang – Seattle, WA, CJ Hungerman – Geneva, IL, Claire Accardo – Richmond, VA, Claudia Lynch – New Orleans, LA, Coalfather Industries – Carlinville, IL, Connie J. Frisch-Cherniak – Staten Island, NY, Connie Wolfe – Chicago, IL, David DuFault – Chicago, IL, Deborah Maris Lader – Chicago, IL, Doug Siefken – Chicago, IL, Ellen Mueller – Pueblo, CO, Faern – San Francisco, CA, Flavio Galván – Plantation, FL, Francine LeClercq – New York, NY, Gary Duehr – Somerville, MA, Ginny Gaura – North Aurora, IL, Ginny Huo – Brooklyn, NY, Ginny Lloyd – Jupiter, FL, Gregory Kaplowitz – San Francisco, CA, Happy Accidents – St. Paul, MN, Harriete Estel Berman – San Mateo, CA, Heather Dewey-Hagborg – Brooklyn, NY, Heysook Cho – Orem, UT, Hue Park –Brooklyn, NY, Industry of the Ordinary – Chicago, IL, Ione Citrin – Los Angeles, CA, Jeff Mendenhall – Lombard, Il, Jen Mitsuko – Portland, OR, Joelle McTigue – Los Angeles, CA, John Cizmar – Chicago, IL, Jonathan Levy – Brooklyn, NY, Joseph Church – Rockford, IL, June Bisantz – Willimantic, CT, Karrie Ross – Los Angeles, CA, Kelsey Bosch – Minneapolis, MN, Kendra Larson – Portland, OR, Kiyomi – Riverside, CA, Kyle Humphrey – Toronto, ON, Canada, Laura F. Gibellini – New York, NY, Lee Aulson – Peabody, MA, Leo Kogan – Amsterdam, Netherlands, Les Mayers – Santa Monica, CA, Lisa Graham – Arlington, TX, Lori Lipsman – San Diego, CA, Luisa Pulido – Miami, FL, Lynn Cazabon – Baltimore, MD, Mairin Hartt – Chicago, IL, Marcellous Lovelace – Chicago, IL, Maria Creyts – Kansas City, MO, Michael Burton – Chicago, IL, Michael Vickers – Toronto, ON, Canada, Michele Guieu – Sunnyvale, CA, Nicholas Economos – Shaker Heights, OH, Oliver Pauk – Toronto, ON, Canada, Rebecca Aguilar – Chicago, IL, Rob Carter – Brooklyn, NY, Sally Sachs – Chicago, IL, Samantha Hookway – Columbus, OH, Sarah Rehmer – Indian Head Park, IL, Seeking Kali – United States, Belgium, Canada, Shane Anderson – Apple Valley, MN, Sharon Lee Hart – Lexington, KY, Simone Bailey – San Francisco, CA, Susan Tonkin Riegel – Granite Bay, CA, TAKEBACKCHICAGO – Chicago, IL, Terry Ward – VA & Brooklyn, NY, Travis Janssen – Carbondale, IL, Warwick Eede – Boston, Lincs, England.   The next Billboard Art Project is in Reading, PA, October 22."], "link": "http://micheleguieu.blogspot.com/feeds/2854984474688844437/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 2, "https://www.facebook.com/": 1, "http://3.blogspot.com/": 2, "http://1.blogspot.com/": 5}, "blogtitle": "inspiration, etc..."}, {"content": ["From the press release     Correspondences and Elevation #14, acrylic on canvas, 36\"x48\", 2010      An eclectic evening of arts and culture in downtown San Jose's SoFA District (& beyond)!     NextSpace San Jose is pleased to feature the work of Phantom Galleries artists Michele Guieu with her installation Correspondences and Elevation ; The Strip; Encaustic images by Katie Guiterrez; and Jeanne Yee's intricate collage works.     Join us for the First Friday art walk and meet the artists, see what's happening at NextSpace San Jose and enjoy Hors d'oeuvres, refreshments and the sweet sounds of El Jefe.     NextSpace Coworking + Innovation San Jose  97 S. 2nd St, Suite 100   For full listing of events and information: please visit www.SouthFirstFridays.com or call 408-271-5155       Media Sponsor: Metro Newspapers      Enjoy FREE PEDICAB RIDES between art venues courtesy of South FIRST FRIDAYS and Eco City Cycles !      This event is produced by Two Fish Design with additional support provided by the San Jose Downtown Association, the San Jose Redevelopment Agency and 1st ACT Silicon Valley."], "link": "http://micheleguieu.blogspot.com/feeds/5331850243434198933/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://www.metroactive.com/": 1, "http://www.southfirstfridays.com/": 1, "http://nextspace.us/": 2, "http://www.ecocitycycles.com/": 1}, "blogtitle": "inspiration, etc..."}, {"content": ["For the Duluth Billboard Art Project , the participating artists knew the billboard would be near a forest. My idea was to use warning signs on the billboard using strange messages related to the presence of the forest: \"Caution! Fairies\", \"Big Bad Wolf lurking\", \"Beware\", \"Wizards Crossing Ahead\", \"Deer in the Headlights\"- or making a poetic link with the place: \"No Man's Land\", \"Here\", \"Nowhere\", \"There\", \"Black Hole\", \"Grey Area\", \"Complicated Zone\". Also, a few of the signs were incomprehensible ones, as if the sign was not working.I even asked the BAP if it would be possible to have the image being shown around dusk to emphasize the strangeness.  The images could not be used because they are playing off of cautionary road signs, and replicating the visual effect is against of department of transportation regulations as it may confuse the driver. I understand their position. Several of the series I proposed to the BAP since the beginning of my participation play with ambiguity. And although I am trying to stay in a zone where my images would not be rejected, I know I am walking a fine line. For example, when I started the series, one of the images I created was \"Checkpoint Ahead\" and I knew right away that this could be a problem. It is a stressful message to read on a billboard which completely resembles a warning sign. I thought working more with strange and surprising message, like \"Black Hole\", and not playing with a stressful content.  If I can obtain permission from the local department of transportation in one of the upcoming shows, I will re-submit the images for that particular venue. I may change them a little, I will find a way.  Here are some faux-montage ( from a BAP photo ) of the images as they could have appeared on the road in Duluth:          My series \" Mileage to \" continues After Savannah, GA, here is the billboard in Duluth, MN, with the distances between Duluth and towns North Africa and Middle East: Algeria, Egypt, Iran, Iraq, Afghanistan, Jordan, Kuwait, Libya, Morocco, Oman, Pakistan, Bahrain, Syria, Tunisia, Palestine, Israel,Yemen, Saudi Arabia, Lebanon. It's interesting to see the series in another town, with the mileage slightly changing. I am finding different ways to write the names of some of the towns when I check on the maps on internet. Misurata in Libya is used as much as Misrata so I decided to use them both.    In Savannah, GA: Towns in Iraq (photo BAP)     In Duluth, MN: Towns in Iraq (photo BAP)     In Savannah, GA: Towns in Libya (photo BAP)      In Duluth: Towns in Libya (photo BAP)    In Savannah, GA: Towns in Morocco (photo BAP)      In Duluth: Towns in Morocco (photo BAP)      In Savannah, GA: Towns in Algeria (photo BAP)      In Duluth: Towns in Algeria (photo BAP)     In Duluth: Towns in Iraq (photo BAP)     The Duluth Billboard Art Project: view all the series of images here."], "link": "http://micheleguieu.blogspot.com/feeds/4225926074896591423/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 2, "http://www.blogger.com/": 1, "http://www.flickr.com/": 2, "http://1.blogspot.com/": 3, "http://4.blogspot.com/": 5, "http://2.blogspot.com/": 4}, "blogtitle": "inspiration, etc..."}, {"content": ["Brett Amory @ Anno Domini      Victor Cartagena and David Molina @ MACLA      STREET MRKT                   My installation South First Street"], "link": "http://micheleguieu.blogspot.com/feeds/2281851192446338741/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 4, "http://galleryad.com/": 1, "http://www.maclaarte.org/": 1, "http://4.blogspot.com/": 5, "http://2.blogspot.com/": 5, "http://www.southfirstfridays.com/": 1}, "blogtitle": "inspiration, etc..."}, {"content": ["From the Press Release -  An eclectic evening of arts and culture in downtown San Jose's SoFA District (& beyond)!  7pm-11pm, free & open to all ages     Anno Domini // the second coming of Art & Design - 366 South First Street       Waiting #95 , oil on wood, 24\" x 48\", 2011    Opening Reception in galleryONE: Brett Amory White Light solo exhibition    White Light is the next installment within Brett Amory’s Waiting series. Amory began the Waiting series in 2001 with paintings depicting commuter subjects seemingly detached from their fellow passengers and surrounding environments, inspired by the introverted culture of public transit and inhabitants of the Tenderloin neighborhood of San Francisco.   This new group of paintings continues to capture an individual’s struggle to exist in the present moment and the continued state of detachment from one’s surrounding environment. However, this new body of work depicts an element of freedom, as the subjects strive to transcend consciousness and human existence: freedom of thought, freedom of perception, freedom to create one’s own narrative. If reality is relative and bound to the subject’s own existence and subject to the judgment of others, this work reminds us that there is a choice. While White Light exposes the limitations one faces when they are defined by their limited perceptions and the gaze of others, the viewer is reminded that there is hope for absolute freedom over our existence and essence.   On view in galleryTWO: Dimitri Drjuchin The Melting Kingdom solo exhibition      Higher Fire Clayspace & Gallery - 499 Market Street        Higher Learning – Higher Fire presents work by emerging clay artists from SJSU’s MFA in Ceramics Program. Participating artists include Jonathan Huang, Malia Landis, Kat MacKinnon, Demetra Messoloras, Avery Palmer, David White, and Wesley Wright.      KALEID Gallery  - 88 South Fourth Street (at San Fernando)   Opening Reception for feature artists Leslie Ann Rice and Sara Tomasello      Image by Leslie Ann Rice    Circus Act by Leslie Ann Rice  A mutt-ley crew of characters explore the circus of popular culture, touching upon the freakish tendencies of human nature.       Image by Sara Tomasello    Looking through the Glass by Sara Tomasello  Through her paintings, Sara Tomasello builds on themes of intimacy and the unity of opposites. Her characters are symbols for the light and dark aspects of human nature. Using a vibrant color palette and inspired by universal mythological themes, Sara portrays the emotional impact of the world she sees and experiences it in her acrylic paintings. There is a story behind each piece and it begins; Once upon time. Viewers are invited to look through the glass that Sara views the world and reflect on your own experiences of the world.       MACLA - 510 South First Street      Photgraphy by Victor Cartagena   Join MACLA for an extraordinary evening of art and performance:  In MACLA’s Gallery: A Body Parted: Shrapnel of Present Time Un Cuerpo Partido: Esquirlas de Tiempo Presente Utopia/Nightmare: The American Dream Utopia/Pesadilla: El Sueño Americano Exhibition by Victor Cartagena with sound elements by David Molina.   Join us for the opening reception, artist talk and micro-performance by Secos y Mojados.       Phantom Galleries - art exhibitions in vacant storefronts and alternative spaces       Detail of the installation     66 South First Street: Defragmentation 66 \u2028An installation by Michele Guieu  Defragmentation 66 is an adaptation of the last installation I’ve made in San Diego: Defragmentation: Rearranging Bits and Pieces of Memory . It is an ongoing project and the occasion to reflect on bits and pieces of my memories, as I am recalling/documenting them. The project originated when I was about to leave San Diego after living there for 6 years. I thought about the different times I’ve left a place in my life. Defragmentation 66 is the first installation I am showing in San Jose since I’ve moved and it represents a link between the two towns – and beyond. The installation is on a smaller scale but uses some essential elements featured in the first version of the show: an ensemble of paintings, a painted background and videos. The videos in “Defragmentation 66” are new memories and were taken here, in the bay area. The address number where the show is held, 66, is an interesting symbol in my life: the first time I came to the US, that’s the road I travelled on.        386 South First Street: Street Swag Photo Booth photos by Abe Menor at SubZERO Festival.         95 So. Market Street:    \"Folie à Deux Family Tree \": Monotypes and Glass Statues by Curt Schauer    In this exhibit, Curt traces the origins and family history of the Folie a Deux series. From the image on the original sign in Tokyo that inspired the figurative images and the early acrylic ink monotype studies, digital drawings and oil based monotypes to the final five piece monotype series and blown glass statues that defined Curt’s work from 2008 to today. Folie a Deux explores the duality of extremes and conflict in human nature and between the art and the viewer in figurative and expressionist styles. Not satisfied with a single medium to express his vision,   Curt furthered the duality theme by recreating the series in colorful 3D blown glass with hand etched graal images. This is the first exhibit to display the family tree in life (glass) and in portrait (monotypes) and displays the use of color, light, movement and dimenssion in Curt’s art.      San Jose Jazz at Eulipia Restaurant - 374 South First Street         The Jazz Mafia for San Jose Jazz   A creative force on the Bay Area music scene for more than a decade, the loose-knit band of Jazz cats, MCs, arrangers and composers known collectively as The Jazz Mafia is one of the most powerful assemblies of virtuosic performers on the West Coast. Launching some of the Bay Area’s most innovative and stylistically expansive ensembles, these musicians contribute their varied talents to a cross-cultural mix of new beats and melodies, Hip-Hop, Funk and R&B. The Jazz Mafia Horns have recorded in the studio with Carlos Santana and backed artists such as Zion-I, KRS One, and Thomas Dolby. Other bands in the JM pantheon include the incredible Realistic Orchestra, Supertaster w/ Joe Bagale, Brass Mafia, Jazz Mafia Trio, Spaceheater, and the Shotgun Wedding Quintet, one of the hits on the Jazz Beyond Stage at this year's San Jose Jazz Summer Fest.       San Jose Museum of Quilts & Textiles - 520 South First Street     Crosses (Stone Mason’s Puzzle) , From the collection of Roderick Kiracofe, Photo by Sharon Risedorph     The Scrap ART exhibit showcases historical quilts drawn from the Museum’s and private collections and ‘scrappy’ contemporary works.   Scrap ART  examines the historical precedent and aesthetic of the scrap quilt and its modern-day descendants.\u2028Just as quilters have long been inspired to make beautiful pieces from available scraps, the throwaways of daily life have inspired a new generation of ecologically-minded artists to combine creative reuse with old-fashioned thrift in works using material as varied as books, jeans, zippers, plastic, buttons and teabags.   Scrap ART  celebrates the reinterpretation of materials by artists both historical and contemporary in works that reflect the cultures and values of their makers.\u2028For more details: http://sjquiltmuseum.org /exhibitions.html\u2028\u2028   Join us for a Recycled Fashion Trunk Show featuring the work of Darcy Fowkes, and a scrap art demonstration by Jane Emery, who will make unique fanciful “Aunt Jane’s Creations” – such as spirit dolls and animal figures!      SLG Art Boutiki & Gallery - 577 South Market Street      Art by Bea Adams.    The Art of the Zombie Apocalypse.  Survivors of the zombie invasion from earlier in the week can come out and see the art they left behind. A group of artists will leave their own impressions of the walking dead. Also featuring live music!      Works San José - 365 South Market Street       In Primer paso (First Step) , artists from Oaxaca, Mexico and San José, confront revolutionary aspects of artistic, personal, and cultural emancipation. In multiple media and site-specific installation, Julio Cesar, César Chávez, Mario Guzman, Eder Luna, and Ylan Luna simultaneously reflect the shadow of despair while lighting the way toward hope and awareness.      Caffé Frascati - 315 South First Street    First Fridays is Caffe Frascati's Opera Night! with all your favorite arias and duets performed live by some of the bay Areas finest opera singers. 8-10pm.      Downtown Yoga Shala - 450 South First Street       Join us after Candlelight Yoga (6-7:30pm) as we open our doors to welcome art patrons and the downtown community to the South FIRST FRIDAYS art walk. Our featured artist is Robertino R. Ragazza, featuring his new exhibition, Memorias de mis viajes (memories of my travels) .   ….. Memories of my travels (Memorias de mis viajes ) is a collection of images which gives me fond memories and recollections of all the places I've traveled. When photographing, I like to capture just bit and pieces, not the full scale view, mainly focusing on the usage of high and low key lightings within the frame. In photographing these pieces, they create an assemblage, painting a complete picture of who I am. All photographs are hand-printed Selenium-toned Silver Gelatin.       Good Karma Vegan Café - 37 South First Street         The Peculiar Pageant : New paintings and installation by Lacey Bryant  Theatrically posed and surrounded by lush, illusory environments, the subjects of Lacey's newest works are like pictures in a storybook written in an unknown language. The images are somewhat familiar but certain elements remains foreign. Like a hazy dream of an imagined childhood long forgotten, the images strive to make you feel as if you just might have been there once, maybe. As is common in Lacey's work, there is a subtle tension between beautiful and unsettling elements. This contrast creates a sense of mystery and invites the viewer to construct their own interpretation of the scenes. In the safety of a world poised between reality and imagination where common symbols mingle with strange ones, Lacey's characters expose their fears, doubts, despairs and longings.      METRO Photo Exhibit - 550 South First Stree t       Join us for the Metro Photo Exhibit seek party destroy Photography by Albert Bracamonte III.      Pho69 - 321 South First Street        Collection of Light A new series by LAuruS Myth  LAuruS Myth work is based on patterns found in nature that have lead to patterns used in modern technology. Not only do these symbols relate to each other visually, but they also function as patterns that guide flows of energy throughout machines and plant life. Connecting and converting this energy into the power that lies within human life and purpose, fuels her motives and creative inspiration. Her hope is to capture the essence of vibration through the repetition of organic and geometric shapes.   \"A plethora of environmental vibrations transform through colors to expose the core joy of my work as I attempt to bridge my own concepts of power. One source of power is sold as a commodity, and the other is simply generated within living organisms. Sources to support our human needs, such as solar, wind, biomass, and nuclear, are found externally in our environment, and I believe are also indistinguishable from our oneness and inner light. The balance between these two realms brings us closer to our collective achievements for energy. I believe that finding ways to converge the ideas of art and science, nature and technology, and “us” as the environment is the purpose of my current work. The interweaving of nature-spaces and microprocessor components in my paintings create a colorful kaleidoscope of this fusion of a world we live in.\"   Pho69 also features live contemporary music on First Fridays. Come check out local bands performing favorite covers and original music.      Psycho Donuts - 288 South Second Street        Psycho Donuts in downtown San Jose is a quirky donut shop and art gallery. The gallery displays top local artists and has an ongoing exhibit featuring the work of John Renzel, Lacey Bryant, Nicolas Caesar, Murphy Adams, Christine Benjamin, Michael Foley, Michael Borja, Carlos Villez, Eric Joyner, Laura Callin Bennett, Michelle Waters, and John Hageman. .      South First Billiards Club & Lounge - 420 South First Street      Efren Alvarez' Separación/Deportados (Separation/Deported) .   In the exhibition Reflejos de Nuestras Raíces , a group of San Francisco Bay Area artists of Mexican roots who vary in socio-economic background, age, language, nationality, and race, exhibit their artwork in representation of one of the many cultures that together define America’s diverse population.  Artists: Efrén Alvarez, Dario Cruz, Tulio Flores, Itzul Gutierrez, Elizabeth Jiménez Montelongo, Ylan Luna, Kimy Martinez, and Mireya Villanueva   Come to South First Billiards on Friday, September 2, 2011 for a night of open-mike and affordable art! You can sign up for open-mike to read poetry, share your own, sing, play an instrument, or just express yourself! Local artists will be selling artwork at affordable prices: 2-D artwork for $100 and under, 3-D artwork for $300 and under, jewelry and crafts for $50 and under. The Art Slam is an event to accompany the current exhibition Reflejos de Nuestras Raíces .   5-9pm ALL AGES. 9pm-close 21+      TechShopSJ - 300 South Second Street        Made At TechShop   A collection of various projects made at TechShop from TechShop members.       Art Ark - 1035 South Sixth Street         forest time  is an exhibition of new paintings and mixed-media drawings by Christine Canepa. The work employs imagery from the animal world as a means of exploring ideas proposed in contemporary physics regarding the existence of multiple dimensions, or a “multiverse”. Canepa uses imagery of dens, nests, and burrows, and various endangered species to explore ideas around endings, loss, and the speculative potential of parallel worlds. The work plays with traditional distinctions between abstract and representational imagery, and historic conventions of landscape painting.         On South First Street between San Carlos & San Salvador streets   7-11pm, free & open to all ages   ON THE STAGE:  (Please note: these times are tentative and may be subject to change.)   7:30-8:10 PM John Staedler 8:30-9:15 PM Ghost and the City 9:45-10:45 PM San Francesca   with STREET MRKT’s Emcee  “Mighty” Mike McGee    INDIE ARTISTS & VENDORS:   Ai & Ai  Al Preciado  Andre Hart  Boombotix  Bugs & Monsters  Chicanoart.Friscostyle  Crossroads Trading Co.  David Mejia  DonBon  EAZ & Sugar Skulls by Jodi  Emo Gonzales  fiftyseven-thirtythree  Flora & Fauna  Force 129  Francisco Franco   Gianfranco Paolozzi  Haley Goodlett  Joe Perea  Ike Greca  iMiNUSD Track Boutique  Ivan Gonzales  Jarod Oliva  Josh Marcotte & Kerfufle  Keith Bunnel  Korrupt Clothing Label  Linda Ritter  Lost Village  Luna Park Chalk Fest  Michael Foley  Mike Borja  Out of Print Vintage  The Rabbit Hole  Sandi Billingsley  Shannon Amidon  TeaShack  Tech Shop  The Usuals     For full listing of events and information: please visit www.SouthFirstFridays.com or call 408-271-5155       Media Sponsor: Metro Newspapers   Enjoy FREE PEDICAB RIDES between art venues courtesy of South FIRST FRIDAYS and Eco City Cycles !    This event is produced by Two Fish Design with additional support provided by the San Jose Downtown Association, the San Jose Redevelopment Agency and 1st ACT Silicon Valley.    Two Fish Design   366 South First Street  San Jose, CA 95113  T: 408.271.5151 F: 408-271-5152   studio@twofishdesign.com   Tweet me: @Astrogirl"], "link": "http://micheleguieu.blogspot.com/feeds/7456019538875278119/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 9, "http://www.psycho-donuts.com/": 1, "http://sjquiltmuseum.org/": 1, "http://downtownyogashala.com/": 1, "http://www.sofapool.com/": 1, "http://www.eulipia.com/": 1, "http://4.blogspot.com/": 5, "http://www.artboutiki.com/": 1, "http://www.techshop.ws/": 1, "http://www.myspace.com/": 1, "http://www.southfirstfridays.com/": 1, "http://www.sanjosejazz.org/": 1, "http://www.galleryad.com/": 1, "http://www.ecocitycycles.com/": 1, "http://www.workssanjose.org/": 1, "http://www.sjquiltmuseum.org/": 1, "http://www.phantomgalleries.com/": 1, "http://1.blogspot.com/": 5, "http://www.higherfirestudios.com/": 1, "http://caffefrascati.com/": 1, "http://www.pho69noodle.com/": 1, "http://www.metroactive.com/": 2, "http://www.artarkgallery.net/": 1, "http://www.maclaarte.org/": 1, "http://www.kaleidgallery.com/": 1, "http://2.blogspot.com/": 3}, "blogtitle": "inspiration, etc..."}, {"content": ["Roaring Mountain \n Driving South From Mammoth Hot Springs to Old Faithful.Parking on the side of the road, next to Roaring Mountain . The mountain makes a rumbling noise and steams abundantly. It is a striking view in the morning light, a good time to be there: the air is almost still and the sun goes though the steam. Sometimes the steam almost disappear, depending on the light and the wind.    On the other side of the road, a reminder about the 1988 wildfire. Amazing how resilient nature is.   A short walk (0.5 m and back) to go see Artists Paint Pots site, on a small hill hidden behind the forest.    This is a detail of a large mud pot. The mud pots produce thick bubbles which make noise when they explode. It never stops, the spectacle is fascinating.    Fountain Paint Pot area - White Dome Geyser erupting - View from Great Fountain Geyser, on Firehole Lake Drive . We were waiting for Great Fountain to erupt - there was a post saying we were still in the \"window\". In fact it already erupted but the people present on the site were not aware of it, although everybody was making predictions and observations (the geyser was filling up and bubbling). When it erupts, usually it takes it twelve hours to built back the pressure and to erupt again. So we never got the chance to see its eruption.    Because White Dome Geyser is usually erupting every hour or so we came closer to it and waited a little less than an hour to see another eruption. Watching some of the geysers requires some time and patience. It is a game we were happy to play. Despite the sun, the heat. It was amazing to wait and to witness the changes, the noises, the little signs that tell (or not) that the eruption will happen. For the kids it was also a way to rest between walks.    Fountain Paint Pot Trail . Walking the boardwalk surrounded by a tempting and toxic palette of colors.    Arriving by chance just in time to see Fountain Geyser erupting. It usually erupts every 9 or 15 hours, the eruption lasts 30mn. On the left, Clepsydra Geyser.    Clepsydra Geyser, its eruption is nearly continuous.    Just a few miles south, the site of Grand Prismatic Spring (Midway Geyser Basin).    The trail crosses a river and a short walk take us to an unbelievable sight. I stood there in disbelief. The extremely vivid colors come from the growth of pigmented bacteria, and the blue of the water in the pool is particularly intense because of its the depth - that's for the explanation.    We played with our shadows.      At the end of the afternoon, we drove back North a few miles to enjoy a cool breeze at the river, along Fountain Flat Drive. Very peaceful place.  \n  \n Old Faithful Inn \n Old Faithful, its Inn, its visitors and its famous geyser. Yes, there are lots of people at Old Faithful, right at the site of the \"Old Faithful\" geyser and around (shops, lodge, visitor center). But that's about it, and I do not know exactly why.  \n  \n The Old Faithful Inn in the thermal area \n  \n  \n Old Faithful geyser \n The Old Faithful geyser is showing off every hour and a half, with an amazing predictability (more or less 10mn). \n  \n prediction for Old Faithful eruption posted at the visitor center - actualized after each eruption! \n  \n  \n Add caption \n And it has lots of fans!    And one can even watch the Old Faithful geyser from the Inn's deck.   But then one wakes up in the morning and walks the boardwalk on the hills close to Old Faithful, and there is almost nobody there.   This is along the loop, it took the whole day with all the stops, between 6 and 7 miles: Old Faithful, Geyser Hill, up to Biscuit Basin and back through the meadow and the forest. A succession of the most diverse and abundant thermal features in the whole park. And a collection of names very often referring to the shape of the thermal structure, to the way the geyser erupts or to its color: Anemone Geyser, Lion group, Turban Geyser, Grotto Geyser, Beehive Geyser, Plume Geyser, Spasmodic Geyser, Sawmill Geyser, Sapphire Pool, Mirror pool, Gem pool...      \n  \n Castle Geyser \n        \n  \n Artemisia Geyser \n  \n  \n Gem Pool \n   Biscuit Basin    Coming back South - to Old Faithful site - through a beautiful and quiet meadow. Absolutely nobody there. A grizzly and her cubs were spotted in the area recently. We clapped our hands a little - and we had our pepper spray!   Back to Grand Geyser . We waited two hours and a half to see this one erupting. The interval between eruptions is from 8 to 12 hours, so we came at the beginning of the predicted window (posted) and waited. Did not seem too long. A coyote passed by. Some people came and went. We just stayed there. I took a nap in the shade, under a bench. It is the tallest geyser in the park. Pretty impressive.      One of the many insects we saw on the trail.    Last view of the hills at Old Faithful. Very difficult to leave such a gripping landscape. We visited many National Parks and I am definitely more attracted by deserts than forested lands. But Yellowstone has that breathing/alive/changing dimension which is quite arrowing to experiment.   Road trip back..."], "link": "http://micheleguieu.blogspot.com/feeds/9081184578208220220/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 13, "http://2.blogspot.com/": 8, "http://3.blogspot.com/": 5, "http://1.blogspot.com/": 12}, "blogtitle": "inspiration, etc..."}, {"content": ["Yellowstone, Mammoth Hot Spring area (elevation 6200 feet). Beautiful morning Hike to Bunsen Peak (8564 feet), just 5 miles South of Mammoth Hot Springs, 2 miles ascent and 1330 feet elevation. We started at 9:00 am and enjoyed some shade in the forest before the trail gets exposed. Very peaceful view at the top.           From the trail, view of Mammoth Hot Springs Headquarters (Fort Yellowstone) and Mammoth Hot Springs Terraces.   We've heard quite a lot of these large Mormon's Crickets. They make a strong rattling noise when they jump-fly in the meadow.   Orange Spring Mound, Mammoth Hot Springs Upper Terraces trail. We spent the afternoon on another planet: unbelievable structures, combination of colors, materials and shapes. The scientific explanations are very interesting (there are some panels along the trail), but the sight of these landscapes is quite mind blowing. After a while, I was not reading anything anymore, I was just watching and not trying to make sense of what I was seeing.                 On the lawn in front of the Albright visitor center, listening to park ranger Leigh Dunworth for a short and animated talk, \"Wonders of Wildlife\", about how the wildlife in Yellowstone adapts to the harsh weather and conditions.   Mammoth Hot Springs Lower Terrace trail. Liberty Cap on the left.     White Minerva Terrace is dry for now, due to the constant changes in the way the springs flow in the area.    An evening at Boiling River. A 10mn trail to get to the spot where the boiling hot spring water coming down from Mammoth Hot Springs mixes with cold Gardner River. The current is a little bit strong but the river is rather shallow. We saw an elk herd passing by and crossing the river."], "link": "http://micheleguieu.blogspot.com/feeds/1438761892476780475/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 5, "http://2.blogspot.com/": 5, "http://3.blogspot.com/": 3, "http://1.blogspot.com/": 7}, "blogtitle": "inspiration, etc..."}, {"content": ["Yellowstone - Canyon Village (elevation 8000 feet). We did a loop hike, which took us most of the day with all the stops. We took our time, we enjoyed the different landscapes the trail goes through. Uncle Tom's Point, Clear lake (an hydrothermal area), Lili Pad Lake, Point Sublime, Artist Point, down to Uncle Tom's Trail and back to Uncle Tom's Point. Approximately 6 miles. Starting in a meadow, then entering a forested area. At the crossing with Ribbon Lake Trail we saw this sign: the area was closed due to bear activity. We felt a little bit alone there - we haven't seen anyone on the trail yet.   Lily Pad Lake was very quiet. Only a few mosquitoes came out of the shade when we arrived. We talked to a ranger who was hiking with a group and asked her about the closed area due to bear activity, she said it was also because they just discovered a wolf's den and they did not want the animals to be disturbed.   Then the trail arrives on the South Rim of the Grand Canyon Yellowstone River and we started seeing more people. The rim along the trail is a sheer cliff and the landscape totally breathtaking, and my mind was battling between worries and awe..     We saw lots of these signs.   View of the massive Lower Falls from the South Rim trail, going to Uncle Tom's Point.  And from the end of the Uncle Tom's trail : 300 steps down (500 feet) from the rim trail.   Getting back up the 300 steps, strenuous at 8000 feet!    Norris Geyser Basin , a few miles West of Canyon Village. This really feels like we - humans - do not belong there but it is amazing to have the possibility to watch it.  The surprise of the geysers. Some are predictable: the rangers in some places even post possible \"eruption windows\" for the day \" may erupt between 10 am and 2 pm \", which seems pretty unreal. A prediction is based on the time of the previous eruption. Some are not predictable, some stop erupting all together, some new ones appear. I felt like I was walking on the lid of a giant boiling pot and that it could explode anytime. At the same time the fascination and the sight were so powerful, that it was almost impossible to leave the place.     The thermal activity can kill the trees around and the chemicals make them look like they wear white socks.   The following day, a more familiar type of landscape! Sweet hike to - and around - Trout Lake in Lamar Valley. We had lunch watching a happy otter.   Lamar Valley - Pebble Creek (close to the North East entrance of the park). Another traffic jam. Cars stopped, ranger on duty: something is going on. We have the time to see... the back of a bear above the high grass. We park the car and our neighbor tells us that a grizzly has been seen in the meadow for two days now. Which explains the presence of the ranger: a ranger comes if a grizzly is close to a road, mostly to tell people to stay away. The bears look fuzzy, round and nice, people forget they are wild animals and they want to get close. The grizzly showed up again, walking slowly and eating plants. When it got 40 yards away from the car, the ranger asked us to get back inside.   The grizzly (an adult male according to the ranger), was magnificent and seemed to enjoy very much the plants he found around there. There are approximately 150 grizzlies in the vast Yellowstone Park and I wonder how it is even possible to see a grizzly given the odds...  We drove West to Mammoth Hot Springs that evening, via Tower Roosevelt and saw quite a lot of these sights: the \"new forest\" and the dead trees still standing in the middle of it. It may be the 1988 fire, may be a more recent one. But where the forest burnt, it is regrowing strong and thick."], "link": "http://micheleguieu.blogspot.com/feeds/3210635288806662862/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 4, "http://2.blogspot.com/": 3, "http://3.blogspot.com/": 6, "http://1.blogspot.com/": 3}, "blogtitle": "inspiration, etc..."}, {"content": ["Just before leaving for Yellowstone, I sent an image to Ivan and his family."], "link": "http://micheleguieu.blogspot.com/feeds/1896255735333405397/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://ivansigg.over-blog.com/": 1}, "blogtitle": "inspiration, etc..."}, {"content": ["Grand Teton . In the crisp morning air, we did the trail around String lake after driving a few miles South of Colter Bay.   Passage between Spring Lake and Leigh lake.   Perfect habitat for bears. We came across a small group of hikers who told us that they just saw a black bear and her two cubs on the trail. They made some noise to make them go away a little. We did not see the bears, not sure we wanted to. Everyone we've met while hiking had a bear spray at hand. I do not know if it is because of the deadly attack by a grizzly in Yellowstone last July, or if it is a common thing. We bought one too. The spray does not harm the bears but it helps in difficult situations. On that trail we did not see a lot of people anyway. That's one interesting fact about the National Parks. They have lots of visitors each year and specially in the summer. But once one leaves the Visitor Center and the main overlook stops that are accessible by car, one already lost 95% of the crowd. And so hiking is really amazing, the feeling of being almost alone in a pristine nature is fantastic - but there are the bears of course. And I was thinking about them!  Canoeing on quiet Jackson lake at the end of the afternoon (We rented the canoes at the marina). We saw a bald eagle perched on top of a tree, signaling all the other birds that it was a taken territory.   After a second night in our cabin, we drove a few miles south to get an early breakfast at Jackson Lake Lodge before going on a \"Scenic Snake River float trip\" . The waitress was from Eastern Europe, I do not remember the country. Lots of young people come from all around the world to work in the National Parks for the summer.   Checking out the animal sighting notebook at the lodge.    The float trip on Snake river was great and tranquil. We saw several bald eagles. The raft was not full, only 10 people. Although the park seems pretty busy in some places, our guide says that the average time a visitor spends in the park is an hour and half. That's because the majority of visitors go through Grand Teton on their way to Yellowstone and do not stop .    A black bear on the side of the road. Photo taken from the car.   Arriving in Yellowstone. I like the signage. I took lots of photos of road signs and park signs during this trip.   Crossing the continental divide, a line I've heard about since I was a little girl. \"Ligne de partage des eaux\" (continental divide), \"derive des continents\" (continental drift), \"tectonique des plaques\" (tectonic plates) were terms I was hearing very often in my house, terms about gigantic geological events that I could not comprehend, even with the explanations my father was giving to me.   Arriving in West Thumb Geyser Basin site, a thermal area on the shore of Yellowstone Lake. First encounter with the volcanic activity present underneath the surface of the ground. Smoking and breathing landscape. The strong smell of rotten eggs. Wet and warm fumes charged with sulfur all around us. We walked on a boardwalk which goes around the site. It would be dangerous to walk close to the pools of boiling water: the crust can be super thin and break.   I did not witness it but apparently some people throw things in the pool. I do not understand the need people have to do that. Everywhere in the world. Mostly coins.   Each hot spring has a name: Fishing Cone, Big Cone, Twin Geyser, Blue Funnel Spring, Ephedra Spring...     First turquoise pool, a boiling Caribbean dream! Here's the boardwalk, which allows to enjoy the site with some people around, but nobody in front.     In Mud Volcano site, North of Lake Village. The holes and pools make all sorts of noises. Gargling, bubbling, whistling... The liquids take different appearances, clear, murky, thick and have different colors.       A yellow-bellied marmot enjoying the sulfur fumes... at Sulfur Caldron.   I could have stayed there for hours, watching the bison in the vast lush meadow.   On our way to Canyon Village, along the Yellowstone River, first traffic jam. We learned that it happens pretty often in Yellowstone. Animals cross the roads, cars stop both ways. The bison in this case seemed completely oblivious of the cars. They were taking their time to cross, the males making all sorts of guttural noises.  It was interesting to be so close to the herd, but I've taken this photo through the window. The park regulation is that people should not get closer than 75 feet from a large animal like a bison and 300 feet from bears and wolves, for safety and to leave the wild animals alone. Of course when the animals cross roads, close encounters happen, but being inside the car feels rather safe!"], "link": "http://micheleguieu.blogspot.com/feeds/2401182675322870892/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 4, "http://2.blogspot.com/": 6, "http://3.blogspot.com/": 8, "http://1.blogspot.com/": 5}, "blogtitle": "inspiration, etc..."}, {"content": ["Coming back and having a hard time adjusting. I would have stayed there for much longer. I am always surprised by people telling me they are happy to be back home after a trip. I never feel that way. I love road trips and when we planned to go to Yellowstone a few months ago, it did not take long to decide to drive up there and back. A 16 hours drive through California, Nevada, Idaho and Wyoming. It is really a cool thing to experience the distance, the space.    One of the reasons I first visited the U.S. was to hike in the National Parks in Utah, Colorado, New Mexico and Arizona. To get around one has to drive in the middle of immense desert landscapes which is part of the pleasure of traveling in the West. Music, discussion, naps, silence. Sweet boredom. Watching the shiny massive trucks, the bypassing Union Pacific freight trains. Watching the changing landscapes: in the mountains going up to Tahoe, arriving in Reno and going through the golden Nevada desert for hours, going North to Twin Falls, Idaho, through much greener lands and then through more mountains crossing Wyoming and approaching Jackson.   The billboards, the road signs.   A night in Elko, Nevada, and not in a chain motel. Dinner at Sergio's, a small taqueria. Before the connection became almost non-existent (it was off an on through Nevada and Idaho), we used Yelp to find cool places to stop at, places that we could never had find before.          Stopping at Hansen Memorial Bridge, Twin Falls County, Idaho. In 1919, a high suspension bridge was constructed here, over the Snake River, and then replaced in 1966 by a new construction. Before 1919, there was only a rowboat to cross the river.   The pioneers who crossed the country encountered numbers of impassable gorges like this one. A gorge we crossed in a few seconds with our car.     Shortly after passing crowded Jackson (many people fly there and rent a car to go to Yellowstone), we arrived at the quiet south entrance of Grand Teton National Park and spent the night in Colter Bay village on Jackson Lake, in a cozy historic log cabin. Some people engraved names and dates on the logs around the bed heads. No phone and no TV in the cabin, no internet - except at the office, but we decided not trying to be connected for the rest of the trip. And that was good. We left the few food items we had in the car, due to the presence of bears, and not only black bears. At the registration office, we were told that two female grizzly and their cubs, 5 animals in total, were in the close area. But we felt more threatened by the mosquitoes which attacked us upon our arrival. We bought an insect repellent (all natural!) first thing the following morning at the general store."], "link": "http://micheleguieu.blogspot.com/feeds/1920985635658309081/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 5, "http://www.nps.gov/": 1, "http://2.blogspot.com/": 2, "http://3.blogspot.com/": 3, "http://1.blogspot.com/": 2}, "blogtitle": "inspiration, etc..."}, {"content": ["Toy Refinery by Roderick Ayers, mixed media 2011. \n We went to South First Fridays and walked along South First Street, from the San Jose ICA to my installation, Defragmentation 66, via MACLA, Anno Domini, the ArtCar Fest and the StreetMRKT Fair. Here are my favorite pieces in \"Lift Off\", The San Jose State University MFA Graduate Exhibition @ San Jose ICA .  \n  \n The Conversation by Evan Hobart, oil stick on paper, 2011, a piece inspired by the Bay Area's geography. \n  \n  \n Lenticular Revelations by Nick Tranmer, ceramic, steel and found materials, 2011 \n  \n  \n Installation of drawings by Jose Arenas \n One of the artists featured in \"Navigations of the Fantastic\" @ MACLA.   Opening of the show \"The Melting Kingdom\", a series of paintings by NY artist Dimitri Drjuchin @ Anno Domini.  \n  \n Melting Worship by Dimitri Drjuchin, acrylic on canvas, 48x48\" \n    ArtCar Fest 15th Anniversary Showcase, South First Street.    \n  \n Bodypaint by Trina Merry \n  Street MRKT , and indie diy urban fair, South First Street.     Defragmentation 66 @ Phantom Galleries , 66 first South Street."], "link": "http://micheleguieu.blogspot.com/feeds/5344338987697047668/comments/default", "bloglinks": {}, "links": {"http://www.zhibit.org/": 1, "http://3.blogspot.com/": 1, "http://www.phantomgalleries.com/": 1, "http://www.sjica.org/": 1, "http://1.blogspot.com/": 4, "http://www.maclaarte.org/": 1, "http://4.blogspot.com/": 4, "http://2.blogspot.com/": 3, "http://www.southfirstfridays.com/": 2, "http://www.artcarfest.com/": 1}, "blogtitle": "inspiration, etc..."}, {"content": ["Bright day with Ivan Sigg and his family at the house last week-end, visiting from Paris via San Francisco. Ivan brought us some treasures from France: a colorful poster he created with artist friend Eric Meyer , two books of enigmas he illustrated: Enigmes Litteraires Spectaculaires and Enigmes Litteraires Extraordinaires , and a novel: \" Chroniques de l'Oiseau a Ressort \" by Haruki Murakami ( The Wind-Up bird Chronicle ). And yesterday, we received a wonderful letter in a beautiful envelope!"], "link": "http://micheleguieu.blogspot.com/feeds/497864345513770977/comments/default", "bloglinks": {}, "links": {"http://www.amazon.com/": 4, "http://emeyer.blogspot.com/": 1, "http://1.blogspot.com/": 1, "http://ivansigg.over-blog.com/": 1}, "blogtitle": "inspiration, etc..."}, {"content": [], "link": "http://micheleguieu.blogspot.com/feeds/6005311796532438237/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://2.blogspot.com/": 1, "http://3.blogspot.com/": 2, "http://1.blogspot.com/": 2}, "blogtitle": "inspiration, etc..."}, {"content": ["Defragmentation 66 66 South First Street San Jose, CA 95113 Installation viewable from the sidewalk. The videos are running from 10 am to 10 pm every day. The show runs until August 27. Defragmentation 66 is part of South First Fridays art walk this Friday in San Jose. August 5, 2011. from 7pm to 11pm, free and open to the public. Detailed program here.  Phantom Gallery 408.271.5151  Phantom Galleries is produced by Two Fish Design, in partnership with the San Jose Downtown Association and the San Jose Redevelopment Agency."], "link": "http://micheleguieu.blogspot.com/feeds/1073865558499801646/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.phantomgalleries.com/": 2}, "blogtitle": "inspiration, etc..."}, {"content": ["Watching The Cardboard Box Theatre- The Gnomes  Last Friday, an evening at Montalvo Arts Center in Saratoga: Sculpture on the Grounds Opening Celebration. Sculptures on the lawn and in the park, music, theatre, and an indoor exhibition at the Project Space Gallery: \"Records and Marks\". An interesting journey through refreshing artworks and performances. I love going to that place.    Yoko Ono \"Wish Tree\"  \"Make a wish Write it down on a piece of paper Fold it and tie it around a branch of a wish tree Ask your friend to do the same Keep wishing Until the branches are covered with wishes\" Yoko Ono 2010      \"Control Tower\" by Cameron Hockenson      Listening to music on the front lawn    \"Ground Control,\" by Cameron Hockenson     \"Cy Pres\" by Julia Jacobson.       Adriane Colburn \"Just Below\", 2005  Project Space Gallery Exhibition: Records and Marks Friday, July 29, 2011 - Sunday, October 16, 2011 The show is all about maps, beautiful! I could not take more photos, someone told me it was not allowed after I took those two of Colburn's amazing work.    detail  Montalvo Arts Center 15400 Montalvo Road Saratoga, CA 95070"], "link": "http://micheleguieu.blogspot.com/feeds/5863290009499274634/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 3, "http://2.blogspot.com/": 4, "http://3.blogspot.com/": 2, "http://1.blogspot.com/": 2, "http://montalvoarts.org/": 2}, "blogtitle": "inspiration, etc..."}, {"content": ["On the Half Moon Bay California Coastal Trail     Back to Half Moon Bay - walking on the beach     Looking for important things     Walking to Pillar Point, Princeton."], "link": "http://micheleguieu.blogspot.com/feeds/1479263187213706082/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 2, "http://3.blogspot.com/": 2}, "blogtitle": "inspiration, etc..."}, {"content": ["Recently I was interviewed by the Billboard Art Project about my participation in one of the most interesting projects I've had the opportunity to participate to.  An Interview with Michele Guieu by The Billboard Art Project on Tuesday, July 26, 2011 at 8:12am Approaching a digital billboard as an artistic medium presents a myriad of opportunities to interact with both the surrounding landscape and unsuspecting passersby. In her submissions to the Nashville and Savannah Billboard Art Projects, Michele Guieu started with the fundamental idea that the canvas is also a sign and then created work that addresses how the viewer interacts with the sign.  Born in southern France, Michele is a graduate of the Ecole Nationale Superieure des Arts Decoratifs de Paris, where she studied graphic design and multimedia. She was a graphic designer for years before moving to the U.S., working as a graphic designer for prominent nonprofit organizations, museums and corporate companies. She now spends most of her time in her studio devoted to her art. Michele lives with her family in Sunnyvale, California, and took a moment to talk about her artwork and the Billboard Art Project.  Billboard Art Project: We understand that your background is not exclusively that of an artist. When did you make the transition from graphic design to art, and what prompted it?  Michele Guieu: After a few years of being a graphic designer, I needed to work on something else other than projects for clients. I began a personal series of paintings and drawings in 1991. My graphic design work and my art work were separated in my head and in the facts: I was doing computer work for the graphic design, and I was using traditional media when I was working for myself. In 2005, after moving to the US and taking a break for a few years (I have two children), I finally (f)used all the techniques I’d learned in art school and afterward into my art work. I was no longer torn between being a graphic designer and a fine artist. I was an artist using traditional and nontraditional media.  BAP: What experiences and lessons did you take as a graphic designer that cross over to your work as an artist?  MG: Right after I graduated from art school, I had the unique opportunity to work with the most daring group of French graphic designers, Grapus. With them, I deepened my knowledge of how to work on images and subjects that matter. I endlessly manipulated images, trying and trying again different solutions. There are many possibilities to “frame” an image, to move around each element, to play with the proportions - and therefore to change the meaning. Everything has a meaning; you have to know what you are doing with space, colors, signs, text.  BAP: When you first heard about the Billboard Art Project, what was the initial appeal?  MG: I saw the call for the BAP Nashville on the “San Diego Artists - Resources, Opportunities & Online Community” Facebook page. I thought it was a great opportunity to work in a new medium, and I was interested by the scale. I always have been fascinated by billboards, but they are almost inaccessible - to work on/with - for individual artists. I visited the BAP website, and it looked like an inclusive and generous project, with a broad variety of artists from very different horizons and places.  BAP: Did the project speak to you as both an artist and a graphic designer?  MG: Absolutely. Although the first series I submitted is an adaptation of a series of paintings I had created previously for an installation in a gallery, I almost immediately thought I could create something special for the BAP, a series of images in direct relation to the context of the town, the street, the highway, using the graphic language of the road signs.  BAP: In your submissions, you have approached the signs in a number of different ways. Defragmentation is a series of images you adapted from some of your previous work to be shown on the billboard. Can you tell us a little about how you originally created those images?  MG: “Defragmentation” is an installation (mural, paintings, video) I had shown at Project X Art in Solana Beach last December. It comprises a series of approximately 70 paintings. Each painting is the interpretation of a photo I've taken. I take photos on an everyday basis: landscapes, people, people in landscapes, details of natural elements.  Defragmentation - Nashville, April 2011  BAP: Some of those images seem to have an almost X-ray-like quality to them where ghostly images of metal objects float in the background. What processes do you employ to get this effect?  MG: Through filters in Photoshop, I strip my photos of most of their details to obtain a black and white image, which I crop. With this image in hand, I then work a background, in relation to the structure of the image, directly on the canvas. It is a layering process of acrylic paint and spray paint with the use of stencils: objects like old brushes, and all sorts of kitchen utensils I find at the thrift store. They come in all sorts of shapes which are quite interesting once stenciled. Once the background is done, I project the image I previously worked on, and then paint it - it becomes the dark layer of the painting. For “Defragmentation,” I worked with shades of silver and a very dark blue.  BAP: How do you feel the images in Defragmentation translated to the billboard format?  MG: I think the adaptation worked very well. The images are mostly an evocation of vast natural spaces which echo the symbol of the American urban and road space the billboards represent. It also worked well because the format of the paintings was almost the same proportion as the billboard: narrow and long. I did not have to crop much. I’ve got a few photos of the “Defragmentation” series on the billboard, in the context of the town. Luckily they were taken at dusk. There is a beautiful effect between the dark blue and silvery painting playing with the color of the darkening sky. Also, the painting's silvery background is enhanced by the billboard LED technology. The silver shimmers beautifully when lit.   Signs - Nashville. BAP: In another series of images, \"Signs,\" you play with a variety of colors and symbols, mostly arrows and some images of clip art. As the title suggests, these images relate more directly to the medium as a sign. When you saw the documentation from the project in Nashville, what were your thoughts?  MG: After adapting the series “Defragmentation,” I developed a series in direct relation to the medium, but with a slight twist: the billboard as a (faux) road sign, not as an advertisement. The billboard was working in direct relation with the space it was displayed in. I saw only a few photos in context. The photos from the images using only the arrows worked very well. I could not go to Nashville to see the display and take photos, so I was thrilled when I received the photos you sent me. It was rather magical - I sent to you a series of jpegs to be displayed on a billboard and I received photos of the images on the billboard in the context of the town! I think part of the interesting aspect of the project is the documentation. In that sense, in Nashville, I got lucky: the series of arrows was displayed right next to a highway with other road signs around, and there was a sense of strangeness and playfulness - it was perfect! The series adds to the confusion already existing with the abundance of signs. A scene from “Brazil” came to my mind: “My complication had a little complication.”   Signs - Savannah. BAP: You submitted a progression of similar images to the Savannah show. Did you feel they had the same contextual impact?  MG: For Savannah, I created a new series of faux road signs with only arrows. I wanted to focus on what worked well, because I had seen the documentation of the Nashville show and I could now adjust my designs in response. Unfortunately, the surroundings of the billboard in Savannah were less interesting - for my images - than in Nashville. I can really measure the impact of the context on the content of the images: depending on the context, the images get stronger or lose their strength. That's when I starting thinking that it would be great to get a photo of the billboard - in its context - before I start working on the images. And this time, for the Duluth show, we do have an image, which is very interesting! The best thing, of course, would be to go see the billboards and their surroundings. I hope to do so for the San Bernardino show, as it’s a 5 hour drive from where I live.  Miles To - Savannah.  BAP: You also had another submission in the Savannah show that played with the fact that these images were indeed being displayed on a sign. Could you talk a little bit on what you did with this particular series?  MG: I wanted to develop another series of faux road signs. The proportions of the billboard are very close to those of the green signs on roads/highways indicating the mileage. As I was thinking about how to use them, another idea came along and gave me the content I needed: I was listening to the news, as I often do when I am working, and the names of towns in the Middle East and Africa were referenced often in the programs. Also, the Savannah show would take place not long after the beginning of the Arab spring. I decided to make a series of road signs indicating the mileage from Savannah to a series of towns situated in the Middle East and in Africa. The mileage on my faux road signs is the exact one between Savannah and each town I chose. To calculate the distances, I found a helpful website. With this series, like with the series of arrows, the approach is simple and poetry plays an important role. There is, of course, also a political aspect. To see the names of the towns on an American road sign makes the towns feel closer, maybe more real to the viewer. The jpegs in themselves are not very interesting. What is very interesting is to see the images in the context of an American town, such as Savannah. Fortunately, close to where the billboard was standing, there is the name of a street that is undoubtedly American.  BAP: What is your personal take on the United States’ regional involvement in the cities you listed?  MG: I am thinking more in terms of the question, \"What is the significance of those names repeated over and over in the media?\" The average American citizen does not have much knowledge about what is really going on. All of these towns are far away. When you live in Europe, these towns are much closer, and people travel to Africa or the Middle East. Living now in the US, I really measure the “distance” between here and anywhere else in the world, especially the Middle East and Africa. The series is timely and puts these towns on the “American map.”I also like the idea of surprising the viewer. And that is not easy, given the number of billboards everywhere with thousands of well-thought-out messages (which does not necessarily mean they are interesting – but they are made to catch the viewers attention).  BAP: Have political musings worked their way into your art in the past?  MG: When I started working on my art again in 2005, one of my first paintings was a large portrait of a Muslim woman. I then painted a series of portraits of American soldiers, portraits of women abducted in two different conflicts, and quite a few pieces directly related to the Iraq war. But the core of my work is about personal and daily experiences: places, landscapes, family and friends.  I lived my teenage years in Senegal, Africa, where I was put in front of the reality of the world at a young age. In my art school, I worked closely with a group of politically engaged professors, and later, with the group Grapus, which was also politically engaged. So the political background has always been there, but I find peace and an endless inspiration in nature. I was 11 when I went for the first time to the Sahara, and I still remember it vividly. I always traveled to see beautiful landscapes and I still do. I first came to the US to visit the Southwest and the National Parks of the West. Now that I am an American citizen, I vote and I try to make sense of the complicated world I live in. It’s there in my work. But lots of other things are in there, too!  Words - Nashville.  BAP: Going back to Nashville, there was one other piece entitled \"Hello\" that spoke to passersby. What was your intent with the messages in \"Hello,\" and how did the background images work with the piece?  MG: “Hello” was part of a series of signs including “Hey,” “You,” and “How Are You?,” all direct messages addressed to the viewer. The few photos I’ve got are interesting because they are taken at night in a deserted parking lot. The effect is strange; it’s as if the billboard is speaking into the void.  BAP: Having participated in two shows, and having the intention of participating in others, do you see the roll of digital billboards as an artistic medium developing past a few random shows?  MG: I am definitely interested in exploring the possibilities of using an LED billboard space, in developing different series in different contexts. The fast pace (a few seconds per image) is a limitation. If nobody takes a picture, there is no documentation and it is gone! For me, documentation is key in this project. That is why I think it would be great to see the same series in a different context. If you show the jpegs, they will look the same. But if you show the images in different contexts, the meaning would be different each time. When a billboard is placed in a different context, it tells a different story, and that is what interests me.  BAP: How do art installations on billboards differ from other public art?  MG: The Billboard Art Project offers one very interesting way to work on billboards. There is a certain format: each event is a projection of several series of images by a group of artists on LED billboards, with a certain pace and time frame, a different town each time. The artists have only to create their images and the rest is taken care of. It would be different to create a single unique image for a billboard - printed or handmade. It would be another approach. I would think about it differently. The Billboard Art Project is a public, incorporeal, ephemeral and nomadic project. Four wonderful qualities I am more and more interested in. Public art is obviously public, but not necessarily incorporeal, ephemeral and nomadic!  To see some of Michele's images, visit her Savannah and Nashville albums in the photo section. Savannah Nashville    The interview on the Billboard Art Project website here ."], "link": "http://micheleguieu.blogspot.com/feeds/7547759882890363032/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 2, "http://www.blogger.com/": 1, "http://1.blogspot.com/": 1, "http://www.billboardartproject.com/": 1, "http://2.blogspot.com/": 2, "http://www.facebook.com/": 4}, "blogtitle": "inspiration, etc..."}]