[{"blogurl": "http://www.jamesandthegiantcorn.com\n", "blogroll": [], "title": "James and the Giant Corn"}, {"content": ["Because I get so many questions about this step in one of my published papers. (Well more accurately, my PI gets questions about this step and he sometimes forwards them on to me for an answer). The paper referred to in this guide is this one.  \n There are two completely different steps to reconstructing maize subgenomes: 1) putting together ancestral chromosome pairs 2) grouping one copy of each ancestral chromosome together into subgenome 1 and the other copy of each ancestral subgenome 2. \n Ancestral chromosome pair reconstruction: \n This step hinges on a single assertion backed up by a number of papers: inversions and other forms of within chromosome rearrangements significantly outnumber translocations (movement of sequence from one chromosome to another). This observation has been backed up by a number of previous studies. \n Give that fact (within chromosome rearrangements are more common than between chromosome rearrangments), when two different pieces of the same maize chromosome are orthologous to different parts of the same sorghum chromosome, we can say that those parts of the maize chromosome originated from the same copy of that sorghum chromosome in the twenty chromosome (two equivalent to each single chromosome of sorghum) tetraploid ancestor of maize. \n A good example of this is the comparison between maize chromosome 1 and sorghum chromosome 1 in Figure 1 of the paper you are inquiring about. There are actually two separate segments of maize chromosome 1 which are orthologous to different parts of sorghum chromosome 1. In theory each segment could have come from a different copy sorghum chromosome 1 in the tetraploid maize ancestor and were combined on one maize chromosome through translacations, but the most parsimonious explanation is that both segments came from a single maize chromosome. \n Once we reassemble that first copy of sorghum chromosome 1 (the two pieces on maize chromosome 1), we know that any remaining pieces of the maize genome orthologous to sorghum chromosome 1 must have come from the second copy of that chromosome in the tetraploid ancestor of maize. In this case there is one piece on maize chromosome 5 and one piece on maize chromosome 9, but since we have already reconstructed one whole copy of the chromosome, the only source for these two segments is the second chromosome copy. \n Repeat this logic 9 more times and you have reconstructed ten pairs of ancestral maize chromosomes, just like we did in the paper. (And as cited in our PNAS paper, we weren’t the first to come up with this idea. Before the maize genome was even complete or the sorghum genome was published, another group was able to derive approximately the same ten chromosome pairs by comparing a genetic map of maize to the rice genome: http://www.plosgenetics.org/article/info%3Adoi%2F10.1371%2Fjournal.pgen.0030123 ) \n Assigning ancestral chromosomes to subgenomes \n In this step we examined the number of maize-sorghum orthologs shared between each maize ancestral chromosome and the orthologous sorghum chromosome. This is figure 2 from our 2011 PNAS paper. As you can see in that figure, for each pair of maize ancestral chromosomes, one copy retains a lower percentage of genes found in sorghum along its entire length and the other copy retains a higher percentage of genes found in sorghum along its entire length.  (Too avoid being thrown off by new/transposed genes in sorghum we excluded sorghum genes without orthologs in rice, but you can get the same results without that filtering step, the main difference is that the % retained is lower.) \n The maize ancestral chromosome copy which retained a higher percentage of genes also found in sorghum was assigned to maize subgenome 1 and the maize ancestral chromosome copy which retained a smaller percentage of genes also found in sorghum  was assigned to maize subgenome 2. \n Then we went back and colored maize subgenome 1 blue in figures 1 & 2 and maize subgenome 2 red in those same two figures. Which I think is one of the things that confuses people. The red and blue color coding in Figure 1 shows a distinction we didn’t actually make until after the analysis shown in Figure 2. \n Schnable, James C., Nathan M. Springer, and Michael Freeling. “Differentiation of the Maize Subgenomes by Genome Dominance and Both Ancient and Ongoing Gene Loss .” Proceedings of the National Academy of Sciences 108, no. 10 (March 8, 2011): 4069 –4074."], "link": "http://www.jamesandthegiantcorn.com/2012/06/29/guide-to-reconstructing-the-maize-subgenomes/", "bloglinks": {}, "links": {"http://www.plosgenetics.org/": 1, "http://www.addtoany.com/": 1, "http://www.pnas.org/": 2}, "blogtitle": "James and the Giant Corn"}, {"content": ["Success in grad school doesn’t come from working incredibly hard. \n It comes from setting unrealistically fast deadlines for yourself. And then meeting them. \n Sometimes that means working early mornings, late nights, and weekends. Sometimes it means coming up with a new approach, getting the results in three hours, and sneaking out of lab at 3:30. But the point is the results are what matter. If you can find ways to be unexpectedly productive you’re much less likely to burn out entirely than if you can only ever meet your own deadlines by burning the midnight oil at both ends (mixed metaphor intended) . \n Working hard for the sake of appearing to work hard (either to others or to yourself) is the surest road to burnout and lack of results. \n P.S. Productivity goes up at least 5-fold when not also teaching. \n P.P.S. If the reagents you are working with are as old as you are, you need to worry. (That falls into the working hard but not getting results category.)"], "link": "http://www.jamesandthegiantcorn.com/2012/05/05/success-in-grad-school/", "bloglinks": {}, "links": {"http://www.addtoany.com/": 1}, "blogtitle": "James and the Giant Corn"}, {"content": ["No chance of getting actual funding, just a silly course I signed up for this semester before I realized how crazy everything was going to be between TAing, trying to teach myself how to make RNA-seq libraries, and at least half a dozen collaborations (all of them urgent). I’ve been writing and analyzing and figure making for the past two days straight and turned in my final grant proposal at 10:50 tonight with a good 70 minutes to spare. \n And all I can say is…. \n what a rush! This is why I love what I do for a living. Two days of improvising and lit-searching and throwing different approaches against the wall to see what would stick. And at in the last 24 hours I finally managed to turn my proposal into a project I would actually enjoy carrying out. \n The only problem is that now I kind of want to spend next weekend doing the same thing. Ideally with a shot at actually getting some cash if I successfully sold people on the value of my research. It’s been a couple of months but I’ve finally been re-bitten by the science bug! Speaking of which, I should wrap this up. My alarm is set for 7 AM tomorrow so I can get to lab in time to squeeze in an RNA extraction before class. I’m taking yet another shot at building a proper sequencing library. Wish me luck!"], "link": "http://www.jamesandthegiantcorn.com/2012/04/29/pretend-grant-deadlines/", "bloglinks": {}, "links": {"http://www.addtoany.com/": 1}, "blogtitle": "James and the Giant Corn"}, {"content": ["R, you may be a confusing and hard to understand language where every package comes with its own set of quirks and foibles. You may make me feel less like a programmer and more like a not-very-well trained magician fumbling around for the right incantation to make magic happen. \n But when you work, you do awesome things. \n  Sex specific splicing of a gene of unknown function of a gene syntenically conserved in all grass species. \n With only four days work I was able to go from a giant pile of reads (from the still not properly appreciated Davidson 2011 The Plant Genome) to figures like the one above. \n So what is the figure above showing you? One of a large number of genes which show a different pattern of splicing in male and female reproductive organs in maize.* The region “E8″ is usually treated as exonic in female reproductive tissues but is spliced out like an intron in male reproductive tissues. What does it mean (if anything)? I have no idea yet! But it would have been a real pain to try to re-invent the wheel for identifying these deferentially spliced genes in python. In R, once I figured out the right incantation, it’s practically plug and play for any gene you could possibly be interested in. Including the software for the (actually quite useful) visualization shown above. \n So thank you R. What you do — once I can figure out how to make you do it — you do incredibly well. \n *Maize makes it easy for us by separating female and male flowers into two entirely different organs (the ear and tassel respectively). \n Data from: \n \n Davidson R. M., Hansey C. N., Gowda M., Childs K. L., Lin H., Vaillancourt B., Sekhon R. S., Leon N. de , Kaeppler S. M., Jiang N., Buell C. R., 2011  Utility of RNA Sequencing for Analysis of Maize Reproductive Transcriptomes. Plant Genome 4 : 191–203. doi: 10.3835/plantgenome2011.05.0015 . \n \n Analyzed using the R package DEXSeq: \n Anders S, Reyes A, Huber W. 2012 Detecting differential usage of exons from RNA-Seq Data . Unpublished. (Link is to a PDF)"], "link": "http://www.jamesandthegiantcorn.com/2012/04/23/in-which-i-apologize-to-r/", "bloglinks": {}, "links": {"http://www.jamesandthegiantcorn.com/": 1, "http://precedings.nature.com/": 1, "http://www.addtoany.com/": 1, "http://dx.doi.org/": 1}, "blogtitle": "James and the Giant Corn"}, {"content": ["I doubt this will be of interest to that many people but here’s the list of what I’m working on this sunday (each item is a separate project/collaboration): \n \n Downloading, decompressing and quality/adapter trimming more than 800 million RNA-seq reads (four full Hiseq 2000 lanes). \n Attempting to make my very own transcriptome assembly for a species where the genome is available but doesn’t look to be published anytime soon. \n Figuring out how to look at differential use of exons in maize between male and female floral structures.  (Later on this will involve using some R packages. I’m not looking forward to that part. R always makes me feel like I’m coding with one hand tied behind my back). \n \n The surprising part is that I’m not being held up by a lack of processors to throw at the problem (the usual problem in computation work), nor a limited supply of RAM (probably the biggest problem in bioinformatics specifically). Instead I’m hitting the limit of how fast all these various programs can read data off of hard drives and write results back. Right now I am waiting for a little surplus capacity to free up. \n It’s hard to believe that eight months from now this will all be over.  I started my education back in 1990. If they kept numbering years in school after high school I’d be a 20th grader right now. But my adviser has informed me that I need to have graduated by this December, so that’s what I have to make happen. Next week is my last as a graduate student instructor. This summer and part of the fall will be a mad sprint to finish up various projects and collaborations and get them written up for publications, then thesis writing, signing, and submitting are all that stand between me and (hopefully) the last degree I’ll ever need to earn."], "link": "http://www.jamesandthegiantcorn.com/2012/04/22/io-limited-assorted-updates/", "bloglinks": {}, "links": {"http://www.addtoany.com/": 1}, "blogtitle": "James and the Giant Corn"}, {"content": ["qTeller isn’t just for generating spreadsheets full of data on genes within an genomic region . It can also visualize published expression data for a single gene. For example here is the expression pattern of a gene called golden plant2 involved in regulating photosynthetic development in maize which was first  described all the way back in 1926 in an article in the american naturalist : \n  \n As you can see golden plant2 is expressed at high levels in photosynthetic tissues and not expressed at all in tissues like roots, endosperm, and pollen. Do you know how long it would have taken me to profile the plant-wide expression pattern of a gene this comprehensively by isolating RNA from different tissues using qPCR? WEEKS! Do you know how long it took for me to get the same level of insight with qTeller? 90 seconds! \n Do you know how long it’ll take you to regenerate this same analysis? 30 seconds. Just click this link . There have been so many awesome RNA-seq papers coming out recently for maize. I know when I arrive in Portland on Thursday for the Maize Genetics Conference I’m going to see a whole lot more even bigger/better RNA-seq datasets which people haven’t finished writing up yet. Some of these datasets have been on posters since the very first maize meeting I went to back in 2009 when I was a wide-eyed first year and may _never_ get published.* But others will be published weeks or months from now, making this visualization all the more powerful. \n But for now, MORE EYE CANDY: \n Anther ear1 \n  Expression of anther ear1, a mutant in the gibberellic acid biosynthetic pathway \n Link to regenerate analysis \n Glossy1 \n  \n Link to regenerate analysis.  \n Glossy1 mutants change the type of wax produced on the leaves of developing maize seedlings, so it makes sense that the gene shows high expression in both maize seedlings and mature leaves. I can even sort of explain away the high expression in developing seeds and embryos since the the primordia which will eventually become the first leaves of the next generation of corn plants are beginning to form, But why in the world does glossy1 show such high levels of expression in anthers? \n *Here is the relevant excerpt from my previous rant on data analysis : \n I recently did the math on a PLoS Genetics paper published in late 2009 based on on a single in-depth analysis of RNA-seq comparisons of mutant and non-mutant siblings. Today we could generate the same dataset, with twice the depth of sequencing for less than $1000 dollars. (INCLUDING regent costs). The takeaway lesson here:  just because your dataset was expensive to generate doesn’t mean you don’t have to worry about the competition stealing the glory if you take more than a year to publish."], "link": "http://www.jamesandthegiantcorn.com/2012/03/13/qteller-part-2-eye-candy/", "bloglinks": {}, "links": {"http://www.jamesandthegiantcorn.com/": 5, "http://qteller.com/": 3, "http://dx.doi.org/": 5, "http://www.addtoany.com/": 1, "http://www.maizegdb.org/": 4}, "blogtitle": "James and the Giant Corn"}, {"content": ["Hunting for good candidate genes is something biologists spend a lot of their time doing. Here are a couple of hypothetical examples: \n A) Suzzy the grad student is mapping a recessive mutant which makes the pollen of cornplants shrivel up and die. By examining a bunch of known genetic markers in plants with dead pollen and normal pollen producing siblings of those plants she has narrowed the location of the gene responsible for her trait down to a region of only a couple of megabases on the fifth chromosome of maize. Since the whole maize genome contains over 2,300 megabases of sequence that means she’s already ruled out 99.9% of the genome. But her region still contains, say, a dozen genes and she needs to know which one she should check first to see if mutation in it is responsible for her mutant phenotype. \n B) Johnny is another grad student. He wants to understand how corn plants genetically regulate how wide their leaves will grow to be. By measuring a lot of plants descended from two parents, each with known genotypes, he can identify regions of the genome where inheriting information from one parent or the other seems to be correlated with either wider or narrower leaves. He calls these regions quantitative trait loci (or QTLs). Now he has picked the genetic region that seems to have the biggest effect, and he wants to know what gene within the region is actually responsible for the effect. \n There are a number of ways for both Johnny and Suzzy to narrow down their lists to the genes most likely responsible for the changes they are each observing in corn plants: \n \n  A okay candidate might contain a protein domain with a function related to the plant trait they were studying. \n A good candidate might show a specific pattern expression in the part of the plant where they observe their phenotype (pollen for Suzzy and developing leaves for Johnny). \n A GREAT candidate would be a gene which has already been studied by another group and has a mutant phenotype related to the phenotype currently observed.* \n \n Checking out the protein domains of genes under a QTL or mutant interval can be accomplished in almost any genome browser (for example the ones provided by MaizeGDB , or CoGe ). \n Checking the expression patterns of genes is harder. One option for plants is a website called PlexDB which lets you look up the expression of individual genes in different people’s microarray experiments. The biggest problem with microarrays is that it really is impossible to compare expression between different people’s microarray experiments. \n Identifying known mutant genes within a genomic interval used to be a real pain. Now they could search the classical maize gene list to see if any of the genes in their interval appear on it, but it is still not what you’d call efficient. \n Now imagine a website that let you check all those things in one step ! \n  Example of data on genes in a region 10 megabases from the start of maize chromosome1. Click to zoom in and make the text big enough to read. \n The automated annotations of protein domains are the same ones you’d find in any of the genome browsers above, but instead of checking each gene in turn, qTeller reports them all in a handy sortable spreadsheet (which you can either view online or download to your computer). \n It also incorporates measurements of gene expression using RNA-seq data from papers published by the maize community.** To make the numbers as comparable as possible I went back to the raw reads provided by NCBI’s Sequence Read Archive and taken each dataset through the same analytical pipeline. \n And, of course, it reports any classical maize genes which lie within the interval a researcher is studying (taken from the version two classical maize gene list.) \n Plus syntenic orthologs in other species. Because, at least in the grasses, genes with mutant phenotypes are  disproportionately likely to have been retained at the same location in the genome of lots of different grass species . \n  \n Suzie found a gene within her interval which was expressed at much higher levels in pollen than in leaf tissue: \n  \n And Johnny realized that his QTL contained the mutant gene milkweed pod1 , a classical maize mutant known from previously published papers to be involved regulating in leaf development. \n  \n So yeah, qTeller is what I’ve been working on for the past few months. Please let me know if you run into any bugs or have any questions.  -James \n *Admittedly this would be rather disappointing news for the grad students involved (it’s a lot harder to get a splashy paper out of rediscovering a known mutant), but it’s much better to find out you might be studying a known gene early so you can check and cut your losses if it turns out to be true, instead of after you sink another couple of years into recloning and recharacterizing it. \n **The authors of all these papers deserve a whole bunch of credit for generating these datasets: \n \n Waters AJ, Makarevitch I, Eichten SR, Swanson-Wagner RA, Yeh C-T, et al. (2011) Parent-of-Origin Effects on Gene Expression and DNA Methylation in the Maize Endosperm.  The Plant Cell  doi: 10.1105/tpc.111.092668 . \n Davidson RM, Hansey CN, Gowda M, Childs KL, Lin H, et. al. (2011) Utility of RNA Sequencing for Analysis of Maize Reproductive Transcriptomes.  The Plant Genome 4:191-203 doi: 10.3835/plantgenome2011.05.0015 \n Li, P., Ponnala, L., Gandotra, N., Wang, L., Si, Y., et al. (2010) The developmental dynamics of the maize leaf transcriptome.  Nature Genetics  42: 1060-1067. doi: 10.1038/ng.703 \n Wang, X., Elling, A.A., Li, X., Li, N., Peng, Z., et al. (2009) Genome-Wide and Organ-Specific Landscapes of Epigenetic Modifications and Their Relationships to mRNA and Small RNA Transcriptomes in Maize.  Plant Cell  21: 1053-1069. doi: 10.1105/tpc.109.065714 \n Jia, Y., Lisch, D.R., Ohtsu, K., Scanlon, M.J., Nettleton, D., et al. (2009) Loss of RNA Dependent RNA Polymerase 2 (RDR2) Function Causes Widespread and Unexpected Changes in the Expression of Transposons, Genes, and 24-nt Small RNAs.  PLoS Genet  5: e1000737. doi: 10.1371/journal.pgen.1000737 \n The Maize Gametophyte Project : Unpublished Dataset  SRP006965"], "link": "http://www.jamesandthegiantcorn.com/2012/03/13/qteller-a-way-to-find-candidate-genes/", "bloglinks": {}, "links": {"http://qteller.com/": 2, "http://genomevolution.org/": 2, "http://www.addtoany.com/": 1, "http://www.jamesandthegiantcorn.com/": 4, "http://www.plosone.org/": 1, "http://maizegametophyte.org/": 1, "http://www.plexdb.org/": 1, "http://www.maizegdb.org/": 2, "http://trace.nih.gov/": 1, "http://dx.doi.org/": 5}, "blogtitle": "James and the Giant Corn"}, {"content": ["Jonathan Eisen has a new post up on his blog “The Tree of Life” tearing apart a letter from the Ecological Society of America (link is to a pdf). In the letter, the ESA comes out against the government requiring that papers funded by federal research dollars must be made available for free online after a set amount of time has passed since publication. Jonathan Eisen, one of the strongest voices in the open access movement, naturally finds this position disturbing. But why would a scientific society come out against the open dissemination of information? Here is my — entirely speculative — explanation. \n First a little bit of background: right now research funded by the National Institutes of Health must be made freely available online within twelve months of publication. This can either mean publishing in an “open access” journal, or publishing in a traditional journal which allows the authors to deposit their results into a free online archive like PubMed Central after a year (something is pretty much all the biomedical journals do now, since not allowing it would mean almost no researcher should still publish papers in those journals). This mandate has worked out so successfully that it may end up being extended to all federally funded research (which means research funded by agencies like the Department of Energy, the USDA, and the National Science Foundation). \n Ecologists who receive federal funding would almost never be funded through NIH, but they certainly might receive grants through DOE (bioenergy), USDA (integrated pest management), and they’d be most likely to receive money from NSF. So the Ecological Society of America, which also publishes a number of ecology focused journals, is confronting the idea that many of the articles it publishes may have to be made freely available online a year after publication. It seems that they fear letting people get access to research papers without paying to subscribe to their journals will mean a lot of universities will stop subscribing and without that money: \n …the Society could not continue to provide the peer-review and editorial services needed to produce high quality scientific publications. \n Now there is a whole separate argument I’m going to put to the side for now: Would  placing papers online a year after publication would really cause universities to start dropping their subscriptions to ecology journals? (This clearly hasn’t been the case in the biomedical field, but the Ecology Society makes some points about how their field might be different). I honestly don’t know the answer. But for the sake of argument, let us say that the Ecological Society of Americas fear are well founded. \n The most common way for journals to offset the loss of income from subscriptions is to implement what is known as the “author pays” open access model, where the authors of the paper pay the journal a set fee if their article is accepted for publication, and the article is freely available online from day one. The arguments for the “author pays” model (as opposed to open access itself which has more good arguments going for it than I can count) go a bit like this: \n \n Since universities already take a large cut out of any grants researchers receive as “indirect costs” to pay for — among other things — journal subscription fees, the journals are making money off of the authors’ grants, and at least this way researchers don’t have to continue paying for access to an article once it is published. \n Many journals already charge hundreds or thousands of dollars for papers that have color figures, too many pages, and/or more than a set number of supplementary materials. So clearly scientists can find the money to pay for having their papers published when they need to. \n Almost all reputable open access journals have policies in place which waive publication charges for authors who simply cannot pay. \n \n So why does the Ecological Society of America just move its journals to an “author pays” open access model? Well I can only speculate and I’m not even an ecologist. But my best guess is because most ecology labs are incredibly poor. There may be a few rockstar labs out there, but in my experience the vast majority of ecology grad students end up having to work as teaching assistants to pay for being in grad school since their professors have no grant money to fund them. In their “spare time” these students write lots and lots of tiny grant proposals (many to private foundations), picking up a few thousand dollars to fund some experiments here, and a few hundred dollars to fund traveling to a conference there. \n \n If a grad student is particularly lucky she (or he) might win an NSF graduate research fellowship, which will pay for their tuition and salary while they conduct research for three years,** or an NSF Dissertation Improvement Grant (which award tiny amounts of money by the standards of molecular biology but which can be stretched out to fund a significant amount of in ecology research). In both cases though, the funding is won by the graduate student, not the professor, and the the university is not permitted to scoop up any of the money as indirect costs. So it would not surprise me at all if the “journal subscription” portion of the indirect costs from grants that ecology departments bring in do not cover the costs of subscribing to ecology journals.*** \n \n So what about the second argument, that clearly authors can find the money to pay for color images and extract pages, so what’s wrong with making them pay simply to publish their article? Well if you’ve ever read ecology literature you will now that figures are without exception in black and white (making papers published yesterday look like something out of the 1970s), and papers always always respect page limits. \n \n And while I agree that the we-only-charge-you-to-publish-if-you-can-afford-it model does a lot to defuse worries about “author pays” models distorting the scientific record, it simply isn’t the solution for journals devoted to a field where almost every lab could make a good case for not having the money to publish. \n \n It’s not clear there is even a problem yet. It wouldn’t surprise me at all if universities aren’t nearly as eager to drop their subscriptions to ecology journals (and make their faculty wait a year to read the latest scientific results) as the Ecological Society of America apparently fears. But I have no trouble at all understanding why the field of ecology isn’t as enthusiastic about implementing ”author pays” open access as fields without so many grad students (and whole labs) working with little or no funding. \n \n h/t to  @PlantGenetGenom  the twitter feed of Frontiers in Plant Genetics and Genomics, the open access (and author pays) journal that published one of my first papers. \n *One alternative for-profit conferences (like PAG) already exist, but the atmosphere at these meetings is very different and because registration costs more (and housing since they tend to be held at more expensive locations) many labs can’t afford to send as many people (or anyone) as they can to other meetings. \n **It should be noted that some ecology departments have mechanisms in place to punish students who win outside funding to cover their salaries, such as giving them last choice of which courses to teach in the years when their salary is not being covered by outside agencies. \n ***In which case the cost of subscribing to ecology journals is either being subsidized by other, better funded departments, or offset by the tuition payments of undergraduate students who sign up for ecology and evolutionary biology courses in droves (if only we could get undergrads as excited about plant biology!)."], "link": "http://www.jamesandthegiantcorn.com/2012/01/06/open-access-and-ecologists/", "bloglinks": {}, "links": {"http://www.esa.org/": 1, "http://phylogenomics.blogspot.com/": 1, "http://www.frontiersin.org/": 1, "https://twitter.com/": 1, "http://www.addtoany.com/": 1}, "blogtitle": "James and the Giant Corn"}, {"content": ["First of all, apparently I’ve been spelling Pigeonpea wrong. The random “d” I was inserting comes from “pidgin.” But fortunately that’s not what the scientific feud is about. \n Instead, it turns out that there were actually two independent assemblies of the pigeonpea genome published in separate journals within a couple of weeks of each other. \n One, which I’ve been talking about, was published in Nature Biotechnology (impact factor 31) on November 6th. This pigeonpea project was run by ICRISAT (one of the CGIAR centers) with much of the actual sequencing and informatics contracted out to BGI (the Beijing Genomics Institute). \n But what I didn’t know was that a second pigeonpea assembly was published back on October 25th in the “JOURNAL OF PLANT BIOCHEMISTRY AND BIOTECHNOLOGY” a journal far fewer scientists will recognize the title of (impact factor 0.41). This genome was put together by a group at the Indian Council of Agricultural Research (ICAR). \n Confused by all the acronyms yet? \n Alright, I’ll drop all of them for the remainder of this post: \n One group: \n \n Has a longer history of working on pigeonpea genomics \n Published first (if just barely) \n \n The other: \n \n Published in a much higher impact journal \n Has more total assembled sequence* \n \n Seems simple enough. And just the sort of thing that is bound to happen more and more as the cost of genome sequencing continues to drop. Unfortunately there seems to be a lot of bad blood between the research groups and all sorts of stuff (like who is more of a real indian ) is getting dragged in. Check out the comments section on this article. \n I really only have two thoughts on the subject: \n \n The research community really will benefit if these two research groups can make peace with each other and merge their data into a combined assembly for version 2 of the pigeonpea genome. Neither assembly is all that great yet, and the two genomes were sequenced using different technologies: 454 sequencing (fewer longer reads) and Illumina sequencing (more shorter reads). A merged assembly could capture more of the total genome and — more importantly in my opinion — maybe get a larger fraction of the current sequence placed and orientated within the pseudomolecules. Right now less than 250 megabases of the 600-odd megabase genome are placed within chromosomes. The other 350 megabases are present as over 100,000 floating contigs, many as small as 103 bp of sequence. \n These situations are terrible for everyone directly involved, all of whom are probably afraid they will not get the credit they expected for the incredibly hard work of sequencing a genome. But the same mess is good for both the broader scientific community and the world as a whole. Incidents like the current one with pigeonpea or the competing chocolate genome projects and the three cucumber genomes  drive home one message. Genome projects can be scooped . You can’t afford to sit on your data for months or years… you need to write up your findings and make your data available fast. As a result science moves faster (good for us scientists trying to publish) and in the long term important discoveries with the potential to help people are made faster (good for the whole world). \n \n *In the article linked above the author states: “The major difference between the two sequencing projects is that while the ICRISAT-led team has assembled 605.78 Mb out of the 833.07 Mb (about 72.5%) of the genome, the ICAR team has captured 511 Mb (about 61%).” I haven’t had a chance to look at the ICAR assembly yet, but to get to 605 Mb the ICRISAT assembly is including contigs as small as 103 base pairs, which is a uselessly small piece of DNA from a genomics or genetics perspective. So comparing raw “sequence assembled” numbers without asking “how many pieces? (and how big were they?)” clearly will not give the whole picture."], "link": "http://www.jamesandthegiantcorn.com/2011/11/26/bad-blood-on-pigeonpea/", "bloglinks": {}, "links": {"http://www.jamesandthegiantcorn.com/": 1, "http://agrariancrisis.in/": 1, "http://genomevolution.org/": 1, "http://www.addtoany.com/": 1}, "blogtitle": "James and the Giant Corn"}, {"content": ["Not that grad school isn’t loaded with plenty to begin with, but here’s one I hadn’t considered before : \n Yes, for many people, a college town is a rather idyllic place. There is a specific subpopulation in these college towns, however, for whom the experience becomes utterly hopeless. This subpopulation: those who move to college towns, are not college-aged, and arrive without a significant other. Meet those requirements, and you’re basically hosed until you escape. It is the bog of eternal singlehood. \n … \n Well, at least as a consolation, you will find great friends, for whom your sad, lonely, single self will serve as a reminder of why they need to stay committed to their own relationships. \n Yikes! I would say another big part of the puzzle is that grad student lifestyle (regardless of where you live) isn’t friendly to attempts to get out and meet new people. Take the fact that I’m sitting in the office updating my blog while waiting for one last genome to finish loading into CoGe ( pigeonpea !) at seven-thirty on a Friday night.* \n And that means even if you did happen to come into grad school with a significant other, things can get messy ( as explained by the Genomic Repairman ): \n So when work builds up, I tend to act less human and more like a robot and just grind away. And unfortunately I take on a sort of tunnel vision when I’m grinding. … If its not directly related to whats happening now it gets place on the backburner, which is fine if its mundane paperwork or BS emails that need to be sent out. Its not good if its your relationship and its going to cause tension. \n I think its hard for a significant other who doesn’t do science to appreciate what we do. We can’t check out of work at 5pm and not worry about it to the other day. The stakes are too high in the game we play and you must be invested in your work. I am. I wake up at night with ideas, fears, and concerns. Did I do the transfection right? Am I being scooped? \n Emphasis mine. \n *Just to be clear no one MADE me work late on the friday after thanksgiving. It is just really easy to get engrossed in science — at least when your research is going well — lose track of time, and ignore the rest of your life."], "link": "http://www.jamesandthegiantcorn.com/2011/11/25/look-its-another-reason-to-dispair/", "bloglinks": {}, "links": {"http://genomevolution.org/": 1, "http://www.labspaces.net/blog": 1, "http://igotgenes.blogspot.com/": 1, "http://www.addtoany.com/": 1}, "blogtitle": "James and the Giant Corn"}]