[{"blogurl": "http://www.juiceanalytics.com/writing\n", "blogroll": [], "title": "Juice Analytics"}, {"content": ["Despite the debacle that was known as the “replacement refs”, football is back!  And if football is being played, then that means fresh new data is being made. We are helping our friends over at FootballOutsiders.com (a.k.a. heaven for NFL stat junkies) display the 2012 NFL Snap Counts in our Leaderboard visualization. Each week you can view which players have played the most (or least) on offense, defense, and special teams. The data can be filtered by position or team and you can search for your favorite player (or fantasy sleeper pick) by last name. \n After you finish, jump to Juice Labs  and try making a Leaderboard using your own data. It is as easy as 1) paste in your own CSV data; 2) configure the data elements you want to show (see the “Learn how” button in the Data area); 3) share a link to your newly created visualization or embed it in your website. \n  \n We are looking forward to adding more visualizations like this to Juice Labs over the coming months. In each case, you’ll be able to use your own data and easily share or embed the visualization. All free. \n (Bonus) Football Outsiders Scavenger Hunt. See if you can find these 3 items in the 2012 NFL Snap Count Leaderboard: \n 1. Which offensive players played on a defensive snap in Week 3? \n2. Where does Ryan Lilja from the Kansas City Chiefs rank for special teams snap percentage in Week 2? \n3. Which linebackers in the NFC East have more than 150 total snaps thru Week 3? \n Thanks to our summer intern Duane Rollins for his help on getting this together."], "link": "http://www.juiceanalytics.com/writing/are-you-ready-for-some-football-we-are/", "bloglinks": {}, "links": {"http://labs.juiceanalytics.com/": 2, "http://www.footballoutsiders.com/": 2, "http://www.linkedin.com/": 1}, "blogtitle": "Juice Analytics"}, {"content": ["What would your perfect sales pipeline dashboard look like? \n The tools that so effectively capture sales information ( Salesforce , PipelineDeals , Highrise ) tend to do a pretty lousy job of providing visibility into that very same data. The reporting or analytics is often just a table with lots of filtering features. That doesn’t begin to answer important questions like: \n \n What is the value of the pipeline? \n Where is it performing efficiently? Where is it failing? \n How are things likely to change in the next month? \n \n I’ve been annoyed by this deficiency in sales dashboards for a while. Ken and I put together some thoughts about what a better sales pipeline information interface would look like and how it would function. Here’s what we came up with: \n  \n The dashboard flows from top to bottom and has five main parts: \n \n Question-based navigation; \n Filters to narrow the scope of your analysis; \n Summary metrics built around the stages of your sales pipeline; \n Top (or bottom) performers visualization to emphasize what factors are driving success (or failure); \n Detailed table showing individual leads or deals. \n \n Let’s look at some of these pieces in a bit more detail: \n  \nZooming into the top section, we’d want to direct users to key and common questions. Once selected, the question would configure elements in the dashboard (primarily the sales pipeline key metrics) to lead the user to answers. For expert users, these questions could act like customized short-cuts. Novice users get help focusing on the important issues and can learn from best-practices. \n  \nThe top performers visualization highlights the factors that are most aligned with success of the pipeline. These factors may be the product being sold, the sales representative who is selling it, or the source of the lead. The vertical position of each top item is based on the selected key metrics. The same visualization could be flipped around to show the characteristics that are leading to the poorest performance. \n  \nFinally, selecting elements in the visualization would refine the data in the table of deals/leads at the bottom to give the user to the specific items to act on. \n By no means is this a perfect and comprehensive dashboard for sales data. But I haven’t seen anything as directed and functional. If you have, I’d love to see it. \n Update: I just came across InsightSquared , and like some of the views they offer for sales data (e.g.  sales pipeline visualization ,  sales trending )"], "link": "http://www.juiceanalytics.com/writing/designing-a-better-sales-pipeline-dashboard/", "bloglinks": {}, "links": {"http://www.salesforce.com": 1, "http://www.pipelinedeals.com": 1, "http://highrisehq.com/": 1, "http://www.insightsquared.com/": 3, "http://www.juiceanalytics.com/": 4}, "blogtitle": "Juice Analytics"}, {"content": ["Conventional \n \n 4-door sedan \n \n Financial spreadsheet \n \n Old-school conference \n \n \n \n Un-conventional \n \n Tesla Model S \n \n Interactive model \n \n Product Camp un-conference \n \n \n \n Juice isn’t known for doing things in traditional ways. I guess that’s one of the reasons we’re good at what we do. So, when we had the opportunity to sponsor the 2012 Atlanta Product Camp un-conference, we knew we had to get involved. \n  \n If you’re not familiar with Product Camp, it’s based on the barcamp un-conference model where people who are interested in a particular concept come together and decide right then and there what sessions they think should occupy the day. In other words, the agenda just includes slots and potential topics, but the actual session topics are not settled until the day of the event. For Product Camp, this is all about product management and marketing: a full day of learning, discussing, and practicing great product management tips and techniques — all based on what those actually in attendance want to discuss. \n So, if you’re a Juice fan, a product manager, and in Atlanta (or nearby), click through to register (it’s free) and join Juice and the other 300 folks who are already registered. \n Here’s one more conventional/not conventional comparison for the road: \n Conventional: donuts \n Un-conventional: Sublime doughnuts (the breakfast Juice is providing at Product Camp) \n (Oh yeah, I forgot to mention that we’ve proposed a topic for discussion: “Winning Friends and Influencing People… with Data!” So, we’d love to see our community show up and vote Juice into a session slot — let’s show the Atlanta product community how to communicate better with data!)"], "link": "http://www.juiceanalytics.com/writing/have-juice-with-juice-at-product-camp-atlanta-2012/", "bloglinks": {}, "links": {"http://www.juiceanalytics.com/": 1, "http://sublimedoughnuts.com/": 1, "http://pcampatl2012.eventbrite.com/": 1, "http://pcampatl.com/": 1, "http://en.wikipedia.org/": 1, "http://media.juiceanalytics.com/": 1}, "blogtitle": "Juice Analytics"}, {"content": ["The Olympics are nearly upon us and the growing patriotic fervor can only be matched by the impending wave of Olympics-themed data visualizations. Here’s our early contribution, a couple of dashboards letting you explore Olympic Medal counts from 1972 to the last summer Olympics in 2008. \n The first dashboard focuses on the question: Which countries have acquired the largest, most glitter-y pile of medals? It features a visualization we call a “leaderboard” which ranks countries based on total medals, gold medals, silver medals, bronze medals, and finally percent of medals that were gold (just to prove that you don’t have to win a lot of medals to stand out). \n  \n The second dashboard is designed to explore the performance of one country at a time, showing total medals by type, and which sports, events, and athletes were most responsible for the medals. Select the filter area to choose a country, then drill into the treemap to see the strengths of the Olympic teams. \n  \n These two dashboards were created with our recently released Slice application for creating interactive reports. Slice makes it easy to upload a data file and create beautiful visualizations linked together into a clear narrative for your readers. Find out more about Slice here ."], "link": "http://www.juiceanalytics.com/writing/slicing-olympic-medals-from-1972-till-now/", "bloglinks": {}, "links": {"http://www.juiceanalytics.com/": 6}, "blogtitle": "Juice Analytics"}, {"content": ["Over the years, our Chart Chooser website has gained fairly significant attention from folks like Jason Shen , O’Reilly Radar , and Lifehacker . But more importantly, it has gained notoriety from folks like you who have loved it and used it to have better conversations with data — and that’s what really gets our hearts pumping. \n So, as thanks for making Chart Chooser one of our most popular creations, we decided it is time for a remake. Introducting Chart Chooser Version 2! \n  Chart Chooser version 2 \n If you’re new to Chart Chooser, it helps you identify the right chart based on what you are trying to show, and then lets you download the Excel or PowerPoint version of that chart to help you get your job done — all in Tufte-compliant style. \n We’ve remade this free tool using HTML (Version 1 was written in Flash which is oh, so last year) and have improved the navigation and filtering. Additionally, we’ve been working on some pretty cool things in the Juice Labs and the new framework will enable us to add the best of these creations for you all to see and use — stay tuned! \n Thanks to Andrew Abela of Extreme Presentations  for inspiring Chart Chooser with his  “Choosing a Good Chart”  post and for working with us to put this tool together. \n So, are you ready? Give it a click and choose your chart to your heart’s content!"], "link": "http://www.juiceanalytics.com/writing/introducing-chart-chooser-v2/", "bloglinks": {}, "links": {"http://extremepresentation.typepad.com/blog": 1, "http://chartchooser.com": 2, "http://www.jasonshen.com/": 1, "http://radar.oreilly.com/": 1, "http://lifehacker.com/": 1, "http://extremepresentation.typepad.com/": 1}, "blogtitle": "Juice Analytics"}, {"content": ["The Juice Analytics team will be in Nashville July 9 – 11, 2012 and while we can’t carry a tune, we’ll have with us an interactive demo of our hosted reporting platform to share. Of course, we’ll also share the latest around dashboard and interface design, as well as data visualization, in general, along with other stuff that interests you. \n Reach out if you’d like to meet up while we’re in town. \n (P.S. If other cities have pent up demand for Juice, reach out and we’ll consider a visit.) \n Cheers!"], "link": "http://www.juiceanalytics.com/writing/hosted-reporting-needs-in-nashville/", "bloglinks": {}, "links": {}, "blogtitle": "Juice Analytics"}, {"content": ["Is the Score or the Rainbow More Memorable? \n \n A cool afternoon rain was the only thing damper than the spirits of the 12-year-olds who shuffled off the field. With the score still lit up on the wooden scoreboard, the coaches yelled to the boys as they struggled to lift their heads so they might catch a glimpse of a rainbow as it rose from the fence in front of them. \n The players of both the winning and losing teams stood there on the wet, steamy grass, frozen in place, in awe of the sight of a rainbow that mystically appeared as if painted on the sky just for them to see. For them, it was an atta boy, pat on the back, a perfect way to wrap up a hard fought double header in which the score had not quite represented the effort that the losing team had given, where the stats failed to tell the tale that brought these two teams together on the hallowed Cooperstown soil. \n \n That’s the thing about numbers. When left to their own devices, they can feel as cold as digits on a lonely scoreboard. They say nothing of the teams who trained for months, played together game after game, relinquished their Saturdays and played nearly perfect seasons just to get to the tournament. \n Numbers alone tell us nothing of context. When we have something particularly meaningful to say, images help us share it best. Dashboards and data visualizations bring to life presentations in which we can engage in two-way conversations with our audience making the story around our data more memorable , impactful and effective than any spreadsheet or table of numbers we can put in front of them. \n What will your audience remember? The numbers, the final score? Share visually, and they will remember the rainbow and the sunshine that most certainly will follow. \n Special thanks to Peter Bielan, my significant other, for inspiring this blog by sharing this photo that he shot during his son’s baseball team pilgrimage to Cooperstown, NY this week."], "link": "http://www.juiceanalytics.com/writing/data-empowers-conversations-and-rainbows/", "bloglinks": {}, "links": {"http://www.juiceanalytics.com/": 2}, "blogtitle": "Juice Analytics"}, {"content": ["Every day, there are thousands of discussions in businesses that rely on data for answers. Many of these conversations fall into the same patterns where the data is unique, but the questions and goals are the same. \n \n How well is our ad campaign delivering? \n What’s the ROI for that capital project? \n Who are my top performing sales people? \n \n At Juice, we’re interested in finding the common situations where people use data as the centerpoint of a discussion. Then we build tools to make those conversations more productive. \n One interesting conversation for us is the one that occurs between start-up founders and investors. Due to the sensitivity involved, its extra important that both sides have a shared view of company valuation and projections. After seeing this conversation play out with spreadsheets and PowerPoint slides, we thought it could be a lot more productive if there was a simple, interactive tool to explore scenarios. \n If you’re thinking about taking investment or talking to investors, our company valuation tool let’s you to test different assumptions and the see the financial results. Here’s how it works: \n  \n 1. Set pre-investment assumptions . Input how much the company is worth before an investment and how much investment you are looking for. \n 2. Add assumptions about revenue and/or profit growth . Choose the number of years for your projection, then drag the trend lines to reflect your model for growth. \n 3. Choose valuation model . Do you want to set a valuation based on revenues or EBITDA? You’ll need to adjust the appropriate multiple. \n As an extra bonus, we have a feature to see what the valuation scenario means for the current owners of the company. Turn the owner valuation toggle to “on” in the upper right corner. \n We also have a short video of the tool in action. \n There you have it: a simple tool for considering company valuation scenarios. We’ll be the first to admit that the valuation model is relatively straightforward. There is no support for liquidation preference, complex pre-investment financing structures, option pools, or how to repay your mom’s loan. Nevertheless, we hope it serves as a productive starting point for discussions with investors. \n This was developed using Bret Victor’s Tangle JS library and D3.js for the visualization."], "link": "http://www.juiceanalytics.com/writing/whats-your-business-worth-a-start-up-valuation-tool/", "bloglinks": {}, "links": {"http://d3js.org/": 1, "https://vimeo.com/": 1, "http://worrydream.com/": 1, "http://media.juiceanalytics.com/": 3}, "blogtitle": "Juice Analytics"}, {"content": ["Most dashboards just talk and don’t listen. Have you ever been in a “conversation” with someone and they talk 90% of the time. They ask you a question and while you’re 15 seconds into answering they interrupt and starting offloading their mountains of insight. It’s mostly about them. And their consideration for you? Not so much. \n That is what most dashboards do. Blah, blah, blah. What if… \n What if the information presentations we interacted with actually acknowledged who they’re talking to, listened more, and talked less? What if we were to replace the focus on data with a conversation and a way of working out the complexities of data between two or more people. \n To do this properly, think about what a “good conversation” is. Here are a few characteristics we came up with: \n \n The people have similar experience around a topic ; so they know what they’re talking about, but because every person is unique, they’ve gathered unique insight that can be shared. The varying, educated perspective keeps the conversation interesting. \n The one doesn’t overly interrupt the other . Sure there may be reasons to interrupt here and there, but, if interruption is the norm, it quickly gets as annoying (and rude) as your cable news political analyst. \n There is a sense of genuine care for what the other person is saying because, well… there is a genuine sense for what the other person is saying. Too often people get caught up in the “tricks” of networking and small talk and “the hook.” What if people actually respond to what’s genuine? \n Distractions are minimal . One person isn’t constantly checking their phone or entertaining other interests . People are very adept at sensing interest. They do this by reading you: body language, eyes, word usage, how you breathe, pace of speech, and inflection to name a few. If you are actually interested in hearing what another else has to say, they will know. \n You trust the other person . There is an assumed authenticity about each other. This is slow to build and easy to break. \n \n So there’s a few qualities of good conversation, but why? People don’t often stop to think about why they enjoy good conversation. Let’s look at the benefits: \n \n Your perspective is sharpened . You don’t have to live through the same experience the other person did in order to benefit from their insight. That is, if you trust what they are saying. This is a big time saver! Imagine if no one acted on anything but personally experienced information. You may know some people like that. They flounder, spending more time re-discovering rather than benefiting. \n Your momentum is accelerated . Good conversations with trustworthy friends or experts is one of the biggest ways we overcome obstacles and keep momentum in life. \n A dependable relationship is formed . You know if you ever want to talk about “x” topic again, where to turn. As the trust is built in that conversation, you are also setting this person as someone you can turn for solid footing when future steps are required. \n Great conversations  lighten your burden . Joking isn’t trivial, in fact, some the most serious conversations benefit from humor. It promotes an open mind and releases misplaced pressure over circumstances. \n \n Now, why is a designer at a visualization, dashboarding, software company talking about all these warm fuzzies?! Presenting information is about people. We’re adamant about that at Juice. We’ve been focusing on what people actually want out of their data for a long time. Why? Because it’s a hole in the market and it’s fundamental to knowing what people both need and want to see out of “information experiences” they encounter. Until we appreciate the qualities and benefits of good conversations, we don’t have a firm foundation for sharing and communicating data. \n You’re saying, “Well, that’s all fine and good, but how in the world does this play out in an application or dashboard?.” I’m glad you asked. This concept is something of deep interest at Juice and the thoughts here represent the tip of the iceberg. As we actively work through these concepts, we’ll look to provide practical examples in the coming months. \n Questions \n What are some of the qualities of an enjoyable conversation you’ve had this week? \nHow did it affect your day? \nIn what ways could you imagine your dashboard just talking and not listening? \n Dig Deeper \n This talk by John Cleese (of Monty Python’s Flying Circus) is one of the best on creativity I’ve ever seen, and it speaks to the seriousness of humor, for the jokesters among you. \n Evaluate and apply some related design principles to your application: Make it conversational , Use common language , Consider data comfort and expertise ."], "link": "http://www.juiceanalytics.com/writing/dashboards-talk-too-much/", "bloglinks": {}, "links": {"http://www.juiceanalytics.com/": 3, "http://www.youtube.com/": 1}, "blogtitle": "Juice Analytics"}, {"content": ["(A conversation about data) \n The other day my seven year old asked, “How do you say indigo in Japanese?” I said, “Why do you want to know?” His response: “Just curious.” \n I love every interaction with my kids, but especially the ones where they surprise me. This particular interaction got me thinking about how tightly linked certain questions are to specific conversations. \n When it comes to data, it’s no different. The conversation that surrounds a question is as important as the question itself. Both have context, a set of relevant questions and hopefully a little curiosity. You would think that because of the similarities between data and conversations, that a conversation about data would be easy. Unfortunately, not so much. Every day we see folks wrestling with how to have a conversation about their data. \n Think about it. How many “data-based” conversations have you sat through that are REALLY overstuffed Power Point presentations, metric-filled reports or chart-engorged dashboards? Not a conversation, but more like an annoying advertisement. People are so afraid of “The Indigo Question”, that they try to answer EVERY possible question by pommelling their audience with lots and lots of data or worse, innumerable slides. \n How about trying this: communicate with data by thinking of it in the context of a conversation: Ask questions; listen to answers; don’t try to cast the conversation before it happens, but allow it to form as it takes place. \n Start with understanding the questions that your audience will want to know about your data: \n \n How has number of bench presses for defensive tackles changed over time? \n Where are my sales coming from? \n Do field goal attempts drive total points per game? \n \n The questions give you great insight into how you would want to show the results. For instance, \n Changes over time are shown by trend lines, \n  \n comparisons can be shown with distributions, \n  \n and outliers might be revealed in a bubble chart. \n  \n In the coming months you’ll hear more about the concept of a conversation with data from us. In fact, turning spreadsheets into conversations is something we think can be a transformational way to think about your data. \n So, after my son and I got home from running errands that day, we went to Google translate to figure out “How do you say Indigo in Japanese?”:  http://translate.google.com/#auto|ja|indigo . This then led us to wonder when would a Japanese person talk about the color indigo or the Indigo plant?  By afternoon both of us walked away from the conversation feeling like we had learned a bunch, cherishing the time spent and looking forward to the next conversation.  After all, isn’t that what we hope to achieve with all our conversations: to feel that sense of reward that makes us anxiously await the next one? \n Here’s to great data conversations!"], "link": "http://www.juiceanalytics.com/writing/dad-how-do-you-say-indigo-in-japanese/", "bloglinks": {}, "links": {"http://www.juiceanalytics.com/": 4, "http://translate.google.com/": 1}, "blogtitle": "Juice Analytics"}]