[{"blogurl": "http://junkcharts.typepad.com\n", "blogroll": [], "title": "Junk Charts"}, {"content": ["Bloomberg Markets (November) has this chart showing national debt as a percentage of GDP for selected countries. \n \n \n If you count the points, there are only 15 on the chart, three annual numbers for each of five countries. \n The theme appears to be redundancy. Countries are identified by both their names and their flags, one placed vertically and one placed horizontally. The 2011 debt-to-GDP ratios are displayed twice, once as the rightmost points on those lines, and once as data labels on the far right. The vertical axis plus gridlines too provide information that is quite unnecessary when there are labels on the right. \n The five dots soak up much of our attention but there is no data in them. In particular, the Greek and U.S. dots fall in between two years where the straight lines are just convenience. \n If all the lines were given the same color , then it would be straightforward to highlight the U.S. data by giving it a different color. The switch to an area chart for U.S. data is both ugly and distorting. The distortion is due to the vertical axis not starting at zero -- this is acceptable for line charts but certainly not for area charts. \n *** \n I find that the data themselves present a challenge for interpretation. Based on my reading of economic news, Greece, Spain and Italy are current poster children for countries with debt problems while Japan has had a debt problem but is more associated with a stagnation problem more recently. \n The issue is the comparison of each of these countries to the U.S. brings almost zero insight. Italy, for example, probably has some kind of legislative control that puts a lid on debt at 120 percent of GDP. Japan, while not currently in the conversation about countries in danger of default, has much worse debt-to-GDP ratio than Greece, which is in serious trouble. By this measure, Spain is nowhere near as indebted as the U.S. and yet it is in much trouble. \n In the following version, I plotted the relative change in the metric with 2009 set to 100."], "link": "http://junkcharts.typepad.com/junk_charts/2012/10/fifteen-points-add-confusion.html", "bloglinks": {}, "links": {"http://junkcharts.typepad.com/": 6}, "blogtitle": "Junk Charts"}, {"content": ["I enjoy looking at the New York Times ' summation of National Convention speeches via visualization. ( link)  \n It's a disguised word cloud combined with a bubble chart with a little bar chart thrown in for good measure. \n The size of the bubble is the total number of mentions of particular words or phrases. So the bubbles tell us the importance of specific concepts in aggregate of two parties. \n It's the split within each bubble that represents the relative emphasis by party. Helpfully, the bubbles are sorted from left to right with the most Democratic words on the left. This splitting uses a bar chart paradigm. The diameter of the bubble is being partitioned, not the areas of the segments. \n *** \n I wanted to see this as a straight-out word cloud. In the following, I use the red-blue-purple color gradient to indicate the Republican-Democratic bias, and the size of the words to indicate the number of mentions. \n \n This word cloud is created using the Wordle tool, advanced options. My colleague John helped me pick the colors. (By the way, I don't like the insertion of small words within large letters, like what happened here inside the O in Obama.) \n Also, I'd line the colors up so that the red words are on one side, blue on the other and purple in the middle. I'd need a different tool to be able to exercise this type of control."], "link": "http://junkcharts.typepad.com/junk_charts/2012/10/purple-politicial-speech.html", "bloglinks": {}, "links": {"http://junkcharts.typepad.com/": 5, "http://www.nytimes.com/": 1, "http://www.wordle.net": 1}, "blogtitle": "Junk Charts"}, {"content": ["Here's a chart in the November edition of Bloomberg Markets: \n \n  Curiosities include: how they split up the lamb chop, why an onion is chosen to represent \"fresh vegetables/melons\"? \n The chart contains some strange data that make readers feel nervous. For example, the fish image seems to say 88 percent of seafood eaten in the States are imported, and yet the two largest importing countries listed below (China and Vietnam) together account for only 22.5 percent. So the residual 65.5 percent must be split among at least 10 countries each accounting for not more than 6.5 percent of the total. \n Then when you look at vegetables, Mexico and Canada together supply 72 percent. But the onion graphic tells us it's less than 20 percent. The categorization seems to be different between the top and the bottom layers. We have \"fruit and nuts\" / \"fresh vegetables/melons\" on the one side, and \"fruit\" / \"vegetables\" on the other side. \n And why are melons combined with fresh vegetables rather than fruit?"], "link": "http://junkcharts.typepad.com/junk_charts/2012/10/whats-wrong-with-this-food-picture.html", "bloglinks": {}, "links": {"http://junkcharts.typepad.com/": 1}, "blogtitle": "Junk Charts"}, {"content": ["Reader Steve S. sent in this article that displays nominations for the \"Information is Beautiful\" award ( link ). I see \"beauty\" in many of these charts but no \"information\". Several of these charts have appeared on our blog before. \n \n Let's use the Trifecta checkup on these charts. (More about the Trifecta checkup here .) \n   \n \n The topic of this chart is both tangible and interesting. As someone who loves books, I do want to know what genres of books typically win awards. \n However, both the data collection and graphical design make no sense. \n The data collection problem presents a huge challenge and it's easy to get wrong. The problem is how narrow should a theme be. If it's too narrow, you can imagine every book has its own set of themes. If it's too wide, each theme maps to lots of books. The challenge is how to select the themes such that they have similar \"widths\". For example, \"death\" is a very wide theme and lots of books contain it, as indicated by the black lines. \"Nanny trust issues\" is a very narrow theme, and only one of those books deals with this theme. When there is such a theme, is its lack of popularity due to its narrow definition or due to writers not being interested in it? \n *** \n \n The caption of this chart said \"Cover stars: Charting 50 years up until 2010, this graphic shows The Beatles to be the most covered act in living memory.\" If that is the message, a much simpler chart would work a lot better. \n Since the height of the chart indicates the number of covers sold in that year, the real information being shown is the boom and bust cycles of the worldwide economy. So, a lot more records were sold in 2005, and then the market tanked in 2008, for example. \n That's why the data analyst should think twice before plotting raw data. Most data like these should be adjusted. In this case, you could either compare artists against one another in each year (by using proportions) or you have to do a seasonal and trend adjustment. I also don't see the point of highlighting year-to-year fluctuations. Nor do I understand why only in certain years is the top-rated cover identified by name and laurel wreath. \n   \n *** \n I talked about this stream graph of 311 calls back in 2010. See the post here . \n \n  \n *** \n I featured this set of infographics/pie charts back in 2011. See the post here . \n \n  \n *** \n This chart is a variant of the one from New York Times that I discussed here . I like the proper orientation on the NYT's version. The color scheme here may be slightly more attractive."], "link": "http://junkcharts.typepad.com/junk_charts/2012/10/can-information-be-beautiful-when-information-doesnt-exist.html", "bloglinks": {}, "links": {"http://junkcharts.typepad.com/": 10, "http://www.co.uk/": 1}, "blogtitle": "Junk Charts"}]