[{"blogurl": "http://www.kinecthacks.net\n", "blogroll": [], "title": "KinectHacks.net"}, {"content": ["Click here to view the embedded video. \n “metoso” is an interactive audio-visual media installation developed by the media artist Michel Winterberg. \nThe dancer and choreographer Heidi Köpfer creates a dialogue with this installation in “tension” between sound and movement. After the performance, the audience has the opportunity to explore the installation themselves and to discuss with the two artists. \n First performed on 29th July 2012 in Werkraum Warteck pp, Proberaum Cirqu’enflex, Basel Switzerland. \nProgrammed with Max/MSP/Jitter and the Kinect controller. \n Michel Winterberg: www. michelwinterberg.ch \nHeidi Köpfer: www.tanzbuero-basel.ch (Tanzschaffende) \n© 2012 \n Camera: Julian Gresenz \nEditing: Julian Gresenz, Michel Winterberg, Heidi Köpfer \nTitle image (video still): Rolf Bürgin \n Thanks to: Florian Giraudel, Diana Pfammatter, Rolf Bürgin, Franz Bannwart, Daniel Gaudey, Claude Winterberg, Kaserne Basel, Cirqu’enflex \n For booking, please contact www.michelwinterberg.ch"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/nL3nNGV1H00/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://www.michelwinterberg.ch": 2, "http://feedads.doubleclick.net/": 2, "http://www.tanzbuero-basel.ch": 1}, "blogtitle": "KinectHacks.net"}, {"content": ["AFTER-MOUSE.COM  offers you a totally new experience thanks to the motion sensing technology of Kinect™ for Windows® powered by Windowsreg; 7/8! \n Click here to view the embedded video. \n AFTER-MOUSE.COM will develop your custom made Kinect™ for Windowsreg; application to suit whatever requirements you may have. Whether you’re looking for a retail solution to showcase your products, or an entertaining interactive experience to engage your customer, AFTER-MOUSE.COM can design what you need. The Kinect™ for Windows® sensor enables you to “simulate touch” through simple movements and gestures. There’s no need to touch a device, you simply need to move:  you are the controller ! \n This new technology does away with the need for a touch screen: you can interact at a distance with any television (connected to a Windows® 7/8 PC) simply by moving. This natural and intuitive technology opens up unlimited possibilities, helping you cut costs dramatically, as the only hardware needed is a conventional display device (screen, projector, etc.), a Windows® 7/8 PC and a Kinect™ for Windows® sensor. Users have complete freedom to interact with the display device, whether it’s right beside them or behind glass. As no contact is required, it’s a completely hygenic product and particularly well suited to fields such as healthcare, or as a unique communication and display tool at events, trade shows, or anywhere! \n Source"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/glQlUeK1xDs/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2, "http://www.after-mouse.com/": 1}, "blogtitle": "KinectHacks.net"}, {"content": ["Click here to view the embedded video. \n Surgeon Assistant  : one of the fields that kinect can be useful is in medical uses . when the doctor or surgeon needs to access documents and scans of patients in the middle of  a surgery . In normal situations surgeon has to access the documents and scans by his hands or review them with a mouse and keyboard on the computer , and doing so will force the surgeon to go through sterile process again . This hack enables surgeons to review patients documents and scans without having to use their hands and save time and energy on surgeries . \n \n Mojtaba Tabatabaie \n www.smtabatabaie.com"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/M2I-rfZZ3nY/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://www.smtabatabaie.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["Hi, \n I’ve put a very short video on youtube  of our latest project with the kinect. \n Click here to view the embedded video. \nIn this setup the kinect is used to track a uses hand that directs a virtual flashlight. It was a challenge because the kinect is looking at a steep angle down on the user. \n The room itself is a CAVE, a four-sided projection system where users experience a holographic like environment. (if we were to show a virtual table and you would bend your knees, you would automatically see underneath the table). In this particular project the imagery is of a cave that temporally has been excavated by archeologist. \nNow, with the virtual flashlight they can explore it again at any time. \n Frans"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/IW5lei81sKw/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["The technology developed at Sigma R&D  can detect your fingers using a depth sensor. The individual directions of your fingers can be tracked, which allows you to use your hand as an advanced controller. For instance, a bare hand can turn into a virtual light saber. \n Click here to view the embedded video. \n The technology can also be used to interpret the shape of your hands using a depth sensor. For instance, sign language gestures can be translated in real time. the users can type without a keyboard, or give commands to applications such as games. \n Click here to view the embedded video. \nThe system can determine the direction of the light saber by analyzing your hands. If the thumb is extended, the light saber is on. Otherwise, the system turns the light saber off. \n The system analyzes the interactions between hands. This enables the user to switch the virtual light saber between hands. \n The same technology is used by Sigma R&D to create other virtual devices, such as a virtual joystick, mouse and driving wheel. For instance, you can use your left hand as a joystick, and your right hand as a mouse, and play many different games with your bare hands."], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/EnDlbv_BCRg/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 2, "http://feedads.doubleclick.net/": 2, "http://www.sigmard.com": 1}, "blogtitle": "KinectHacks.net"}, {"content": ["NumHop is a prototype game of physical interaction,developed around the concept of embodied learning. \n Aim of the prototype is to study the potentials of modern motion capture and body sensors technologies in educational games, involving human body in the learning process, and assisting the development of basic social skills like self and others awareness. \n The prototype was developed as part of my master thesis at the Vrije Universiteit Amsterdam, and my internship at Waag Society. \n Click here to view the embedded video. \nNumHop features the Microsoft Kinect, Neurosky Mindwave EEG sensor, and Zephyr HxM ECG sensor. \nIt was developed using Unity, cinder, OpenNI and OSC"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/SFpkx-gGn54/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["Click here to view the embedded video. \n Yet another use of the Kinect for an interactive dance show! In our work, we use two Kinects to analyze the skeleton of the dancer and trigger media events (video, sound, lighting, etc.). Both of the Kinects are running in different computers and are connected over an ethernet wire using OSC. Additionally, we have hacked CD trays in conjunction with Arduino+Processing to build our sound space. You could visit  www.distopic.es  for a tutorial on how to set up the two Kinects and, as well, you can find lot of info about the whole creative process. \nThe show will have its premiere on Seville at the end of the year. \n DISTOPIC. DANCING IS FORBIDDEN \n info@colectivomalab.org \n www.distopic.es"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/DvNesSobOTw/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2, "http://www.distopic.es/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["Hey over there! \n I developed as technical part of my Master Thesis in Computer Sciences the DirActNI framework (Direct Acting Natural Interface) for the implementation and evaluation of contactless (whole-body) 3D interaction techniques based on depth sensors like the Kinect. \nThe DirActNI framework provides the possibility of a natural and immersive whole body interaction in virtual environments. The user controls the environment directly and totally contactless to any physical controllers or sensors. \n You can watch the video on Youtube: \n Click here to view the embedded video. \n Or see more information on features and use cases at: \n http://www.DirActNI.de \n I hope you like it. \n Alexander Dridger"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/nsLkjjbLhKk/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2, "http://www.diractni.de/": 1}, "blogtitle": "KinectHacks.net"}, {"content": ["This is one of the Body Instruments designed by Adriano Clemente for his project Kin-Hackt. \nThis performance is one extract from the “Composition for Five Bodies and Kinect”. \n Click here to view the embedded video. \nThis is achieved with a 3D sensor (Kinect) able to map the joints of a human body, then tracking their movements which are translated to musical impulses. \nMy art project is based on the idea of the body itself as the ultimate instrument of expression and communication, without the use of any other objects to hold, wear or touch. Interacting directly with a virtual sound-space, the essence of the expression is contained in the movement. \n The person performing is the composer, the music player, the instrument and even the orchestra. \n The possibilities of this new “instrument” are limited only by ones imagination. \n Adriano Clemente, NY \n www.adrianoclemente.com"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/WatEvpHpphk/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["Paul Sanderson contacted me in February for a big project, because he wanted to use BiKinect in it. We shared a few mails and after some explanations, he was ready to create something really cool. \n Actually, my soft wasn’t enough so he modified it a bit and added a complete new kinect/software systems for the visuals. \nCheck out the video and here’s a link to an interesting article on how this was done :  http://fugitive.co.nz/v-motion-project-tech-how-we-built-it \n Click here to view the embedded video. \n Paul contacted me just after the video was released, and after seeing what he did, coming from my software, i got really motivated to get bikinect on tracks again (i had to stop the development for professional matter). \nWith new access to the kinect from other languages, i will port the software and make it more usable for everyone. The builder is also being reshaped and released openSource. \n In the meantime, enjoy the V Motion Project !"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/xrq0bhKpCGI/", "bloglinks": {}, "links": {"http://fugitive.co.nz/": 1, "http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["Click here to view the embedded video. \n Because of the Euro Cup, Paradox D&D, in conjunction with BHB Group, has developed an application that exploits Kinect technology. This is a game that allows the user to become a goalkeeper whose objective is to stop as many balls as possible. Then, the player receives his deserved award. Euro Cup appears in his hands. \n The system recognizes the user height and uses this information to adapt the dificulty of the game to the age of the player. Among other surprises, the application takes two photographies of the user. The first one while playing as the goalkeeper and the other when showing the Euro Cup. Such photographs may be downloaded from facebook at the end of the day. \n This application takes advantage of the possibilities of kinect as a Natural Interface, as well as an Augmented Reality tool. Users play with their own body, thus no markers are needed. \n You are invited to try the game if you have the chance to go to the Nueva Condomina Mall (Murcia). \n http://pdxstudio.com"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/8Cvy7bHW2Jw/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2, "http://pdxstudio.com/": 1}, "blogtitle": "KinectHacks.net"}, {"content": ["After the creation of TipTep Mouse, our team decided to create software which would allow us to recognize the skeleton of the hand (with the hand not being further than 3m away from sensor) using new generation of depth sensors. \n Click here to view the embedded video. \n We are now able to recognize the skeleton of the human hand in a real time.The skeleton of the hand can also be recognized even when it’s in close proximity to the body. On this basis we are planning on creating a system which will allow us recognize static and dynamic hand gestures, similar to those used in sign languages. \n More here . \n Vahagn"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/pgVahi58Qg4/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2, "http://tiptep.com/": 1}, "blogtitle": "KinectHacks.net"}, {"content": ["CogniMem Technologies, maker of the CM1K neural network chip, is working to bring hand and finger gesture recognition to Kinect games on the Xbox 360. \n By distinguishing between an open palm and a closed fist, we are able to recognize a “grab” gesture that can be used to control games which involve a drag-and-drop mechanic. In this video, we describe the approach and show how it can be used in games, including drawing shapes and controlling the puzzler World of Goo, in which you drag-and-drop balls of goo to build a structure. \n Click here to view the embedded video. \n We will be demonstrating this technology live at the CVPR conference this June, where we will show both the ability to recognize this simple gesture in software, and the ability to accelerate this algorithm using our hardware. \n Click here to view the embedded video. \n Chris McCormick"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/_aJb1T9iEYk/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 2, "http://feedads.doubleclick.net/": 2, "http://cognimem.com/": 1}, "blogtitle": "KinectHacks.net"}, {"content": ["My research using the Point cloud generated by kinect as a reference to animating. \n As you probably know, already exists some motion capture softwares using the kinect on windows, they are quite interesting once the capture is made without needing marks, and it can be exported to many compatible formats, like the BVH and the FBX. \n Particularly I don’t like mocap and don’t have much patience to clean the infinite number of generated keys and adjusting them, trying to give more life to the motion-captured. \n Click here to view the embedded video. \n Instead, I’m using kinect to generate a sequence of point clouds and use it as reference. \n This is something like animating over the videos. Just like we usually do as reference for timing and more complex \nmovements. \n The difference is that I can animate three-dimensionally “inside” the video, the advantage instead of mocap is that the animation process is more free, where I can easily exaggerate the movements and play a lot with the poses without compromising my style of animation. \n Jomario Murta"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/fBlQmF9ujfg/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["KB (aka Ludique’s Kinect Bundle) is the new brother os Simple Kinect Touch. \n Click here to view the embedded video. \n Includes new features like: \n - Multiplataform support \n- Transforms any surfaces into touchable surfaces \n- Includes a TUIO multiplexer to send the collected to multiple clients \n- Includes a gesture recognition, for recording gestures and using as TUIO IDs. \n- Tracks up to 10 users with full body skeleton \n- Tracks only hands too, with our “push method” for clicking over the air. \n- Generates realtime 3d objects using 2 kinects. \n- Includes a 2 kinects calibrato system. \n- It’s Free and Open Source! \n Click here to view the embedded video. \n Click here to view the embedded video. \n More here ."], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/NniivfxdcTs/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 3, "http://www.rubbletalk.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["Hi, I’m Andy worked in Maxst. \n For long times I imagined people who has wings . \n Finally I made it using Kinect. ( actually xtion pro) \n I calibrated webcam and Kinect for using 46inch full screen kiosk( 1080×1920) . \n ‘I recognized AR make people happy!’ \n Click here to view the embedded video. \n Click here to view the embedded video."], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/GaVeTLmMTPs/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 2, "http://feedads.doubleclick.net/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["Click here to view the embedded video. \n I’m working on a robotic character using Visual Basic 2010 and the Kinect SDK. In this video, I am showing how the skeletal tracker in the Kinect drives a separate motorized webcam. Both cameras are used to take snapshots of the user. The robot is also speech interactive – but I’ll post that functionality in a separate video. \n Jason Brown"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/Ii00dzPaFL8/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["Click here to view the embedded video. \n In the show Avatar: the Last Airbender, many characters are capable of manipulating the classical elements of water, earth, fire, and air using martial-arts-inspired movements. Using the power of Kinect you, too, can manipulate the elements, and SAVE THE WORLD!"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/Ygvdei62cnM/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "KinectHacks.net"}, {"content": ["Kinect Intervention, medical application that allows early detection of behavioral disorders, autism, hyperactivity, using the kinect catatonic schizophrenia. \n 2nd place winners of Imagine Cup competition in 2012. \n Kinect intervention  \n View more presentations from Luis Rodriguez \n \n video: \n Click here to view the embedded video."], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/xLak8G1chvo/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2, "http://www.slideshare.net/": 3}, "blogtitle": "KinectHacks.net"}, {"content": ["EON Reality introduces the EON Interactive Mirror! \n Click here to view the embedded video. \n This innovative and interactive 3D retail solution officially launched on April 12 with two systems installed at Raffles City mall, one of Singapore’s largest shopping centres with approximately 3 million visitors passing through every month. \n Leading fashion brands such as Guess, Kate Spade, Levi’s, Topshop, Desigual, Esprit and Shanghai Tang are featured in the EON Interactive Mirror as virtual 3D garments – enabling customers to virtually try on the latest spring fashion ‘on-the-go’ in a fun and engaging way, snap pictures on their mobiles and instantly share on Facebook with their friends. Featuring a wide range of men’s and women’s spring fashion lines and accessories, the EON Interactive Mirror offers the ability to mix-and-match clothes in thousands of combinations by a simple flick of your hand. \n www.eonreality.com"], "link": "http://feedproxy.google.com/~r/Kinecthacksnet/~3/LBS959cKKeo/", "bloglinks": {}, "links": {"http://www.kinecthacks.net/": 1, "http://feedads.doubleclick.net/": 2, "http://www.eonreality.com/": 1}, "blogtitle": "KinectHacks.net"}]