[{"blogurl": "http://laurent-duval.blogspot.com\n", "blogroll": [], "title": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Who compressively senses the compressive sensing folks (cf. Quis custodiet ipsos custodes? )? In an exchange among technical chairs for a conference with a close deadline, we notice the following mention: \n \n \n \n Please pay particular attention to reviewers who can deal with compressed sensing papers. Extrapolating from previous years, there are typically almost a 100 papers in compressed sensing - and so we need a lot of capable reviewers in the area. \n \nImpressive. So who does compressively sense the compressive sensing community? Nuit Blanche does sense it, maybe not quite compressively (hence, its audience ). I guess there exists redundancy in the published stuff, should one try to reduce drastically the selection on compressive sensing, not based on \"peer evaluation\", maybe on random picking? Or assuming some Finite Rate of Innovation in a period of time? Hurry up, rumors are the NSF (not NFS nor NHS, thank you Igor ) may shrink the funding on such topics... \n \n \n All along the watch tower (Bob Dylan) by Calvin Russell \n \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/7225902149820951926/comments/default", "bloglinks": {}, "links": {"http://www.copblock.org/": 1, "http://feedads.doubleclick.net/": 2, "http://en.wikipedia.org/": 1, "http://laurent-duval.blogspot.com/": 1, "https://sites.google.com/": 2, "http://nuit-blanche.blogspot.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["The November-December 2012 issue of Geophysics (Volume 77, Issue 6) features (at last) a recent work performed on model-based, adaptive multiple removal in seismic . The concept is illustrated on the figure to the left. Signal obtained from direct reflections of interest (blue) are mixing with other waves bouncing between layers (red). They look alike except for differential attenuation in the frequency domains, different slopes in CMP gathers. Those interested could have a look at the booklet Seismic multiple removal techniques: past, present and future by Eric J. (Dirk) Verschuur . Those more patient may want to waiting for Seismic Multiple Elimination Techniques , by the same author, which should be published in June 2013.As the problem is quite complex per se, hundred of papers have been devoted to multiple elimination techniques, since the January 1948 special issue of Geophysics. A common approach consists in first computing one or several approximate models of the multiple reflections, and then trying to adaptively substract the model from the data. Such techniques usually combine an adapted representation (Fourier, Radon , different breeds of wavelets ) and a matching or separation technique. The one we finally published resides at one end of the representation/matching spectrum, to cope with the industrial partner requirements. A somewhat redundant complex wavelet tranform (and yes, combining a Morlet wavelet frame and the complex trace, so to say) and a very simple sliding window 1-tap adaptive filter estimation on the complex scalogram, to adapt and remove a template disturbance signal from the original seismic trace. Maybe not the most theoretically proven approach, but a decent, fancy blend of complex wavelets and adaptive filtering, and some industrialized code that works. And a milestone in a nice collaborative venture, especially with Sergi Ventosa , now at IPGP . And finally published (took 1.5 years). So here it is: \n \n \n \n Adaptive multiple subtraction with wavelet-based complex unary Wiener filters ( arxiv , doi ), page ), Geophysics, 2012, November-December \n \nSergi Ventosa, Sylvain Le Roy, Irène Huard, Antonio Pica, Hérald Rabeson, Patrice Ricarte, Laurent Duval \n \n \n \n \n Abstract: Adaptive subtraction is a key element in predictive multiple-suppression methods. It minimizes misalignments and amplitude differences between modeled and actual multiples , and thus reduces multiple contamination in the dataset after subtraction. The challenge consists in attenuating multiples without distorting primaries, despite the high cross-correlation between their waveform. For this purpose, this complicated wide-band problem is decomposed into a set of more tractable narrow-band problems using a 1D complex wavelet frame. This decomposition enables a single-pass adaptive subtraction via single-sample (unary) complex Wiener filters, consistently estimated on overlapping windows in a complex wavelet transformed domain. Each unary filter compensates amplitude differences within its frequency support, and rectifies more robustly small and large misalignment errors through phase and integer delay corrections . This approach greatly simplifies the matching filter estimation and, despite its simplicity, compares promisingly with standard adaptive 2D methods, on both synthetic and field data. \n \n \nThe preprint version is available , with nice color figure, under the umbrella of Arxiv. Next in line: explore other ends of the matching/transform spectrum. Comments welcome. \n \n \n \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/1293543195222813966/comments/default", "bloglinks": {}, "links": {"http://library.seg.org/": 2, "http://3.blogspot.com/": 1, "http://eel.upc.edu/": 1, "http://www.cggveritas.com/": 1, "http://bookshop.eage.org/": 1, "http://www.laurent-duval.eu/": 2, "http://arxiv.org/": 3, "http://www.tudelft.nl/": 1, "http://www.ipgp.fr/": 1, "http://laurent-duval.blogspot.com/": 1, "http://amath.colorado.edu/": 1, "http://store.elsevier.com/": 1, "http://geophysics.geoscienceworld.org/": 1, "http://feedads.doubleclick.net/": 2, "http://dx.doi.org/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Typical the kind of image that makes me (still) love image processing. So the \"light green\" spiraled stripelets have the same color corrdinates (yes, R,G,B) as the \"light blue\" ones. I have checked it with XnView . \n \n \n \nThere is still room for image processing algorithms that meet vision stimuli. \n \n \n \nThe two-penny philosophical question: do these two colors actually merge at the aliased warped end in the center? Indeed, the phenomenon is related to the scale of observation, as one may obseve by zooming in and see how the green and the blue reduce there perceptual distance. Funnily enough, the illusion also works with at least one color blind and image processing specialist colleague (Frédéric Morain-Nicolier @ Pixel Shaker ) who has been kind enough to discuss these issues. So here is the thumbnail and an enlarged version. Of course, youcannot fully trust the present image renderer, but try by yourself. \n \n  Akiyoshi Illusion page: \n http://www.ritsumei.ac.jp/~akitaoka/index-e.html \n \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/6877159342002710829/comments/default", "bloglinks": {}, "links": {"http://www.xnview.com/": 1, "http://3.blogspot.com/": 1, "http://www.ac.jp/": 1, "http://feedads.doubleclick.net/": 2, "http://pixel-shaker.fr/": 1, "http://laurent-duval.blogspot.com/": 1, "http://4.blogspot.com/": 3}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Although conferences = concern fees (with the anagram equivalence) for a few organizers, they allow to grab a few call for papers to other conferences. Grabbed from EUSIPCO 2012, along with cfp1 and cfp2 (on time-frequency theory and applications), and after a couple of proofs from a finally painfully published paper in Geophysics , the recent opening of GRETSI 2013 website in Brest, France, provides a good opportunity to release the latest updates on Signal, Image and Volume Analysis (SIVA) Conferences: \n \n \n Eurographics 2013 (Annual conference of the European Association for Computer Graphics) calls for papers on 21/09/2013. CVPR 2015 (IEEE Conference on Computer Vision and Pattern Recognition) is announced in Boston, Massachussetts, USA; ICIP 2016 (IEEE International Conference on Image Processing) in Phoenix, Arizona, USA; ICCV 2015 (International Conference on Computer Vision) in Santiago, Chile. \n \n \n \nOne of the next target is ICASSP 2013 in Vancouver, Canada, with submission deadline on 19/11/2012. And many more at SIVA Conferences ... \n \nFor those interested in writing time-frequency papers, two special issue call for papers: \n \n Call for Papers (CfP): Special issue on time-frequency methods for condition based maintenance and modal analysis \n Special issue on Signal Processing Magazine: Time-frequency analysis and applications \n \n \n \n \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/6318693296496344091/comments/default", "bloglinks": {}, "links": {"http://www.icassp2013.com/": 2, "http://eg2013.udg.edu/": 1, "http://www.securics.com/": 1, "http://www.laurent-duval.eu/": 1, "http://colloque2013.gretsi.fr/": 1, "http://arxiv.org/": 1, "http://laurent-duval.blogspot.fr/": 4, "http://laurent-duval.blogspot.com/": 1, "http://media-cdn.tripadvisor.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Call for Papers (CfP): Special issue on time-frequency methods for condition based maintenance and modal analysis \n \nIn recent years, research in the area of Condition-Based Maintenance \n(CBM) and Modal Analysis (MA) has been growing rapidly benefiting from \nthe development of more advanced and accurate time-frequency methods. \nCBM is a decision making strategy which was introduced to recommend \nmaintenance actions when the output of the sensors placed on the \nphysical equipment fulfill a set of predefined criteria defining \nabnormal behaviors. CBM is based on using real-time data to prioritize \nand to optimize maintenance resources. It enables real-time diagnosis of\n impending failures and prognosis of remaining useful life of equipment \nwithout interrupting normal operations through analyzing and \ninterpreting the measured data. Intensively used in CBM, the MA is \nconcerned with the identification of the natural mode shapes and \nfrequencies of structures or fluids under vibrational excitation. \nMulti-purpose time-frequency methods like the short-time Fourier \ntransform, the Wigner-Ville distribution or wavelets etc. are signal \nprocessing techniques which are applied in mechanical structures \nanalysis for investigating functional parameters that are evolving in \ntime like structural damages, cracks or deformations. Their usefulness \nin practice consists mainly in the fact that they are non-invasive \ntechniques. This call for papers is aiming to stimulate not only new \ninsides on the standard time-frequency techniques for signal processing \nbut also recently developed methods like non-stationary Gabor frames, \ncurvelets, adaptive wavelet families, sparse decompositions etc. with \npotential applications to dynamic data processing in manufacturing, \nmechanical structures and acoustics. Therefore, the main objective of \nthis special issue is to bring the ideas of worldwide research community\n to present the latest developments and to advance the fields of CBM and\n MA through applications of the modern time-frequency processing \ntechniques. \n \nThe following topics are of main interest : \n \n \n Time-frequency methods for diagnostics, prognostics and features extraction \n \n Time-frequency methods for modal analysis \n \n Wavelet-based vibration monitoring and control \n \n Natural frequencies identification \n \n Sparse signal analysis \n \n Online, segment-wise and parallel time-frequency implementations \n \n Assessment studies of different signal processing techniques \n \n Hardware and application constraints when building CBM systems \n \n Applications in radar, mechanics, acoustics, etc. \n \nThe specified topics should be viewed as guidelines but any original \ninterpretation of the signal processing methods for CBM and MA will be \nconsidered. \n \n Important dates: \n \n \n Manuscript due: November 30, 2012 \n \n First Round of Reviews: January 31, 2013 \n \n Second Round of Reviews: March 31, 2013 \n \n Publication date: June 1, 2013 \n \n \n Submission Guidelines: \nAuthors are invited to submit their papers via the Elsevier submission web site at http://ees.elsevier.com/sigpro/login.asp and please select the Item: “ Time-frequency for CBM&MA ” after you log in as an author. Please also refer to the complete Author Guidelines . \n \n Guest editors: \n \n \n Dr. Darian M. Onchis - University of Vienna & University of Resita, ( darian.onchis@univie.ac.at ) \n \n Dr. Ruqiang Yan - Southeast University, ( ruqiang@seu.edu.cn ) \n \n Dr. Pavel Rajmic - University of Brno, ( rajmic@feec.vutbr.cz ) \n \n \n \nAnd of course remember this other recent special issue on the topic of \nmultirate/multiscale methods in signal and image processing. Signal \nProcessing: Special issue on Advances in Multirate Filter Bank Structures and Multiscale Representations , Vol. 91, Issue 12, Dec. 2011 ( more here ). \n \n \n \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/2237287306188457988/comments/default", "bloglinks": {}, "links": {"http://www.laurent-duval.eu/": 1, "http://homepage.ac.at/": 1, "http://laurent-duval.blogspot.com/": 1, "http://www.elsevier.com/": 1, "http://ees.elsevier.com/": 2, "http://feedads.doubleclick.net/": 2, "http://www.vutbr.cz/": 1, "http://www.sciencedirect.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["[Update 20120925] Special issue call for papers officialy released (deadline extended to 08/10/2012): Special issue on Time-frequency analysis and applications \n \n The 4-page white paper should address: the motivations, importance, timeliness of the topics, an outline of the paper structure and content, some words about the authors (for the special issue editors). No style imposed: 4-page one-column would be enough. \n \nFresh from Eusipco 2012 , a call for papers (cfp) is issued by the signal processing society, for IEEE Signal Processing Magazine : Special issue on Time-frequency analysis and applications \n \nThe special issue ( not yet on the special issue page ) seeks to present recent advances in time-frequency (TF) signal analysis, using both linear and nonlinear decompositions. \n \n Topics include: \n \n advances in detection, estimation and classification using TF signatures \n instantaneous frequency estimation \n robust TF signal representations \n new advances in TF localization and uncertainty principles \n multidimensional extensions of TF concepts (instantaneous frequency, coherence, Riesz transform, etc.) \n multi-sensor TF analysis and signal representations \n TF domain processing, time-varying systems, Gabor multipliers, non diagonal denoising \n data-driven methods e. g. Empirical mode decomposition (EMD), Hilbert-Huang transform and related techniques \n reassignment, synchrosqueezing and phase-based methods. \n \n Guest editors: \n \n Patrick Flandrin \n Moeness Amin \n Steve McLaughlin \n Bruno Torrésani \n \n \n Important dates: \n \n October 8, 2012 (2012/10/01): White paper (4 pages) \n October 15, 2012 (2012/10/15): Invitation notification \n January 15, 2013 (2013/01/15): Manuscript due \n March 1, 2013 (2013/03/15): Acceptance notification \n April 15, 2013 (2013/04/15): Revised manuscript due \n June 15, 2013 (2013/06/15): Final manuscript due \n November 2013 (2013/11/00): Publication date \n \n Submissions here . Remember this other recent special issue on the topic of multirate/multiscale methods in signal and image processing. Signal Processing: Special issue on Advances in Multirate Filter Bank Structures and Multiscale Representations , Vol. 91, Issue 12, Dec. 2011 ( more here ). \n \n Other sources: \nIEEE Signal Processing society: http://www.signalprocessingsociety.org/uploads/special_issues_deadlines/time_frequency.pdf  \n http://www.cmi.univ-mrs.fr/~torresan/pages/events.htm \n http://www.signalprocessingsociety.org/uploads/email/SPM_time_frequency.html \n \n \n \n \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/8060820963754676051/comments/default", "bloglinks": {}, "links": {"http://www35.villanova.edu/": 1, "http://feedads.doubleclick.net/": 2, "http://laurent-duval.blogspot.com/": 1, "http://www.signalprocessingsociety.org/": 6, "http://www.eusipco2012.org/": 1, "http://www.ac.uk/": 1, "http://perso.ens-lyon.fr/": 1, "http://ocean.fsu.edu/": 1, "http://www.sciencedirect.com/": 1, "http://www.univ-mrs.fr/": 2, "http://www.laurent-duval.eu/": 1, "http://mc.manuscriptcentral.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Ingrid Daubechies ( wiki page ) has just been granted? awarded? made a baroness title by the King of Belgium. She is has a PhD in Physics from Vrije Universiteit Brussel (VUB), teaches at Princeton and Duke universities, and is the present president of the \"International Mathematical Union\". She is famous to waveleters for many progresses, among others, in frame sampling, wavelet design (e.g. daublets & coiflets ), (two-scale) difference equations, orthogonal and biorthogonal bases design, fast, integer, lifting, irregular and signal edge-aware implementation, time-frequency reassignment, inverse problems, fractal properties, compression, with a recent brush(let)strocke towards artist (van Gogh) identification, to mention a few. Have a look... Soon, she will be another distinguished line on http://fr.wikipedia.org/wiki/Cat%C3%A9gorie:Baron_belge . \n \n Qui sont nos nouveaux nobles? \n \n http://www.lalibre.be/actu/belgique/article/750104/qui-sont-nos-nouveaux-nobles.html \n \n Arise, Baronne Daubechies \n \n http://aperiodical.com/2012/07/arise-baronne-daubechie/ \n \n \nTo start with, why not \" Where do wavelets come from?--A personal point of view \", in Proc. IEEE, Special Issue on Wavelets, 84 (4), pp. 510-513, 1996?  La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/9122183162297465281/comments/default", "bloglinks": {}, "links": {"http://www.lalibre.be/": 1, "http://laurent-duval.blogspot.com/": 1, "http://aperiodical.com/": 1, "http://www.laurent-duval.eu/": 2, "http://en.wikipedia.org/": 1, "http://fr.wikipedia.org/": 1, "http://www.utexas.edu/": 1, "https://web.princeton.edu/": 2, "http://feedads.doubleclick.net/": 2}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["http://www.mortati.com/glusker/fowler/ \n The ternary calculating machine of Thomas Fowler \n \n[In a word: e (2.71828...) is the most efficient base for storing digital information. Not two. Three would be the best practical information base] \n \nThis short post is inspired by Igor Carron 's The 2-bit Aggie weather station . Igor proposes us the three-valued (bbl) system for assessing weather conditions, with a brick put outside: brown, bright, left \n \n \n If brick is dark brown, it's a sure sign that it's raining outside. \n If the brick is bright, then it's sunny outside. \n If the brick is not there anymore, it's a tornado. \n \nThe weird machine on the right is not a brick, and is better described in The ternary calculating machine of Thomas Fowler , IEEE Annals of the History of Computing, 2005, by Glusker, Hogan, and Vass. \n \n \nBender: Ahhh, what an awful dream. Ones and zeroes everywhere... and I thought I saw a two. \nFry: Don't worry, Bender: there's no such thing ... \nFuturama \n \nAmong the very few scientific results i can grasp, a very few simple ones jump to my mind and keep me amazed: \n \n \n the fact that the Wiles-Fermat theorem is almost trivial in polynomial ring (see Mason-Stothers ABC theorem , based on Wronskians for complex coefficients, showing that max(deg(A(a),deg(B(x),deg(C(x))) + 1 <= # roots (A(x)B(x)C(x)) \n Cantor's diagonal argument \n statistical Stein's lemma and paradox , and some of it's signal processing applications ( pdf ) \n the most beautiful Euler god-existing formula , involving constants pi, e, i, 1 and 0 (from utmost to least translucency) \n \n \n \n \n \n \n van der Corput Lemma for oscillatory integrals \n Pick's theorem relating inside, border points and area in lattice polygons \n and, of course, a pair of others \n \n The most radical one, pertaining to signal acquisition and representation, lies between the binary and the ternary systems: from bits to trits , from bytes to trytes. It states that the \"most efficient\" storing system is \" e \", from Euler's number, not to confuse with Mascheroni-Euler constant, gamma , (the one from the natural logarithm). I am quite surprised the binary system pervades so much the present digital world that this \"fact\" is quite often ignored. Indeed, when i try to gather some information on that topic, i generally do not remember where to start from. Which keywords (trit for \"ternary digits\" similar to bits for \"binary digits\", or \"tryte\" versus \"byte\" for the \"words\" themselves, trinary or ternary), what sources? \n \nThe basic idea is that, when trying to represent a number in concise or sparse form on d -digits (or number byte-width ), one could choose the biggest b -base (or bit-depth , the number of symbols per \"digit\") for representation. In a similar way for signal or image processing, the sparsest base or frame for a specific signal or image has this signal or image data as a vector. The simplest idea comes from minimizing the product width x depth, or e(d,b) = = db , considered as a loss function.Let us compute it for all numbers from 0 to decimal N = 999999, in different numeral systems? \n \n Decimal: b = 10, d = 6 = ceil(log( N +1)/log( b )), db = 60, \n Binary: b = 2, d = 20, db = 40, \n Ternary: b = 3, d = 13, db = 39, \n Quaternary: b = 4, d = 10, db = 40. \n \n \n \nHere we have a very local minimum at b = 3. More generalized, the objective minimizes the loss function e(b) = b/log(b) (at WolframAlpha). The non-negative real minimum is \"e\". The two potential contenders for practical arithmetics, or even physics, are 2 (binary) or 3 (ternary), the two closest integers. It is easy to note that e(2) = 2.885... while e(3) = 2.731... and e(4) = 5.771 (compare to 2.718...). This confirms the preceding decimal/binary/ternary/quaternary local minimum at 3, 2 becoming second, the ternary numeral system , is closer to the absolute minimum. So we need to add 2 and 3 and propose a \"Generalized\"-) Euler formula: \n \n \n \n \nand, more interesting, 3 should be more compact, even for three-valued logic in computer systems. The chapter Ternary computers: the setun and the setun 70 , by N. P. Brusentov and J. R. Alvarez from Moscow state university (at Google books), indicates that this is an old story: \n \n\"It is known that the ternary arithmetic has essential advantages as compared with the binary one that is used in present-day computers. In connection with this Donald Knuth assumed that the replacement of \"flip-flop\" for \"flip-flap-flop\" one a \"good\" day will nevertheless happen [1]. Now, when the binary computers predominate, it is hard to believe in a reality of such assumption, but if it would happen not only the computer arithmetic, but the informatics on the whole would become most simple and most perfect. The third value (Aristotle named it snmbebhkoV – attendant) what is very actual but hidden in binary logic, will become obvious and direct manipulated. Ternary logic has better accordance with the Nature and human informal thinking [2]. Unfortunately, the modern researches of the multivalued (non-binary) logic are formal and are not associated with practical requests.A remarkable exclusion is the experience of creating the ternary computers \"Setun\" and \"Setun 70\" at Moscow State University [3,4,5,6]. This experience convincingly confirms practical preferences of ternary digital technique. \n \nThe design of small digital machine \"Setun\" (Setun is the little river which flows into the river \"Moscow\" near the University) was initiated by member of the academy of Sciences S. L. Sobolev at 1956. It was assumed to create small, inexpensive computer, simple in use and service for schools, research laboratories, design offices and for manufacture control. For such goal at the computer center of the University there was formed a group of young men (4 MS and 5 BA). The joint seminar for engineers and programmers was organized and S. L. Sobolev, K. A. Semendjev, M. R. Shura-Bura, I. S. Berezin were its permanent participants. The problems of optimization of computer architecture and technical realization were examined and the variants of future computer were discussed.\" \nI especially like the flip-flap-flop mnemonic. \"Perhaps the prettiest number system of all,\" writes Donald E. Knuth in \nThe Art of Computer Programming, \"is the balanced ternary notation.\"This reminds of the derivatives of position. Velocity and acceleration are well known, jerk is the 3rd. Jounce is sometimes given for the fourth derivative. Jounce is the rate of change of jerk, over the time. But some call the 4th, 5th and 6th derivatives \"Snap, \"Crackle\" and \"Pop\" (as for the Rice Crispies , as for those interested in wavelets). \n \n \nThis story is summarized in Third Base at American Scientist, by Brian Hayes : ( printer-friendly version , 2001). \n \n\"When base 2 is too small and base 10 is too big, base 3 is just right. \" \nIt even recalls the following conjecture: \nMore than 20 years ago, Paul Erdös and Ronald L. Graham published a conjecture about the ternary representation of powers of 2. They observed that 2^2 and 2^8 can be written in ternary without any 2s (the ternary numerals are 11 and 100111 respectively). But every other positive power of 2 seems to have at least one 2 in its ternary expansion; in other words, no other power of 2 is a simple sum of powers of 3. Ilan Vardi of the Institut des hautes études scientifiques has searched up to 2^6973568802 without finding a counterexample, but the conjecture remains open. \n \nYet, even-though the first attempts have met difficulties (check out the early 1950 High Speed Computing Devices in djvu ), people are still working towards ternary physical systems: Klein M., Mol J. A., Verduijn J., Levine R. D., et al. Ternary logic \nimplemented on a single dopant atom field effect silicon transistor. \nAPPLIED PHYSICS LETTERS. 2010; 96(4) (see Raphael Levine ). \n \n \n \n \n \n \n \n \nSo yes Igor, this brick-like technology does (almost) exist . Or probably in a near future. Maybe it is not practical enough yet, or the world is not ready for that. A while ago (30 years), i learned how to count in binary with my fingers (thanks to a mormon American, CF, thinking of you), and we have three phalanges, so i can easily switch. But the ternary politic system still does not yet exist in France. \n \n \n \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/1302816021392210414/comments/default", "bloglinks": {}, "links": {"http://www.wolframalpha.com/": 1, "http://agutie.homestead.com/": 1, "http://laurent-duval.blogspot.com/": 1, "http://www.mortati.com/": 1, "http://www.nyu.edu/": 1, "http://vimeo.com/": 1, "http://citeseerx.psu.edu/": 1, "http://faculty.ucla.edu/": 1, "http://sites.google.com/": 2, "http://1.blogspot.com/": 2, "http://archive.org/": 1, "http://micromath.wordpress.com/": 1, "http://hal.archives-ouvertes.fr/": 1, "http://books.google.fr/": 1, "http://answers.yahoo.com/": 1, "http://www.neu.edu/": 1, "http://www.americanscientist.org/": 2, "http://feedads.doubleclick.net/": 2, "http://www.niu.edu/": 1, "http://www.coopertoons.com/": 1, "http://dsp.rice.edu/": 1, "http://en.wikipedia.org/": 7, "http://ieeexplore.ieee.org/": 1, "http://jwilson.uga.edu/": 1, "http://2.blogspot.com/": 1, "http://nuit-blanche.blogspot.fr/": 1, "http://www.laurent-duval.eu/": 1, "http://ia600502.archive.org/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Cannot remember the origin of this picture ( pdf ) \n \n[Post originated from Grégory Favre news on the excellent EPFL Infodoc mailing list] \nThe pressure of publication pushes back the frontiers of laziness. Here, a sole change in a paper title allows the paper to pass through reviews (if there are any reviews in this case, look at Nuit Blanche on peer review ). \n \n \n If you steal from one author it's plagiarism ; if you steal from many it's research . (attributed to Wilson Mizner) \n \n The most interesting example i had seen so far was a paper i reviewed on nonsubsampled contourlets (a kind of discretized, directional wavelet ). Its content had about 60% overlap with a more standard and authoritative paper on the topic. A big difference resided in the typeset: the text was written with word (instead of LaTeX), the figures were drawn in Word too (instead of Xfig, InkScape). I hereby provide a little excerpt, so you can check the subtle differences: \n \n \n Original paper: 2) Nonsubsampled Directional Filter Bank (NSDFB): The directional filter\n bank of Bamberger and Smith [ 18 ] is constructed by combining \ncritically-sampled two-channel fan filter banks and resampling \noperations. The result is a tree-structured filter bank that splits the \n2-D frequency plane into directional wedges. A shift-invariant \ndirectional expansion is obtained with a nonsubsampled DFB (NSDFB). The \nNSDFB is constructed by eliminating the downsamplers and upsamplers in \nthe DFB ( see also [20] ). This is done by switching off the \ndownsamplers/upsamplers in each two-channel filter bank in the DFB tree \nstructure and upsampling the filters accordingly. This results in a tree\n composed of two-channel NSFBs. Fig. 3 illustrates a four channel \ndecomposition. \n \n Submitted paper: b: Nonsubsampled Directional Filter Bank (NSDFB) The directional filter bank of Bamberger and Smith [ 14 ] is constructed by combining critically-sampled two-channel fan filter banks and resampling operations. The result is a tree-structured filter bank that splits the 2-D frequency plane into directional wedges. A shift-invariant directional expansion is obtained with a nonsubsampled DFB (NSDFB). The NSDFB is constructed by eliminating the downsamplers and upsamplers in the DFB. This is done by switching off the downsamplers/upsamplers in each two-channel filter bank in the DFB tree structure and upsampling the filters accordingly. This results in a tree composed of two-channel Nonsubsampled Filter Banks (NSFB). Fig. 3 illustrates a four channel decomposition. \n \nBut i am very unfair: the reference list was quite different. Interestingly, to the genuine honesty of the (submitting) authors, the partly copied paper EVEN cited the original paper: A. L. Cunha, J. Zhou, M. N. Do. The nonsubsampled contourlet transform: Theory, design, and applications . IEEE Trans. on Image processing, 2006, 15(10): 3089-3101. \n \nI am not sure this recent \"copy-paste-publish\" trend deserves as much praise as Jorge Luis Borges short story: Pierre Menard, autor del Quijote . The story narrates 20th century writer Pierre Ménard's efforts to truly re-create Cervantes' Don Quixote, beyond a mere translation, in the 17th century Spanish, sparking thoughts on authorship, imitation and appropriation (well, 60% of my words are similar here to the Wikipedia page ;) There are worse artifacts than copy indeed: \"Mirrors and fatherhood are abominable because they multiply it [human kind] and extend it.(Les miroirs et la copulation sont abominables car ils multiplient le nombre des hommes)\" (J. L. Borges). \n \nThe recent example did some genuine editing: the title is partly new (SOA is mainly expanded), acknowledgments have been deleted, and the references cut to item 21. That's a Catch 22. \n \n Interacting with the SOA-Based Internet of Things: Discovery, Query, Selection, and On-Demand Provisioning of Web Services, IEEE TRANSACTIONS ON SERVICES COMPUTING, 2010: http://www.vs.inf.ethz.ch/res/papers/dguinard-intera-2010.pdf \n Service Oriented Architecture-Based Internet of Things: Discovery, Query, Selection, and On-Demand Provisioning of Web Services, International Journal of Computer Science and Telecommunications, 2012\n http://www.ijcst.org/Volume3/Issue1/p7_3_1.pdf ( [EDIT] funnily, the paper does not seem to be accessible anymore since the publication of this post. Still there is a Google Trace, and i have saved it on my drive, in case i'd like to publish a paper on SOA-based Internet of Things in a near future ;) \n \n \n \n \nClick on images for a larger view. I just discover there is a Wikipedia page in Scientific plagiarism in India . \n \n \n    \n \n \n \n \n \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/5479031274018649496/comments/default", "bloglinks": {}, "links": {"http://www.ethz.ch/": 1, "http://www.illinois.edu/": 1, "http://library.epfl.ch/": 1, "http://www.laurent-duval.eu/": 2, "http://1.blogspot.com/": 3, "http://www.ijcst.org/": 1, "http://personnes.epfl.ch/": 1, "http://3.blogspot.com/": 1, "http://en.wikipedia.org/": 2, "http://laurent-duval.blogspot.com/": 1, "http://espaceeducatif.ac-rennes.fr/": 1, "http://nuit-blanche.blogspot.fr/": 1, "http://information-clade.blogspot.fr/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["[Permission to link to author slides is being asked. Stay tuned, but do not expect too much] Meanwhile, check out Simon Leys (aka Pierre Rickmans) \" Le studio de l'inutilité \" (or The Hall of uselessness ), with a special attention to Leys' talk on 8 Nov. 2005 at l'Université catholique de Louvain, with its nice quote to Flaubert: \"I have always tired to live in an ivory tower; but a tide of shit is beating at its walls, threatening to undermine it. \" \n \n \n \"Modeling is a life skill\" ( Solomon Garfunkel )  \n \n \n \n \n \n \"To be able to use maths at a certain level, it is necessary to learn it at the next level\" ( Alexandre Borovik ) \n \n \n \n \n On April 4h, 2012, a meeting held in IPH , Paris. Under the motto: How to fix our math education (Comment réparer l’enseignement des mathématiques ?) . The main incentive was Solomon GARFUNKEL ( COMAP Inc. , Boston) and David MUMFORD (Brown University) paper \"How to fix our math education\", New York Times, August 28th, 2011 . The paper was translated in french in Le Monde (14 septembre 2011) by Jean-Michel Kantor under the same title: Comment réparer l’enseignement des mathématiques ? . Motivated by some prominence of mathematics, and bad results of France in PISA benchmarks, the conference aimed at answering the following questions: \n \n does our education system answer the needs of newly opened areas in the scientific and technical realms? \n how do we can train citizens on the present century? \n \n \nTwo talks were given by Sol Garfunkel (What Mathematics Do Educated Citizens Need To Know?) and Alexandre Borovik (What do children learn when we teach them mathematics?), chaired and translated by Jean-Michel Kantor . \n \n \n \nBoth conferences were profound, lively, though provoking and entertaining, in a different style. Sol explained the motivations behind the NYT paper: the U.S. education was local to the extreme, with highly varying levels between states, counties, and even neighborhoods. Two great 4-letter sticker acronyms (NCLB: no child left behind , under G. Bush, and RTTT: race to the top , under B. Obama) have tried, and are trying, respectively, to change this local situation, by establishing nation-wide standards. The resulting goals reside in showing that mathematics are honestly (in the meaning of the honnête homme ) useful and in ensuring the availability, in the future, of mathematicians and scientists. Mathematics provide a greater ability to understand (or model) the world: \"Modeling is a life skill\" (SG). Sol reminded that cellphones and MRI are as much as engineering as maths. He also pointed out how operational research, computers, statistics used to belong to math departments, and have now grown into self-owned fields. He advocated the use of real-life examples graphs through mail delivery, Voronoi cells and bisectors via *** pizza delivery from Bengladesh call centers and rain falls in Colorado. Indeed, teachers tend to provide students with answers for questions they do not ask for. Looks like the following quote, inspired by Plotin, attributed to J. Lacan : « l’amour est donner ce qu’on n’a pas à quelqu’un qui n’en veut pas ». So students (and forthcoming adults) need an ability to estimate. Maths are a necessity for survival. \n \n \n \n Alexandre Borovik drove a useful comparison between rhythm-impaired people (because of a drunk and noisy music teacher) and people who could not understand maths. Both are survivors. He considers (following Heinrich Neuhaus \" the art of piano playing \") that learning is an accumulation of neurological damage, reaching a threshold level. Some of us as only survivors. In a sort of Pareto-law, he tells that 95% of the population has no ideas on how 95% of the everyday stuff works, as a follow-on to the division of labor (Adam Smith, Frederick W. Taylor). He suggests re-branding maths into a tool for personal development and spiritual enhancement. Like music, not a profession, but a personal life-style. Teachers should thus be bound to the Hippocratic oath : do not arm . Which other school (mathematics including computer science) teaches \"substitution of terms\", at work in simple Excel sheets that provoke bracket overload (or in French \"surcharge parenthétique\") when three opening brackets and cell-depending operators confuse most people. Maths should be both interesting AND difficult, remember the \" Law of excessive learning of mathematics \": \"to be able to use maths at a certain level, it is necessary to learn it at the next level\". \n \n \n \nHe finally suggests teaching math bits at certain ages: maybe basic algebraic structures at 6-9 when kids are natural question-asking machines, leaving set-theoretic abstractions for teen-age, where sex hormones lead some appeal to pure idealities. \n \n \n \n Additional lectures: \n \n Sol Garfunkel 10 Improving education will require teamwork \n Algebra: In Simplest Terms - Mathematical Induction \n Alexandre Borovik: Book in progress: Shadows of the Truth: metamathematics of Elementary Mathematics (pdf) \n \n \n \n \n Why Should Anyone Study Mathematics , Timothy S. Norfolk \n What Mathematics do Elementary Education Teachers need to know? , Bret Benesh \n \n \n \n \n Todays bonus: Project Gutenberg: Mathematics' Bookshelf: classic mathematics books typeset with latex , with for instance Henri Poincaré, Science and hypothesis . \n  La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/3320095270633348194/comments/default", "bloglinks": {}, "links": {"": 1, "http://www.merriam-webster.com/": 1, "http://www.youtube.com/": 1, "http://www.jussieu.fr/": 5, "http://laurent-duval.blogspot.com/": 1, "http://www.com.au/": 1, "http://feedads.doubleclick.net/": 2, "http://www.comap.com/": 1, "http://www.ac.uk/": 4, "http://www.gutenberg.org/": 2, "http://vimeo.com/": 1, "http://digitalcommons.csbsju.edu/": 1, "http://pierrehenri.free.fr/": 1, "http://en.wikipedia.org/": 4, "http://www.uakron.edu/": 1, "http://books.google.fr/": 1, "http://www.nytimes.com/": 1, "http://www.ihp.fr/": 1, "http://www.lexpress.fr/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["A new conference is born: UCCV 2013 , The 1st IEEE Workshop on User-Centred Computer Vision, due in Florida, Tampa. on January 2013. It has been added to SIVA Conferences . \n \n \nWhile the shearlets are enjoying some spread (cf. Shearlets from MIA 2012 or this paper ), some of their contributors are involved in hyperbolets, or hyperbolic wavelets , closely related cousins. Here they are (as on WITS: where is the Starlet ): \n \n \n\nHyperbolets \n \n \n \n In short: \n An example of multi-composite wavelets with hyperbolic scaling law \n \n \n Etymology: \n From the hyperbola ( wiki entry ), with a potential reference (article no available on 2011/05/26) to the parabolic scaling law of the shearlets \n \n \n Origin: \n Glenn R. Easley, Demetrio Labate, Vishal M. Patel: Multi-composite wavelet estimation , Proceedings of SPIE Volume 8138, Wavelets and Sparsity XIV, Aug. 2011 ( local copy )\n \n \n Abstract : In this work, we present a new approach to image denoising by using a general representation\nknown as wavelets with composite dilations. These representations allow for waveforms\nto be defined not only at various scales and locations but also at various orientations.\nFor this talk, we present many new representations such as hyperbolets and\npropose combining multiple estimates from various representations to form a unique denoised image. In particular, we can take advantage of different representations to sparsely represent important features such as edges and texture independently and then use these estimates to derive an improved estimate.\n \nThe hyperbolet construction is further refined in: \nG. R. Easley, D. Labate and V. M. Patel, Hyperbolic shearlets , IEEE International Conference on Image Processing (ICIP), Orlando, FL, 2012, submitted ( local copy ) \nG. R. Easley, D. Labate, and V. M. Patel, Directional multiscale processing of images using wavelets with composite dilations , submitted 2011 ( local copy )\n\n\n \n \n \n Contributors: \n Glenn R. Easley (no personal page),\n Demetrio Labate ,\n Vishal M. Patel \n \n \n \n Some properties: \n \n \n   \nTiling of the frequency domain associated with an hyperbolic system of wavelets with composite dilations. \nClosely related to shearlets \n \n \n Anecdote: \n \n \n \n Usage: \n \n \n \n See also: \n The above work might be related to \n Glenn R. Easley, Demetrio Labate: Critically Sampled Wavelets with Composite\nDilations ( local copy ), preprint, 2011, which develops interesting critically sampled directional wavelet schemes (DWTShear, CShear, QDWTShear)\n\n \n \n \n Comments: \n \n \n \n \nMore on the topic: \n 2D wavelets: A panorama on multiscale geometric representations, intertwining spatial, directional and frequency selectivity  La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/6889317723667469166/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.umd.edu/": 4, "http://www.uh.edu/": 2, "http://www.laurent-duval.eu/": 10, "http://www.openvl.org/": 1, "http://draft.blogger.com/blog": 1, "http://laurent-duval.blogspot.fr/": 1, "http://en.wikipedia.org/": 1, "http://laurent-duval.blogspot.com/": 1, "http://www.scopus.com/": 1, "http://draft.blogger.com/": 3, "http://www.sciencedirect.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Signal Processing is very akin to dry fruits: this is the very art of transforming .DAT 's in .FIG 's \n https://twitter.com/#!/laurentduval/status/192746543349108736 \n \nOnly that? Sure. \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/8192498499497276063/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://news24now.com/": 1, "http://static.ddmcdn.com/": 1, "https://twitter.com/": 1, "http://laurent-duval.blogspot.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["At the wonderful MIA 2012 (hey Gabriel , did i tell you how that was great?), two talks have been devoted to shearlets ( Gitta Kutyniok , Gabriele Steidl ), yet another geometric multiscale representation for images . And a brand new Matlab toolbox from Gabriele Steidl group named FFST (fast finite shearlet transform) and developed by Sören Haüser has been announced. \n \n \n  \n Shearlet-Zerlegung eines Auges.© Gitta Kutyniok \n \n \n \n \n \nA good opportunity to update a little corner of WITS: Where is the Starlet , which was beginning to grow a few webs. Mmh, look like some familiar frequency domain partitioning... And now for something completely different: number 1, the shearlet... the shearlet! ( Monty Python inside ) \n \n \n \n \n Shearlets \n\n \n \n \n In short:\n \n Non-separable wavelets built out of parabolic scaling, shear, and translation operations \n \n \n Etymology:\n \n From shear , a sheer distorsion \n \n \n Origin:\n \n Labate, Demetrio and Lim, W-Q. and Kutyniok, Gitta and Weiss Guido, Sparse multidimensional representation using shearlets (local copy) \n\nA handful lot of papers is available here:\n shearlet papers . A first overview is given in Shearlets. The First Five Year (Oberwolfach Report, 2010, local copy ).\n\n\n\n\n\n\n\n \n \n \n  \n \n \n \n Some properties:\n \n Unlike curvelets, shearlets form an affine system \nwith a single generating mother shearlet function parameterized \nby a scaling, a shear, and a translation parameter. \nProvides the same approximation properties as curvelets, albeit with a \ndifferent directional sensitivity. Exist in band-limited or compact \nsupport flavors. Possess natural, canonical smoothness spaces, called shearlet coorbit spaces , similar to Besov spaces for wavelets. Apparently extend to arbitrary any dimensions.\n \n \n \n \n \n \n \n Usage:\n \n Image denoising, restoration, morphological component analysis\n \n \n \n See also:\n \n The shearlet website, recently updated with ShearLab (... a rationally designed digital shearlet transform) \n\nFor discrete implementation, there exists for instance a Digital Shearlet Transforms or Development of a Digital Shearlet Transform Based on Pseudo-Polar FFT . \n\n\n\n\nShearlet Matlab toolboxes are available at ShearLab matlab toolboxes ,\n local shearlet toolbox by G. Easley and FSST :\n \n \n ShearLab-1.1 (Implementation based on Cartesian Grids) ( direct link )\n \n ShearLab-PPFT-1.0 (Implementation based on Pseudo-Polar Grids) ( direct link )\n \n The recent (2012)  FFST - Fast Finite Shearlet Transform by Sören Häuser \n \nThe FFST package provides a fast implementation of the \nFinite Shearlet Transform. Following the the path via the continuous \nshearlet transform, its counterpart on cones and finally its \ndiscretization on the full grid we obtain the translation invariant \ndiscrete shearlet transform. Our discrete shearlet transform can be \nefficiently computed by the fast Fourier transform (FFT). The discrete \nshearlets constitute a Parseval frame of the finite Euclidean space such\n that the inversion of the shearlet transform can be simply done by \napplying the adjoint transform. \n \nwith a \n Fast Finite Shearlet Transform tutorial ( local copy )\n \n \n \n \n \n Comments:\n \n Potential a hard competitor, for years to come, to the quite oversold curvelets (IMHOlet: In My (little) Humble Opinion) \n \n \n \n \nMore on the topic: \n 2D wavelets: A panorama on multiscale geometric representations, intertwining spatial, directional and frequency selectivity  La vertu d'un LA (Laurent Duval)"], "link": "http://www.shearlab.org/software/Win32_ShearLab-1.1.zip", "bloglinks": {}, "links": {"http://zahlenwissen.mmcd.de/": 1, "http://www.shearlet.org/": 2, "http://www.sciencedirect.com/": 1, "http://tinyurl.com/": 1, "http://www.uh.edu/": 2, "http://feedads.doubleclick.net/": 2, "http://www.uni-kl.de/": 7, "http://www.shearlab.org/": 6, "http://draft.blogger.com/blog": 5, "http://www.youtube.com/": 1, "http://en.wikipedia.org/": 1, "http://laurent-duval.blogspot.com/": 1, "http://www.tu-berlin.de/": 1, "http://www.uni-osnabrueck.de/": 1, "http://2.blogspot.com/": 1, "http://www.dauphine.fr/": 5, "http://www.uos.de/": 1, "http://lcd.free.fr/": 4, "http://www.wpclipart.com/": 1, "http://dx.doi.org/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Un peu de publicité pour cette Journée scientifique et Professionnelle au titre alléchant : \"de la donnée à l’information : Comment accroître la productivité et mieux exploiter les résultats de mesure ?\" \n \nNancy, 31 mai 2012, ENSIC, 1, rue Grandville F-54001 Nancy, (manifestation, initialement prévue le 12 janvier 2012) \n \nCette \"Journée Scientifique et Professionnelle\" intitulée : \"De la donnée à l'information: Comment accroître la productivité et mieux exploiter les résultats de mesure\" est organisée par le Laboratoire Réaction et Génie des Procédés (LRGP) de l'ENSIC et la Société des Experts Chimistes de France (SECF). Cette manifestation s’adresse aux chercheurs (académiques et industriels) et aux autres acteurs de l’industrie (exploitants et analystes). Elle a pour objectif de présenter l’état de l’art et les technologies émergentes concernant: \n \n l’expérimentation haut débit, \n les capteurs, \n et les systèmes de traitement et de gestion de l’information. \n \n \n \n \nUne exposition de fournisseurs présentant leurs équipements (matériels/logiciels), sera présentée en plus des conférences lors de cette journée. \n \n Programme et inscription : \n9h – 9h30: Accueil à l’ENSIC Nancy \n9h30 - 10h : Introduction : Allocutions d’ouverture - Présentation de la journée, de l’ENSIC et de \nses laboratoires \n10h - 11h30: L’expérimentation haut débit : génération de données et amélioration de la \nproductivité \n \n Qu’est-ce que l’expérimentation haut débit ? Matthieu GUIRARDEL. (Laboratoire du Futur P.G. de Gennes UM 5258. Pessac) \n La microfluidique: Intégration et parallélisation, un changement de paradigme pour les méthodes analytiques. Jean-Louis VIOVY. Institut Curie. Groupe Macromolécules et Microsystèmes en Biologie et Médecine (MMBM) \n L’expérimentation haut débit : génération de données et amélioration de la productivité au travers des exemples de l'industrie et de la recherche académique'', Amira ABOU-HAMDAN, CHEMSPEED TECHNOLOGY AG (Augst, Suisse) \n \n \n11h30 -12h : Brèves présentations des sociétés présentes à l’exposition et de leurs activités \n12h -13h30 : Repas-buffet dans locaux de l’exposition \n13h30 - 14h30 : Acquisition de l’information : les capteurs \n \n Capteurs émergents, intervenant à préciser \n Quelques applications des capteurs : Marie-Noëlle PONS (ENSIC Nancy) \n \n \n14h30 – 15h30 : Pause et visite de l’exposition \n15h30 - 17h : Exploitation de l’information / Gestion de l’information / Modélisation. \n \n \"Chimiométrie : bases et applications en agroalimentaire, en chimie et en pharmacie\", Sylvie ROUSSEL (ONDALYS, Montpellier) \n Algorithmes et chimie : interactions entre analyses physico-chimiques et traitement des signaux, Laurent DUVAL (IFPEN) \n Les LIMS : nouvelles tendances, Éric DEWITTE (MB Développement) \n \n \n17h - 17h15 : Conclusions - Synthèse de la journée : Cornélius SCHRAUWEN. (ENSIC – LRGP) \n \n \n \nAutres sources : \n \n http://chimie-experts.org/pdf/Plaquette-Nancy.pdf \n http://www.insa-toulouse.fr/cmsv3/preview/lisbp/_resources/newsletter/20120301/Jrn%25C3%25A9e%2520Nancy%2520-%2520Programme%2520-%2520BI%2520-%2520Plan%2520acc%25C3%25A8s.pdf?download=true \n http://www.gazettelabo.fr/calend/fiche11.php?fiche=3332 \n http://www.cefracor.org/doc/Nancy-31Mai2012.pdf \n \n \nEt je refais un brin de publicité pour Call for papers: Dossier, Special issue on Advances in signal and image processing for physico-chemical analysis [physical or analytical chemistry] , la deadline étant étendue en avril \n  La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/1846320890415930389/comments/default", "bloglinks": {}, "links": {"http://www.cefracor.org/": 1, "http://www.laurent-duval.eu/": 3, "http://www.insa-toulouse.fr/": 1, "http://www.gazettelabo.fr/": 1, "http://chimie-experts.org/": 1, "http://www.ffc-asso.fr/": 1, "http://laurent-duval.blogspot.com/": 1, "http://upload.wikimedia.org/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["(CfP: Deadline extension) Looking for new frontiers in signal and image processing applications in physico-chemical analysis? Have compressive sensing results for mass spectrometry? Got improvements on the Savitsky-Golay filter? Consider the following call for contributions. \n \n\n\n Call for papers: Dossier, Special issue on Advances in signal and image processing for physico-chemical analysis ( pdf )\n \n\n \n \n \n \n \n\n\n \n\nDeadlines : Final manuscript: February 17th, 2012 \n Oil & Gas Science and Technology - Revue d'IFP Energies Nouvelles \n\n (online journal) \n \n WikiCfP: OGST-SIP-PCA \n With the advent of more affordable, higher resolution or innovative data\n acquisition techniques (for instance hyphenated instrumentation such as\n two-dimensional chromatography), the need for advanced signal and image\n processing tools has grown in physico-chemical analysis, together with \nthe quantity and complexity of acquired measurements. \n\nEither with mono- (signals) or two-dimensional (from hyphenated \ntechniques to standard images) data, processing generally aims at \nimproving quality and at providing more precise quantitative assessment \nof measurements of materials and products, to yield insight or access to\n information, chemical properties, reactive dynamics or textural \nproperties, to name a few (for instance). Although chemometrics embrace \nfrom experimental design to calibration, more interplay between \nphysico-chemical analysis and generic signal and image processing is \nbelieved to strengthen the two disciplines. Indeed, although they \nstrongly differ in background and vocabulary, both specialities share \nsimilar values of best practice in carrying out identifications and \ncomprehensive characterizations, albethey of samples or of numerical \ndata.\n \nThe present call for papers aims at gathering contributions on recent \nprogresses performed and emerging trends concerning (but not limited) \nto:\n \n \n 1D and 2D acquisition, sparse sampling ( compressive sensing ), modulation/demodulation, compression, \nbackground/baseline/trend estimation, enhancement, integration, \nsmoothing and filtering, denoising, differentiation, detection, \ndeconvolution and source separation, resolution improvement, peak or \ncurve fitting and matching, clustering, segmentation, multiresolution \nanalysis ( wavelets ), mathematical morphology , calibration, multivariate curve \nresolution, property prediction, regression, data mining, tomography, \nvisualization, \n \npertaining to the improvement of physico-chemical analysis techniques, including (not exclusively): \n \n \n(high-performance) gas, liquid or ion chromatography; gel \nelectrophoresis; diode array detector; Ultraviolet (UV), visible, \nInfrared (NIR, FIR), Raman or Nuclear Magnetic Resonance (NMR) \nspectroscopy, X-ray diffraction (XRD), X-Ray Absorption (EXAFS, XANES), \nmass spectrometry; photoacoustic spectroscopy (PAS); porosimetry; \nhyphenated techniques (GCxGC); electron microscopy (SEM, TEM), \n \nin the following proposed domains (not exclusively):\n \n \n catalysis, chemical engineering, oil and gas production, \nrefining processes, petrochemicals, and other sources of energy, in \nparticular alternative energies with a view to sustainable development. \n \n Provisional deadlines: \n \n \n Statement of intent: January 31st, 2012 \n \n Submission of final manuscript: February 17th, 2012 \n \n Publication: 2nd semester 2012 \n \n Refering links: \n Thierry Gallouët Igor Carron at Nuit Blanche in \n Around the blogs in 80 hours , \n Harris Georgiou ,\n GdR ISIS \n \n More details: \n\n \n http://tinyurl.com/ogst-signal-chemical-analysis \n http://www.laurent-duval.eu/lcd-cfp-ogst-2012-call-for-papers-signal-image-processing-physico-chemical-analysis.html \n \n \n  La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/7516667035600093115/comments/default", "bloglinks": {}, "links": {"http://www-gm3.univ-mrs.fr/": 1, "http://tinyurl.com/": 1, "http://www.wikicfp.com/": 1, "http://www.laurent-duval.eu/": 4, "http://www.c4i.gr/": 1, "http://cmm.ensmp.fr/": 1, "http://ogst.ifpenergiesnouvelles.fr/": 1, "http://laurent-duval.blogspot.com/": 1, "http://dx.doi.org/": 1, "https://plus.google.com/": 1, "http://www.ifpenergiesnouvelles.fr/": 1, "http://gdr-isis.fr/": 1, "http://feedads.doubleclick.net/": 2, "http://nuit-blanche.blogspot.com/": 3}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Amongst a novena of virtual life savers on computers (under Windows XP or seven of course, everything is great with MacOS or Linux), we have the following. If you just want to pick one, pick Everything ! Friends keep on thanking me for that. \n \n \n \n file finding via Everything , a ligth-weight freeware to find files and directories with wildcards or regular expressions (then you can easily disable Windows *.* indexing and save hassle, space and time). It revolutionized my way of naming AND storing files (project management, bibliographic references files, mainly) \n USB port cleaning with DriveCleanup when after some use, your usb keys and drives do not mount nicely \n stuff and idea organizing via mindmapping software, for instance FreeMind or FreePlane \n task organizing and GTD (getting things done) via ToDO list \n note taking (simple and yet, simple) via The Guide , or maybe TreeSheet \n word synonyming via Wordnet \n communicating via Skype on usb key (its install is forbidden on my work laptop): copy some new Skype.exe file (from any local installation) to any directory (SkypePortable) on your USB Drive; in that directory create a directory named \"Data\", above create a file (with a text pad like context or notepad++ ) called \"skype.bat\" with command line \"skype.exe /datapath:\"Data\" /removable\", that you can launch instead of skype.exe ( 7zip archive here for Skype version 5.9.0.114 ). For DIY versions: http://www.gruups.com/usbskype/ or Skype Portable or TheUberOverLord Formally Install Skype to USB Drive Only \n security via Keypass , (open source version), to keep and propose password for management, \n podcasting via Ziepod (or Juice ). \n \n \n\n\n\n\n\n\n\n\n \nThat's my Xmas gift for virtual life friends, for what it's worth. Update from The turn of a friendly card - Train numbering trick . What else? \n  La vertu d'un LA (Laurent Duval)"], "link": "http://www.laurent-duval.eu/_Share/SkypePortable5.9.7z", "bloglinks": {}, "links": {"http://community.skype.com/": 1, "http://laurent-duval.blogspot.com/": 2, "http://notepad-plus-plus.org/": 1, "http://www.skype.com/": 1, "http://portableapps.com/": 1, "http://www.laurent-duval.eu/": 1, "http://keepass.info/": 1, "http://www.ziepod.com/": 1, "http://1.blogspot.com/": 1, "http://www.uwe-sieber.de/": 1, "http://fr.wikipedia.org/": 1, "http://www.gruups.com/": 1, "http://www.mydigitallife.info/": 1, "http://wordnet.princeton.edu/": 1, "http://theguide.sourceforge.net/": 1, "http://www.voidtools.com/": 1, "http://freemind.sourceforge.net/": 1, "http://www.codeproject.com/": 1, "http://freeplane.sourceforge.net/": 1, "http://feedads.doubleclick.net/": 2, "http://juicereceiver.sourceforge.net/": 1, "http://www.youtube.com/": 1, "http://en.wikipedia.org/": 1, "http://treesheets.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["In a long lasting trend of jokes on popular antonyms, Chuck Norris facts as well as Car Friedrich Gauss facts ( The greatest mathematician since antiquity or Gauss facts thus far , see Carl Friedrich Gauss Facts ), i would like to share this chuck-norris-keyboard-fact (shared on Facebook or Twitter ): \n \n Chuck Norris just sucks. If he were as smart and strong it's claimed, he'd just come here and slam my head on the keyboard asdmsdfvmwefjkmasd [space] [space] [space] [space] [space] \n \nOkay, i haven't posted nothing for a month, let's be serious for a while. : \n \n ChucK: audio programming language (Strongly-timed, Concurrent, and On-the-fly Audio Programming Language) \nChucK is a new (and developing) audio programming language for real-time synthesis, composition, performance, and now, analysis - fully supported on MacOS X, Windows, and Linux. ChucK presents a new time-based, concurrent programming model that's highly precise and expressive (we call this strongly-timed), as well as dynamic control rates, and the ability to add and modify code on-the-fly. In addition, ChucK supports MIDI, OSC, HID device, and multi-channel audio. It's fun and easy to learn, and offers composers, researchers, and performers a powerful programming tool for building and experimenting with complex audio synthesis/analysis programs, and real-time interactive control. \nwith something to do with keyboards ... \n \n \nAnd now for something completely different:  \n \n (Johann) Carl Friedrich Gauss is radical (with respect to the \"roots\", as in Jimmy Cliff's Roots radical ) in signal processing for many reasons, and mainly for the possible invention of what is known today as the FFT or Fast Fourier transform ( Cooley–Tukey FFT algorithm ). You may just quote wikipedia : \n \nThis algorithm, including its recursive application, was invented around 1805 by Carl Friedrich Gauss, who used it to interpolate the trajectories of the asteroids Pallas and Juno, but his work was not widely recognized (being published only posthumously and in neo-Latin).[1][2] Gauss did not analyze the asymptotic computational time, however. Various limited forms were also rediscovered several times throughout the 19th and early 20th centuries. \nor refer to Gauss and the history of the fast Fourier transform, by Michael T. Heideman, Don H. Johnson and C. Sidney Burrus as appeared behind paywalls Archive for History of Exact Sciences, Volume 34, Number 3, 265-277, DOI: 10.1007/BF00348431 or IEEE Acoustics, speech and signal processing Magazine, October 1984 . A downloadable copy can be found here . The FFT has profound applied connections with early oil industry: some say (though i am not able to provide an online reference yet) that FFT algorithms were known to oil industry years before Cooley and Tukey's (1965) , and they did not even bother patent it (because patents are a way to disclose, and sometimes secret is just simpler for protecting). Other early insights on connections between electrical engineering and geophysics are to be found in Oral-History with Enders Robinson who states two main problems, related to some (yet unknown) inverse problem equation: \n \n \n  \n Gauss primes \n \n \nThey followed the new group, but they were also very concerned with their own special problems. Their problem was 1)to collect data, then 2) produce a map of where to drill the oil well. \n \nSo what about an even stronger Gauss fact? Well, Gauss can beat Stalin , Poutin AND Medvedev . As read on \nЗа нормальное распределение (in french, Images des mathématiques La loi normale de Gauss s’invite dans les manifs . Carl Friedrich Gauss depicted with goat's horns? No way, since Gauss is often described as the fox of mathematics , for his abilities to hide his (mathematical proofs') tracks on the sand (or snow) with his tail. \n \nAbel said, `He is like the fox, who effaces his tracks in the sand \nwith his tail'. Gauss, in defense of his style, said, `no \nself-respecting architect leaves the scaffolding in place after \ncompleting the building'. \n \n \n \n \nQuoted in Startribune : \n \n\"Obviously, he doesn't agree with Gauss,\" one commenter wrote disdainfully, referring to pioneering mathematician Carl Friedrich Gauss , who lived 200 years ago. Disenchanted Russians argue that United Russia's reported election results are so improbable as to violate Gauss' groundbreaking work on statistics. \nOne slogan: \"we beleive in Gauss , not in Churov \". Vladimir Churov is the president of Central Election Commission of Russia, but apparently breeches the central limit theorem . So as Stalin used to say: Gauss, how many divisions? Let's look at Gauss integers (left image). Chuck Norris vs. Gauss? Battle's ongoing. \n \n \n \nUpdate on Pixel shaker (aka Frédéric Morain-Nicolier ): Carl Gauss strongly refuted Chuck Norris conjecture ( get a snapshot now, this infringes standard arithmetics ) that 1550 < 6450. A century before. \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/923505739108557579/comments/default", "bloglinks": {}, "links": {"http://ocw.edu.tw/": 1, "http://wiki.princeton.edu/": 1, "http://draft.blogger.com/": 1, "http://www.gaussfacts.com/": 1, "http://laurent-duval.blogspot.com/": 1, "http://pixel-shaker.fr/": 1, "http://images.cnrs.fr/": 3, "http://www.sciencedirect.com/": 1, "http://www.jonbrant.com/": 1, "http://chuck.princeton.edu/": 1, "http://www.chucknorrisfacts.com/": 1, "http://www.ieeeghn.org/": 1, "http://crestic.univ-reims.fr/": 1, "http://www.googlefight.com/": 1, "http://1.blogspot.com/": 1, "http://fr.wikipedia.org/": 4, "http://upload.wikimedia.org/": 1, "http://www.springerlink.com/": 1, "http://serge.free.fr/": 1, "http://m.startribune.com/": 1, "https://twitter.com/": 1, "http://www.brainyquote.com/": 1, "http://www.logicnest.com/": 1, "http://matt-j-heath.livejournal.com/": 1, "http://www.wfu.edu/": 1, "http://feedads.doubleclick.net/": 2, "http://www.agendaculturel.fr/": 1, "http://www.upenn.edu/": 1, "http://www.youtube.com/": 1, "http://en.wikipedia.org/": 8, "http://ieeexplore.ieee.org/": 1, "http://www.facebook.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["I wouldn't have spent this special day with unary sequence 11h1111s at 11/11/11 without a terrible pun, mentioning it as the anniversary of Attila , since it's \"an invasion of the Huns\" (\"huns\" for \"ones\", uttered with an awful accent); even made a Facebook page for that: Attila Fest . Not proud :) Yet this dull (not in the Ramanujan sense ) sequence reminded me of two nice formula for the golden ratio (aka $\\phi$, or the divine proportion): one rational, one radical. So it seems $\\phi$ could be tamed (or approched) quite easily. Indeed, it is one of the simplest non-rational numbers, as a root of a basic equation of degree 2. Thus, far from being transcendental . Surprisingly, $\\phi$ bears some kind of transcendence (in the religious sense) as it is, somehow, beyond the grasp of the human mind, meaning it cannot be approched easily in a \"rational\" way, i.e. worse that any other number, as stated in a theorem by Adolf Hurwitz (1856-1919). In the following formula, there exist infinitely many $m$ and $n$ for any irrational $\\xi$, and the constant $\\sqrt(5)$ cannot be improved, due to $\\phi$. \n \n \nThe radical formula for $\\phi$ above is the key: with divisions by ones, denominators increase very very slow. Contrary to common knowledge (in Age of Empires) that Huns are faster . Thus being, in think i'd better go back to a paper on applications of unary filters , instead of making dull puns.  La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/4967030244894528001/comments/default", "bloglinks": {}, "links": {"http://mathworld.wolfram.com/": 1, "http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://arxiv.org/": 1, "http://4.blogspot.com/": 1, "http://en.wikipedia.org/": 5, "http://laurent-duval.blogspot.com/": 1, "http://www.oppapers.com/": 1, "http://upload.wikimedia.org/": 1, "http://nyates314.wordpress.com/": 1, "http://aoeism.blogspot.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Looking for new frontiers in signal and image processing applications in chemical related analysis? Consider the following call for contributions. \n \n Call for papers: Dossier, Special issue on Advances in signal and image processing for physico-chemical analysis ( pdf )\n \n\n \n \n \n \n\nDeadlines - Intent: December 12th, 2011 / Final manuscript: January 8th, 2012 \n Oil & Gas Science and Technology - Revue d'IFP Energies Nouvelles \n\n (online journal)\n \n With the advent of more affordable, higher resolution or innovative data\n acquisition techniques (for instance hyphenated instrumentation such as\n two-dimensional chromatography), the need for advanced signal and image\n processing tools has grown in physico-chemical analysis, together with \nthe quantity and complexity of acquired measurements. \n\nEither with mono- (signals) or two-dimensional (from hyphenated \ntechniques to standard images) data, processing generally aims at \nimproving quality and at providing more precise quantitative assessment \nof measurements of materials and products, to yield insight or access to\n information, chemical properties, reactive dynamics or textural \nproperties, to name a few (for instance). Although chemometrics embrace \nfrom experimental design to calibration, more interplay between \nphysico-chemical analysis and generic signal and image processing is \nbelieved to strengthen the two disciplines. Indeed, although they \nstrongly differ in background and vocabulary, both specialities share \nsimilar values of best practice in carrying out identifications and \ncomprehensive characterizations, albethey of samples or of numerical \ndata.\n \nThe present call for papers aims at gathering contributions on recent \nprogresses performed and emerging trends concerning (but not limited) \nto:\n \n \n 1D and 2D acquisition, sparse sampling (compressive \nsensing), modulation/demodulation, compression, \nbackground/baseline/trend estimation, enhancement, integration, \nsmoothing and filtering, denoising, differentiation, detection, \ndeconvolution and source separation, resolution improvement, peak or \ncurve fitting and matching, clustering, segmentation, multiresolution \nanalysis, mathematical morphology, calibration, multivariate curve \nresolution, property prediction, regression, data mining, tomography, \nvisualization, \n \npertaining to the improvement of physico-chemical analysis techniques, including (not exclusively): \n \n \n(high-performance) gas, liquid or ion chromatography; gel \nelectrophoresis; diode array detector; Ultraviolet (UV), visible, \nInfrared (NIR, FIR), Raman or Nuclear Magnetic Resonance (NMR) \nspectroscopy, X-ray diffraction (XRD), X-Ray Absorption (EXAFS, XANES), \nmass spectrometry; photoacoustic spectroscopy (PAS); porosimetry; \nhyphenated techniques; electron microscopy (SEM, TEM), \n \nin the following proposed domains:\n \n \n catalysis, chemical engineering, oil and gas production, \nrefining processes, petrochemicals, and other sources of energy, in \nparticular alternative energies with a view to sustainable development. \n \n Provisional deadlines: \n \n \n Statement of intent: December 12th, 2011 \n \n Submission of final manuscript: January 8th, 2012 \n \n Publication: 2nd semester 2012\n \n \n  La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/6472907516500851531/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.laurent-duval.eu/": 2, "http://www.ifpenergiesnouvelles.fr/": 1, "http://ogst.ifpenergiesnouvelles.fr/": 1, "http://laurent-duval.blogspot.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Lars von Trier has recently proposed to the audience the Cannes awarded movie Melancholia . As for the brunette and the blonde sisters (one organized and the other erratic), as for the two planets (Earth and Mechancolia) featured in the movie (one rotating predictively for ever around the sun, the other wobbling to its final destination), the movie has attracted two-pole reviews, either good or bad (in random order). Melancholia , as a science-fiction movie (is it?), dwells on a the line that joins Stanley Kubrick 's 2001 and Andrei Tarkovsky 's Solaris . On very projective line, between \"zero and infinity\" ( le zéro et l'infini ), which translates into French Darkness at noon by Arthur Koestler . \n \n \n \n Von Trier 's Mechancolia of course reminds of Albrecht Dürer 's (the painter, not the insect - see Monty Python's in three languages ) Melencolia I ou La Melencolia . The engraving has suffered many interpretations, with all its symbolic details (magic square, sphere, truncated rhombohedron...) combined with the standard inference of \"Melencolia I\" or \" Melencholia Imaginativa \", in which \"imagination\" predominates over \"mind\" or \"reason\". \n \nBeautiful picture, ear-deafening Wagner music , fine directed, the film would only need some direction. After clear-cut editing, it would probably make a nice desktop wallpaper. \n \n \n \nOh yes, i forgot to tell you (for those who have an eye for finest details, these words are from another SicFi movie Dune ), the Signal Processing: Special issue on Advances in Multirate Filter Bank Structures and Multiscale Representations is out: at ScienceDirect (Signal Processing, Volume 91, Issue 12) , here in a blog post or on a separate page . Feel like melancholia as the issue is finally out. \n \n \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/5306728501895077417/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://en.wikiquote.org/": 1, "http://data7.blog.de/": 1, "http://www.laurent-duval.eu/": 1, "http://www.youtube.com/": 2, "http://imaginativa.tumblr.com/": 1, "http://www.imdb.com/": 2, "http://www.cinemateaser.com/": 1, "http://en.wikipedia.org/": 6, "http://fr.wikipedia.org/": 5, "http://upload.wikimedia.org/": 1, "http://laurent-duval.blogspot.com/": 2, "http://www.elsevier.com/": 1, "http://www.sciencedirect.com/": 2}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Szeged University Memorial plaque in honor of Haar and Riesz \n \n All papers in press for the Special Issue of Signal Processing on \" Multirate Filter Bank Structures and Multiscale Representations \" (announced here at Nuit Blanche ) are now available online and published in Volume 91, Issue 12, December 2011 . 100 years after Alfred Haar seed, with the help of about 100 reviewers. While waiting for the paperback versions in the solid world, have a look at the following contributions in digital form, gathered on a dedicated page Signal Processing: Special issue on Advances in Multirate Filter Bank Structures and Multiscale Representations . They deal with 1-D signals to 2-D images, from image coding to compressive sensing, from fixed to adaptive representations, with a common bias toward sparsity. Forthcoming \"call for papers\" in 2011, related to sparsity, were gathered in a previous post: Sparse is abundant . \n \n A century after the first outbreak of wavelets in Alfred Haar's \nthesis in 1909, \n filter banks and wavelet transforms lie at the heart of many digital \nsignal processing and communication systems. During the last thirty \nyears, they have been the focus\nof tremendous theoretical advances and practical applications in a \ngrowing digital world. They are for instance present, as local linear \nexpansions, at the core of many existing or forthcoming audio, image or\n video compression algorithms. \n\n \n \n \nBeyond standards, many exciting developments have emerged in filter \nbanks and wavelets from the confrontation between scientists from \ndifferent fields (including signal and image processing, computer \nscience, harmonic analysis, approximation theory, statistics, \nbioengineering, physics,\\ldots). At their confluence, multiscale \nrepresentations of data, associated with their efficient processing in a\n multirate manner, have unveiled tools or refreshed methods impacting \nthe whole data management process, from acquisition to interpretation, \nthrough communications, recovery and visualization. Multirate \nstructures naturally shelter key concepts such as the duality between \nredundancy and sparsity, as well as means for extracting low dimensional\n structures from higher ones. In image processing in particular, various\n extensions\nof wavelets provide smart linear tools for building insightful \ngeometrical representations of natural images.\n\n \n \nThe purpose of this special issue is to report on recent progresses \nperformed, and emerging trends, in the domain of multirate filter banks\n and multiscale representations of signals\nand images. Topics addressed faithfully reflect the active research \npertaining to this field, including sparse representations of (1-D) \nsignals to (2-D) images, multiscale models and processing, shrinkage and\n denoising, compressive sensing, oversampled discrete frames, \ngeometrical multiscale transforms, hybrid and adaptive representations \nand non-separable lifting for image compression.\n \n \n \n Fast orthogonal sparse approximation algorithms over local dictionaries (DOI:10.1016/j.sigpro.2011.01.004) \n \nBoris Mailhé and Rémi Gribonval and Pierre Vandergheynst and Frédéric Bimbot \n \nAbstract: \n \nIn this work we present a new greedy algorithm for sparse approximation called LocOMP. \nLocOMP is meant to be run on local dictionaries made of atoms with much shorter supports than the signal length. \nThis notably encompasses shift-invariant dictionaries and time-frequency dictionaries, be they monoscale or multiscale. \nIn this case, very fast implementations of Matching Pursuit are already available. \nLocOMP is almost as fast as Matching Pursuit while approaching the signal almost as well as the much slower Orthogonal Matching Pursuit. \n \nKeywords: \n \nSparse approximation; Greedy algorithms; Shift invariance; Orthogonal Matching Pursuit \n \n Recursive Nearest Neighbor Search in a Sparse and Multiscale Domain for Comparing Audio Signals (DOI:10.1016/j.sigpro.2011.03.002) \n \nBob Sturm and Laurent Daudet \n \nAbstract: \n \nWe investigate recursive nearest neighbor search in a sparse domain \nat the scale of audio signals. \nEssentially, to approximate the cosine distance between the signals \nwe make pairwise comparisons between \nthe elements of localized sparse models built from \nlarge and redundant multiscale dictionaries of time-frequency atoms. \nTheoretically, error bounds on these approximations provide \nefficient means for quickly reducing the search space to \nthe nearest neighborhood of a given data; \nbut we demonstrate here that the tightest bound \ninvolving a probabilistic assumption does not provide a practical approach \nfor comparing audio signals with respect to this distance measure. \nOur experiments show, however, that regardless of these non-discriminative bounds, \nwe only need to make a few atom pair comparisons \nto reveal, e.g., the position of origin of an excerpted signal, \nor melodies with similar time-frequency structures. \n \nKeywords: \n \nMultiscale decomposition; Sparse approximation; Time—frequency dictionary; Audio similarity \n \n Symmetric Tight Frame Wavelets With Dilation Factor M=4 (DOI:10.1016/j.sigpro.2011.05.005) \n \nFarras Abdelnour \n \nAbstract: \n \nIn this paper we discuss a new set of symmetric tight frame wavelets with the associated filterbank outputs downsampled by four at each stage. The frames consist of seven generators obtained from the lowpass filter using spectral factorization, with the lowpass filter obtained via Groebner basis method. The filters are simple to construct, and offer smooth scaling functions and wavelets. Additionally, the filterbanks presented in this paper have limited redundancy while maintaining the smoothness of underlying limit functions. The filters are linear phase (symmetric), FIR, and the resulting wavelets possess vanishing moments. \n \nKeywords: \n \nWavelet transform; Frame; Symmetric filterbanks; Multiresolution analysis \n \n Activelets: Wavelets for Sparse Representation of Hemodynamic Responses (DOI:10.1016/j.sigpro.2011.03.008) \n \nIldar Khalidov and Jalal Fadili and Francois Lazeyras and Dimitri Van De Ville and Michael Unser \n \nAbstract: \n \nWe propose a new framework to extract the activity-related component in the BOLD functional Magnetic Resonance Imaging (fMRI) signal. As opposed to traditional fMRI signal analysis techniques, we do not impose any prior knowledge of the event timing. Instead, our basic assumption is that the activation pattern is a sequence of short and sparsely-distributed stimuli, as is the case in slow event-related fMRI. \n \nWe introduce new wavelet bases, termed ``activelets'', which sparsify the activity-related BOLD signal. These wavelets mimic the behavior of the differential operator underlying the hemodynamic system. To recover the sparse representation, we deploy a sparse-solution search algorithm. \n \nThe feasibility of the method is evaluated using both synthetic and experimental fMRI data. The importance of the activelet basis and the non-linear sparse recovery algorithm is demonstrated by comparison against classical B-spline wavelets and linear regularization, respectively. \n \nKeywords: \n \nBOLD fMRI; Hemodynamic response; Wavelet design; Sparsity; l1 minimization \n \n Resonance-Based Signal Decomposition: A New Sparsity-Enabled Signal Analysis Method (DOI:10.1016/j.sigpro.2010.10.018) \n \nIvan Selesnick \n \nAbstract: \n \nNumerous signals arising from physiological and physical processes, in addition to being non-stationary, are moreover a mixture of sustained oscillations and non-oscillatory transients that are difficult to disentangle by linear methods. Examples of such signals include speech, biomedical, and geophysical signals. Therefore, this paper describes a new nonlinear signal analysis method based on signal resonance, rather than on frequency or scale, as provided by the Fourier and wavelet transforms. This method expresses a signal as the sum of a ‘high-resonance’ and a ‘low-resonance’ component—a high-resonance component being a signal consisting of multiple simultaneous sustained oscillations; a low-resonance component being a signal consisting of non-oscillatory transients of unspecified shape and duration. The resonance-based signal decomposition algorithm presented in this paper utilizes sparse signal representations, morphological component analysis, and constant-Q (wavelet) transforms with adjustable Q-factor. \n \nKeywords: \nSparse signal representation; Constant-Q transform; Wavelet transform; Morphological component analysis \n \n Multivariate empirical mode decomposition and application to multichannel filtering (DOI:10.1016/j.sigpro.2011.01.018) \n \nAmar Kachenoura and Julien Fleureau and Laurent Albera and Jean-Claude Nunes and Lotfi Senhadji \n \nAbstract: \n \nEmpirical Mode Decomposition (EMD) is an emerging topic in signal processing research, applied in various practical fields due in particular to its data-driven filter bank properties. In this paper, a novel EMD approach called X-EMD (eXtended-EMD) is proposed, which allows for a straightforward decomposition of mono- and multivariate signals without any change in the core of the algorithm. Qualitative results illustrate the good behavior of the proposed algorithm whatever the signal dimension is. Moreover, a comparative study of X-EMD with classical mono- and multivariate methods is presented and shows its competitiveness. Besides, we show that X-EMD extends the filter bank properties enjoyed by monovariate EMD to the case of multivariate EMD. Finally, a practical application on multi-channel sleep recording is presented. \n \nKeywords: \nMono- and multivariate empirical mode decomposition; Filter bank structure; Electroencephalography data analysis \n \n A Panorama on Multiscale Geometric Representations, Intertwining Spatial, Directional and Frequency Selectivity (DOI:10.1016/j.sigpro.2011.04.025) \n \nLaurent Jacques and Laurent Duval and Caroline Chaux and Gabriel Peyré \n \nAbstract: \n \nThe richness of natural images makes the quest for optimal representations in \nimage processing and computer vision challenging. The latter observation has \nnot prevented the design of image representations, which trade off between \nefficiency and complexity, while achieving accurate rendering of smooth regions \nas well as reproducing faithful contours and textures. The most recent ones, \nproposed in the past decade, share an hybrid heritage highlighting the \nmultiscale and oriented nature of edges and patterns in images. This paper \npresents a panorama of the aforementioned literature on decompositions in \nmultiscale, multi-orientation bases or dictionaries. They typically exhibit \nredundancy to improve sparsity in the transformed domain and sometimes its \ninvariance with respect to simple geometric deformations (translation, \nrotation). Oriented multiscale dictionaries extend traditional wavelet \nprocessing and may offer rotation invariance. Highly redundant dictionaries \nrequire specific algorithms to simplify the search for an efficient (sparse) \nrepresentation. We also discuss the extension of multiscale geometric \ndecompositions to non-Euclidean domains such as the sphere or arbitrary meshed \nsurfaces. The etymology of panorama suggests an overview, based on a choice of \npartially overlapping \"pictures\". We hope that this paper will contribute to \nthe appreciation and apprehension of a stream of current research directions in \nimage understanding. \n \nKeywords: \nReview; Multiscale; Geometric representations; Oriented decompositions; Scale-space; Wavelets; Atoms; Sparsity; Redundancy; Bases; Frames; Edges; Textures; Image processing; Haar wavelet; Non-Euclidean wavelets \n \n Bandlet Image Estimation with Model Selection (DOI:10.1016/j.sigpro.2011.01.013) \n \nCharles Dossal and Stéphane Mallat and Erwan Le Pennec \n \nAbstract: \n \nTo estimate geometrically regular images in the white noise model and \nobtain an adaptive near asymptotic minimaxity result, we consider a model selection \nbased bandlet \nestimator. This bandlet estimator combines the best basis selection \nbehaviour of the model selection and the \napproximation properties of the bandlet dictionary. \nWe derive its near asymptotic minimaxity for geometrically regular images as an \nexample of model selection with general dictionary of orthogonal bases. \nThis paper is thus \nalso a self contained tutorial on model selection with orthogonal bases dictionary. \n \nKeywords: \nModel selection; White noise model; Image estimation; Geometrically regular functions; Bandlets \n \n Augmented Lagrangian based Reconstruction of non-uniformly sub-Nyquist sampled MRI data (DOI:10.1016/j.sigpro.2011.04.033) \n \nJan Aelterman and Hiep Luong and Bart Goossens and Aleksandra Pizurica and Wilfried Philips \n \nAbstract: \n \nMRI has recently been identified as a promising application for compressed-sensing-like regularization because of its potential to speed up the acquisition while maintaining the image quality. Thereby non-uniform k-space trajectories, such as random or spiral trajectories, are becoming more and more important, because they are well suited to be used within the compressed-sensing (CS) acquisition framework. In this paper, we propose a new reconstruction technique for non-uniformly sub-Nyquist sampled k-space data. Several parts make up this technique, such as the non-uniform Fourier transform (NUFT), the discrete shearlet transform and a augmented Lagrangian based optimization algorithm. Because MRI images are real-valued, we introduce a new imaginary value suppressing prior, which attenuates imaginary components of MRI images during reconstruction, resulting in a better overall image quality. Further, a preconditioning based on the Voronoi cell size of each NUFT data point speeds up the conjugate gradient optimization used as part of the optimization algorithm. The resulting algorithm converges in a relatively small number of iterations and guarantees solutions that fully comply to the imposed constraints. The results show that the algorithm is applicable not only to sub-Nyquist sampled k-space reconstruction, but also to MR image fusion and/or resolution enhancement. \n \nKeywords: \nAugmented Lagrangian methods; MRI reconstruction; Non-uniform Fourier transform; Shearlet; Compressed sensing \n \n Matching Pursuit Shrinkage in Hilbert Spaces (DOI:10.1016/j.sigpro.2011.04.010) \n \nTieyong Zeng and Francois Malgouyres \n \nAbstract: \n \nIn this paper, we study a variant of the Matching Pursuit named Matching Pursuit Shrinkage. Similarly to the Matching Pursuit it seeks for an approximation of a datum living in a Hilbert space by a sparse linear expansion in a countable set of atoms. The difference with the usual Matching Pursuit is that, once an atom has been selected, we do not erase all the information along the direction of this atom. Doing so, we can evolve slowly along that direction. The goal is to attenuate the negative impact of bad atom selections. \n \nWe analyze the link between the shrinkage function used by the algorithm and the fact that the result belongs to $l^2$, $l^1$ and $l^0$ space. Experimental results are also reported to show the potential application of the proposed algorithm. \n \nKeywords: \nDictionary; Matching pursuit; Shrinkage; Sparse representation \n \n Non Separable Lifting Scheme with Adaptive Update Step for Still and Stereo Image Coding (DOI:10.1016/j.sigpro.2011.01.003) \n \nMounir Kaaniche and Amel Benazza-Benyahia and Béatrice Pesquet-Popescu and Jean-Christophe Pesquet \n \nAbstract: \n \nMany existing works related to lossy-to-lossless multiresolution image compression are based on the lifting concept. It is worth noting that a separable lifting scheme may not appear very efficient to cope with the 2D characteristics of edges which are neither horizontal nor vertical. In this paper, we propose to use 2D non-separable lifting schemes that still enable progressive reconstruction and exact decoding of images. Their relevant advantage is to yield a tractable optimization of all the involved decomposition operators. More precisely, we design the prediction operators by minimizing the variance of the detail coefficients. Concerning the update filters, we propose a new optimization criterion which aims at reducing the inherent aliasing artifacts. A theoretical analysis of the proposed method is conducted in terms of the adaptation criterion considered in the optimization of the update filter. Simulations carried out on still images and residual ones generated from stereo pairs show the benefits which can be drawn from the proposed optimization of the lifting operators. \n \nKeywords: \nLossless compression; Progressive reconstruction; Lifting schemes; Separable transforms; Non-separable transforms; Adaptive transforms; Multiresolution analysis; Wavelets; Stereo coding \n \n La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/7964240685432053138/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.laurent-duval.eu/": 4, "http://nuit-blanche.blogspot.com/": 1, "http://laurent-duval.blogspot.com/": 2, "http://www.sciencedirect.com/": 1, "http://lcd.free.fr/": 1, "http://dx.doi.org/": 11}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["William of Ockham \n [Updated 2011/06/19 for iTWIST 2012 workshop in Marseille, see at bottom] \n[Updated 2011/07/02 for a call of paper to Journal of Applied Mathematics on \"Preconditioning Techniques for Sparse Linear Systems\"] \n \nYou still have one day (deadline: 2011/06/19) to submit a paper to ACM Multimedia SRED 2011 : First International Workshop on Sparse Representation for Event Detection in Multimedia , from 28. Nov. to 1 Dec. in Arizona, USA. \n \nShould you need a little more time, an oxymoric abundance of calls for papers related to sparsity offers additional opportunities. Let's hope your submissions will spark interesting discussions on sparsity on Nuit Blanche . (BTW, thank you Igor for promoting a PhD thesis proposal related to sparsity and seismics , i'll try to make it more international soon). \n \nJournal: EURASIP Journal on Advances in Signal Processing \nSpecial issue: New Image and Video Representations Based on Sparsity \nEditors : Fred Truchetet, Université de Bourgogne; Akram Aldroubi, Department of Mathematics, Vanderbilt University; Ivan W. Selesnick, Polytechnic Institute of New York University; Peter Schelkens, Vakgroep Elektronica en Informatieverwerking, Vrije Universiteit Brussel; Olivier Laligant, Université de Bourgogne, Dijon, Bourgogne, France \n \nSubmission deadline: apparently open until June 30 2011 [2011/06/30], see this page ( CfP ) \n In recent years, new signal representations based on sparsity have drawn considerable attention. Natural images can be modeled by sparse models living in high-dimensional spaces. New efficient algorithms based on sparse representations have been recently proposed and successfully applied to many image and video processing problems.This special issue will focus on how sparsity has impacted image and video processing. It intends to be an international forum for researchers to summarize the most recent developments, trends, and new ideas in the field of sparse representations and their applications to image and video processing and hence highlight the advances in this field. The topics to be covered include, but are not limited to: \n Sparse representations for image and video \n Multiresolution approaches, Wavelet, and X-let analysis for image processing \n Compressed sensing \n Applications of sparsity to image denoising, compression, segmentation, restoration, recognition, inpainting, super resolution, and so forth \n Journal: EURASIP Journal on Advances in Signal Processing \nSpecial issue: Sparse Signal Processing \nEditors: Farokh Marvasti, Advanced Communications Research Institute, Sharif University of Technology; Jonathon Chambers, Advanced Signal Processing Group, Department of Electronic and Electrical Engineering, Loughborough University; Mohammad Djafari, CNRS, Ecole supérieure d'éléctricité (Supélec) \n \nSubmission deadline: July 15, 2011 [2011/07/15] ( CfP ) \n An emerging important area of signal processing is the case when the signal is sparse in any transform domain. Sparse signal processing reveals significant reduction in the sampling rate and processing manipulations. Efficient algorithms have been developed for sparse signals for various applications; the algorithms developed seem to be application specific. It is the aim of this special issue to compare so many algorithms for these applications. The goal is a unified view of sparse signal processing by bringing together various fields.The key applications of sparse signal processing are sampling, coding, spectral estimation, array processing, component analysis, and multipath channel estimation. In terms of reconstruction algorithms papers are solicited in, but are not limited to: \n Random sampling \n Compressed sensing \n Rate of innovation \n Real Galois field error correction codes \n Spectral estimation \n Multisource location \n DOA estimation in array processing \n Sparse array beamforming \n Sparse sensor networks \n Blind source separation in SCA \n Multipath channel estimation \n \nJournal: International Journal of Mathematics and Mathematical Sciences \nSpecial issue: Sparse Sampling and Sparse Recovery and Its Applications to Inverse Problems \nEditors: Gerd Teschke, Institute for Computational Mathematics in Science and Technology, Neubrandenburg University of Applied Sciences; Anders Hansen, Department of Applied Mathematics and Theoretical Physics, Centre for Mathematical Sciences, University of Cambridge; Ronny Ramlau, Industrial Mathematics Institute, Johannes Kepler University \n \nSubmission deadline: September 1st, 2011 [2011/09/01] ( CfP ) \n Many applications in science and engineering require the solution of an operator equation Kx = y. Often only noisy data are available, and if the problem is ill posed, regularization methods have to be applied for the stable approximation of a solution. Influenced by the huge impact of sparse signal representations and the practical feasibility of advanced sparse recovery algorithms, the combination of sparse signal recovery and inverse problems emerged in the last decade as a new growing area. Currently, there exist a great variety of sparse recovery algorithms for inverse problems. These algorithms are successful formany applications and have lead to breakthroughs in many fields (e.g., MRI, tomography). However, the feasibility is usually limited to problems for which the data are complete and where the problem is of moderate dimension. For really large-scale problems or problems with incomplete data, these algorithms are not well suited or fail completely. In the context of signal recovery, generalized sampling theories were developed to tackle the problem of data incompleteness. One outstanding approach is the theory of compressed sensing. A major breakthrough was achieved when it was proven that it is possible to reconstruct a signal from very few measurements. A crucial condition for compressed sensing is the so-called restricted isometry property. Nowadays, this strong requirement has been relaxed in several ways, but so far all formulations of compressed sensing are in finite dimensions. Quite recently, first attempts of infinite dimensional formulations emerged. In this special issue, our focus is on stable and numerically feasible recovery algorithms and–and this is one major question–whether these technologies generalize to the solution of operator equations/inverse problems. Hence we invite authors to submit original research papers and review articles that provide the state of the art in this field and extend the known theory and contribute therefore to answer these questions. We are interested in articles that explore aspects of generalized sparse sampling, sparse recovery, and inverse problems. Potential topics include, but are not limited to: \n Generalized sampling principles and stable reconstruction \n Compressed sampling strategies and the solution of operator equations \n Compressive sampling principles and their extensions to infinite dimensions \n Sparse recovery principles for inverse problems \n Regularization theory for inverse problems with sparsity constraints \n Algorithms and their numerical realization \n Journal: Neurocomputing \n \nSpecial issue: Distributed Machine Learning and Sparse Representation with Massive Data Sets \n \nEditors: Oliver Obst CSIRO ICT Centre, Sydney, ; Tiberio Caetano NICTA, Canberra, ; Michael Mahoney Stanford University, Stanford \n \nSubmission deadline: September 16, 2011 [2011/09/16] \n \n The exponentially increasing demand for computing power as well as physical and economic limitations has contributed to a proliferation of distributed and parallel computer architectures. To make better use of current and future high-performance computing, and to fully benefit from these massive amounts of data, we must discover, understand and exploit the available parallelism in machine learning. Simultaneously, we have to model data in an adequate manner while keeping the models as simple as possible, by making use of a sparse representation of the data or sparse modelling of the respective underlying problem. \n \nThis special issue follows the 2011 Symposium on \"Distributed Machine Learning and Sparse Representation with Massive Data Sets\" (DMMD 2011). We invite both new submissions as well as previously unpublished work that have been presented on DMMD 2011. Suggested topics for this special issue include: \n \n Distributed, Multicore and Cluster based Learning Techniques \n Machine Learning on Alternative Hardware (GPUs, Robots, Sensor Networks, Mobile Phones, Cell Processors ...) \n Sparsity in Machine Learning and Statistics \n Learning results and techniques on Massive Datasets \n Dimensionality Reduction, Sparse Matrix, Large Scale Kernel Methods \n Fast Online Algorithms for Large Scale Data \n Parallel Computing Tools and Libraries \n Journal: Journal of Visual Communication and Image Representation (JVCI) \nSpecial issue: Sparse Representations for Image and Video Analysis \nEditors: Jinhui Tang, Nanjing University of Science and Technology; Shuicheng Yan, National University of Singapore; John Wright, Microsoft Research Asia; Qi Tian, University of Texas at San Antonio; Yanwei Pang, Tianjin University; Edwige Pissaloux, Université Pierre et Marie Curie \n \nSubmission deadline: October 1, 2011 [2011/10/01] ( CfP ) \n Sparse representation has gained popularity in the last few years as a technique to reconstruct a signal with few training examples. This reconstruction can be defined as adaptively finding a dictionary which best represents the signal on sample bases. Sparse representation establishes a more rigorous mathematical framework for studying high-dimensional data and ways to uncover the structures of the data, giving rise to a large repertoire of efficient algorithms. The sparse representation has just been applied to visual analysis for few years, while has shown its advantages in processing the visual information. Thus it will have a great potential in this field. \nSparse representation has wide applications in image/video processing, analysis, and understanding, such as denoising, deblurring, inpainting, compression, super-resolution, detection, classification, recognition, and retrieval. Many approaches based on sparse representation were proposed for these applications in the past years, and showed the promising results. This special issue aims to bring together the range of research efforts in sparse representation for image/video processing, analysis, and understanding. The goals of this special issue are threefold: (1) to introduce the advances of the theories on sparse representation; (2) to survey the progress of the applications of sparse representation in visual analysis; and (3) to discuss new sparse representation based technologies that will be potentially impactful in the image/video applications (primary results are needed). \n \nThe scope of this special issue is to cover all aspects that relate to sparse representation for visual analysis. Topics of interest include, but are not limited to the following: \n The fundamental theories on sparse representation \n Dictionary learning for sparse representation and modeling \n The novel learning methods based on sparse representation \n The applications of sparse representation in image/video denoising, impainting, debluerring, compression, and super-resolution \n Sparse representation for pattern recognition and classification \n Sparse representation for image/video retrieval \n Sparse reconstruction for medical imaging and radar imaging \n Sparse component analysis and its application to blind source separation \n \n  Journal: IEEE Journal of Selected topics in Signal Processing \nSpecial issue: Robust Measures and Tests Using Sparse Data for Detection and Estimation \nEditors: Hsiao-Chun Wu, Louisiana State University; Philippe Ciblat, ENST; Octavia A. Dobre, Memorial University of Newfoundland; Jitendra K. Tugnait, Auburn University \nSubmission deadline: March 28, 2011 (apparently past, still on the \"Open Special Issues\" page, yet on the upcoming publications, due February 2012) ( CfP ) \n The sparse (undersampled) data constraint in the statistical signal processing is quite common for efficient computation and system time-invariance validity. Hence, the research about how to build reliable statistical measures and statistical tests using sparse data for different signal processing applications is still quite challenging nowadays. When the real-time efficiency or the unnoticeable processing delay is required with the help of the state-of-the-art microprocessors or DSP platforms, researchers are still making continual efforts to develop new robust statistical methodologies. Two crucial indicators, “number-of-samples to number-ofparameters- to-be-estimated ratio” (referred to as SPR) and “system performance versus signal-to-interferenceplus- noise ratio”(referred to as SPSINR), can reflect both sparse data constraint and robustness. The objective is to seek new ideas and techniques to surmount the existing signal processing methods in terms of low SPR and superior SPSINR but still achieve good computational efficiency. In the signal processing research, reliable statistical measures such as statistical moments/cumulants, Lp-norms, mean-square-errors (MSE), Cramer-Rao bounds (CRB), signal-to-noise ratio (SNR), signal-to-interference ratio (SIR), mutual information/entropy, divergence, etc. are always in pursuit, especially subject to the restriction on the limited data and/or the time variance of the underlying systems instead of the classical asymptotical analysis based on the infinite data set. This special issue will focus on all aspects of design, development, implementation, operation, and applications of robust measures and tests using sparse data for detection and estimation. \n \nWe invite original and unpublished research contributions in all areas relevant to signal processing in cooperative cognitive radio systems. The topics of interest include, but are not limited to: \n New robust measures or objective functions for detection and estimation using sparse data \n New robust statistical tests for detection and estimation using sparse data \n New theoretical and empirical analyses for detection and estimation using sparse data \n New results for explicit expressions of CRB or variance for detection and estimation using sparse data \n Reliable signal quality measures using sparse data \n General frameworks for evaluating various statistical measures/tests using sparse data \n Journal: Journal of Applied Mathematics \nSpecial issue: Special Issue on Preconditioning Techniques for Sparse Linear Systems \nEditors: Massimiliano Ferronato, Department of Mathematical Methods and Models for Scientific Applications, University of Padova, Padova, Italy; Edmond Chow, School of Computational Science and \nEngineering, College of Computing, Georgia Institute of Technology, Atlanta; Kok Kwang Phoon, Department of Civil Engineering, National University of Singapore \n \nSubmission deadline: November 1, 2011 [2011/11/01] ( CfP Special Issue on Preconditioning Techniques for Sparse Linear Systems ) \n The accurate and efficient solution to sparse linear systems of equations, arising from the discretization of PDEs, often represents the main memory- and time-consuming tasks in a computer simulation. Direct methods are still widely used on the basis of their robustness and reliability. However, they generally scale poorly with the matrix size, especially on 3D problems. For large sparse systems, iterative methods based on Krylov subspaces are a most attractive option. Several Krylov subspace solvers have been developed during the 1970s through the 1990s, and they are generating a growing interest in many areas of engineering and scientific computing. Nonetheless, to become really competitive with direct solvers they need an appropriate preconditioning to achieve convergence in a reasonable number of iterations. \n \nIt is widely recognized that preconditioning is the key factor to increase the robustness and the computational efficiency of iterative methods. Unfortunately, theoretical results are few, and it is not rare that “empirical” algorithms work surprisingly well despite the lack of a rigorous foundation. The research on preconditioning has significantly grown over the last two decades and currently appears to be a much more active area than either direct or iterative solution methods. On one hand, this is due to the understanding that there are virtually no limits to the available options for obtaining a good preconditioner. On the other hand, it is also generally recognized that an optimal general-purpose preconditioner is unlikely to exist, so new research fields can be opened for improving the computational efficiency in the solution of any specific problem at hand on any specific computing environment. \n \nWe invite investigators to contribute original research articles as well as review articles on the development and the application of preconditioning techniques for the solution to sparse linear systems. Potential topics include, but are not limited to: \n Development and numerical testing of novel preconditioners \n Development and numerical testing of preconditioners for specific applications \n Improvement of existing general-purpose algebraic preconditioners \n Theoretical advances on the properties of existing general-purpose algebraic preconditioners \n Application of existing techniques to novel fields \n Additional conference events are found at the Compressive sensing meetings page or SIVA Conferences (not updated often enough these times). Let us mention: \n The first international Travelling Workshop of Interaction between Sparse models and Technologies (iTWIST 2012), May 9-11, 2012, at CIRM, in Marseilles, France, on \"Generalized sparsity in high-dimensional geometries\". The range of topics will include (but may not be limited to) : \n Graph theory and applications \n Dictionary learning \n Sparse models in machine learning \n Compressed sensing \n Emerging and innovative acquisition technologies such as: \n * compressive imagers \n * hyperspectral imaging \n * analog to information converter \n * coded aperture system \n * computational photography \n Applications to real-life problems (astronomy, biomedical, industry, multimedia and any other field ... ) \n Organisers: Dr. Sandrine Anthoine, Prof. Yannick Boursier, Prof. Pascal Frossard, Dr. Laurent Jacques, Prof. Pierre Vandergheynst, Prof. Christophe De Vleeschouwer \nProbably more information soon at: http://marwww.in2p3.fr/~boursier/ \nFor the near present, we are awaiting the upcoming (September 2011) Adaptive Sparse Representation of Data and Applications in Signal and Image Processing (IEEE Journal of Selected topics in Signal Processing) and the \"very very sparse\" special issue \"Sparse Representation of Data and Images\" in Advances in Adaptive Data Analysis. Theory and Applications , which appears only on a few places ( Improved analysis of the subsampled randomized Hadamard transform , cited by A Note on Low-rank Matrix Decompositions via the Subsampled Randomized Hadamard Transform ). \n \nFinally, the special issue of Signal Processing on Advances in Multirate Filter Bank Structures and Multiscale Representations is complete; 4 out of 11 papers refer to sparsity in their title, all of them in their text. Sparsity is no self-referential concept these days.  La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/2353982179502913632/comments/default", "bloglinks": {}, "links": {"http://www.umd.edu/": 1, "http://users.caltech.edu/": 1, "http://icig2011.edu.cn/": 2, "http://www.faidutti.com/": 1, "http://laurent-duval.blogspot.com/": 1, "http://downloads.hindawi.com/": 4, "https://profiles.google.com/": 1, "http://www.blogger.com/": 1, "http://www.laurent-duval.eu/": 4, "http://www.rpi.edu/": 1, "http://www.worldscinet.com/": 1, "http://www.ifp-school.com/": 1, "http://nuit-blanche.blogspot.com/": 3, "http://research.microsoft.com/": 1, "http://ees.elsevier.com/": 1, "http://www.hindawi.com/": 8, "http://intelligent-sistems.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://marwww.in2p3.fr/": 1, "http://www.elsevier.com/": 1, "http://www.signalprocessingsociety.org/": 4, "http://icanhascheezburger.wordpress.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["About one year ago Gilbert Strang published a first paper Fast transforms: Banded matrices with banded inverses at Proceedings of the National Academy of Science (PNAS), with the following abstract: \n It is unusual for both $A$ and $A^{-1}$ to be banded — but this can be a valuable property in applications. Block-diagonal matrices $F$ are the simplest examples; wavelet transforms are more subtle. We show that every example can be factored into $A = F_1 \\dots F_N$ where $N$ is controlled by the bandwidths of $A$ and $A^{-1}$ (but not by their size, so this extends to infinite matrices and leads to new matrix groups). \n Banded matrices (or band matrices) are somewhat related to implementations of discrete wavelet transforms (see for instance Short Wavelets and Matrix Dilation Equations , 1995 by G. Strang and V. Strela). The 2010 PNAS sparked some interest as a means to implement fast local linear filters in both the forward and inverse transforms (an ascribed tandem , first anagram to banded matrices ), by splitting matrices into ones faster to compute. In Unraveling the Matrix (A new way of analyzing grids of numbers known as matrices could improve signal-processing applications and data-compression schemes) at MIT News, Larry Hardesty states that: \n In a paper published in the July 13 issue of Proceedings of the National Academy of Science, MIT math professor Gilbert Strang describes a new way to split certain types of matrices into simpler matrices. The result could have implications for software that processes video or audio data, for compression software that squeezes down digital files so that they take up less space, or even for systems that control mechanical devices. \n[...] \nRichard Brualdi, the emeritus UWF Beckwith Bascom Professor of Mathematics at the University of Wisconsin-Madison, points out that a mathematical conjecture that Strang presents in the paper has already been proven by three other groups of researchers. “It’s a very interesting theorem,” says Brualdi. “It’s already generated a couple of papers, and it’ll probably generate some more.” Brualdi points out that large data sets, such as those generated by gene sequencing, medical imaging, or weather monitoring, often yield matrices with regular structures. Bandedness is one type of structure, but there are others, and Brualdi expects other mathematicians to apply techniques like Strang’s to other types of structured matrices. “Whether or not those things will work, I really don’t know,” Brualdi says. “But Gil’s already said that he’s going to look at a different structure in a future paper.” \nThe chronicle can been read at Dr. Dobbs and here in pdf as well. And News I care mentioned it briefly in Fast signal transform with Banded matrix method . \n \n  The blog of a mandated scribe (on mixed banded matrices ) can be used as a note to self . I completely forgot to read that paper, which was openly available at the time. Thanks to an update at Gilbert Strang's pdf paper repository , a few related others are now shared in pdf: \n \n Fast transforms: Banded matrices with banded inverses , Proc. National Academy of Sciences 107 (#28) (2010) 12413-12416. \n Abstract above \n \n Banded Matrices with Banded Inverses and A = LPU , Proceedings Intl. Congress of Chinese Mathematicians: ICCM2010, to appear. \n If $A$ is a banded matrix with a banded inverse, then $A = BC = F_1 \\dots F_N$ is a product of block-diagonal matrices. We review this factorization, in which the $F_i$ are tridiagonal and $N$ is independent of the matrix size. For a permutation with bandwidth $w$, each $F_i$ exchanges disjoint pairs of neighbors and $N \n \n \n Groups of banded matrices with banded inverses , Proc. AMS, to appear (2011) \n A product $A = F_1 \\dots F_N$ of invertible block-diagonalmatrices will be bandedwith a banded inverse. We establish this factorization with the number $N$ controlled by the bandwidths w and not by the matrix size n: When A is an orthogonal matrix, or a permutation, or banded plus finite rank, the factors $F_i$ have $w = 1$ and generate that corresponding group. In the case of infinite matrices, conjectures remain open. \n \n Triangular factorizations: The algebra of elimination , submitted to SIAM Review (2011) \n Elimination with only the necessary row exchanges will produce the triangular factorization $A = LPU$, with the (unique) permutation $P$ in the middle. The entries in $L$ are reordered in comparison with the more familiar $A = PLU$ (where $P$ is not unique). Elimination with three other starting points 1, $n$ and $n$, $n$ and $n$, 1 produces three more factorizations of $A$, including the Wiener-Hopf form $UPL$ and Bruhat’s $U_1 \\pi U_2$ with two upper triangular factors. \nAll these starting points are useless for doubly infinite matrices. The matrix has no first or last entry. When A is banded and invertible, we look for a new way to establish $A = LPU$. First we locate the pivot rows (and the main diagonal of $A$). $LPU$ connects to the classical factorization of matrix polynomials developed for the periodic (block Toeplitz) case when $A(i,j) = A(i+b;j+b)$. Only for anagram sake, these approaches may reanimate BDDCs ( balancing domain decomposition by constraints ), which may sound a macabre distend to acerbated minds walking on candidate berms . \n \nAdditional papers: \n Factoring Permutation Matrices Into a Product of Tridiagonal Matrices ( pdf ) Michael Daniel Samson, Martianus Frederic Ezerman (July 2010) \n Gilbert Strang posited that a permutation matrix of bandwidth $w$ can be written as a product of $N < 2w$ permutation matrices of bandwidth 1. A proof employing a greedy ``parallel bubblesort'' algorithm on the rows of the permutation matrix is detailed and further points of interest are elaborated. \n Factorization Of Banded Permutations ( pdf ), Greta Panova (July 2010) \n We prove a conjecture of Gilbert Strang stating that a banded permutation of bandwidth $w$ can be represented as a product of at most $2w-1$ permutations of bandwidth 1. Approximating the inverse of banded matrices by banded matrices with applications to probability and statistics ( pdf ), Peter J. Bickel, Marko Lindner (February 2010) \n In the first part of this paper we give an elementary proof of the fact that if an infinite matrix $A$, which is invertible as a bounded operator on $\\ell^2$, can be uniformly approximated by banded matrices then so can the inverse of $A$. We give explicit formulas for the banded approximations of $A^{-1}$ as well as bounds on their accuracy and speed of convergence in terms of their band-width. In the second part we apply these results to covariance matrices $\\Sigma$ of Gaussian processes and study mixing and beta mixing of processes in terms of properties of $\\Sigma$. Finally, we note some applications of our results to statistics. \nNew words learned by myself today: \n acerbated : embittered, resentful \n berm : (1) a narrow shelf, path, or ledge typically at the top or bottom of a slope; also : a mound or wall of earth or sand (2) the shoulder of a road \n distend : become wider, cause to expand as it by internal pressure, swell from or as if from internal pressure  La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/4007058623810022403/comments/default", "bloglinks": {}, "links": {"http://www-math.mit.edu/": 7, "http://www.physorg.com/": 2, "https://lh3.googleusercontent.com/": 1, "http://www.pnas.org/": 1, "http://feedads.doubleclick.net/": 2, "http://laurent-duval.blogspot.com/": 1, "http://arxiv.org/": 6, "http://en.wikipedia.org/": 2, "http://wordnetweb.princeton.edu/": 3, "http://web.mit.edu/": 1, "https://lh4.googleusercontent.com/": 1, "http://www.urbandictionary.com/": 1, "http://newsicare.wordpress.com/": 2}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["For french listening folks only: \" Mathématiques : quelle pérennité pour le prestige français ? \" on France Culture today. Following the recent Fields medals , the discussion goes along the following tracks: \n How long does it take to become a mathematician? \n Has a 3-year long project some sense in mathematics? \n Why is a paper outdated after 3 years in biology, while only after 30 years in maths? \n Why a Minister of Higher Education and Research is so booked (s)he cannot attend such a debate? \n \nPanel: Michel Broué , mathématicien, professeur à l’université Paris Diderot, Pierre Cartier , mathématicien, CNRS/IHES, Dominique Leglu , directrice de la rédaction de la revue Sciences et Avenir, Bertrand Monthubert , mathématicien, Institut de mathématiques de Toulouse, with interviews of Cédric Villani , mathématicien, professeur à l’Institut Camille Jordan, directeur de l’Institut Henri Poincaré et médaille Fields 2010 and Wendelin Werner, professeur de mathématiques, université Paris-Sud et Ecole normale supérieure Médaille Fields 2006 et membre de l’Académie des sciences. \n \nMusical intermede: Gov't mule, Thorazine shuffle \n \n \n \n  La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/8245381575410764692/comments/default", "bloglinks": {}, "links": {"http://www.jussieu.fr/": 1, "http://neptune.podbean.com/": 1, "http://www.ihes.fr/": 1, "http://feedads.doubleclick.net/": 2, "http://math.univ-lyon1.fr/": 1, "http://www.gouv.fr/": 1, "http://www.univ-toulouse.fr/": 1, "http://www.franceculture.com/": 2, "http://fr.wikipedia.org/": 1, "http://laurent-duval.blogspot.com/": 2}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}, {"content": ["Saint-Malo Intra-Muros. \n  I went like an \" animal sot \" to Saint-Malo (Brittany) and returned enchanted by the 2010 edition of the Latent Variable Analysis and Independant Component Analysis ( LVA-ICA 2010 ). The four excellent keynote/plenary speeches : \n When tensor decomposition meets compressed sensing, by Pierre Comon (University of Nice, France), admittedly with an ad-like title, more akin to coherence than CS ; \n Discrimination with deformation for classification, by Stéphane Mallat (Ecole Polytechnique, France), when mapping complex wavelet coefficients to the lower frequencies yields a scattering metric; \n Bayesian non-negative matrix factorisation methods to detect dye labelled DNA oligonucleotides in multiplexed Raman spectra, by Mark Girolami (University of Glasgow, UK); \n 2nd order statistics + A 3rd data dimension = Just weight and see!, by Arie Yeredor (Tel-Aviv University, Israel); \n should be webcasted soon (stay tuned, i got audio bootlegs for personal use). Meanwhile, the next LVA/ICA 2012 will be held in Spring 2012 in Tel Aviv, Israel (see SIVA conferences ). An internship is proposed in 2011 at IFP Energies nouvelles on that peculiar domain. \n \nAmong other latent events recently announced: \n SPARS 2011 (Workshop: Signal Processing with Adaptive Sparse Structured Representations) in Edinburgh, Scotland (DL: 27/06/2011) from 30/06/2011 to 30/08/2010; \n SSP 2011 (IEEE Workshop on Statistical Signal Processing) in Nice, France (DL: 15/01/2011) for 28/06/2011 to 30/06/2011; \nICCV 2013 (International Conference on Computer Vision) is announced in Barcelona, Spain; \n GenSIPS 2010 (IEEE International Workshop on Genomic Signal Processing and Statistics) at Cold Spring Harbor USA-NY from 10/11/2010 to 12/11/2010; \n DSP 2011 (International Conference on Digital Signal Processing) in Corfu, Greece (DL: 14/01/2011) from 06/07/2011 to 08/07/201; La vertu d'un LA (Laurent Duval)"], "link": "http://laurent-duval.blogspot.com/feeds/6791500792401001322/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.dsp2011.gr/": 1, "http://lva2010.inria.fr/": 2, "http://www.ssp2011.org/": 1, "http://hopeeternal.wordpress.com/": 1, "http://laurent-duval.blogspot.com/": 1, "http://meetings.cshl.edu/": 1, "http://ecos.ac.uk/": 1, "http://www.laurent-duval.eu/": 3, "http://nuit-blanche.blogspot.com/": 1}, "blogtitle": "La vertu d'un LA The virtue of an A - A fortunate hive"}]