[{"blogurl": "http://taoshistat.wordpress.com\n", "blogroll": [], "title": "Learning From Data"}, {"content": ["On the way to school late night yesterday, I randomly checked in  Urban Meyer’s call in show  for the first time.  I was pleasantly surprised by a question from the first caller, Adam, and was even more impressed by Urban ‘s answer. \n \n Adam’s question was asking the origin and evolution of the coach’s football philosophy and “ To what extents, statistics, football statistics, play a role in your football philosophy? ” Here is Urban’s answer: \n Adam, that’s a. Congratulations. I appreciate your phone call. That’s well thought out and researched question. It is the essence of everything we do. You say what role statistics play in the management of a football game, a football program. In my world, it is everything. \n And you will hear people say statistics are for losers. Usually losers are the one who’s saying that (made my day ). \n Statistics are very important and we. There are times, there is one thing that is not statistically analyzed. It is momentum. Momentum, to me, when you deal with young people. They are maybe inexperienced teams at some positions, it is even greater. So the higher level, think about this, the higher level football you get, momentum is not quite as much as a factor. [...] \n So we do play a game of statistics where we try to manage the game, try to force the team to drive the length of the field, take care of the football. Once you cross the fifty, that’s where you get more aggressive in play calling. However, there is times that we run a faked punt against Nebraska. That was not a statistically well-thoughtout play. However, we were in the quick sand and we were heading into the bad way against a good offense. So you need that momentum shift for your team. [......] \n It was an interesting description of what statistics can do and cannot. Statistics and Momentum. \n It reminded me a post, Winning with numbers , I wrote about Russ Rose  around this time last year. Russ is the head coach of Penn State women’s volleyball. by coaching with numbers, he is the coach with the highest winning percentage among all NCAA sports. Interestingly, he also holds a master’s degree from Nebraska, where he wrote his thesis on volleyball statistics. \n By the way, Ohio States are playing at Penn States this weekend. Go Buckeyes! \n Now, what I really wonder is if momentum has anything to do with numbers that statistician can measure and study as well By a quick search on the internet, I found this: \n It may have been a new actor on Apple’s stage on Tuesday, but the script was familiar. Start with some momentum statistics , show off the new software, end with a look at the new hardware and then give product specifics. \n Here we go, momentum statistics!"], "link": "http://taoshistat.wordpress.com/2012/10/26/urban-meyer-statistics-and-momentum/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://taoshistat.wordpress.com/": 1, "http://gopsunittanylions.com/": 1, "http://en.wikipedia.org/": 1, "http://www.971thefan.com/": 1, "http://allthingsd.com/": 1}, "blogtitle": "Learning From Data"}, {"content": ["Google was in headlines today for being completely innocent. Reported by  tech blog Mashable  on Wednesday, \n Looking for Mitt Romney photos? You could just search the presidential candidate’s name in Google Images, or now you could instead type “ completely wrong ” to see his face over and over again. \n \n The search engine’s gallery for the phrase appears organically because of Romney’s recent admission: “I said something that’s just completely wrong,” he remarked regarding his  47%-of-Americans comment  from May. \n It seems to be a completely successful case for Google’s imaging searching algorithm. Google works like a giant brain that trys to crawl the internet and to learn and organize all information, articles, books, data, images, videos, etc, on the internet and in real life. \n My educated guess would be that Google uses context of an article to help tagging images in that article. In this case, the information form the article content overweights the information in the image itself. The searching results also show us where our technology of organizing image information stands. Lots of work needs to be done, but we are getting better. \n To see if it is completely a google problem, I am curious to test and see how other searching engines report on this particular query. Here are what I got around 10:30am 10/10/12. \n  \n  \n I like the big red “wrong” sign and it seems to be quite “complete”. \n I also wish I could go back to search the term “completely wrong” on google one month ago and see how much the search results have changed from then. I know I cannot, so I tried a searching the biggest searching engine in China instead. \n  \n Now this is called  completely innocent and completely clueless at this moment."], "link": "http://taoshistat.wordpress.com/2012/10/11/completely-wrong-and-completely-innocent/", "bloglinks": {}, "links": {"http://mashable.com/": 2, "http://feeds.wordpress.com/": 1, "http://bit.ly/": 1, "http://i.imgur.com/": 3}, "blogtitle": "Learning From Data"}, {"content": ["Heard two stories about unemployment rates on NPR today. \n The first report is about the hottest topic today: “ One Jobs Report, Two Different Political Spins ” that reports the nation’s unemployment rate in US fell to 7.8 percent  in September. As the title suggests: one number, two interpretations: \n The Obama administration got good news Friday: Jobs are indeed growing. \n But, as Republicans noted, the pace remains well below the level needed to provide paychecks for the 12.1 million people seeking them. \n    \n Even staring at the same number, people feel so different about it. \n Meanwhile, another story about unemployment rate was reported about China: “ No One Trusts China’s Unemployment Rate “. The official unemployment rate stands at 6.5%, but the report says no one believes it. \n “The unemployment rate in China is one of the most useless and ridiculous statistics out there,” says macroeconomic researcher Arthur Kroeber of Dragonomics. “No one pays any attention to it, because everyone knows it’s a complete fiction.” \n It’s not like China isn’t trying. It has a national statistics office that works very hard. But the country is so big, and changing so quickly, that it is actually really hard to keep track of what is going on. \n I’m not an economist, but I do see reasons why the reported rate in China might be off target. \n At the end of the day, statistics is still labeled as something beyond the damned lies. The value of those numbers really depends how we get them, how we use them and for what purposes. \n Let the spin start ……"], "link": "http://taoshistat.wordpress.com/2012/10/05/number-spinning-the-unemployment-rates/", "bloglinks": {}, "links": {"http://www.npr.org/": 1, "http://feeds.wordpress.com/": 1, "http://www.npr.org/blog": 2}, "blogtitle": "Learning From Data"}, {"content": ["This freshly published post  A randomized trial of ‘free market’ capitalism – Web Exclusive Article – Significance Magazine  by Michael A. Lewis at Significance  today is quite interesting. It starts with a question from his social work students: \n doesn’t capitalism cause those who live within its confines to be more individualistic and selfish than they’d be under a different economic system? \n This question seems to be related to, but even beyond a simpler idea I read before: “ Does higher social class leads to increased unethical behavior? “. Michael went ahead with his thought on if it is feasible to use randomized trails and statistics to carry out causal inference and to answer his students. He nicely laid out details of randomized trails: \n 1. state the question \n 2. state the hypothesis \n 3. randomly assign treatments to the participants in the trial \n 4. collect data from participants \n 5. analyze data \n 6. reach a conclusion about whether the hypothesis was confirmed \n Of course, we know it is impossible to perform randomization to societies on Earth at this stage, so he aimed higher and further,  at Mars . As Michael puts it, \n The theoretical physicist Stephen Hawking has argued that humans should colonize Mars. [...] Imagine we randomly assigned some Earthlings to live a capitalist way of life on Mars while others would be assigned to live non-capitalist ones, after having their baseline levels of individualism measured, of course. We would need some way of assuring that these Martian societies didn’t interact with each other, to prevent “contamination” of one another’s economic system [...]. \n I don’t know if such a study would make it through my university’s human subjects review board and I don’t know if the National Science Foundation would be interested in funding such a study. \n Just a few day ago, NASA has announced that Curiosity rover found  evidence for an ancient, flowing stream on Mars at a few sites . So there might be something on Mars. \n \n And a colon of Mars? It reminds me a funny picture I saw on the internet a while ago.  \n \n We see what we see."], "link": "http://taoshistat.wordpress.com/2012/10/02/really-a-randomized-trial-of-free-market-capitalism/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.nasa.gov/": 1, "http://taoshistat.wordpress.com/": 1, "http://www.significancemagazine.org/": 2}, "blogtitle": "Learning From Data"}, {"content": ["Given my bad memory, it is to a point that remembering all PIN numbers of different cards, accounts, and doors is close to impossible. However, PIN numbers are the ones you don’t want to share with others either. Here is an interesting analysis. \n Robert Siegel at NPR talked to  Nick Berry, president of the data mining consulting company Data Genetics, about his findings, the least popular PIN and why the password “1234″ isn’t such a great idea. Nick analyzed a database of 3.4 million exposed passwords, mostly for websites, condensed from released/exposed/discovered password tables and security breaches. \n The first big finding: \n The most popular password is  1234 …… it’s  staggering  how popular this password appears to be. Utterly  staggering  at the lack of imagination …… nearly 11% of the 3.4 million passwords are  1234   !!! \n Following 1234 , here come 1111 , 0000 , 1212 , 7777 , ……, the most frequently used PIN numbers. The complete list can be found from Nick’s blog post PIN analysis , which is a very nice statistical analysis worth reading. \n The high frequency list comes with puzzles as well. For example, the number  2580  is in position #22. What is the significance of these digits? Nick figured out that it is due to the layout of a telephone keypad! \n The least used in the database 8068 has only 25 occurrences in 3.4 million (0.000744%). Be careful to use it since it may not be least used any longer \n See more interesting analysis at Nick’s post , from which (and xkcd) I stole another nice cartoon."], "link": "http://taoshistat.wordpress.com/2012/09/21/cannot-remember-your-pin-numbers/", "bloglinks": {}, "links": {"http://www.npr.org/": 1, "http://feeds.wordpress.com/": 1, "http://www.datagenetics.com/blog": 2}, "blogtitle": "Learning From Data"}, {"content": ["As ESPN.com reports on a Wednesday   US Open  match in which 6-foot-9 John Isner defeated Xavier Malisse 6-3, 7-6 (5), 5-7, 7-6 (9) with help from his blistering serves, the article title reads “At what point is tall too tall?”. You may see how tall Isner is in this historical picture taken after the longest tennis match in history . \n \n More interestingly, the article starts with: \n Tall people, the studies insist, tend to be more successful than the rest of us. \n According to a 2009 report in Australia’s Economic record, men who are 6 feet or taller make an average of nearly $1,000 more per year than those who are 2 inches shorter. \n “Taller people are perceived to be more intelligent and powerful,” the study said. \n This gets me curious about the relationship between “being tall” and “being successful”. Eventually I found this paper, “Does Size Matter in Australia?” by MICHAEL KORTT  and ANDREW LEIGH, published in  THE ECONOMIC RECORD . Using data from the Household, Income and Labour Dynamics in Australia (HILDA) survey and applying regressions on log(wage) as response variable, the paper finds: \n To put this into context, the average height of men in our sample is 178 cm (5 feet 10 inches). A male who is 183 cm (6 feet) tall is at the 75th percentile of the height distribution, and would be expected to earn a wage premium of 1.5 per cent. The average annual earnings of men in our sample is $63 200, so at the mean, another 5 cm of additional height is worth $948 per year. \n Here is my question: How does this study based on survey data support “Taller people are perceived to be more intelligent and powerful “? I cannot see through. \n Even on tennis court, as pointed out by the same  ESPN article , height alone does not guarantee success. \n [Update] John Isner lost in the third-round of U.S. Open against Philipp Kohlschrieber in another five-set  match which ended at 2:26 a.m. Monday. An additional note, Isner left all four Grand Slam tournaments this year with five-set losses. The taller the player, the longer you play?"], "link": "http://taoshistat.wordpress.com/2012/09/02/tall-people-tend-to-be-more-successful/", "bloglinks": {}, "links": {"http://www.wiley.com/": 1, "http://feeds.wordpress.com/": 1, "http://sports.go.com/": 1, "http://espn.go.com/": 5}, "blogtitle": "Learning From Data"}, {"content": ["After investigating results of   expert picks  and  algorithmic prediction  of 2011-2012 season NFL game in earlier posts, we may have been convinced that systematic study of relevant data may lead to better “expert”. Machine beats human with a wide margin (68% v.s. 65% accuracy rate)? \n Now if you move your eyes to the last column of the  prediction image , you will notice the word “ Pick’em “.  It is the average of all predictions by NFL fans who submitted their picks on ESPN.com before the game. A kind of “crowd prediction” by non -experts. \n Like Accuscore, Pick’em prediction scored 10-6 in the first week of 2011-2012 NFL season, no more, no less. \n Click to view slideshow. \n However, at the end of the  17 weeks of  regular season  games, Pick’em tied with accusore with 174 right picks (68%accuracy). Isn’t it amazing? The next table contains the performance of the best four experts, Accuscore and Pick’em. \n \n \n \n \n Allen \n Jaworski \n Schlereth \n Wickersham \n Accuscore \n Pick’em \n \n \n Correct \n 165 \n 155 \n 167 \n 167 \n 174 \n 174 \n \n \n Wrong \n 89 \n 85 \n 89 \n 89 \n 82 \n 82 \n \n \n Accuracy \n .65 \n .65 \n .65 \n .65 \n .68 \n .68 \n \n \n \n Aha!   Wisdom of the crowd kicks in nicely. A classic example of this phenomenon is often mentioned as: \n At a 1906 country fair in  Plymouth , eight hundred people participated in a contest to estimate the weight of a slaughtered and dressed ox. Statistician  Francis Galton  observed that the mean of all eight hundred guesses, at 1197 pounds, was closer than any of the individual guesses to the true weight of 1198 pounds. \n This year,  Lior Zoref  actually bring a live ox on stage of TED . \n  \n How good does the the mind of that crowd do? There were 500 estimates, and the results were: \n -The lowest guess was 308 lbs. \n -The highest was more than 8000 pounds. \n -The average was 1792 pounds. \n And the real weight? The ox weighs 1795 pounds.  Three  pounds off. \n People rock! (How about random forests and boosting, if you know what I’m talking about.)"], "link": "http://taoshistat.wordpress.com/2012/08/23/crowd-prediction-of-nfl-games/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://taoshistat.wordpress.com/": 3, "http://tedconfblog.wordpress.com/": 1, "http://en.wikipedia.org/": 3, "http://blog.ted.com/": 2, "http://i.imgur.com/": 1}, "blogtitle": "Learning From Data"}, {"content": ["Following my previous post on expert picks of NFL games , one may wonder if someone can do better than those experts in picking winning teams ahead of the game. If you direct your eagle eyes to the second last column of the prediction image , you will notice the word “Accuscore”. What is it? ESPN describes it as: \n AccuScore  has powered more than 10,000 simulations for every NFL game on ESPN.com, calculating how each team’s performance changes in response to game conditions and opponent’s abilities. Each game is simulated and the game is replayed a minimum of 10,000 times to generate forecasted winning percentages. \n In short words, it is prediction based on simulations (algorithms and data). As a company, Accusore runs simulation on almost every major sport game: NFL, NBA, NCAA FB, NCAA BB, … Of course, they sell their prediction through membership purchase. It seems that they are trying their best to use massive amount of data to generate a fortune. So, how well are they doing? \n For predicting the first week of 2011-2012 season, Accuscore prediction scored 10-6, just like one extra expert, no better, no worse. \n  \n However, at the end of the  17 weeks of  regular season  games, accusore did pretty well, compared to any of those experts. \n \n \n \n \n Allen \n Golic \n Hoge \n Jaworski \n Mortensen \n Schefter \n Schlereth \n Wickersham \n Accuscor \n \n \n Correct \n 165 \n 161 \n 162 \n 155 \n 155 \n 158 \n 167 \n 167 \n 174 \n \n \n Wrong \n 89 \n 95 \n 93 \n 85 \n 101 \n 98 \n 89 \n 89 \n 82 \n \n \n Accuracy \n .65 \n .63 \n .64 \n .65 \n .61 \n .62 \n .65 \n .65 \n .68 \n \n \n \n Would we call it the power of data mining? (… to be continued …)"], "link": "http://taoshistat.wordpress.com/2012/08/22/algorithm-prediction-of-nfl-games/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.accuscore.com/": 1, "http://taoshistat.wordpress.com/": 1, "http://i.imgur.com/": 2}, "blogtitle": "Learning From Data"}, {"content": ["Football is at the corners again and all kinds of experts are active in making predictions of NFL games recently. So how good are these experts in prediction and how predictable are NFL games?  Well, we do not  know how well they will do this year, but we can check their records last year. \n Let’s take  ESPN expert pick as an example. When NFL regular season starts, experts will submit their picks, which will be public viewable, before each week’s games. After all games are played, they will simply be judged as right or wrong in each game. \n Each week on ESPN.com, the brain trust of Bristol University convenes and our experts offer their predictions for the upcoming slate of NFL games. A green border indicates a correct answer, and a red border indicates a wrong answer. \n “the brain trust of Bristol University” LOL. Anyway, with some nice graphical artwork by ESPN.com, here we can see how ESPN experts did for the first week of 2011-2012 season. \n  \n After 17 weeks of regular season games, the total numbers of correct predictions, wrong guesses and expert’s prediction accuracies are: \n \n \n \n \n Allen \n Golic \n Hoge \n Jaworski \n Mortensen \n Schefter \n Schlereth \n Wickersham \n \n \n Correct \n 165 \n 161 \n 162 \n 155 \n 155 \n 158 \n 167 \n 167 \n \n \n Wrong \n 89 \n 95 \n 93 \n 85 \n 101 \n 98 \n 89 \n 89 \n \n \n Accuracy \n .65 \n .63 \n .64 \n .65 \n .61 \n .62 \n .65 \n .65 \n \n \n \n Since it is hard to find these results on internet now, you got to either trust me (blindly) or request the full data from me (which I’m happy to share). Say you believe the numbers for now, do you think you can pick better than other experts? \n You know what, it is legal to bid on NFL games somewhere  (… to be continued …)"], "link": "http://taoshistat.wordpress.com/2012/08/17/nfl-expert-picks/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://espn.go.com/": 1, "http://i.imgur.com/": 1}, "blogtitle": "Learning From Data"}, {"content": ["People following the controversy generated by a Nature news article  Why great Olympic feats raise suspicions  saw new developments today. Tim Appenzeller  Chief Magazine Editor,  Nature and  Philip Campbell  Editor-in-Chief,  Nature issued an editor’s note and apologized to readers and Ye Shiwen. (As I saw it at 11:40am EST, August 6, 2012) \n \n EDITORS’ NOTE (continued) \n The news story was triggered by a debate that was already active, concerning the scale of Ye Shiwen’s victory. Such debates have arisen over many outstanding feats in the past, by athletes from many countries, and it is wrong to suggest, as many of the critics do, that we singled her out because of her nationality. \n The story’s intention as an Explainer was to examine how science can help resolve debates over extraordinary performances, not to examine those performance statistics in detail. Several analyses done by others convinced us that it was fair to characterize Ye’s performance as ‘anomalous’ — in the sense that it was statistically unusual. But we acknowledge that the combination of errors discussed above and the absence of a more detailed discussion of the statistics (which with hindsight we regret) gave the impression that we were supporting accusations against her, even though this was emphatically not our intention. For that, we apologize to our readers and to Ye Shiwen. \n Tim Appenzeller  Chief Magazine Editor,  Nature \n Philip Campbell  Editor-in-Chief,  Nature \n However, I don’t understand this sentence. “ Several analyses done by others convinced us that it was fair to characterize Ye’s performance as ‘anomalous’ — in the sense that it was statistically unusual.” \n I wish it was a typo in the word “fair”, but maybe not. If the editors are convinced that Ye’s performance is statistically unusual, would you kindly point out which statistical analysis have convinced you that this is anomalous? As a person who has studied, taught and researched on statistics in college for more than 15 years, I see most analysis in comment section pointing to the direction that Ye’s performance is not anomalous. \n You’d better not to regret again on “ the absence of a more detailed discussion of the statistics” this time around. \n I’m sending this comment to the editors now."], "link": "http://taoshistat.wordpress.com/2012/08/06/good-and-bad-statistics-in-display-following-nature-news-article/", "bloglinks": {}, "links": {"http://www.nature.com/": 2, "http://feeds.wordpress.com/": 1}, "blogtitle": "Learning From Data"}]