[{"blogurl": "http://letsplaymath.wordpress.com\n", "blogroll": [], "title": "Let's Play Math!"}, {"content": ["Two of my daughters are attempting NaNoWriMo this year. So I’m thinking I might keep them company and give the EBookWriMo Challenge a try. What topic should I write about? \n \n \n \n Take Our Poll \n Don’t like any of my ideas? Enter your suggestion in the poll, or leave a comment below! \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/10/30/poll-math-ebooks/", "bloglinks": {}, "links": {"http://www.nanowrimo.org/": 1, "http://feeds.wordpress.com/": 1, "http://www.copyblogger.com/": 1, "http://polldaddy.com/": 1, "http://www.feedburner.com/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["I cleaned up the clutter on my other blog , and so I decided to make a page about my daughter’s book , which meant taking the time to pull out excerpts from her reviews. And since I hadn’t posted anything about her on this blog for a couple of months, I thought I’d brag a bit to you all, too. \n Reviews of Banished \n Banished is a captivating fantasy story with a well-thought-out plot that would be a credit to any writer. But it is especially remarkable coming from a thirteen-year-old student who has been homeschooled all her life. \n Teresa Gaskins actually wrote this book as a project for the National Novel Writing Month program. One noteworthy thing about the book is that there is no sexuality or bad language (the euphemistic interjection “Blasted” is used once), so, other than those who object to the presence of any kind of magic in books, parents can let their kids read the novel with no reservations. \n However, be forewarned. When you reach the final page and find the words, “Not the End…,” you will cry, “Oh! No!” The story does not resolve itself at the end and then pick up in a sequel. Rather, the plot is left hanging at the end and will continue in another book. I for one feel as if I simply can’t wait to read the next installment to find out what happens to Chris and his friends. It’s that good! \n — Wayne at Home School Book Review \n \n \n There are many things I like about this first book in a series. First, I am very impressed that it was written by a 13 yr old homeschooler. Yes, a 13 year old! Teresa Gaskins has been writing stories for a few years in her blog. She has participated in the NaNoWriMo Youth program as a part of her language studies. \n Her use of descriptive words is wonderful as is her grammar! I found myself looking up word definitions while reading, (I love how easy a kindle makes that) refreshing my memory on such things as harpies. \n I do recommend this book for children age 9 and up. \n — HomeschoolLiterature.com \n \n A paperback version is also available, and Amazon is even including the book in their buy-3-get-1-free promotion. Nice! \n Naturally I’m biased, but I think Teresa (who goes by the internet nickname of Princess Kitten ) did a pretty good job, as first books go. Her book is clearly the beginning of a series, so she sets up more plot threads than she resolves. So far, she’s written about 17,000 words on Book Two, and I can’t wait to read it. \n If you think you might be interested, you can read the first four chapters by clicking the “Look Inside” link on her Amazon.com book page . \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/10/23/reviews-for-my-daughters-book/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.homeschoolliterature.com/": 1, "https://kittenspurring.wordpress.com/": 1, "http://homeschoolblogger.com/": 1, "http://blogging2learn.wordpress.com/": 1, "http://tryth.at/": 4, "http://www.feedburner.com/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["Blog carnivals can be a wonderful source of inspiration and information. The Blog Parties for Teachers widget in my sidebar offers an wide assortment of recent carnivals on math and homeschooling. \n The widget disappeared over the summer, as some carnivals (like the Homeschooled Kids Blog Carnival ) went on hiatus — and as I just got too busy to maintain the list by hand. But now, with the new school year, I’ve found several new carnivals to explore, so I’ll try my best to keep the list up-to-date. \n Enjoy! \n P.S.: If you host an blog carnival for teachers or homeschoolers, please email me a link. \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/10/22/blog-parties-for-teachers-2/", "bloglinks": {}, "links": {"http://tinyurl.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.feedburner.com/": 1, "http://blog.homeschooling-ideas.com/": 1, "http://www.flickr.com/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["Sunday, October 21, is the worldwide hexaflexagon party in honor of Martin Gardner’s birthday. Gardner’s article about hexaflexagons launched his career as a recreational math guru who inspired people all around the world to love math. \n Here’s how to join in the fun: \n \n Hexaflexagon Templates \n \n Hexaflexagon History \n \n \n Hexaflexagons 2 \n \n Hexaflexagon Safety Guide \n \n  \n Discover more flexafun at The Flexagon Portal . \n G4G is an annual celebration of math in honor of Martin Gardner , long-time author of the Mathematical Games column in Scientific American . \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/10/19/hexaflexaparty-this-weekend/", "bloglinks": {}, "links": {"http://www.puzzles.com/": 2, "http://maa.org/": 1, "http://www.feedburner.com/": 1, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1, "http://www.flexagon.net/": 1, "http://getth.at/": 1, "http://www.g4g-com.org/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["by Mike Licht, NotionsCapital.com \n “Writing is how we think our way into a subject and make it our own.” \n – William Zinsser \n Writing to Learn \n \n Since the last recession, our homeschool co-op has been too small to support a blogging class, and I have seriously neglected my Blogging 2 Learn blog. So last week, I decided to refresh everything by starting up a new Blogging 101 Series . If your student has been longing to start a blog, you may want to check it out. \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/10/17/would-your-student-like-to-start-a-blog/", "bloglinks": {}, "links": {"http://fave.co/": 1, "http://feeds.wordpress.com/": 1, "http://www.feedburner.com/": 1, "http://blogging2learn.wordpress.com/": 2, "http://www.flickr.com/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["Nrich recently updated their amazing website. I love exploring their backlog of puzzles and games — what a mother lode of resources for math club or a homeschool co-op class! \n  \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/10/15/nrich-math-puzzles-and-more/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.feedburner.com/": 1, "http://nrich.maths.org/": 2}, "blogtitle": "Let's Play Math!"}, {"content": ["If you are looking for some mathematical inspiration, check out this month’s Math Teachers at Play blog carnival . It’s full of activity and game ideas, puzzles and problems, and interesting mathematics for students in elementary, middle, or high school. Enjoy! \n \n \n Welcome to the 55th edition of the Mathematics Teachers at Play Blog Carnival. The number 55 is the 10th Fibonacci number and the sum of the first 10 counting numbers. \n Below are the entries to the 55th edition of the Math Teachers at Play Blog Carnival… \n Click here to read the whole carnival post. \n Photo by Sam via flickr. \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/10/13/math-teachers-at-play-55-via-mathematical-palette/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://mathpalette.com/": 3, "http://www.feedburner.com/": 1, "http://www.flickr.com/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["I’ve been enjoying the Introduction to Mathematical Thinking course by Keith Devlin. For the first few weeks, we mostly talked about language, especially the language of logical thinking. This week, we started working on proofs. \n For a bit of fun, the professor emailed a link to this video. My daughter Kitten enjoyed it, and I hope you do, too. \n \n Full lesson available at Ted-Ed . \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/10/10/what-is-a-proof/", "bloglinks": {}, "links": {"http://www.coursera.org/": 1, "http://ed.ted.com/": 1, "http://www.feedburner.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["Poster by Maria Droujkova of NaturalMath.com . In this PUFM Series , we are studying Elementary Mathematics for Teachers and applying its lessons to home education. \n Multiplication is taught and explained using three models. Again, it is important for understanding that students see all three models early and often, and learn to use them when solving word problems. \n — Thomas H. Parker & Scott J. Baldridge \n Elementary Mathematics for Teachers \n \n I hope you are playing the Tell Me a (Math) Story game often, making up word problems for your children and encouraging them to make up some for you. As you play, don’t fall into a rut: Keep the multiplication models from our lesson in mind and use them all. For even greater variety, use the Multiplication Models at NaturalMath.com (or buy the poster ) to create your word problems. \n   \n Study Teaching Materials \n In this section, our textbook refers to Singapore Primary Math 3A pp. 68-90. It seems to me that the following would also be helpful, if you have these books: 1B pp. 42-53; 2A pp. 68-71, 80-91; 2B pp. 20-35; 3A pp. 39-56, and 68-90. Page numbers are from my (old!) 3rd edition books. If you have a different edition or another textbook series, look for headings like these: \n \n Multiplication \n Equal Groups \n Multiplication and Division \n Word Problems \n \n By following the topic through several grade levels, you will get a better understanding of how your textbook series develops a student’s understanding. Pay attention to how the concepts are introduced and how they are built up step by step from one lesson to the next. Does your textbook push students straight into memorization drills, or does it encourage the use of a variety of thinking strategies? \n Three Basic Multiplication Models \n Elementary Mathematics for Teachers discusses three basic models, or mental pictures, that are helpful for teaching multiplication to your children. \n (1) Set Model \n “_____ sets of ______ objects per set” \nThis model represents discrete (countable) items collected into groups: apples per basket, pennies per dime, or cookies per plate. The set model includes the idea of multiplication as repeated addition , so it is the most common way of introducing multiplication to young children. \n (2) Measurement Model \n “_____ units of _____ measures per unit” \nThis model represents continuous quantities measured out in parts: inches per foot, cups per recipe, dollars per pound, or spaces per jump on a number line. The measurement model can include the idea of multiplication as scaling, stretching, or shrinking something from its original size, which makes it useful when thinking about fractions. \n (3) Rectangular Array Model \n “_____ rows of _____ items per row” \nIn early elementary math, the this model represents an array of discrete items: chairs per row, buttons per column, or soldiers on parade. As students grow, however, the model expands to include continuous rectangular area. At its most mature, this model becomes the basis for many topics in high school math and beyond, including integral calculus. Because of its flexibility, the rectangular model is the most important one for our children to master. \n  \n Notice that in each model, the two numbers of a multiplication problem have different roles. The first number is a scale factor, which tells you how many sets, units, or rows you are talking about, while the second number is a this-per-that ratio. In addition and subtraction, both numbers must represent the same type of thing, but this is almost never true in multiplication and division. Even in rectangular area, where both numbers represent a length measurement, one must be the horizontal length and the other vertical (the x- and y-dimensions in coordinate graphing). \n Multiplication Model Games \n I have created a deck of cards representing the three models of multiplication, so that your children can master them by playing games. \n \n Multiplication Matching Cards \n \n The cards do not include every math fact on the times table, but they should provide enough variety to cement the multiplication models in your children’s minds. \n To play Multiplication Rummy , deal seven cards to each player. Turn up the top card from the stack to start the discard pile. On his turn, each player may either draw from the stack or pick up the discard pile as far back as desired. But if he picks up more than the top discard, he has to meld the farthest-back card he picks up. When a player collects at least three cards in a set, he may meld (lay them down). If he has the fourth card in a set that is already on the table, he may lay that down, too. Then the player discards to end his turn. \n Play continues clockwise around the table until one player runs out of cards. A discard is optional when going out. Then count the score as follows: \n \n Every card on the table is worth +5 points. \n Every card in the hand is worth –2 points. \n The player who went out gains a bonus of +15 points. \n \n You may play a single hand, just for fun. Or play several hands, and the first player to reach 300 points wins. \n For a quick and easy game using the multiplication cards, play Concentration : Lay all the cards face down on the table, then try to turn up two matching cards — any two cards that belong to the same math fact. Or try Go Fish , according to your family’s favorite rules. Both of these games help children grow comfortable with the multiplication models. \n Properties of Multiplication \n Proceeding through our textbook lesson, we meet our old favorite “Any Order” Property : Numbers may be multiplied in any order without changing the answer . Addition was both commutative and associative, too, so this property may seem rather boring to you, but don’t take it for granted. It should be surprising. In addition, we were combining two of the same sort of things, such as pushing together two piles of blocks, so it makes sense that the answer shouldn’t matter on order. But the idea that 3 baskets of 4 apples per basket contain the same number of apples as 4 baskets of 3 apples per basket — Wow! \n Experiment with your children by making sets. Explore how the numbers work. Let your children discover and wonder at the amazing coincidence of the any-order property. And later, as they grow in understanding the multiplication models, use the rectangular array model to show why it will always be true. \n Now we meet a new principle: The Distributive Property : Any number times a sum is the same as the sum of the individual products (that number times each individual part of the sum). This is usually expressed in algebra. \n \n \n \n The distributive property is definitely “fundamental mathematics,” so we need to become familiar with it and recognize it in many situations. One thing that impressed me in the Liping Ma book is how often the Chinese teachers called on the distributive property to explain what they were doing and how blind the American teachers seemed to be to it. \n I remember in the New Math textbooks of my childhood we spent many lessons trying to master the words “associative,” “commutative,” and “distributive” and tell which property was represented by a certain equation. It was tremendously confusing, even to a good math student, and there is no reason to torture our children this way. The important thing is to learn the principles and be able to use them , not to memorize definitions and rules. \n Teachers should know and use the terms “distribute” and “distributive” so children get used to them, but I wouldn’t expect the students to remember the terms until pre-algebra or algebra. \n The arithmetic properties are taught as principles about the ways that whole numbers behave; they are illustrated with models using specific numbers and are practiced with Mental Math and word problems. They are not “rules” to be memorized. \n — Thomas H. Parker & Scott J. Baldridge \n Elementary Mathematics for Teachers \n \n Thinking Strategies for Multiplication \n I wrote extensively about the thinking strategies for multiplication in my Times Table Series , so I won’t repeat any of that here. \n One thing that I do with my students, usually in 3rd or 4th grade, is to give them a bunch of blocks (unit base ten blocks, but any small manipulative that can be lined up in a rectangular array would work) and several sheets of graph paper. I have them draw all the rectangles they can make for each set of blocks from 1 to 100, or as far as they can get in a few days’ worth of work. They will discover that 12 makes the 1×12, 2×6, and 3×4 rectangles, while 13 only makes 1×13. They can see exactly what square numbers are and why they have that name, and how prime numbers are different from composite numbers . This is early practice in factoring, which will be important in later math work. \n Three Stages of Learning Multiplication \n Because I prefer to delay formal arithmetic , with its emphasis on rules and memorization, I see these stages as stretching out longer than what our textbook authors recommend. My goal is the same: fluency in using multiplication to solve problems. But I prefer to spend the early- to mid-elementary years in the “figuring it out” stages (Stage I and Stage II by our book’s system) and let my children count blocks, fingers, or tally marks while we talk together about thinking strategies — and work lots and lots and lots of informal, oral story problems . \n Stage I \n (preschool-grade 2) \nNo pressure to memorize facts in this stage, because the focus is on understanding what multiplication is (and its inverse relationship with division) and learning to recognize a this-per-that ratio. Use plenty of pictures and word problems. \n Stage II \n (grades 2-4) \nThe stress is on deepening the student’s understanding, using all the models of multiplication, and learning to do multi-step problems. Memory work begins, but it is definitely not the main focus. Mental manipulation of numbers, using what you know to figure out what you don’t know, builds deep familiarity with the math facts and fundamental properties of multiplication. Notice for example the paragraph on the top of p. 29, where the problem 7 × 14 = 98 is used to show the significance of understanding and using place value and the distributive property. \n Stage III \n (grades 3-whenever) \n Wrap up the memory work , using games to make drill-style practice fun. The time needed will vary from one student to another, but I try to bring my children to readiness for this stage by 4th grade and to mastery by the end of 5th, if possible. I agree with our textbook authors’ statement that “Confidence is a major factor in learning and enjoying mathematics,” but it is possible to enjoy and excel at math even if one never masters all the multiplication facts. Consider this oft-quoted anecdote: \n Ernst Eduard Kummer (1810-1893), a German algebraist, was rather poor at arithmetic. Whenever he had occasion to do simple arithmetic in class, he would get his students to help him. Once he had to find 7 × 9. \n “Seven times nine,” he began, “Seven times nine is er — ah — ah — seven times nine is…” \n “Sixty-one,” a student suggested. Kummer wrote 61 on the board. \n “Sir,” said another student, “it should be sixty-nine.” \n “Come, come, gentlemen, it can’t be both,” Kummer exclaimed. “It must be one or the other.” \n — quoted from Anecdotes About Famous Scientists \n \n Homework Set 5 \n I’ve gone so long that I won’t comment on the homework problems, except to say that problem 8 demonstrates why older children should have scratch paper (or a white board and markers) available while working with mental math, to make notes or write down the answers of intermediate steps. Most people can’t hold that much information in short-term memory. \n  \n Times table by David Millar . \n \n This post is part of the Profound Understanding of Fundamental Mathematics Series . [Go to the previous post . Go to the next post. Or start at the beginning .] \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email . \n \n Have more fun on Let’s Play Math! blog: \n  \n \n Multiplication Challenge \n Diagnosis: Math Workbook Syndrome \n How Long is 10! Seconds? \n Game: Times Tac Toe \n Contig Game: Master Your Math Facts"], "link": "http://letsplaymath.net/2012/10/02/pufm-1-5-multiplication-part-2/", "bloglinks": {}, "links": {"http://www.naturalmath.com/": 2, "http://feeds.wordpress.com/": 1, "http://jcdverha.xs4all.nl/": 1, "http://letsplaymath.wordpress.com/": 2, "http://thegriddle.net/": 2, "http://math.about.com/": 1, "http://letsplaymath.net/": 16, "http://www.mathsisfun.com/": 3, "http://en.wikipedia.org/": 1, "http://tryth.at/": 6, "http://www.learningwave.com/": 1, "http://www.feedburner.com/": 1, "http://getth.at/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["via The Math Plane \n If you are a homeschooler or classroom teacher, student or independent learner, or anyone else who writes about math, now is the time to send in your favorite blog post for next week’s Math Teachers at Play blog carnival. \n The deadline is this Friday night , and the carnival will be posted next week at Mathematical Palette . \n \n Math Teachers at Play Blog Carnival — Submission Form \n MTaP Blog Carnival Information Page \n \n If you haven’t written anything about math lately, here are some ideas to get your creative juices flowing: \n \n Elementary Concepts: As Liping Ma showed, there is more to understanding and teaching elementary mathematics than we often realize. Do you have a game, activity, or anecdote about teaching math to young students? Please share! \n Arithmetic/Pre-Algebra: This section is for arithmetic lessons and number theory puzzles at the middle-school-and-beyond level. We would love to hear your favorite math club games, numerical investigations, or contest-preparation tips. \n Beginning Algebra and Geometry: Can you explain why we never divide by zero, how to bisect an angle, or what is wrong with distributing the square in the expression ? Struggling students need your help! Share your wisdom about basic algebra and geometry topics here. \n Advanced Math: Like most adults, I have forgotten enough math to fill several textbooks. I’m eager to learn again — but math books can be so-o-o tedious. Can you make upper-level math topics come alive, so they will stick in my (or a student’s) mind? \n Mathematical Recreations: What kind of math do you do, just for the fun of it? \n About Teaching Math: Other teachers’ blogs are an important factor in my continuing education. The more I read about the theory and practice of teaching math, the more I realize how much I have yet to learn. So please, fellow teachers, don’t be shy — share your insights! \n \n \n Would You Like to Host the Carnival? \n Hosting the blog carnival can be a lot of work, but it’s fun to “meet” new bloggers through their submissions. And there’s a side-benefit: The carnival usually brings a nice little spike in traffic to your blog. If you think you’d like to join in the fun, read the instructions on our Math Teachers at Play page . Then leave a comment or email me to let me know which month you’d like to take. \n Explore the Other Math Carnivals \n  \n While you’re waiting for next week’s Math Teachers at Play carnival, you may enjoy: \n \n Last month’s Math Teachers at Play \n Mathematics and Multimedia \n Carnival of Mathematics \n Carnevale della Matematica \n Carnaval de Matemáticas \n \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/10/01/bloggers-time-to-submit-your-post/", "bloglinks": {}, "links": {"http://mathpalette.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.walkingrandomly.com/": 1, "http://rudimatematici-lescienze.repubblica.it/": 1, "http://tinyurl.com/": 1, "http://mathandmultimedia.com/": 1, "http://ztfnews.wordpress.com/": 1, "http://letsplaymath.net/": 4, "http://tryth.at/": 1, "http://www.feedburner.com/": 1, "http://www.mathplane.com/": 1, "http://www.epsilon-delta.org/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["While I was working on the next post in my PUFM Series , I stumbled on an old favorite video. Since I couldn’t think of an excuse to use it in a post about multiplication, I decided to share it today. Enjoy! \n \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/09/28/new-math-by-tom-lehrer/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.feedburner.com/": 1, "http://letsplaymath.net/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["What a Fun Book! \n Who Killed Professor X? is a work of fiction based on actual incidents, and its heroes are real people who left their mark on the history of mathematics. The murder takes place in Paris in 1900, and the suspects are the greatest mathematicians of all time. Each suspect’s statement to the police leads to a mathematical problem, the solution of which requires some knowledge of secondary-school mathematics. But you don’t have to solve the puzzles in order to enjoy the book. \n Fourteen pages of endnote biographies explain which parts of the mystery are true, which details are fictional, and which are both (true incidents slightly modified for the sake of the story). \n I ordered Who Killed Professor X? from The Book Depository (free shipping worldwide!), and it only took 5 days to arrive here in the middle of the Midwest. My daughter Kitten, voracious as always , devoured it in one sitting — and even though she hasn’t studied high school geometry yet, she was able to work a couple of the problems. \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/09/26/who-killed-professor-x/", "bloglinks": {}, "links": {"http://fave.co/": 2, "http://feeds.wordpress.com/": 1, "http://www.feedburner.com/": 1, "http://letsplaymath.net/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["[ Photo by dsb nola via flickr. ] \n Food for thought: \n Imagine that you wanted your children to learn the names of all their cousins, aunts and uncles. But you never actually let them meet or play with them. You just showed them pictures of them, and told them to memorize their names. \n Each day you’d have them recite the names, over and over again. You’d say, “OK, this is a picture of your great-aunt Beatrice. Her husband was your great-uncle Earnie. They had three children, your uncles Harpo, Zeppo, and Gummo. Harpo married your aunt Leonie … yadda, yadda, yadda. \n — Brian Foley \n Times Tables – The Worst Way to Teach Multiplication \n \n On the other hand, if you want your children to develop relationships with the numbers, to learn the math facts naturally, then be sure to tell lots of math stories . And when you are ready to focus on multiplication, be sure to study the patterns and relationships within the times tables . \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/09/24/trouble-with-times-tables/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://bfoley.wrytestuff.com/": 1, "http://letsplaymath.net/": 2, "http://www.flickr.com/": 2, "http://www.feedburner.com/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["I wanted to include this video last week when I mentioned Paul Lockhart’s new book, but I couldn’t figure out how to copy it from Amazon. So today I read Shecky’s review of Measurement , which included the YouTube video. Thanks, Shecky! \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/09/19/the-world-of-mathematical-reality/", "bloglinks": {}, "links": {"http://fave.co/": 2, "http://math-frolic.blogspot.com/": 1, "http://www.feedburner.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "Let's Play Math!"}, {"content": ["[ Photo by Alex E. Proimos via flickr. ] \n Patrick Vennebush, author of Math Jokes 4 Mathy Folks ( the book and the blog ) wants to know how you and your children would answer a tricky math problem. \n He’s taking a pol l: \n I have often heard that, “Good teachers borrow, great teachers steal.” So today, I am stealing one of Marilyn Burns’s most famous problems. She takes this problem to the streets, and various adults give lots of different answers. When I’ve used it in workshops, even among a mathy crowd, I get lots of different answers, too. \n What’s your answer? \n “A man buys a truck for $600, then sells it for $700. Later, he decides to buy it back again and pays $800 dollars. However…” \n Go to Patrick’s blog to read the whole problem and submit your answer. Let everybody in the family try it! \n Update: Patrick posted the solution and percentages correct for students of various ages. \n \n Get all our new math tips and games:  Subscribe in a reader , or get updates by Email ."], "link": "http://letsplaymath.net/2012/09/17/problem-solving-poll-whats-your-answer/", "bloglinks": {}, "links": {"http://fave.co/": 1, "http://mathjokes4mathyfolks.wordpress.com/": 4, "http://www.feedburner.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.flickr.com/": 2}, "blogtitle": "Let's Play Math!"}]