[{"blogurl": "http://liesdamnedliesstatistics.com\n", "blogroll": ["http://thestatsblog.wordpress.com"], "title": "Lies, damned lies and statistics"}, {"content": ["Every so often someone comes out with a study that tries to make the point that investing in social media is a waste of time as it won’t help you sell your stuff. \n The latest incarnation is from Forrester (via Business Insider ) analyst Sucharita Mulpuru, who says that less than 1% of online transactions could be traced to a social media post. \n I’ll respond in two ways: \n That’s one study, here are five that show the opposite \nFirst of all the Forrester research is wildly counter-intuitive. The simple fact of the matter is we do pay attention to consumer opinions online. \n Exhibit A – Tripadvisor and Amazon. If social media had no affect on sales why do hoteliers and authors get so anxious about what’s written about them to the extent of (in a few extreme cases) trying to stuff them with fake reviews ? A review site like Tripadvisor is popular precisely because consumers consult it *before* a sale. \n 1- In fact, according to Nielsen , which conducted a global study of 28,000 consumers in 56 countries, online consumer recommendations are the second most powerful source of ‘brand advertising’ ahead of even editorial endorsements. \n Number one was word of mouth endorsement from friends and family which of course sometimes also happen online. \n That’s one (fairly persuasive) study that shows the opposite of Sucharita Mulpuru’s report. Here are four more: \n 2 – 15% of US social media purchasers have bought alcohol due to content they read on a social media site . However the same study by ROI research found that this can increase significantly if that content is about more than just promotions, ad messages and discounts. \n For example, Constellation Brands, which has 1.3 million Facebook fans, says 36% have purchased more because of social media. \n 3 – Constellation Brands raises a key point, it’s about creating a community of advocates who do ultimately buy. According to Bain and co consumers active on social media spend 20-40% more with companies they engage with online than other customers. \n 4 – And those advocates in turn will persuade other consumers to buy. A comblu study says that super-fans and advocates are 50% more likely to create content that results in purchases \n 5 – Finally, that positive content and sentiment created by fans is important as social media can certainly work in reverse and harm sales. According to the Convergys Group, a single bad tweet or Facebook comment can cost you 30 customers. \n Social media isn’t direct mail \nThose statistics I outline above all make a single point – people can create positive sentiment around your brand. That sentiment spreads thanks to online tools. And that sentiment then creates the right mood music for people to buy your products. \n However, social media by and large is not a direct response tool, and in that sense the Forrester report is correct. Social media is about everyday human interactions, and human interactions don’t work like that. \n I wouldn’t post a Facebook update or send out a tweet along the lines of “hey everyone, click on this link for the new Singer pilsner. It’s refreshing and low calorie too!” \n People don’t do it because its crass, you wouldn’t talk like that in real life and so its a sure- fire way to lose friends online. Yet the impetus is sometimes for social media to operate in this fashion, and so sadly some brands talk like that online. No wonder it doesn’t always work as intended. \n As a result, I think Sucharita Mulpuru’s study has done us all a favour. \n No, social media isn’t comparable to direct mail. And no, I won’t click on a link a friend has sent me to buy a new TV or lawnmower. \n However, next time I am browsing in store or online, the chances are when having to choose, I’ll remember him / her raving about it, and I’ll get out my credit card. \n Image – Michael Holden"], "link": "http://liesdamnedliesstatistics.com/2012/10/social-media-doesnt-drive-sales-a-response.html", "bloglinks": {}, "links": {"http://mashable.com/": 1, "http://www.businessinsider.com/": 1, "http://www.flickr.com/": 1, "http://comblu.com/": 1, "http://www.bain.com/": 1, "http://www.emarketer.com/": 1, "http://blog.nielsen.com/": 1, "http://www.bloomberg.com/": 1, "http://liesdamnedliesstatistics.com/": 1}, "blogtitle": "Lies, damned lies and statistics"}, {"content": ["Showcasing the growth of the so-called visual web , Comscore ( vla All Things D ) today came out with figures to show that, in the US at least, Instagram had 7.3 million daily active users (DAUs) beating Twitter’s 6.9 million. \n That’s very significant.  Remember that as recently as last Christmas Instagram only had 16 million users, while at SXSW in March, it passed the 25 million total. \n Looking at it over the course of the whole month, Twitter beat Instagram with 29 vs 22 million DAUs.   However, Twitter is of course still 5x the size of Instagram, with c.500 million accounts . \n On Twitter , RAAK’s Wessel van Rensburg commented that Twitter has a problem if Instagram is approaching it in size on mobile devices, as they share a lot of similarities from hashtags to loose connections.  On that point, the real story isn’t even so much the user numbers.   It is the fact that while only c.30% of Twitter’s user base is truly active , Instagram has managed to keep users engaged as the network has grown. \n Back in March at SXSW, Instagram boss Kevin Systrom claimed that 2/3 of users had logged in the previous day.   I assumed that those numbers would change for the worse. \n However, Comscore tells us that the average Instagram user spent 257 minutes on the network over August, compared to 170 minutes for the average Twitter user who accessed it via a mobile. \n Or to put it another way, Instagram users spend 51% more time with the service than (mobile) Twitter users.  A big difference in engagement.  Certainly these stats imply something that I’ve picked up from personal experience and observation:  That when it comes to people who aren’t otherwise heavy users of social media, Instagram is doing a lot better at reeling them in. \n ( Above, chart of the day from Business Insider ) \n \n Related articles \n \n  ComScore: Instagram Tops Twitter in Mobile Engagement \n  Instagram Beats Twitter in Daily Mobile Users \n  CHART OF THE DAY: Instagram’s Daily Users Blow Past Twitter’s (FB)"], "link": "http://liesdamnedliesstatistics.com/2012/09/instagram-beats-twitter-in-daily-mobile-users-engagement-significantly-higher.html", "bloglinks": {}, "links": {"http://techonomy.com/": 2, "https://twitter.com/": 1, "http://techcrunch.com/": 1, "http://wewillraakyou.com/": 1, "http://www.therabbitagency.com/": 1, "http://www.zemanta.com/": 1, "http://blogs.wsj.com/": 2, "http://blog.twitter.com/": 1, "http://www.businessinsider.com/": 3, "http://allthingsd.com/": 1, "http://liesdamnedliesstatistics.com/": 3}, "blogtitle": "Lies, damned lies and statistics"}, {"content": ["There’s been a lot of talk over the past month about the ‘ socialympics ‘:  How Olympics buzz really spread via social media at London2012. \n The IPC, the body which runs the Paralympic Games , has now produced a list of stats , which shows how the Paralympics similarly benefitted from social media exposure. \n I’ve taken a few highlights from the news release they issued this afternoon, and added a few comments and supplementary figures onto them: \n 1 – Nearly 2 million people visited www.paralympic.org , the official website of the IPC.  One in six visitors came from the UK, with USA, Germany, Poland and Canada making up the top five visiting countries \n 2 – There were close to 9 million views of videos featuring London 2012 sporting action or ceremonies uploaded to www.youtube.com/paralympicsporttv \n 3 – The IPC’s official Facebook group www.facebook.com/ParalympicGames grew by 130% during the Games and now has over 136,000 likes \n 4 – Over 10 million unique users visited london2012.com more than 25 million times during the Paralympics and a further 5.8 million people upgraded their London 2012 App to the Paralympic version \n 5 – Individual athletes also benefitted: Great Britain’s 100m T44 gold medallist Johnnie Peacock saw his Facebook fan page grow by 3,258% during 12 days of competition.   Meanwhile South African Oscar Pistorius added 30,000 followers during the games \n 6 – Google released figures today claiming 100 million regular Google+ visitors, which produced a fair amount of head scratching.   The IPC Google+ page was however certainly well received , getting 50,000 followers \n 7 – There have been 350,000 views of 600 behind the scenes videos produced by athletes as part of a Samsung sponsorship.    As an aside, this is one of the better commercial tie-ins I saw during London 2012 and is worth checking out  \n 8 – On August 25th, the IPC’s official Twitter feed had 28,509 followers, on 10 September (the day after the games finished) it had 39,839. \n 9 – The UK Paralympics team saw an even greater increase with Twitter followers increasing from  70,239 to 108,309 during the same period \n 10 – Finally during the games itself, Nielsen told us that a staggering 12% of UK social media messages were about the Paralympics \n As I posted on my Olympics Jux site, I was simply blown away by the Paralympics and the stats above prove I certainly wasn’t alone.   The online element of the games was particularly important given that US London2012 broadcaster NBC gave the Paralympics no live coverage at all , which puts the strong traffic figures from the US to the IPC website (which streamed live video) into perspective. \n \n Image – Greenwich Equestrian 2012 venue \n Related articles \n \n  ‘London 2012. Made in Britain’: standing ovation as Lord Coe closes the Paralympic Games \n  The London Paralympics \n  Lord Coe: ‘We were moved, dazzled and inspired by Paralympic athletes’"], "link": "http://liesdamnedliesstatistics.com/2012/09/london-2012-paralympics-the-social-media-facts-and-stats.html", "bloglinks": {}, "links": {"http://www.paralympic.org/": 3, "http://www.androidauthority.com/": 1, "https://plus.google.com/": 1, "http://www.thedrum.com/": 1, "http://deadspin.com/": 1, "http://www.twitter.com/": 2, "https://greenwicholympicdiary.jux.com/": 1, "http://www.zemanta.com/": 1, "http://www.youtube.com/": 1, "http://www.itv.com/": 2, "http://www.co.uk/": 5, "http://thelabyrinthguide.wordpress.com/": 2, "http://london2012.com/": 1, "http://liesdamnedliesstatistics.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Lies, damned lies and statistics"}, {"content": ["Two years ago I posed the question of whether the age of search might be – slowly – coming to a close .  This was in response to US stats showing all search had declined 16% year on year with Google showing a 17% drop. \n Though the figures evened themselves out, it could be that I asked the questions two years two early based on the latest figures from Hitwise . \n According to Paid Content these show that UK searches in August were down 40 million year on year.  Hitwise itself admitted that in addition to the Olympics skewing web stats, “the growing significance of social networks to websites” was a factor. \n It should be noted that this is 40 million out of a total search volume of 2.21 billion, so obviously there’s no reason for brands to scrap their search marketing budgets yet. \n However, the evidence is also clear that a strategy that has search and social working together improves search results. \n As far as three years back, Comscore found a 50% CTR increase when consumers were exposed to paid search and social media in tandem. \n Meanwhile a study this year by Search Metrics found that five of the top six factors relating to a high Google rank were social media related. \n Image from Kesco via Creative Commons  \n \n Related articles \n \n  Bing Search Volume Drops Following Social-Focused Updates \n  Contemporary Search Phrase Research \n  Social Media vs. SEO – Which Is More Important \n  Search Engine Trends – 2012"], "link": "http://liesdamnedliesstatistics.com/2012/09/is-search-traffic-slowly-moving-to-social.html", "bloglinks": {}, "links": {"http://www.vendio.com/": 2, "http://paidcontent.org/": 1, "http://www.flickr.com/": 1, "http://www.comscore.com/": 1, "http://arnoldit.com/": 2, "http://hitwise.com": 1, "http://www.zemanta.com/": 1, "http://blog.co.nz/": 2, "http://www.aaramshoppro.com/": 2, "http://liesdamnedliesstatistics.com/": 3}, "blogtitle": "Lies, damned lies and statistics"}, {"content": ["Over the past six weeks I’ve stopped doing what I’ve been doing on social media for the past four years…posting pretty much non-stop about social media. \n Instead I by and large turned my attention to London2012, first the Olympics and then the Paralympics .  This has included pausing this blog in favour of a jux photo-diary ( greenwicholympicdiary.jux.com ). \n Though I didn’t plan it like this, it actually resulted in a six week detox from social media business as usual (outside the day job ).  As London2012 draws to a close tonight, I’ve thought about how that’s worked out for me. \n First of all, on Twitter I appear to have lost 40-50 odd followers.  Fair enough really, the Paralympics in particular didn’t have nearly as much exposure in the US as it did here. A shame given the 227 US Paralympians representing their country. \n But as a result I must have appeared like people I occasionally see tweeting non stop about college football or major league baseball, where I wonder what on earth they are on about – and more to the point where I think ‘what’s this got to do with me?’ \n I have seen two positives though. \n First of all I’m now far more informed about my local area, Greenwich (London), than I was previously. \n Fairly soon into my Olympic tweeting I attracted the attention of local activists who objected to Greenwich Park being used for equestrian events, and from there I actually started tapping into a whole range of local twitter users. \n Never mind social media linking me to people half way around the world, using social media differently has connected me more to my immediate community. \n Related to that, I now follow a different mix of people.  The social media experts are still there.  So are plenty of people in sports, the Paralympic movement, and quite simply other Olympic / Paralympic enthusiasts from all walks of life. \n The range of content I see in my stream is different and more varied, and I think I’m better off for it. \n It’s benefitted me personally, I feel more optimistic and grounded with the real world.  As an aside I’ve also been able to personally test out a few other social networks with my paralympic content like Jux and Eyeem . \n It’s not rocket science, but its a reminder that’s been said many times elsewhere, that those of us in agencies can easily start living in a bubble. \n In fact, I was reminded of something I posted a few years ago, a Dutch marketer, Martijn van Osch,  who rationed his media intake to the bare minimum and – perhaps counter intuitively given his job – found he was better off professionally  for it.   His original piece is worth a read , some of what he said resonated as I looked back over the past few weeks and thought about the debate those of us who work in social media always have about filtering out the noise. \n Those of you who have followed me on social media these past few weeks, thank you for bearing with me!  (Almost) Normal service with stats based posts resumes this week! \n (Above, US women’s wheelchair basketball team leaves the North Greenwich arena after a quarter final win over Canada)"], "link": "http://liesdamnedliesstatistics.com/2012/09/reflections-from-a-london2012-induced-social-media-detox.html", "bloglinks": {}, "links": {"http://www.teamusa.org/": 1, "https://twitter.com/": 1, "http://www.paralympic.org": 1, "http://london2012.nytimes.com/": 1, "http://www.jux.com": 1, "http://www.eyeem.com": 1, "http://twitter.com/": 1, "http://liesdamnedliesstatistics.com/": 2, "http://www.therabbitagency.com": 1, "http://martijnvanosch.nl/": 1, "http://greenwicholympicdiary.jux.com/": 1}, "blogtitle": "Lies, damned lies and statistics"}, {"content": ["I’ve taken a break from this site for a few weeks, you’ll find me elsewhere posting about something else I love – the Olympics! \n I’ve always found it easier to get into the Olympics than say the World Cup, complete with the usual array of ‘Enger-land’ shouting.  And of course this time around the Olympics are happening in London, with the equestrian events and pentathlon happening 5 mins up the road here in Greenwich. \n As a result, I’m currently posting on an Olympic themed Jux site – Greenwich Olympic Diary .    It allows me to try something new, and also gives me experience of working with one of the ten up and coming visual social networks I talked about in my last post. \n Perhaps see you there!  If not, normal service here resumes in a few weeks. \n Related articles \n \n  London 2012: My Olympics experience, Games volunteer Miranda Staveley \n  This Guy Stomps Out 3G Hotspots at the Olympics [Olympics]"], "link": "http://liesdamnedliesstatistics.com/2012/08/olympic-break.html", "bloglinks": {}, "links": {"https://greenwicholympicdiary.jux.com/": 1, "http://r.zemanta.com/": 2, "http://www.zemanta.com/": 1, "http://gizmodo.com/": 2, "http://liesdamnedliesstatistics.com/": 2}, "blogtitle": "Lies, damned lies and statistics"}, {"content": ["Beyond Instagram and Pinterest – ten visual networks that should be on your radar  \n View more presentations from The Rabbit Agency (Rabbit) \n \n I’ve written a lot recently about the growth of the visual web – how the big social media success stories of 2011/2012 were visual, and how imagery is becoming more important online. \n I summarised the trend in a webinar presentationI did for EyeFor Travel (link here ) \n However, though Pinterest, Tumblr and Instagram have grabbed the headlines, which ones should you look out for next?   I’ve listed the ten I’ve had some exposure to over the past six months, as part of my job at Rabbit . \n Sure, not all of them will be a success.  Some will be though, and they are worth keeping on your radar. \n 1 – Jux \n  \n Less than a year old, Jux was called “ the most beautiful blog platform yet ” by The Next Web at launch and I agree. \n Think of it as an even more visual and better looking alternative to Tumblr, with a lot of the same functionality (repost articles, follow other users). \n Jux has quickly become a Rabbit favourite, with some of us (for instance catturner.jux.com   greenwicholympicdiary.jux.com ) having recently created personal sites. \n Jux boss Ted Metcalfe is adding features all the time to improve the functionality, so this is definitely one to start to get to grips with and thinking about what you can use it for.   Like Tumblr, the process of signing up and posting takes minutes. \n 2 – Tadaa \n  \n I wrote about Tadaa the other month , it’s one of a series of photo-sharing mobile networks that could on the surface of it be considered Instagram competitors. \n However founder Niko Schoppmeier’s aim isn’t to compete with Instagram on numbers, which he can never win.  Instead, it is to create a network for mobile photographers who really take pride in the quality of their content – think Vimeo vs YouTube. \n Tadaa recently went through an upgrade adding more filters and features.  I think its a better ‘product’ than Instagram with better features and filters. \n What it’s lacking at the moment is basic community features such as the ability to group images by hash-tag and the ability to call out someone publicly through @.   The fact that Instagram lifted both of these conventions from Twitter proved to be crucial to its success. \n However, unlike Instagram you can post an image and ask other users to post images in reply – most challenges and contests on Tadaa are run like this.   Also, both from personal experience and from what Tadaa told me – the network is ‘busy.’  It isn’t a ghost town, but has a core of committed users who come back day after day. \n 3 – EyeEm \n Like Tadaa, EyeEm is a German-based company.  While Tadaa is iOS only, and Instagram is iOS / Android, EyeEm is a good option for Windows Phone users. \n Its a service I very much like and have started using personally. I also think its got a lot going for it, with attractive product features.  For example, it gives you the option of filling out your caption and location for you, which is a nice touch if you are stuck with what to add. \n The interface looks good, you can call out other users through the @, and though there are no hash-tags as yet, you can instead create albums around any location or activity.   Once you’ve done this, any other user can add photos to that album. \n EyeEm seems to be taking a similar approach to Tadaa in differentiating itself in being a higher end network for mobile photo enthusiasts. \n Having said that, Britain’s Race for Life charity recently chose EyeEm in preference to Instagram for its high profile event. \n 4 – 500px \n  \n If Tadaa wants to be the high end Instagram, Toronto-based start-up 500px wants to be the high-end Flickr.   The Sydney Morning Herald describes it as being “home to some of the most amazing photos in the World” \n Like Flickr, free membership will get you a certain amount of functionality (10 uploads a week), while paid for accounts start at $19.95. \n Recently 500px acquired another Canadian company Algo Anywhere, with the aim of integrating its recommendation system into the site.   The fact that 500px was able to shell out $2 million on this implies a certain level of deep pockets. \n 5 – Cowbird \n Cowbird is in theory invitation only.   It is not a photo or video sharing service, instead it is a story-telling site with added multi-media.   Or rather, as Cowbird puts it , it is designed to become a “public library for human experiences.” \n Cowbird doesn’t actually allow video as founder Jonathan Harris says a video is a story in its own right.  It does encourage photos and sound. \n 6 – Storywheel \n Like Cowbird, Storywheel is all about (as the name says) the story.   Anyone actually old enough to remember pre-PC age picture slide-shows will immediately get the concept. \n Storywheel is the creation of Soundcloud, the growing social network that aims to become the YouTube of audio.   You upload a series of Instagram photos together, and then turn them into a narrated slide-show. \n 7 – Picle \n Picle is another app that meshes audio and images.   Record ten seconds worth of sound on top of your pictures \n Picle was the idea of London digital agency Made by Many , which launched the app at SXSW.   A month in, and it had netted 50,000 downloads. \n 8 – Socialcam and viddy \n  \n Along with Viddy , Socialcam has been described as the Instagram of mobile video.   Instead of taking a photo with your phone, you record a short video and then as with Instagram you enhance it via a series of filters. \n There are question marks over whether Socialcam has 40 or 80 million monthly users, given accusations of gaming the Facebook app charts. \n However, even the lower figure is impressive and the service has generated a lot of noise in the US in particular .   Brands have also started signing up , for example the Washington Post is using it for its Olympics coverage \n Rather than automatically funneling everything over to YouTube, Socialcam could be a good alternative or supplement to any video based campaign. \n Viddy is Socialcam’s main competitor and differs in that it is iOS only, and also restricts your videos to 15 seconds.  For that reason its been compared to Twitter as well as Instagram and a lot of people (myself included) prefer it to the larger socialam. \n Viddy has a fair share of celebrity users including Justin Bieber and Britney Spears \n 9 – Cinemagram \n Recently at Le Web, Instagram founder Kevin Systrom said that while he saw problems with mobile video (mainly to do with speed), he did see potential in Cinemagram . \n Cinemagram allows you to create animated photos, or cinemagraphs – the Cinemagram blog gives examples, with many users having turned these animated gifs into an art form. \n 10 – Snapguide \n  \n I think of Snapguide as the online version of picture recipe cards.   Except its about far more than food covering DIY, technology, photography automotive and beauty to name a few. \n Basically you create a how to guide, through images.   Typical examples include how to clean silver jewellery using toothpaste, how to make a bracelet out of a baseball, and how to make authentic Mexican salsa. \n Having recently raised $5 million, Snapguide integrates with Pinterest, and the potential-in for brands to create profiles and their own how to guides seems obvious. \n Those ten are by no means a definitive list.   For example, in photo-sharing networks you also have Via.me and Streamzoo.   In animated photos you also have Gifture.   In mobile video you have Burst and Klip – and so on.    \n But these ten are ones that caught my eye and are good representatives of the different genres of social networks that are on the rise and that you should be aware of – story telling apps, mobile photography and mobile video."], "link": "http://liesdamnedliesstatistics.com/2012/07/beyond-pinterest-and-instagram-ten-visual-social-networks-that-should-be-on-your-radar.html", "bloglinks": {}, "links": {"http://www.readwriteweb.com/": 1, "http://catturner.jux.com": 1, "http://www.co.uk/": 1, "http://www.cowbird.com": 1, "http://www.viddy.com": 1, "http://techcrunch.com/": 2, "http://www.com.au/": 1, "http://www.slideshare.net/": 4, "http://www.jux.com": 1, "http://www.zemanta.com/": 1, "http://greenwicholympicdiary.jux.com": 1, "http://www.snapguide.com": 1, "http://liesdamnedliesstatistics.com/": 6, "http://www.tadaa.net": 1, "http://500px.com/": 1, "http://cinemagram.tumblr.com/": 1, "http://www.eyeem.com": 1, "http://www.therabbitagency.com": 1, "http://popcrush.com/": 1, "http://blog.eyeem.com/": 2, "http://pandodaily.com/": 1, "http://www.co.uk": 1, "http://www.boston.com/": 1, "http://www.socialcam.com": 1, "http://picleapp.com/": 1, "http://allthingsd.com/": 1, "http://thenextweb.com/": 1, "http://storywheel.cc": 1}, "blogtitle": "Lies, damned lies and statistics"}, {"content": ["The visual web  \n View more presentations from The Rabbit Agency (Rabbit) \n \n Yesterday I was invited to speak at SXSE and having pretty much an open brief, chose to concentrate on two of my favourite things…stats and pictures!  The presentation is above, it goes into a bit more detail about why an image led online world matters. \n SXSE?  No, that’s not a typo, the event was a first and a deliberate play on its much more famous Austin namesake.   The brain-child of Ben Stockman , the event was held in the Thirsty Bear pub in London (which has an SE1 postcode, hence the name), with a line-up of 20 odd speakers during the day. \n From Rabbit that included Cat Turner who talked about some of the work she did in the 2010 election, her presentation is super interesting for anyone who knows a bit about UK politics, and well worth checking out. \n As yet London’s SXSE may be infinitely smaller than Austin’s SXSW. Remember though, SXSW also started from relatively modest beginnings . \n \n \n (Featured image on the site comes from Creative Commons  ) \n \n Related articles \n \n  South by South East – London, 3rd July \n \n \n \n \n  The Importance of the ‘Visual Web’ – Some Stats"], "link": "http://liesdamnedliesstatistics.com/2012/07/ten-and-a-bit-stats-on-why-the-visual-web-matters.html", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://www.flickr.com/": 1, "http://www.slideshare.net/": 4, "http://www.futurelab.net/blog": 2, "http://www.zemanta.com/": 1, "http://shinesquad.me/": 2, "http://www.therabbitagency.com": 1, "http://blog.eloqua.com/": 1, "http://www.co.uk/": 1, "http://www.twitter.com/": 1}, "blogtitle": "Lies, damned lies and statistics"}, {"content": ["I’m fortunate enough that the tools of my job happen to be things I personally enjoy.   Instagram has become my main network of choice, I check twitter first and last thing every day (and several times in between) and recently I’ve even (finally) come to appreciate  Google+. \n Facebook however I work with because I have to.  Though I understand the business need, it’s a network I personally dislike. \n I could write a whole post on the reasons why, but the point is you’d think I’d welcome any stats showing Facebook on the decline.  In fact, I’m going to argue that the latest figures suggesting that this is happening should be treated with caution. \n Those figures come from Comscore, showing that Facebook’s US user base has declined 4.8% in six months to 158 million. \n So is Facebook finally heading slowly the way of MySpace?  Hardly.  Here is why: \n In his critique (which I agree with) of Facebook’s mission to promote ‘authentic identity’, analyst and blogger Wagner James Au pointed out that Facebook probably has a ceiling of just over 50% market penetration of a country’s online population, and it has reached that point for the US, the UK and Canada \n I think that is right…when you are talking about the major industrialised nations.  In the Philippines for instance, Facebook has a whopping 92.9% penetration of the Internet population , and in the developing world that online population is only going to grow. \n \n The chart above above from the World Bank ( via Google ) shows that the % of the population on the Internet in the major English speaking countries has increased over the past few years. But when you look at the BRICS countries (and I added The Philippines in for good measure) those numbers in some cases more than doubled in the second part of the last decade. \n As Facebook is well aware, the home market of the US is no longer pre-eminent online.  Especially given the evidence that social media users in emerging markets are highly engaged , this is still a huge growth opportunity. \n Secondly this story seems to do the rounds every Summer.  Almost exactly a year ago, news came out of a so-called ‘big drop’ in user numbers.   As I wrote at the time , when even the Murdoch owned The Sun starts talking about users ‘abandoning’ the service, you know the idea has common currency. \n Guess what?  Facebook came out of last Summer just fine, and whatever the subsequent problems, managed to IPO.  Look out for another wave of Facebook in decline posts in June 2013. \n Social media e-commerce referrals from Facebook drop 88% to 59% \n  \n Here is one recent Facebook stat that brands should be aware of.  Facebook’s share of e-commerce referrals from social media  has dropped from 88% to 59% – that is significant. \n According to Monetate, which came out with the report, this is directly connected to the growth in non PC mobile and tablet traffic, and also the rise of Pinterest, whose share of referral traffic has gone up from 0.68% in Q1 2011, to 26% in Q1 2012.  No wonder Facebook is looking at a ‘want’ button . \n Never mind though.  Just as he did with Instagram to plug a mobile gap, I’m sure Mark Zuckerberg can dip into his pocket and find another $1 billion to buy Pinterest or someone similar. \n Related articles \n \n  The visual web – big in the Philippines, the US, Canada, UK and Spain \n \n \n \n \n  Top Trends of 2012: The Visual Web \n \n \n \n \n  Infographic of the Week: Instagram Nation \n \n \n \n \n  Google+ for tablets is the mobile app Facebook should have designed"], "link": "http://liesdamnedliesstatistics.com/2012/06/facebook-still-dominant-in-numbers-less-so-in-referrals.html", "bloglinks": {}, "links": {"http://therealtimereport.com/": 1, "http://www.businessinsider.com/": 1, "https://plus.google.com/": 1, "http://www.othersidegroup.com/": 2, "http://www.internetevolution.com/": 1, "http://www.readwriteweb.com/": 2, "http://statigr.am/": 1, "http://www.huffingtonpost.com/": 1, "http://www.zemanta.com/": 1, "http://venturebeat.com/": 2, "http://www.therabbitagency.com": 1, "http://www.co.uk/": 1, "http://www.twitter.com/": 1, "http://liesdamnedliesstatistics.com/": 5, "http://www.cbsnews.com/": 1}, "blogtitle": "Lies, damned lies and statistics"}, {"content": ["According to Royal Pingdom, Pinterest is probably now bigger than Tumblr in the US .    I say probably, as Royal Pingdom consulted a number of sources from Comscore to Google Trends to Alexa, and they all gave slightly different results. \n Even if Pinterest is only slightly behind that’s still a huge achievement, underscoring its 4377% growth over the past year ( according to Comscore ) \n Royal Pingdom does however suggest that based on Google Insights, Pinterest is heavily US based, while Tumblr is global. \n Google Insights is based on search queries, so I personally have gone back to Alexa, which shows that the top Pinterest, Tumblr and Instagram countries are as follows.  Note this is based on the ranking in their individual countries, not overall. \n Certainly Alexa suggests that Pinterest has not only passed Tumblr in the US, but in Canada, South Africa and Australia as well (though not in the UK). \n But what about Instagram?   Instagram is off course an application and mobile network, with (when I checked on 28 June) 56.2 million users.   You don’t access it via the web unless you go through a web client such as Statigram .   Nevertheless, a look at web traffic still shows general interest and popularity. \n What do these stats show?  They show that all three of the big visual social networks feature highly in the Philippines.   Along with (as expected), the US, Canada, Spain, and the UK. \n The importance of social media in the Philippines has been documented before.  Last year the country was found to be the top Facebook market by % of the Internet population using it (92.9%) . \n And speaking of Instagram, at the start of the year, #igersmanila (the Manila chapter of the Instagramers super-fan group) had the highest number of tagged photos worldwide.   \n Related articles \n \n  Pinterest has overtaken Tumblr in the United States \n \n \n \n \n  Top Trends of 2012: The Visual Web \n \n \n \n \n  Pinterest: The Next Social Frontier for Music \n \n \n \n \n  The Importance of the ‘Visual Web’ – Some Stats"], "link": "http://liesdamnedliesstatistics.com/2012/06/the-visual-web-big-in-the-philippines-the-us-canada-uk-and-spain.html", "bloglinks": {}, "links": {"http://techcrunch.com/": 1, "http://www.readwriteweb.com/": 4, "http://statigr.am/": 1, "http://www.futurelab.net/blog": 2, "http://www.zemanta.com/": 1, "http://royal.pingdom.com/": 3, "http://www.google.com/": 1, "http://liesdamnedliesstatistics.com/": 3}, "blogtitle": "Lies, damned lies and statistics"}]