[{"blogurl": "http://www.datavisualization.fr\n", "blogroll": [], "title": "Looking 4 data visualization"}, {"content": [". Conflicthistory est une data visualization développée par le studio néerlandais TecToys qui permet de visualiser les principaux conflits (Guerres, Révolutions, Emeutes ...) sur une map monde et de naviguer à travers le temps et l'histoire à l'aide d'une timeline (-4000 à Aujourd'hui). . La carte interactive a été développée..."], "link": "http://www.datavisualization.fr/blog/2012/10/timeline-of-war-and-conflict.html", "bloglinks": {}, "links": {}, "blogtitle": "Looking 4 data visualization"}, {"content": [". Garr Reynolds est un expert international en communication et est considéré comme un des gourous de la présentation en public avec Nancy Duarte. Son livre Presentation Zen est toujours la référence dans le domaine de la data presentation et a permis une amélioration significative ces dernières années des pratiques..."], "link": "http://www.datavisualization.fr/blog/2012/10/watch-garr-reynolds-at-tedxosaka.html", "bloglinks": {}, "links": {}, "blogtitle": "Looking 4 data visualization"}, {"content": [". L'éditeur de Business Intelligence SAS organise le 22 octobre à Paris l'évènement \"Comment prendre des décisions d’entreprise plus rapidement et efficacement ?\" afin de promouvoir sa solution de visualisation interactive JMP. . Au delà de la découverte de l'outil JMP, cet évènement sera l'occasion pour ceux qui s'intéressent à..."], "link": "http://www.datavisualization.fr/blog/2012/10/stefen-few-in-paris.html", "bloglinks": {}, "links": {}, "blogtitle": "Looking 4 data visualization"}, {"content": [". Récapitulatif mensuel des tweets les plus influents sur le domaine de la data visualization : Les 5 tweets les plus populaires sur le mois de Septembre ont été publiés par les comptes @Good, @JanWillemTulp, @WorldBank, @pewresearch et @uscensusbureau. . Au programme : Une infographie sur la qualité de l'air..."], "link": "http://www.datavisualization.fr/blog/2012/10/most-influential-tweets-2012-09-dataviz.html", "bloglinks": {}, "links": {}, "blogtitle": "Looking 4 data visualization"}, {"content": [". Sourcemap est une solution cartographique sortie des bureaux du MIT Media Lab qui permet de visualiser la chaine logistique et l'impact environnemental des biens de consommations. Lancée en 2009, cette plateforme collaborative s'adresse aussi bien aux particuliers qu'aux entreprises et industriels. . Avec Sourcemap, un consommateur peut visualiser la..."], "link": "http://www.datavisualization.fr/blog/2012/10/where-things-come-from-.html", "bloglinks": {}, "links": {}, "blogtitle": "Looking 4 data visualization"}]