[{"blogurl": "http://ml.typepad.com\n", "blogroll": [], "title": "Machine Learning Thoughts"}, {"content": ["If you like rationalizing events (see Happiness of a scientist I), you would probably enjoy convincing yourself that your jobs actually fits with your initial expectations, and this will require a certain amount of rationalization and a posteriori reinterpretation of..."], "link": "http://feedproxy.google.com/~r/MachineLearningThoughts/~3/3QxH81j6gNs/happiness_of_a__2.html", "bloglinks": {}, "links": {}, "blogtitle": "Machine Learning Thoughts"}, {"content": ["Having tried to do scientific research at several different places, I have observed the following, which has been confirmed by several colleagues: No matter where you are, it is almost impossible to spend more than 20% of your time doing..."], "link": "http://feedproxy.google.com/~r/MachineLearningThoughts/~3/AjZx3PT2Pdg/happiness_of_a__1.html", "bloglinks": {}, "links": {}, "blogtitle": "Machine Learning Thoughts"}, {"content": ["This post is a first of a series of somewhat personal posts. This will not be about Machine Learning in particular, nor will it be about science, but rather about scientists, their life and their quest for happiness. I often..."], "link": "http://feedproxy.google.com/~r/MachineLearningThoughts/~3/3lKq4SzFMiY/happiness_of_a_.html", "bloglinks": {}, "links": {}, "blogtitle": "Machine Learning Thoughts"}, {"content": ["In the early days of AI, scientists thought they would be able to build an intelligent computer by the end of the 20th century. This raised various fears about computers eventually taking over the world, and human beings replaced by..."], "link": "http://feedproxy.google.com/~r/MachineLearningThoughts/~3/jxVUP541UlQ/the_failure_of_.html", "bloglinks": {}, "links": {}, "blogtitle": "Machine Learning Thoughts"}, {"content": ["Google custom search engines are a very nice idea. I have started to create such a custom search engine for Machine Learning research. It is still preliminary, so feel free to suggest URLs or categories to add to it. Here..."], "link": "http://feedproxy.google.com/~r/MachineLearningThoughts/~3/p7bG5q1oHq4/machine_learnin_1.html", "bloglinks": {}, "links": {}, "blogtitle": "Machine Learning Thoughts"}, {"content": ["I have just created a page with a selection of cool Machine Learning videos (mainly talks given at Google). Feel free to suggest some more to add to this page..."], "link": "http://feedproxy.google.com/~r/MachineLearningThoughts/~3/ck_bKW9eavI/machine_learnin.html", "bloglinks": {}, "links": {}, "blogtitle": "Machine Learning Thoughts"}, {"content": ["A very nice talk by Sebastian Thrun about how he and his team designed an autonomous driving vehicle for the DARPA Grand Challenge. What is interesting is the use of Machine Learning to train the program."], "link": "http://feedproxy.google.com/~r/MachineLearningThoughts/~3/h12u1EmJdVA/winning_the_dar.html", "bloglinks": {}, "links": {}, "blogtitle": "Machine Learning Thoughts"}, {"content": ["The title of this post may seem awkward as most people working on ML would consider themselves as scientists. However, ML is still a young field, and as most scientific fields in their youth, the methods and practices are still..."], "link": "http://feedproxy.google.com/~r/MachineLearningThoughts/~3/dvDrO6Do2D8/making_machine_.html", "bloglinks": {}, "links": {}, "blogtitle": "Machine Learning Thoughts"}, {"content": ["Is learning theory really answering the right questions? More precisely, does working on (statistical) learning theory bounds really help designing better algorithms? Let me first say that this note is not against anyone in particular. I know most of the..."], "link": "http://feedproxy.google.com/~r/MachineLearningThoughts/~3/v3sCpOXSfdc/learning_theory.html", "bloglinks": {}, "links": {}, "blogtitle": "Machine Learning Thoughts"}, {"content": ["While commenting on the comments to my previous note (see here), I thought about the comparison of human and computers in terms of learning performance. Does this comparison even make sense? If it does, on which basis, or with which..."], "link": "http://feedproxy.google.com/~r/MachineLearningThoughts/~3/xs5cENgjG4A/learning_abilit.html", "bloglinks": {}, "links": {}, "blogtitle": "Machine Learning Thoughts"}]