[{"blogurl": "http://www.marketingcharts.com\n", "blogroll": [], "title": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Americans viewed 9.4 billion video ads in September, as data from comScore VideoMetrix reveals. That is a slight dip from August’s 9.5 billion ads, but, fairly positive news after the June-to-July 2012 plummet from 11 billion to 9.6 billion. Turning from ads to content videos, overall, 181 million US internet users watched in excess of [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/z3Q4tUNTv8o/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Of the 10 industries that spent the most on Google ads in Q3 2012 (both search and display), the Internet and Telecommunications industry achieved the best overall results according to WordStream, with a 6.27% average conversion rate from Google Search, and 8.59% on Google Display Network. The finance industry enjoyed the second highest average conversion [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/iJM7Jayy5YI/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Local search incidence is very high across 11 product and service categories, according to [download page] an October 2012 report from YP, conducted by Immr and in collaboration with Street Fight. 4 in 10 respondents use local search once a day, and two-thirds use local search at least 3-4 times a week. As data from [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/2a1vTYWIa3g/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Effective social care (being customer service through social media channels) fosters strong customer loyalty, finds NM Incite [download page] in a new report released October 2012. Among customers who have sought a social care response, 71% of those who experienced a quick and effective response say they are likely to recommend a brand or company, [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/d_4Ozo1Elyw/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["About 8 in 10 agencies surveyed by RSW/US [pdf] believe that the number of opportunities for new business are about the same as last year (34.4%) or have increased (44.8%). But, that doesn’t mean that getting new business is any easier. In fact, more than 8 in 10 say that obtaining new business is either [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/xL2MX2zDuJo/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["A new study by Sign-Up.to of tweets sent and tracked through its marketing tools finds that click-through rates (CTR) on links contained within those tweets are higher on the weekends than during the week, echoing January research from HubSpot’s Dan Zarrella, but contrasting later findings from Bit.ly. The Sign-Up.to research found that the average CTR [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/VeTHS9cFWMk/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["47% of American social media users aged 18 and older have used “social care,” finds NM Incite [download page] in a new report. That figure, unsurprisingly, is highest among younger groups, with 60% of 18-24-year-old females and 57% of males of that age accessing customer service through a social media platform. And although the use [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/FF-gh_o6H7E/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Almost 6 in 10 global adults aged 18-64 prefer online and mobile ads that are clear and straightforward, rather than humorous, according to new data released by Ipsos in October. But Americans, who value storytelling in their ads, apparently want those stories to be funny, at least when they’re online. In contrast to the global average, 56% of [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/ii75UWBDU2k/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["However self-indulgent they are perceived to be, Millennials and Gen Xers (those born after the post-WWII baby boomers) are a cost-conscious lot, according to SymphonyIRI’s quarterly MarketPulse findings, released October 2012. Fully 37% of Gen X adults surveyed buy brands that are on sale, rather than the brands they prefer. Just under one-third select products to create more [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/C_5MCkk-GyY/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["For even the most successful brands on Facebook, paid media can significantly amplify total reach over organic reach alone, argues Facebook [pdf] in a study conducted in partnership with comScore. The study examined 100 brand pages that were among the top in the US by fan count and that reached an organic audience of at [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/bc-El3VDPeM/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["The holiday season is picking up steam, and with it, a rash of studies documenting where, how, and for what consumers will shop. Most of these studies point to a significant role for mobile devices in the shopping process: Anywhere between two-thirds and four-fifths of smartphone owners plan to use their devices as shopping tools, [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/6pJQFeEJ6r8/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Ads should tell a unique story rather than just try to sell, agree 73% of US consumers. That’s one in a series of findings [pdf] from Adobe and Edelman Berland on consumer attitudes towards marketing and advertising. Respondents were presented with 17 statements about marketing and advertisements and asked with which they agree. Two-thirds agreed [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/tenlbE0eiec/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["New research finds [download page] that customers who participate in a brand’s social community are likely to show higher transaction volume in the weeks following the event that spurred their engagement. Using Canada’s AIR MILES rewards program as a case study, LoyaltyOne, which operates the program, combined 2-and-a-half years of social media interactions with actual [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/NV4l-JypkY8/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Among mobile platforms, Apple’s iOS leads in monetization performance on the Opera Advertising mobile platform, as Opera details [download page] in a report covering platform activity in Q3. iOS devices’ average effective cost-per-thousand impressions (eCPM) of $1.64 ($1.48 for the iPhone, $0.82 for the iPod Touch, and a whopping $4.42 for the iPad) outperformed the [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/fPvBefuZ02c/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Source: Rentrak. Content in Rentrak updates is produced and/or compiled by Rentrak Corporation and its TV Essentials data collection and analytical service. The “Stickiness” Index is the average percentage of the program viewed, divided by the average percentage viewed for all programs of that duration (i.e. 30 min, 60 min, or 120 min)."], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/aK1eoTXisnQ/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Source: Rentrak. Content in Rentrak updates is produced and/or compiled by Rentrak Corporation and its TV Essentials data collection and analytical service. The “Stickiness” Index is the average percentage of the program viewed, divided by the average percentage viewed for all programs of that duration (i.e. 30 min, 60 min, or 120 min)."], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/AUPOY8_wkpo/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Almost two-thirds of professionals around the world say that the use of information (including big data) and analytics is creating a competitive advantage for their organizations. But ask these professionals to define big data, and all consensus is thrown out the window. That’s what IBM and Oxford University found when they surveyed [download page] more [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/PMUJDvaCgIY/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Online advertising revenues are growing more quickly than traditional media revenues. But consumers and marketers both rate traditional sources, including TV and print publications, as best for marketing and advertising, well ahead of any digital media, according to survey findings by Adobe, released October 2012. Given up to 2 choices, 45% of consumers named newspapers and [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/F949_EE2iy0/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["B2B marketers are almost universally using social media to distribute content, but less than half rate it as effective, according to [download page] a new study from the Content Marketing Institute (CMI) and MarketingProfs. Instead, good old face-to-face contact still does the trick, with two-thirds of respondents rating in-person events as either effective or very [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/Wv-iMaEt5dQ/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Americans looked to incentive sites in greater numbers last month to help them save money, according to the latest comScore Media Metrix data. The number of unique visitors to incentive sites grew by 7% month-over-month, reaching 24.6 million, the second fastest-growing category for September. Education information sites took the top spot, enjoying their yearly spike [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/_en_518-Qwk/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["7 in 10 American mothers with children up to 12 years old make recommendations about brands, products and services to other mothers at least monthly, according to [download page] a study released October 2012 by The 360PR MomSquad and Mom It Forward. Fully half make brand recommendations daily. But what motivates them to recommend? Some [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/fU2IcOsXbr8/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["B2B marketers believe that the most effective content tells compelling and engaging stories. Apparently producing that kind of content isn’t such a problem anymore – but producing enough of it is. According to a new report from the Content Marketing Institute (CMI) and MarketingProfs, 29% of North American marketers surveyed said their biggest content marketing [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/tMav7ky3tpU/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Yesterday, Facebook reported that mobile ads accounted for 14% share of its advertising revenue in Q3, signaling that the social network might be starting to find its way in this new channel. For brands investing in mobile advertising to drive fan growth and engagement, a pair of studies released this month lend credence to Facebook’s [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/7fMCf732eGk/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Facebook was again the leading option in Q3 2012 for social logins, among online users who opted to use a social network identity to speed up registration on sites across the web, according to October 2012 data from Janrain. Facebook gained 6% points quarter-over-quarter to pass majority share for the first time, at 54%, extending its lead [...]"], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/gLUN1Fx4HOQ/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}, {"content": ["Content in Rentrak Theatrical box office updates is produced and/or compiled by Rentrak Corporation and its Box Office Essentials theatrical box office data collection and analytical service."], "link": "http://feeds.marketingcharts.com/~r/marketingcharts/~3/USDOlHOqkho/", "bloglinks": {}, "links": {"http://feeds.marketingcharts.com/": 2}, "blogtitle": "Marketing Charts, Stats, Facts & Trends"}]