[{"blogurl": "http://www.markheckmann.de\n", "blogroll": [], "title": "Mark Heckmann - Blog"}, {"content": ["Diese Tage (29.06-01.07.2012)  fand im altehrwürdigen Trinity College im Zentrum von Dublin die 11th European Personal Construct Association Conference (EPCA) statt. Thematisch ist diese um die Arbeiten von George A. Kelly zentriert, der die Personal Construct Theory (PCT)   in den 5oer Jahren begründet hat. Ich war auf der Konferenz mit einem  Vortrag  und einem  Workshop  zur Repertory Grid Technik angetreten. Obgleich das Repertory Grid einen hohen Bekanntheitsgrad auch außerhalb der PCT erreicht hat, gehörte ich mit diesem Thema zu einer kleinen Randgruppe. \n Die Atmosphäre auf der Konferenz war getragen von einer starken Kollegialität, Freundlichkeit und Offenheit. Auch als Newcomer in dem Feld fühlte ich mich angenommen und akzeptiert. Feedback wurde durchgehend konstruktiv in einer unterstützenden Haltung vorgetragen. Es war eine besondere Stimmung, die letztendlich auch daraus resultieren mag, dass viele der Teilnehmer sich bereits seit langer Zeit kennen und die internationale PCP Community sehr klein ist. Aber gerade die geringe Größe macht es Newcomern einfacher, sich hier zurecht zu finden und den ein oder anderen Kontakt zu knüpfen. \n Während mein Eindruck von der PCP-Konferenz in Venedig  im Jahr 2009 war, dass die Community Probleme mit dem Nachwuchs hat, war die Lage diesmal deutlich positiver. Nahezu die Häfte aller Teilnehmer waren junge Italierener aus den PCP-Zentren um Padua. Deutsche Wissenschaftler waren insgesamt hingegen nur vier vertreten. \n Insgesamt war die Konferenz für mich – nicht zuletzt durch das angenehme Rahmenprogramm, wo ich viele Kontakte knüpfen konnte –  ein toller Aufenthalt. Ich freue mich (und hoffe inständig, dass die prekäre Finanzierungslage meiner Fakultät dies zulässt) auf die nächste PCP-Konferenz in Australien im kommenden Jahr."], "link": "http://markheckmann.wordpress.com/2012/07/04/11th-epca-biennial-conference-in-dublin/", "bloglinks": {}, "links": {"http://markheckmann.wordpress.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.irishconstructivists.org/": 3, "http://en.wikipedia.org/": 1, "http://www.flickr.com/": 1}, "blogtitle": "Mark Heckmann - Blog"}, {"content": ["Wissenschaftler könnte ein schöner Beruf sein. Denn man hat als Wissenschaftler Zeit und Raum, Dinge zu durchdenken und zu erforschen. Wissenschaft scheint als Raum der Freiheit, als ein Ort an dem Neues entstehen kann. Dies ist zumindest das Bild, das viele von dem Wissenschaftsbetrieb haben,  bevor sie in diesen eintreten. All dies trifft zum Teil auch zu. Es gibt jedoch eine Kehrseite, die der Öffentlichkeit kaum bekannt ist. Dies betrifft vor allem die Arbeitssituation, wie sie sich für viele Nachwuchswissenschaftler in Deutschland derzeit gestaltet: Kaum Aussicht auf ein unbefristetes Beschäftigungsverhältnis, keine ausreichende Finanzierungssicherheit allein schon während der Qualifikationshase (Promotion), Arbeitszeiten einer vollen Stelle bei halber Bezahlung, keine ausreichende Zeit neben den tägliche Projekten der Promotion nachzugehen zu können, kaum unbefristete Anstellungsverhältnisse u.v.m. All dies ist Realität an vielen deutschen Lehrstühlen und Instituten. Selbstredend unterscheidet sich diese Situation von Universität zu Universität und Fachbereich zu Fachbereich. Insgesamt jedoch bleibt festzuhalten, dass der Wissenschaftsbetrieb nicht im Elfenbeinturm stattfindet. Zutreffender ist eher das Bild eines baufälligen, einsturzgefährdeten Gebäudes. \n In den letzten Jahren enthält dieser Umstand immer mehr Einzug in die öffentliche Diskussion, besondern da das Thema inzwischen auch von den Tagesmedien aufgegriffen wird (z.B. hier ). Auch das Templiner Manifest  der GEW und andere Bemühungen scheinen Wirkung zu zeigen. Ende April 2012 hat die Bundesregierung einen Vorentwurf zur Verbesserung der Situation des wissenschaftlichen Nachwuchses mit dem Titel “Exzellente Perspektiven für den wissenschaftlichen Nachwuchs fortentwickeln” herausgegeben. Es ist ein Zehn-Punkte Plan der diverse zentrale Problembereiche im Bereich des wissenschaftlichen Nachwuchses benennt. \n Ich befürchte, dass mich die positiven Folgen dieser Initiative nicht mehr erreichen werden. Und so gestaltet sich die Perspektive, nach meiner Promotion im Wissenschaftsbetrieb zu bleiben als nur bedingt attraktiv. Die Vorstellung, wenn dann ggf. man eine Familie hat, ständig nur Zwei- bis Drei-Jahres-Verträge und somit  keine Planungssicherheit zu haben, maximal mobil sein zu müssen, um eine neue geeignete Stelle irgendwo in Deutschland finden zu können u.v.m., machen Wissenschaft zu keiner attraktiven Berufsperspektive. Hinzu kommt, dass einer Wechsel in die privatwirtschaftliche Welt sich oft schwieriger gestaltet, je länger die Tätigkeit im Wissenschaftsbetrieb war. Hier gibt es ohne große Frage Unterschiede zwischen den Disziplinen. Für einen Sozialwissecnahftler scheint mir diese Einschätzung jedoch sehr zutreffend. Was also tun? \n Es ist eine Frage, die  von vielen angehenden Akademikern m. E. zu wenig reflektiert wird. Wenn man Interesse an einer wissenschaftlichen Tätigkeit hat, dann ist man i.d.R. erstmal glücklich, als Post-Doc eine Drei-Jahres-Stelle bekommen zu haben. Die strategische Frage, wo dies einen in zehn Jahren hinbringen wird, wird oft erfolgreich verdrängt. Das Motto ist meist: “Da wird sich schon was ergeben”. Vielleicht wird es das. Was jedoch wenn nicht? Will ich wirklich sehendes Auges das Risiko einer derart unsicher Berufsplanung eingehen, in der Hoffnung irgendwann eine Professur oder eine der wenigen unbefristeten Post-Doc Stellen zu ergattern? Eine gewissen Sorglosigkeit im Umgang mit dieser Frage scheint mir mitunter sogar zum guten Ton zu gehören. Die Gefahr dieser Haltung ist jedoch gegeben. Denn jenseits der akademischen Welt wartet man nicht gerade auf einen hochqualifizierten habilitierten Germanisten, der mit 40 Jahren aufgrund des Wissenschaftzeitvertragsgesetzes einen neuen Beruf sucht. \n Vor diesem Hintergrund freue ich mich über die Initiative der Bundesregierung und ihr Ziel, die Rahmenbedingungen zu verbessern. Ich hoffe, dass dieser Vorstoß auf Resonanz trifft und langfristig zu einer deutlichen Verbesserung der Situation im akademischen Mittelbau führen wird. Mir erscheint Wissenschaftler als ein schöner Beruf was den Inhalt betrifft. Es wird Zeit, dass dies auch für die übrigen Rahmenbedingungen zutrifft."], "link": "http://markheckmann.wordpress.com/2012/05/16/karriere-vs-wissenschaft-zur-verbesserung-der-bedingungen-fur-den-wissenschaftlicher-nachwuchs/", "bloglinks": {}, "links": {"http://markheckmann.wordpress.com/": 1, "http://www.spiegel.de/": 1, "http://feeds.wordpress.com/": 1, "http://www.gew.de/": 1, "http://dip21.bundestag.de/": 1}, "blogtitle": "Mark Heckmann - Blog"}, {"content": ["Die Verwaltung von Literaturangaben und das automatisierte Erstellen von Literaturverzeichnissen ist in LaTex gut gelöst: Die gewünschten Zitate werden einfach direkt in den Text eingetragen. Anschließend sucht das Programm BibTex die zu den Zitaten zugehörigen Literatureinträge heraus. Im letzten Schritt wird automatisiert ein Literaturverzeichnis auf Basis dieser Einträge erstellt. Für diese Vorgänge sind in LaTex zwei Dateitypen von Bedeutung: Eine Datei mit der Endung .bst , die definiert, was BibTex tut und eine zweite, mit der Endung .sty , die auf der LaTex-Seite das Erscheinungsbild des Literaturverzeichnisses regelt. \n Insgesamt stehen in LaTex eine Reihe von Stilen zur Verfügung, die das Erscheinungsbild  des Verzeichnisses bestimmen. Diese sind an den Normen und Vorgaben der einschlägigen Fachverbände orientiert, so dass es möglich ist, das Verzeichnis dem jeweiligen Tätigkeitsfeld anzupassen. Da auch viele Psychologen LaTex nutzen, hat die APA reagiert und die notwendigen Dateien für ein Literaturverzeichnis im APA-Format zur Verfügung gestellt. Um die Lösung zu nutzen, muss das Paket apacite in den Vorspann der .tex Datei eingebunden werden. Eine ausführliche Anleitung hierzu findet sich z.B. hier . Diese Lösung funktioniert sehr gut. Da die Deutschen Gesellschaft für Psychologie  (DPGs) sich an den Definitionen der APA orientiert, ist das Format auch für deutsche Texte prinzipiell nutzbar, zumal es möglich ist, die Sprachoption deutsch in dem apacite -Paket einzustellen. Ein gravierendes Manko ist jedoch, dass die Anfangsbuchstaben von Literaturangaben (gemäß APA-Vorgaben) durchweg klein geschrieben werden. \n Neben apacite existiert das apager -Paket, dass einige Anpassungen für deutsche Texte enthält. Ich hatte zuletzt jedoch Probleme, das apager Paket im Netz zu finden. Darüber hinaus enthält es wie auch apacite das Manko, dass die Anfangsbuchstaben klein geschrieben werden. Wer mit LaTex arbeitet und auf deutsch schreibt, wird u.U. auf diese Probleme treffen, wenn ein Literaturverzeichnis nach Vorgaben der  DGPs erstellt werden soll. Leider stellt die DGPs m.W. keine offizielle Lösung für LaTex zur Verfügung. \n Bei meiner Recherche nach einer Lösung bin ich auf eine modifizierte Version von apager.bst gestossen. In dieser ist das o.g. Problem behoben, so dass es sich für die Arbeit im DGPs-Stil eignet. Unter diesem Link stelle ich eine .zip -Datei mit der modifizierten Version zum Download bereit. Sie enthält einen Ordner mit der modifizierten .bst Datei ( apager_dgps.bst ), der apager.sty -Datei  (keine Modifikation), einer Literaturdatenbank ( library_win.bib ) sowie ein  .tex -Minimalbeispiel ( apa_test.tex ), das direkt ausgeführt werden kann (d.h. 1 x Tex, 1 x BibTex, 1 x Tex). Da ich selber auf MacOS  arbeite, kann es sein, dass das Encoding in der .tex -Datei unter Windows angepasst werden muss. \n Viel Spaß damit!"], "link": "http://markheckmann.wordpress.com/2012/03/01/psychologie-und-latex-literaturverzeichnisse-im-dgps-stil/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://markheckmann.wordpress.com/": 1, "http://www.uni-salzburg.at/": 1, "http://de.wikipedia.org/": 1, "http://www.dgps.de/": 1, "http://www.uni-bremen.de/": 1, "http://www.apa.org/": 1}, "blogtitle": "Mark Heckmann - Blog"}, {"content": ["Zotero ist ein kostenloses OpenSource Literaturverwaltungsprogramm, das eine gute Oberfläche und Funktionalität bietet. Es ist als Plug-In für Firefox und demnächst auch als Stand-Alone Version erhältlich. Die Einbindung in Word funktioniert unter Windows als auch auf Mac OS sehr gut. Problematischer gestaltet es sich jedoch, wenn man mit LaTex arbeitet. LaTex nutzt BibTex  für Literaturangaben. In Zotero ist es möglich, die Literaturangaben in das BibTex-Format zu exportieren. Danach kann der zu einem Literatureintrag gehörige BibTex-Key aus der BibTex-Datei z.B. durch Nutzung von JabRef oder einem anderen Programm leicht herausgesucht werden. Dieser wird dann für das Zitat in LaTex verwendet. Schön ist dieser Workflow jedoch nicht, da er ein zusätzliches Programm benötigt. Eine für mich praktikablere Lösung mit einem einfacheren Workflow habe nach etwas Suchen im Zotero Forum  gefunden. Diese funktioniert, indem ein neuer Export-Stil zu Zotero hinzugefügt wird. Anstelle einer vollständigen Literaturangabe liefert der neue Export-Stil den zu einem Zotero Eintrag zugehörigen BibTex-Key, sofern der neue Stil eingestellt wird.  Dieser Workflow erscheint mir sehr nützlich, da ich somit ausschließlich Zotero nutzen muss und alle Zitate nun per Drag-and-Drop in meine LaTex-Datei einfach herüberziehen kann. Ein Link zu dem dafür benötigten Export-Stil ist im Forumbeitrag angegeben. Auch der Ort an die Dateien hinterlegt werden müssen ist genau erklärt. Have fun!"], "link": "http://markheckmann.wordpress.com/2011/12/01/zotero-to-latex-workflow/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://markheckmann.wordpress.com/": 1, "http://jabref.sourceforge.net/": 1, "http://de.wikipedia.org/": 1, "http://forums.zotero.org/": 2, "http://www.zotero.org": 1}, "blogtitle": "Mark Heckmann - Blog"}, {"content": ["Im aktuellen Semester (WiSe 2011/2012) biete ich für Studierende des Bachelor-Studiengangs Psychologie den Kurs “ Einführung in die quantitative Datenanalyse mit R”  an. Vorbehaltlich einer ausreichenden Anzahl an Plätzen sind auch Interessierte anderer Gruppen (WiMis, Doktoranden, Studenten andere Studiengänge) herzlich eingeladen teilzunehmen. \n Über den Kurs \n In der Veranstaltung wird in die Grundlagen von R  eingeführt. Die Teilnahme ist voraussetzungslos. Grundlegende Kenntnissen der Statistik sind jedoch empfehlenswert. \n Der Kurs findet dienstags von 11-14h (s.t.) an folgenden Terminen statt: 15.11., 22.11., 29.11., 13.12.2011 sowie 10.01, 17.01., 24.01, 07.02.2012 + ggf. einen Add-On Termin. Ort: Großer Cip-Pool Grazer Str. 2c.  Als Prüfungsleistung werden (a) zwischen den Terminen Aufgaben bearbeitet und im Kurs vorgestellt und (b) eine Ausarbeitung gegen Semesterende erstellt, die nachweist, dass der Umgang mit R vom Kursteilnehmer in den Grundzügen beherrscht wird. Anmeldung über StudIP.  Bitte einen Laptop mitbringen! \n Was ist R? \n R ist eine Open Source Statistik Programmiersprache, die wie SAS oder SPSS zur Bearbeitung vielfältiger Fragestellungen der Datenanalyse eingesetzt werden kann. R wurde 1996 aus der Wiege gehoben und hat sich seitdem zu einer der mächtigsten Sprache am Markt entwickelt, so dass sich inzwischen auch SPSS und SAS Schnittstellen zu R bereitstellen, um dessen umfangreiche Analysemöglichkeiten einbinden zu können. Der Grund für die rasante Entwicklung von R liegt vor allem an der Open Source Philosophie bei der wie bei Linux eine Vielzahl von Freiwilligen weltweit zu seiner Erweiterung beiträgt. R steht für alle weit verbreiteten Betriebssysteme (MacOS, Windows, Linux) auf der  R-Project Website  kostenlos zum Download zur Verfügung. \n Inhalte des Kurses \n Ziel des Kurses ist des den Umgang mit R zu erlernen und am Ende der Veranstaltung über einen sicheren Umgang in der Sprache zu verfügen. Davon ausgehend, dass der beste Weg eine Programmiersprache zu erlernen ist, in dieser selber Programme zu schreiben, wird der Kurs viele praktische Anteile enthalten. Folgende Themen werden behandelt (Änderungen möglich): \n \n Vorstellung der R Project Site, von R-help, der R Arbeitsumgebung, des R Workspaces und gängiger Editoren sowie ein kurzer Überblick über die Möglichkeiten von R als Appetizer. \n Einführung in die R Syntax sowie die wichtigsten Operationen und Datenobjekte. \n Umgang mit Daten: Laden und Speichern von Daten, grundlegende Datenmanipulation, Daten-Aggregation, Reshaping von Daten. \n Grundlegende statistische Auswertungen / Zusammenfassungen (Boxplots etc.). \n Einführung in das R Graphik-System. \n Grundlegende Statistik: Hypothesentests und lineare Modelle. \n \n Literaturauswahl \n In der SuUB besteht inzwischen eine umfangreiche Sammlung Büchern über R. Darüber hinaus enthält das Internet sehr viel Anleitungen als auch themenbezogene Blogs. Nachfolgende Bücher sind gut für einen Einstieg geeignet und stehen meist über das Campusnetz online zur Verfügung. \n Ligges, U. (2007)  Programmieren mit R . Berlin: Springer. Sehr gutes Buch, das keinerlei Vorkenntnisse erfordert. Thematisiert vorwiegend die Programmierung mit R. Als Online-Version im Campusnetz frei verfügbar ( http://www.springerlink.com/content/v17125/ ). \n Luhmann, M. (2010).  R für Einsteiger. Einführung in die Statistiksoftware für die Sozialwissenschaften. Weinheim: Beltz. In der SuUB vorhanden. Für Psychologen der empfehlenswerteste Einstieg in die Thematik. \n Sachs, L. (2006).  Angewandte Statistik: Methodensammlung mit R .  Berlin: Springer. Das Kapitel 9, Einführung in R, bietet einen guten Einstieg in R. Als Online-Version im Campusnetz frei verfügbar ( http://www.springerlink.com/content/l32744/ ). \n Verzani, J. (2005).  Using R for introductory statistics . Boca Raton : Chapman & Hall/CRC. Als Online-Version im Campusnetz frei verfügbar ( Link)."], "link": "http://markheckmann.wordpress.com/2011/10/01/einfuhrung-in-die-quantitative-datenanalyse-mit-r/", "bloglinks": {}, "links": {"http://www.netlibrary.com/": 1, "http://markheckmann.wordpress.com/": 1, "http://www.r-project.org/": 1, "http://www.r-project.org": 1, "http://feeds.wordpress.com/": 1, "http://www.springerlink.com/": 2}, "blogtitle": "Mark Heckmann - Blog"}, {"content": ["“… dass mir die Gelegenheit gegeben wurde, die sokratische Methode des gemeinsamen Nachdenkens  zu praktizieren, hat meine Einstellung zum Leben tief gehend verändert. Als ich zu Nelson kam, befand ich mich in einem Zustand des Skeptizismus, durch den Zweifel verunischert, soweit tiefere Überzeugungen betroffen waren. Hier fand ich einen Weg, den Zweifel zu überwinden und, durch meine eigene Anstrengung und durch gemeinschaftliches Nachdenken, festen Boden zu gewinnen.” \n ( Gustav Heckmann, 1942) \n \n Seit einigen Jahren nehmen wir an  Sokratischen Gesprächen  teil, wie sie von der  Gesellschaft für Sokratisches Philosophieren   (GSP) mehrmals im Jahr organisiert  werden. In unserer Familie existiert eine Tradition der Teilnahme am Sokratischen Gespräch, nicht zuletzt dadurch, da unser Großvater,  Gustav Heckmann , dieses stark mit geprägt hat. Die Teilnahme und das Erleben eines (Neo-)Sokratischen Gesprächs ist eine  Erfahrung, die wir als  bereichernd  bezeichnen möchten . Im Folgenden werden wir kurz erklären, worum es sich beim (Neo-)Sokratischen Gespräch handelt und unsere Eindrücke eines Gesprächs aus dem Jahre 2008 schildern. Vorangestellt ist eine historische Kurzinfo zum Sokratischen Gespräch. \n Historische Kurzinfo \n  Leonard Nelson \n Das sokratischen Gespräch geht auf die Idee des Göttinger Philosophen und Pädagogen  Leonard Nelson  (1882-1927) zurück, die sokratische Methode zu einer Methode des Gruppengesprächs weiterzuentwickeln und als Unterrichtsmethode zu verwenden. Als Hauptquelle gilt sein Vortrag “Die sokratische Methode” aus dem Jahre 1922, in dem er die sokratische Methode empfiehlt: „Die sokratische Methode ist nämlich nicht die Kunst, über Philosophen zu unterrichten, sondern Schüler zu Philosophen zu machen. Wollte ich daher von der sokratischen Methode eine rechte Vorstellung geben, so müßte ich meine Rede hier abbrechen und, statt Ihnen etwas vorzutragen, mit Ihnen eine philosophische Frage nach sokratische Methode behandeln.“ (Nelson, 1922) \n So machte für ihn den unwiderstehlichen Reiz der sokratischen Methode und ihren Sinn als Unterrichtsform der unvermeidbare Zwang zum Selbstdenken aus. Nach dem Ersten Weltkrieg gründete Nelson die bis heute bestehende  Philosophisch-Politische Akademie , welche als Trägerin des 1924 ebenfalls von ihm gegründeten  Landerziehungsheims Walkemühle  bei Kassel fungierte. In der Walkemühle wurde nach sokratischer Methode gelehrt. \n  Gustav Heckmann \n Maßgeblich beteiligt an der Weiterentwicklung des sokratischen Gesprächs war Nelsons Schüler,  Gustav Heckmann  (1898-1996), der sich, aufmerksam geworden durch Nelsons Vortrag, diesem Thema widmete. Heckmann praktizierte die sokratische Methode im mathematischen und philosophischen Unterricht an der Walkemühle bis zur Schließung 1933 durch die Nationalsozialisten. Nach dem zweiten Weltkrieg führte er seine Lehre in philosophischen Hochschulseminaren über viele Jahre an der Pädagogischen Hochschule Hannover fort. \n Das Sokratische Gespräch \n Der Philosoph  Sokrates  ist vielen bekannt, besonders durch die Dialoge, die er mit den Bürgern Athens geführt hat, so wie sie von seinem Schüler Platon verschriftlicht wurden. Das (Neo-)Sokratische Gespräch geht z. T. auf diese Tradition zurück, wobei jedoch Unterschiede als auch Gemeinsamkeiten in der Gesprächsform bestehen. Beim klassischen sokratischen Dialog verwickelt Sokrates durch gezieltes Nachfragen seinen Gesprächspartner in Widersprüche, um diesem anschließend, ebenfalls durch Fragen, zu einer neuen, tieferen Erkenntnis zu verhelfen. Die ganze Situation ist dadurch gekennzeichnet, dass es sich hier um  zwei Personen  handelt (Sokrates und den Gesprächspartner) als auch, dass eine gewisse  Asymmetrie in dem Gespräch  erkennbar ist. Denn Sokrates entlarvt das “Scheinwissen” des Gesprächspartners und führt ihn so zu einer vertieften Erkenntnis. Sokrates ist hierbei stets der Fragende. \n Das Sokratische Gespräch in der Tradition Nelson/Heckmann, wie es von der GSP durchgeführt wird, wird aufgrund seiner Unterschiede sowie Gemeinsamkeiten zum klassischen Sokratischen Gespräch auch als “neo-sokratisch” bezeichnet. Denn es unterscheidet sich in den zuvor genannten Punkten. Ein  Neosokratisches Gespräch  wird im Gegensatz zum klassischen Dialog, an dem zwei Personen beteiligt sind, mit einer  Gruppe von ca. vier bis acht Teilnehmern  plus einen Gesprächsleiter geführt. Dem Gesprächsleiter kommt hierbei die Funktion zu, die Erkenntnisse der Gruppe und den Gesprächsprozess zu strukturieren. Anders als im klassischen Dialog, ist seine Rolle jedoch wesentlich passiver als die des Sokrates. Ziel eines Neosokratischen Gesprächs ist, ganz allgemein gesprochen, durch  gemeinsames  Nachdenken zu Erkenntnissen zu gelangen. In den Worten von Gustav Heckmann: \n \n “ Das Ziel ist, dass die Teilnehmer Einsichten gewinnen, und das heißt: sie im eigenen Geist auffinden. Einsicht ist etwas anderes als durch Sinneswahrnehmung vermittelte Kenntnis oder ein Wissen, das mir durch einen anderen vermittelt wird. Jeder kann die Einsicht nur reflektierend im eigenen Geiste finden. Das Gespräch zwischen Partnern, unter denen keiner für den anderen Autorität ist, kann dazu wesentlich helfen. ” (Heckmann, o.J.) \n \n Obwohl das Präfix  neo  die Verwandschaft als auch die Unterschiede zum klassischen sokratischen Dialog hervorhebt, wird i.d.R. der Begriff Sokratisches Gespräch genutzt, wobei jedoch die neosokratische Variante gemeint ist. Auch im Folgenden verwenden wir hierfür den Begriff  Sokratisches Gespräch . \n Ablauf eines Sokratischen Gesprächs \n Das Sokratische Gespräche, so wie sie die GSP veranstaltet, dauern zwischen drei und sechs Tagen. Innerhalb dieser Zeit beschäftigen sich die Teilnehmer jeder Gesprächsgruppe mit  einer  Fragestellung. Die Fragestellungen ist hierbei entweder eine  ethische , ein  erkenntnistheoretische  oder eine  mathematische . So könnten die Fragen etwa lauten: “In welchen Situationen ist Gewalt legitim?”, “Was ist Lüge?”, “Ist jede ehrliche Überzeugung zu achten?” etc. Die Themen sind vorab bekannt und werden von den Gesprächsleitern am ersten Abend kurz vorgestellt. Danach ordnet sich jeder Teilnehmer einem Thema zu, für das er sich am meisten interessiert. \n Im Folgenden werden wir exemplarisch aus einem Gespräch in Bergisch-Gladbach aus dem Jahr 2008 berichten. Die Leitfrage war hier eine erkenntnistheoretische: “ Was ist Gegenwart?”.  Diese Frage bildete den Ausgangspunkt für das Gespräch dieser Woche. Wenn man zum ersten Mal an einem Sokratischen Gespräch teilnimmt, mutet die Aussicht, sich mit dieser einen Frage eine Woche lang zu befassen, zunächst einmal befremdlich an. Wie kann man denn eine Woche lang hierüber reden? Nun ja, dass man es kann ist nicht verwunderlich, denn andere beschreiben tausende Seiten hierzu. Aber kann ich das? Kann denn das über eine so lange Zeitspanne spannend, interessant und bereichernd sein? Lohnt sich dies? Ohne zuviel vorweg greifen zu wollen, sei gesagt: Ja, es kann! Und dies ohne Probleme! Denn die Erlebnisse, die man in einem Sokratischen Gespräch hat und die Erkenntnisse, die man gewinnt, tragen einen mit einem guten Gefühl durch den Prozess. Mehr dazu später. \n Auswahl eines Beispiels \n Der Ausgangspunkt für unsere Gesprächsgruppe war also die Frage: “ Was ist Gegenwart? “. Nachdem diese nun feststand wurden in einem ersten Schritt von den Teilnehmern Beispiele geschildert, in denen sie Gegenwart erfahren haben. Hierbei entstehen naturgemäß unterschiedliche Bezüge zu einer Erfahrungsdimension, die man als Gegenwart bezeichnen möchte. Es gab Beispiele, die uns fremd, als auch Beispiele, die leicht nachspürbar waren. Aber wir hatten das Gefühl, dass jedes von ihnen etwas in sich trägt, was sich für uns auf Gegenwart bezieht. Dies in Worte zu kleiden fiel jedoch alles andere als leicht. \n  Von den Teilnehmer geschilderte Beispiele eines Gegenwartserlebnisses \n Von den vorgestellten Beispielen wurde nun eines ausgewählt, das die Basis für das Gespräch der folgenden Woche sein sollte. In unserem Fall schilderte eine Teilnehmerin den Ausritt mit ihrem Pferd, bei dem sie etwas erfahren hat, was sie als Gegenwart bezeichnet. Wozu dieses Beispiel? Und warum gerade dieses? \n \n Wozu ein Beispiel . Das konkrete Beispiel stellt stets die Basis für die Arbeit in einem Sokratischen Gespräch dar. Im Sokratischen Gespräch bildet  immer  eine  konkrete  Erfahrung die Basis anhand derer gearbeitet wird. Dies verhindert, dass sich das Gespräch in theoretischen oder abstrakten Erörterungen verliert, da alle getroffenen Aussagen stets anhand des Beispiels belegt werden müssen. Diese Rückbindung an das Beispiel bewirkt, dass das Sokratische Gespräch stets im “Konkreten  fußt “. \n Warum nun gerade dieses Beispiel?  Man hätte ohne Frage auch ein anderes Beispiel wählen können und hätte evtl. einen anderen Zugang zu dem Thema erhalten. In der Tat fiel die Auswahl in der Gruppe schwer, denn jedes Beispiel für sich versprach spannend zu werden. Nach einer Zeit des Abwägens wurde abgestimmt. Zu diesem Zeitpunkt erschien uns die Auswahl des Beispiels noch immens wichtig. Dem lag die Vorstellung zugrunde, dass mit diesem der Erfolg der Arbeit steht und fällt. Dies sehen wir jedoch im Nachhinein anders. Zwar kann man nicht sagen, dass die Auswahl irrelevant sei. Das jedoch, was auf Basis des Beispiels passieren wird, lässt sich noch gar nicht absehen. Wir vermuten, dass jedes dieser Beispiele eine gute Basis für die Arbeit abgegeben hätte. \n \n Ausschnitt aus der Schliderung des konkreten Beispiels mit dem gearbeitet wird \n Die Teilnehmerin schrieb ihr Beispiel nun auf vier Flipcharts auf, so dass es jedem stets vor Augen war. Der dargestellte Ausschnitt aus dem geschilderten Beispiel zeigt, dass es sich um eine plastische und facettenreiche Schilderung handelt und auch handeln muss. Denn eine gewisse Detailliertheit ist wichtig, da die Geschichte die Basis unserer Arbeit ist. Wenn man die Geschichte betrachtet wird deutlich, dass es sich um ganz alltägliche Erlebnisse handelt. Dies ist was mit dem Konkreten gemeint ist – keine Theorie, keine Abstraktion sondern Arbeiten mit dem, was wir erleben. \n Das Sachgespräch \n Es beginnt der zweite Tag der sokratischen Woche. Das was bisher geschehen ist kann als Vorarbeit bezeichnet werden. Nach der Niederschrift des Beispiels beginnt nun der eigentliche Teil, der sokratische Dialog. Um einen Einstieg in das Gespräch zu finden, sind wir nun auf einige zuvor gesammelte Fragen zurückgekommen und haben diese zum Beispiel in Bezug gesetzt. Die Frage mit der sich die Gruppe zunächst beschäftigen wollte war:  “Welche(n) Prozess(e) umfasst die Gegenwart?” \n Die erste Zeit drehte sich das Gespräch um Rückfragen an die Urheberin des Beispiels, um sich ein besseres Bild von dem machen zu können, was sie genau meint. Nach und nach identifizierten wir Aussagen in dem Beispiel, die wir als relevante Prozesse erachteten. Hierbei ergab sich die Hypothese, dass wir drei Prozesse trennen können, die wir als  äußere Bewegung (P1) ,  innere Bewegung  (P2) und  reflektierende Bewegung  (P3) bezeichneten. Die äußere Bewegung ist das, was die Teilnehmerin tut, z.B. sich anders auf dem Pferd hinsetzen. Die innere Bewegung bezeichnet eine Änderung ihrer inneren  Haltung , z.B. die Zunahme an Konzentration auf das Pferd. Die reflektierende Bewegung meint die Tatsache, dass sie sich beider zuvor benannten Prozesse gewahr ist. Bei Niederschrift dieser Worte ist es  nicht  unser Anliegen, dass man die Aussagen  inhaltlich  nachvollziehen kann. Die Schilderung soll lediglich eine Idee davon vermitteln, wie wir über das konkrete Beispiel zu Hypothesen, Argumenten und Ansichten gelangen, die alle Gruppenteilnehmer teilen und nachvollziehen können. \n Im weiteren Verlauf der Woche wurden viele Facetten, die in dem Beispiel enthalten sind und sich auf “Gegenwart” beziehen, herausgearbeitet. Nach und nach dringt die Gruppe so tiefer zum Wesen dessen vor, was Gegenwart ist. \n Die Arbeit mit einem einzigen Beispiel ist für einen sozialwissenschaftlich vorgebildeten Teilnehmer oft befremdlich. Einhergehend mit einer sozialwissenschaftlichen Ausbildung wird oftmals die Haltung kultiviert, dass Erkenntnis lediglich über eine große Anzahl an untersuchten Fällen herzustellen sei. Was passiert also hier genau, dass wir von Erkenntnis reden wollen? \n Der Prozess des Erkenntnisgewinns ist in folgender Grafik (Sanduhrmodell) in abstrakter Form dargestellt. Ausgehend von der Frage (“Was ist Gegenwart?”) wurde aus verschiedenen Beispielen der Teilnehmer eines ausgewählt (“Der Ausritt mit dem Pferd”), von dem wir das gemeinsame Urteil fällten, dass es etwas mit Gegenwart zu tun hat. Ausgehend von diesem Beispiel gelangten wir nach und nach zu Voraussetzungen in Form von voraussetzenden Regeln, die vorhanden sein müssen, damit das Urteil gültig sein kann. Wir nähern uns der Frage “Was ist Gegenwart?” gewisserweise rückwärts, indem wir nach den Bedingungen für die Gültigkeit des Urteils (“Hier handelt es sich um Gegenwart”) fragen. Dieser Weg wird als  regressive Abstraktion  bezeichnet. Mit einer fortschreitenden Erschließung der voraussetzenden Regeln gelangt man schließlich zu grundlegenden philosophischen Prinzipien, deren Gültigkeit sich als Folgerung aus dem Urteil ergeben. So werden ausgehend von  einem konkreten  Beispiel Gesetzmäßigkeiten herausgearbeitet, um sich einer Antwort auf die allgemein formulierte Ausgangsfrage anzunähern. \n  Das Sanduhrmodell \n Diese theoretische Beschreibung hat ihr Pendant in dem Gefühl, das uns während des Gesprächs begleitet. Es ist das Gefühl, tiefer zu kommen, Aspekte aufzudecken, von denen man zunächst gar nicht vermutet hätte, dass sie mit dem Gegenwartserleben im Zusammenhang stehen. Und vor allem nicht, dass sich all diese Aspekte aus einem Beispiel ableiten lassen. Es muss allerdings gesagt werden, dass eine Woche i.d.R. nicht ausreicht, um zu grundlegenden philosophischen Prinzipien vorzudringen. Die Systematik mit der man sich diesen nähert wird jedoch während des Gesprächs deutlich. \n Das Metagespräch \n Neben dem sogenannten Sachgespräch, das oben skizziert wurde, gibt es das  Metagespräch . Dieses findet i.d.R nachmittags statt. Das Metagespräch ist ein Gespräch über das Sachgespräch. In diesem werden Befindlichkeiten geäußert, Probleme angesprochen, Lob und Kritik geübt, Vorschläge über das weitere Vorgehen diskutiert, Spannungen, die in der Luft liegen thematisiert etc. Es dient dem Zweck, Emotionen, die im Gespräch auftauchen können, Raum zu geben. Alles was das Gespräch auf einer anderen Ebene als der inhaltichen bestimmt, sollte hier besprochen werden. So kann z.B. angesprochen werden, wenn Teilnehmer immer wieder gegen dialogische Regeln verstoßen und dies Missmut in der Gruppe zur Folge hat. Dies hilft dabei, das eigentliche Gespräch weitgehend frei von Störungen zu halten. Weiterhin dient das Metagespräch der Klärung von Fragen zur Logik des Gesprächsablaufs, also Fragen danach, warum wir, was, wann, wie und in welcher Weise machen. Dies vertieft das Verständnis von der Methode des Gesprächs. \n Systematik und Regeln des Sokratischen Gesprächs \n Wie auch andere Gespräche folgt das Sokratische Gespräch gewissen Regeln und einer gewissen Erkenntnislogik. Was unterscheidet nun ein (Neo)-Sokratisches Gespräch von einem gewöhnlichen Gruppengespräch oder auch einem andersartig moderierten Gespräch. \n Zum Gespräch . Beim Sokratischen Gespräch handelt es sich um eine  dialogische  Form des Gesprächs, deren Charakter anders als der einer Diskussion ist. Traditionell existiert eine  Trennung von Gesprächen in zwei Kategorien: der  Dialektik  sowie der  Rhetorik  oder um einen moderneren Sprachgebrauch zu bemühen, dem  Dialog  und der  Diskussion.  Während es in einer Diskussion darum geht, den eigenen Standpunkt zu vertreten, durchzusetzen, zu verteidigen und ggf. zu sprachlichen Mitteln zu greifen, die auch gerechtfertigte Argumente des Gegners unbrauchbar machen, ist das Ziel eines Dialogs genau gegensätzlich. Im Dialog geht es darum,  gemeinsam  zu einer Erkenntnis zu gelangen, wobei alle teilnehmenden Gesprächspartner ihre Argumente einbringen können und diese gemeinsam untersuchen, ihre Berechtigung abwägen, auf Fehler hin überprüfen und langsam zu einem neuen, verfeinerten Standpunkt zu gelangen. Zwei Schlüsselworte, die diesen Unterschied der beiden Gesprächsformen gut beschreiben, sind  gegeneinander  und  gemeinsam . \n Das Sokratische Gespräch zählt zu der  dialogischen  Kategorie, in dem  gemeinsam  über einen Gegenstand nachgedacht wird. Hierbei sind einige Hürden zu nehmen, da eine Haltung, die ein dialogisches miteinander ermöglicht, zunächst erlernt und hergestellt werden muss. Zu einer solchen Haltung zählt etwa, den anderen verstehen zu wollen und auch etwas dafür zu tun, ihn verstehen zu können. \n Zuhören lernen.  Während man im Alltag und speziell in einer Diskussion oftmals schon während ein anderer redet, in Gedanken bei dem ist, was man selber sagen will und dem anderen nicht  wirklich  zuhört, sollen die Regeln des Sokratischen Gesprächs dies verhindern. In seiner strengsten Form schreibt die Regel vor, dass bevor der eigene Redebeitrag erfolgt, zunächst das, was der andere gesagt hat, mit den eigenen Worten wiedergegeben werden muss. So kann der andere sehen, ob man das wiedergibt, was er gemeint hat. Wenn man bereit ist, diese Last auf sich nehmen, um zu sehen, ob man den anderen denn auch  wirklich  verstanden hat, wird man allzu oft überrascht. Denn in vielen Fällen ist die Reaktion des anderen:”Das habe ich gar nicht gemeint.” Dabei scheint es doch immer so klar, was der andere sagen will und nun ist man genötigt zu fragen: “Ja, was hast du denn gemeint? Kannst du mir das noch einmal erklären?” Denn an dieser Stelle wird der Bruch in der Kommunikation für alle offenbar, ein Bruch, der in einer Diskussion oft nicht einmal bemerkt wird oder werden kann. \n Entschleunigung des Gesprächs.  In einer Diskussion ist man damit beschäftigt, Argumente zurechtzulegen und die richtige Replik auf das Gesagte schon vorzubereiten, während der andere noch redet. Schließlich muss man seine Position  verteidigen . Zum einen, um nicht übergangen zu werden, zum anderen, um die  eigene  Meinung durchzusetzen. Im Sokratischen Gespräch kommt dem Gesprächsleiter die Aufgabe zu, darauf zu achten, dass die Gruppe stets gemeinsam  ein  Argument bzw.  einen  Argumentationsstrang zur Zeit bespricht, bevor ein neuer  verfolgt oder ein neues Argument analysiert wird. Das Argument, das ich selber eingebracht habe, kann also nicht einfach von den anderen vom Tisch gefegt oder vergessen werden. Diese Befürchtung muss ich nicht haben.  Mein  Argument und meine Position wird dann  zusammen  mit den anderen auf seine Tragfähigkeit hin untersucht. Hierzu wird das Argument oftmals aufgeschrieben, so dass jeder es immer wieder lesen kann. Wenn mein Argument nun nicht mehr im Eifer der Worte untergehen kann, fällt der innere Drang weg, etwas unbedingt noch sagen oder aufpassen zu müssen, dass der eigene Beitrag nicht untergeht. Dadurch, dass alle Teilnehmer versuchen, das Gesagte – was ggf. auch angeschrieben an der Tafel steht – zu verstehen und in Bezug auf ihre eigene Erfahrung einzuordnen, erfährt das Gespräch eine angenehme  Entschleunigung . Als Folge hat jeder Teilnehmer Zeit, die Dinge zu durchdenken und sich ausgiebig mit dem Argument des anderen zu befassen. So entwickelt sich zunehmend die Bereitschaft, sich auf die Aussagen der anderen genauso einzulassen wie auf die eigenen. \n Von der eigenen Erfahrung sprechen.  Eine bekannte rhethorische Wendung ist es, sich auf Autoritäten zu berufen und so seinen Standpunkt zu stützen. “Das, was du sagst, ist vor dem Hintergrund von Kants Erkenntnistheorie unzulässig … .” Diese Art der Argumentation ist im Sokratischen Dialog nicht erlaubt. Im Sokratischen Gespräch darf lediglich von der eigenen Erfahrung gesprochen werden. Wenn das Thema wie in unserem Fall Gegenwartserleben ist, dann ist es nicht wichtig, was Steven Hawkins oder Buddha dazu gesagt hat. Bedeutsam ist, was  unserer  Erfahrung entspricht.  Darüber hinaus ist es wichtig, das, was in dem gegebenen Beispiel steckt, zu nutzen und damit an seine eigene Erfahrung anzuknüpfen, sich hineinzuversetzen, sich in das Beispiel hineinzufühlen.  Dies ist die Basis für den Erkenntnisprozess im sokratischen Gespräch. \n Oftmals ist das Wort Philosophieren mit der Vorstellung verbunden, man müsse sich dafür in der Philosophie auskennen, z.B. wissen, was Kant oder andere ausgearbeitet haben. Dies ist für ein Sokratisches Gespräch aus oben genannten Gründen nicht von Bedeutung. Sehr oft hört man in diesem Zusammenhang den Satz: “Das mag Kant (oder andere) gesagt haben, aber wir sind ja nun hier, um selber zu denken.” Vorwissen in der Philospohie ist somit nicht im geringsten notwendig. Es wird schließlich nicht über Philosophie geredet, sondern selbst philosophiert. \n Weitere Erfahrungen \n Was ist nun der Charakter der Erfahrung, die man in einem Sokratischen Gespräch machen kann? Hier möchten wir unterschiedliche Aspekte nennen, die wir erlebt haben. \n Wertschätzung oder das angenehme Gefühl des Gehörtwerdens . Die Grundregel des Sokratischen Gesprächs gebietet, dass jeder ausreden darf. Darüber hinaus wird kein Argument übergangen, sondern jedes wird stets gemeinsam bedacht. Und es wird i.d.R. so lange behandelt, bis diesem zugestimmt oder es verworfen werden kann. Es ist also nicht so, wie es sich in einer typischen Diskussion darstellt, wo auf Argument meist ein Gegenargument folgt, ohne die Essenz eines jeden Arguments wertzuschätzen, indem man es untersucht. Ich werde also im Rahmen des Gespräches ernsthaft angehört, was eine Atmosphäre des Ernst-Nehmens sowie ein angenehmes Gefühl mit sich bringt. Auch stellt sich mit der Zeit in der Gruppe eine gewisse Vertrautheit zwischen den Teilnehmern ein, obgleich man ja  nur  über (teilweise kontroverse) Sachthemen redet. \n Zurücktreten von der eigenen Meinung . Man wird sich mehr und mehr dessen bewusst, dass man keine gedankliche Position verteidigen muss. In einem  Diskurs  sollte es sich stets um ein gemeinsames Abwägen handeln. Dies setzt jedoch voraus, dass man nicht die Notwendigkeit fühlt das “eigene” Argument beschützen zu müssen. Dieses Loslassen und das Zurücktreten von der eigenen Meinung ist eine Erfahrung, die im sokratischen Gespräch gemacht und auch trainiert werden kann. Wir haben hierbei oft gemerkt, dass man auch mit sich selbst hadert, denn hin und wieder gleite man in ein typisches Diskussionsmuster zurück. Dann möchte man wieder Argumente  gegen  etwas suchen, statt mit Abstand abzuwägen und das Argument des anderen zunächst so zu behandeln, als sei es unser eigenes. \n Die Erfahrung des gemeinsamen Denkens . Diese Erfahrung ist schwer zu beschreiben, denn wir haben sie als flüchtig erlebt. Wenn es gelingt, die eigene Meinung mit Abstand zu sehen und sie genauso wie die anderen Argumente als ein Objekt von vielen zu behandeln; wenn ich mich weiterhin in der Gruppe wertgeschätzt und sicher fühle, ohne etwas verteidigen zu müssen. Dann tritt manchmal ein Zustand ein, in dem man sagen könnte: “ Wir denken gerade gemeinsam ” oder “ Wir sind eine denkende Einheit “. Es ist eine Art Verbundenheit mit den anderen Teilnehmern, die ein Stück Mauer zwischen ihnen verschwinden lässt – ein Stück Transzendenz. Wir haben diese Zustände als flüchtig erlebt, die minutenweise kamen und gingen. Wir vermuten jedoch, dass sich diese mit zunehmender Praxis öfter einstellen werden. \n Zusammenwachsen zur Gruppe . Neben dem eigentlichem Gespräch, das ca. vier Stunden am Tag einnimmt, besteht auch stets viel Freizeit sowie ein Rahmenprogramm, das genug Zeit und Raum lässt, alle Teilnehmer kennenzulernen. Bisher haben wir die Atmosphäre stets als sehr herzlich erlebt, so dass allein dadurch die sokratische Woche stets eine schöne Erfahrung ist. \n Wesentliches aus dem Gespräch . Regelmäßig werde wir nach der Teilnahme von Bekannten gefragt: “Was hast du denn nun rausgefunden in der Woche?” Interessanterweise ist die Antwort nicht einfach. Zwar könnte man diverse interessante Aspekte der behandelten Frage aufzählen. Das geht jedoch am Wesentlichen vorbei. Viel treffender empfinden wir die Antwort: “Das ist gar nicht so wichtig. Ich habe die Erfahrung gemacht, wie es ist, mich intensiv mit meinem Denken auseinanderzusetzen und dies ist eine unglaublich bereichernde Erfahrung.” Dies ist für den Zuhörer oft enttäuschend, erwartet man mitunter doch eine inhaltliche Antwort. Die wesentliche Erkennis aus der Woche, das Erleben der ganzen Gesprächssituation und was es in einem bewirkt, ist mit Worten erklärt jedoch immer zu wenig. Auch stellt sich uns nach der Teilnahme stets die Frage, ob es überhaupt möglich ist, Erkenntnisse, die man durch das intensive Durchdenken gewonnen hat, in wenigen oder auch vielen Sätzen zu vermitteln, ohne dass die Person den Prozess des Durchdenkes für sich komplett durchläuft. \n Schlussbemerkung \n Abschließend wird grundlegende Literatur zum Sokratischen Gespräch aufgelistet. Aber eines sei hierzu angemerkt: Alles Lesen kann nie die Erfahrung und das Gefühl vermitteln, dass man nur durch eine Teilnahme an einem Sokratischen Gespräch bekommt. Denn über Melodien zu reden, vermittelt niemals die Erfahrung, die man macht, wenn man eine Melodie hört. \n \n Nelson, Leonard ( 1922). Die sokratische Methode. Vortrag, gehalten am 11. Dezember 1922 in der pädagogischen Gesellschaft in Göttingen. In Otto Meyerhof, Franz Oppenheimer, Minna Specht (Hrsg.)    Abhandlungen der Fries’schen Schule. Neue Folge. Band 5, H. 1. Öffentliches Leben, Göttingen 1929, S.21-78.  \n Heckmann, Gustav (1993).  Das Sokratische Gespräch : Erfahrungen in philosophischen Hochschulseminaren. Frankfurt a.M.: dipa-Verl. \n Krohn, Dieter; Neißer, Barbara & Walter, Nora (Hrsg.) (1997).  Neuere Aspekte des sokratischen Gesprächs . Frankfurt a.M.: dipa-Verl. \n Birnbacher, Dieter & Krohn, Dieter (Hrsg.) (2002):  Das sokratische Gespräch.  Stuttgart: Reclam. \n \n \n Möglichkeiten zur Teilnahme . Die Sokratischen Gespräche werden von der  Gesellschaft für Sokratisches Philosophieren (GSP)  an meist vier Terminen und an unterschiedlichen Orten im Jahr angeboten, die auf der Homepage nachzulesen sind. Seltener finden sich auch an einzelnen Universitäten Dozenten, die als ausgebildete Gesprächsleiter das (Neo-)Sokratische Gespräch anbieten. Die Teilnahme an einer sokratischen Woche ist für Studenten besonders günstig, da diese von der GSP bezuschusst werden. Seit 2004 existiert weiterhin der Förderverein “ FFSG – Freunde und Förderer des sokratischen Gesprächs “, der neo-sokratische Veranstaltungen als auch die Teilnahme und Anreise auf Antrag finanziell unterstützt. \n von Andrea Heckmann & Mark Heckmann"], "link": "http://markheckmann.wordpress.com/2011/01/10/das-neo-sokratische-gesprach/", "bloglinks": {}, "links": {"http://regiowiki.hna.de/": 1, "http://feeds.wordpress.com/": 1, "http://markheckmann.wordpress.com/": 4, "http://de.wikipedia.org/": 4, "http://www.philosophisch-politische-akademie.de/": 3, "http://ffsg.gmxhome.de/": 1}, "blogtitle": "Mark Heckmann - Blog"}, {"content": ["Im WiSe 2010/2011 biete ich ermeut für Studierende des Bachelor- und Masterstudiums der Psychologie einen Einführungskurs in R an. Interessierte anderer Gruppen (Wissenschaftliche Mitarbeiter, Doktoranden, Studenten andere Studiengänge) sind – vorbehaltlich einer ausreichenden Anzahl an Plätzen – herzlich eingeladen, teilzunehmen. \n Über den Kurs \n In der Veranstaltung Alternative zu SPSS: Einführung in das R-Framework zur quantitativen Datenanalyse für Bachelor- und Masterstudenten wird in die Grundlagen der Datenverarbeitung/-analyse mit R eingeführt. Die Teilnahme ist voraussetzungslos. Grundlegende Kenntnissen der Statistik sind jedoch empfehlenswert. \n Der Kurs wird an zwei Wochenenden als Blockveranstaltung durchgeführt. Der Kurs findet an den folgenden Tagen jeweils von 11-ca. 16.30h statt: 05.12. (So.), 11.12. (Sa.), 18.12. und 19.12.2010 (Sa und So.). Ort: MZH 4210 (Kursraum 2). Zwischen den Wochenenden werden selbstständig Aufgaben bearbeitet. Anmeldung bei StudIP ( Link ). Bitte einen Laptop mitbringen! \n Was ist R? \n R ist eine Open Source Statistik Programmiersprache, die wie SAS oder SPSS zur Bearbeitung vielfältiger Fragestellungen der Datenanalyse eingesetzt werden kann. R wurde 1996 aus der Wiege gehoben und hat sich seitdem zu einer der mächtigsten Sprache am Markt entwickelt, so dass sich inzwischen auch SPSS und SAS Schnittstellen zu R bereitstellen, um dessen umfangreiche Analysemöglichkeiten einbinden zu können. Der Grund für die rasante Entwicklung von R liegt vor allem an der Open Source Philosophie bei der wie bei Linux eine Vielzahl von Freiwilligen weltweit zu seiner Erweiterung beiträgt. R steht für alle weit verbreiteten Betriebssysteme (MacOS, Windows, Linux) auf der R-Project Website kostenlos zum Download zur Verfügung. \n Inhalte des Kurses \n Ziel des Kurses ist des den Umgang mit R zu erlernen und am Ende der Veranstaltung über einen sicheren Umgang in der Sprache zu verfügen. Davon ausgehend, dass der beste Weg eine Programmiersprache zu erlernen ist, in dieser selber Programme zu schreiben, wird der Kurs viele praktische Anteile enthalten. Folgende Themen werden behandelt (Änderungen möglich): \n \n Vorstellung der R Project Site, von R-help, der R Arbeitsumgebung, des R Workspaces und gängiger Editoren sowie ein kurzer Überblick über die Möglichkeiten von R als Appetizer. \n Einführung in die R Syntax sowie die wichtigsten Operationen und Datenobjekte \n Umgang mit Daten: Laden und Speichern von Daten, grundlegende Datenmanipulation, Daten-Aggregation, Reshaping von Daten. \n Grundlegende statistische Auswertungen / Zusammenfassungen (Boxplots etc.) \n Einführung in das R Graphik-System \n Grundlegende Statistik: Hypothesentests und lineare Modelle \n \n Literaturauswahl \n In der SuUB besteht inzwischen eine umfangreiche Sammlung Büchern über R. Darüber hinaus enthält das Internet sehr viel Anleitungen als auch themenbezogene Blogs. Nachfolgende Bücher sind gut für einen Einstieg geeignet und stehen meist über das Campusnetz online zur Verfügung. \n Ligges, U. (2007) Programmieren mit R . Berlin: Springer. Sehr gutes Buch, das keinerlei Vorkenntnisse erfordert. Thematisiert vorwiegend die Programmierung mit R. Als Online-Version im Campusnetz frei verfügbar ( http://www.springerlink.com/content/v17125/ ). \n Luhmann, M. (2010). R für Einsteiger. Einführung in die Statistiksoftware für die Sozialwissenschaften. Weinheim: Beltz. In der SuUB vorhanden. \n Sachs, L. (2006). Angewandte Statistik: Methodensammlung mit R .  Berlin: Springer. Das Kapitel 9, Einführung in R, bietet einen guten Einstieg in R. Als Online-Version im Campusnetz frei verfügbar ( http://www.springerlink.com/content/l32744/ ). \n Verzani, J. (2005). Using R for introductory statistics . Boca Raton : Chapman & Hall/CRC. Als Online-Version im Campusnetz frei verfügbar ( Link). \n Folien zum Kurs"], "link": "http://markheckmann.wordpress.com/2010/10/25/einfuhrung-in-das-r-framework-zur-quantitativen-datenanalyse-fur-bachelor-and-master-studenten/", "bloglinks": {}, "links": {"http://www.netlibrary.com/": 1, "http://markheckmann.wordpress.com/": 1, "http://www.r-project.org/": 1, "http://www.r-project.org": 1, "http://feeds.wordpress.com/": 1, "https://elearning.uni-bremen.de/": 1, "http://www.springerlink.com/": 2}, "blogtitle": "Mark Heckmann - Blog"}, {"content": ["Next week form Monday to Friday (9.-13.08.2010; 9.30-17.30h) the second EduHack will take place at Bremen University. The EduHack is a one week codesprint during which particpants work intensively on a software or media project for five days. Participants are free to join one of the small teams that already have planned a project or to start a new project themselves. For the coming EduHack the following projects (among others) have been announced: \n \n The ABC on how-to videos: Making a video tutorial on how to make a “how-to video” for YouTube etc. \n DataGotchi: iPhone App programming for real time monitoring in the class room – what do pupils think and feel during a course? \n Rich E-Assessment using Adobe Flex 4 / Flash: rea.framework – development of an interactive multimedia testing for functional illiterates. \n web application using RApache: online-reporting for psychological diagnostic using a combination of R (open source statistic software), LaTeX and RApache . \n \n Anyone from any university is invited to join in! No previous enrollment necesseary. \n useR Hackfest 2010 \n useR Hackfest 2010 is a week long workout for R-users, who want to prepare or finish their statistical programming and analysis using R for their bachelor, master or ph.d. thesis. Other R-users (non-students) are welcome to join us! It is a self-organized event where we will learn from each other. The hackfest will be supported by Tamàs, who is a mathematics major and works especially on time series modelling in Prof. Karsten Wolf ’s research group. There are some other experienced R users on the location as well (me, Karsten ) ( excerpt from Karsten’s blog entry ). \n Where and when \n Monday 09.08. – Friday 13.08.2010, 9.30 – 17.30h in the building GW2 room A4100 ZIM (4th floor). On wednesday there will be a barbeque in the park. On thursday there will late night coding session with music. On friday it’s demo time: here the projects can presented."], "link": "http://markheckmann.wordpress.com/2010/08/05/2nd-eduhack-plus-user-hackfest-at-bremen-university-9-13-08-2010/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://markheckmann.wordpress.com/": 1, "http://worldofrcraft.blogspot.com/": 1, "http://www.r-project.org": 1, "http://www.uni-bremen.de/": 2, "http://en.wikipedia.org/": 1, "http://rapache.net/": 1}, "blogtitle": "Mark Heckmann - Blog"}, {"content": ["Im SoSe 2010 biete ich für Studierende des Bachelorstudiums der Psychologie einen Einführungskurs in die R-Programmierung an. Es sind jedoch grundsätzlich alle Interessierten aus Bachelor, Master oder Diplom und aus jedem Studiengang herzlich willkommen. \n Über den Kurs \n In der Veranstaltung Einführung in die R-Programmierung für Sozialwissenschaftler wird in die Grundlagen der Datenverarbeitung/-analyse mit R eingeführt. Die Teilnahme ist voraussetzungslos. Grundlegende Kenntnissen der Statistik sind jedoch empfehlenswert. \n Der Kurs wird als Blockveranstaltung vom 13.07. – 16.07. (erste Woche der vorlesungsfreien Zeit) jeweils von 8.00-13.30h (c.t.) angeboten. Nachmittags von 14.30-16.00h werden zusätzlich Übungen angeboten. Ort: MZH 4200 (Kursraum 3). Anmeldung bei StudIP ( Link ). Bitte einen Laptop mitbringen! \n Was ist R? \n R ist eine Open Source Statistik Programmiersprache, die wie SAS oder SPSS zur Bearbeitung vielfältiger Fragestellungen der Datenanalyse eingesetzt werden kann. R wurde 1996 aus der Wiege gehoben und hat sich seitdem zu der mächtigsten Sprache am Markt entwickelt, so dass sich inzwischen auch SPSS und SAS Schnittstellen zu R bereitstellen, um dessen umfangreiche Analysemöglichkeiten einbinden zu können. Der Grund für die rasante Entwicklung von R liegt vor allem an der Open Source Philosophie bei der wie bei Linux eine Vielzahl von Freiwillgen weltweit zu seiner Erweiterung beiträgt. R steht für alle weit verbreiteten Betriebssysteme (MacOS, Windows, Linux) auf der R-Project Website kostenlos zum Download zur Verfügung. \n Inhalte des Kurses \n Ziel des Kurses ist des den Umgang mit R zu erlernen und am Ende der Woche über einen sicheren Umgang in der Sprache zu verfügen. Davon ausgehend, dass der beste Weg eine Programmiersprache zu erlernen ist, in dieser selber Programme zu schreiben, wird der Kurs viele praktische Anteile enthalten. Folgende Themen werden behandelt (Änderungen möglich): \n \n Vorstellung der R Project Site, von R-help, der R Arbeitsumgebung, des R Workspaces und gängiger Editoren sowie ein kurzer Überblick über die Möglichkeiten von R als Appetizer. \n Umgang mit Daten: Laden und Speichern von Daten, grundlegende Datenmanipulation, Daten-Aggregation, Reshaping von Daten. \n Datenobjekte in R \n Grundlegende statistische Auswertungen / Zusammenfassungen (Boxplots etc.) \n Einführung in das R Graphik-System \n Grundlegende Statistik: Hypothesentests und lineare Modelle \n \n Weitere R-Seminare an der Uni Bremen \n Voraussichlich in der Woche nach dieser Blockveranstaltung wird von Támas Nagy am FB12 eine Blockveranstaltung zur Zeitreihenanalyse in R (auf Englisch) angeboten. \n Literaturauswahl \n In der SuUB besteht inzwischen eine umfangreiche Sammlung Büchern über R. Darüber hinaus enthält das Internet sehr viel Anleitungen als auch themenbezogene Blogs. Nachfolgende Bücher sind gut für einen Einstieg geeignet und stehen meist über das Campusnetz online zur Verfügung. \n Ligges, U. (2007) Programmieren mit R . Berlin: Springer. Sehr gutes Buch, das keinerlei Vorkenntnisse erfordert. Thematisiert vorwiegend die Programmierung mit R. Als Online-Version im Campusnetz frei verfügbar ( http://www.springerlink.com/content/v17125/ ). \n Luhmann, M. (2010). R für Einsteiger. Einführung in die Statistiksoftware für die Sozialwissenschaften. Weinheim: Beltz. In der SuUB vorhanden. \n Sachs, L. (2006). Angewandte Statistik: Methodensammlung mit R .  Berlin: Springer. Das Kapitel 9, Einführung in R, bietet einen guten Einstieg in R. Als Online-Version im Campusnetz frei verfügbar ( http://www.springerlink.com/content/l32744/ ). \n Verzani, J. (2005). Using R for introductory statistics . Boca Raton : Chapman & Hall/CRC. Als Online-Version im Campusnetz frei verfügbar ( Link). \n Feedback \n Während des Kurses: bitte hier abgeben. \n Folien zum Seminar"], "link": "http://markheckmann.wordpress.com/2010/04/01/einfuhrung-in-die-r-programmierung-fur-sozialwissenschaftler/", "bloglinks": {}, "links": {"http://www.netlibrary.com/": 1, "http://markheckmann.wordpress.com/": 1, "http://www.r-project.org/": 1, "http://feeds.wordpress.com/": 1, "https://elearning.uni-bremen.de/": 1, "http://www.springerlink.com/": 2, "http://spreadsheets.google.com/": 1}, "blogtitle": "Mark Heckmann - Blog"}, {"content": ["From Friday to Sunday (8.-10. January) the first EduHack will take place at Bremen University.  EduHack is a weekend hackathon with a nice atmosphere (live DJ etc.) focusing on the development of educational software. Anyone who is interested is welcome (no previous enrollment necessary). The goal is to develop prototype software versions for several ideas during these three days. Participants are free to join existing projects or start a new own project. A list of existing projects and extensive information about EduHack can be found on this blog post from Prof. Dr. Karsten Wolf , who will host the hackathon. Some examples: \n \n DataGotchi-types . Hand-held data collection devices for gathering process data on almost anything. Projects: iPhone DataGotchi and a World of Warcraft DataGotchi AddOn . \n PS3 & Little Big Planet: Design of an educational Little Big Planet stage to take part in the $50 K challenge (see DML Competetition website ). \n Adobe Flex and Air E-Assessment extravaganza. Rich E-Assessment Item framework in Adobe Flex framework and a fitting editor for creating items with this framework running on Adobe AIR. \n Digital story telling. How to use Web 2.0 to support digital story telling. \n Educasting and social blogging workout. Pimp up the new Uni Bremen blogfarm running BuddyPress to support the new e-General Study program starting Summer 2010. \n DiagnosticaR. Mashing R, Sweave/LaTeX and probably some web framework to create an educational diagnostic tool. \n Your project .  … \n \n The EduHack will start at 10 a.m. in building GW2 Roo m A4100 (4. Floor). Please feel free to join or drop by to have a look. You may also watch the livestream at http://www.livestream.com/educamptv . \n More info … \n Nachtrag \n Als kleiner Round-up hier eine Video-Doku über den Edu-Hack."], "link": "http://markheckmann.wordpress.com/2010/01/05/1st-eduhack-at-bremen-university-a-hackathon-for-educational-software/", "bloglinks": {}, "links": {"http://www.livestream.com/": 1, "http://markheckmann.wordpress.com/": 1, "http://wowprogramming.com/": 1, "http://www.uni-bremen.de/": 3, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1, "http://www.dmlcompetition.net/": 1}, "blogtitle": "Mark Heckmann - Blog"}]