[{"blogurl": "http://gazeinteraction.blogspot.com\n", "blogroll": [], "title": "Martin Tall On Gaze Interaction"}, {"content": ["From Alexandre Alapetite and John Paulin Hansen , who I previously did an eye controlled robot with, comes a demo that shows gaze control of a drone. The user´s gaze is determined by an eye tracking apparatus ( Alea technology ) situated below the display. The drone will fly in the direction that people are looking. The operator is located near the drone. However, he could be situated anywhere, even hundreds of miles away. Gaze Controlled Flying was presented as an interactive demo at the NordiChi 2012 conference, October 16, IT University of Copenhagen , Denmark. Cool guys!"], "link": "http://gazeinteraction.blogspot.com/feeds/8877152283939781777/comments/default", "bloglinks": {}, "links": {"http://gazeinteraction.blogspot.dk/": 1, "http://www.nordichi2012.org/": 1, "http://alexandre.alapetite.fr/": 1, "http://www.itu.dk/": 2, "http://www.alea-technologies.de/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["The European Conference on Eye Movements 2013 will be held in Lund, Sweden, from August 11th to 16th 2013. ECEM is the largest and oldest eye tracking conference in the world. The conference webpage is now public: http://ecem2013.eye-movements.org/   Next year’s conference will include four panel discussions, 9 keynote speakers and a large number of sessions of 4 to 6 talks. We also include pre-conference methods workshops taught by top experts in the field on diverse topics related to eye movements and eye tracking, open to all researchers at every level, and to members of industry, running from the 7th to 10th August. You can see a list of these topics and the teachers here: http://ecem2013.eye-movements.org/workshops .   Important dates include the following:  Oct 15, 2012: Submission of proposals and abstracts will open. Jan 15, 2013: Deadline for proposals for symposia. Feb 25, 2013: Notification on acceptance for symposia. March 1, 2013: Deadline for 2-page extended abstract for talks and 200 word abstracts for posters. April 1, 2013: Registration opens. April 15, 2013: Notification on acceptance for talks and posters. May 1, 2013: Last day for reduced registration fee.  Organising committee  Conference Chairs: Kenneth Holmqvist and Arantxa Villanueva Conference Organiser: Fiona Mulvey Scientific Board: Halzska Jarodzka , Ignace Hooge , Rudolf Groner and Päivi Majaranta Exhibition Chairs: John Paulin Hansen and Richard Andersson Method Workshop Organisers: Marcus Nyström and Dan Witzner Hansen Web Masters: Nils Holmberg and Detlev Droege Proceedings Editors: Roger Johansson and Richard Dewhurst Registration Managers: Kerstin Gidlöf and Linnéa Larsson Student Volunteer Managers: Linnéa Larsson , Richard Dewhurst and Kerstin Gidlöf Social Program Organisers: Richard Andersson , Jana Holsanova and Kerstin Gidlöf   Contact  Conference chairs and organiser: management at/på/an ecem2013.eye-movements.org Exhibition: exhibition at/på/an ecem2013.eye-movements.org Method workshops: workshops at/på/an ecem2013.eye-movements.org The web page: webmaster at/på/an ecem2013.eye-movements.org"], "link": "http://gazeinteraction.blogspot.com/feeds/5634018992083595003/comments/default", "bloglinks": {}, "links": {"http://ecem2013.eye-movements.org/": 2}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Today the first public demonstrations of the Fujitsu/Docomo/Tobii tablet came online, all from the CEATEC 2012 expo in Japan. The prototype tablet, called iBeam, is designed by Fujitsu for Docomo and contains an eye tracking module from Swedish Tobii, namely the IS-20 which was introduced earlier this year . The form factor appears a bit on the large size with a bump towards the edge where the eye tracking module is placed, sort of looks like a tablet inside another case. On the software side the tablet is running Android where a gaze marker is overlaid on the interface. Selection is performed using simple dwell activation which is known for being both stressful and error-prone. The sample apps contains the usual suspects, panning of photos and maps, scrolling browser and image viewer. Pretty neat for a prototype.    Fujitsu also demonstrated a LCD monitor with an eye tracking camera system embedded while the actual gaze estimation algorithms are running on an embedded Windows computer. This display is not using the Tobii IS20 but a system developed by Fujitsu themselves which is stated to be low-cost. Question is why they didn't use this for the tablet. From what I can tell it does not provide the same level of accuracy, it appears to be a rough up/down, left/right type of gaze estimation which explains why the demo apps only handles panning of maps and images."], "link": "http://gazeinteraction.blogspot.com/feeds/2047736243401780984/comments/default", "bloglinks": {}, "links": {"http://www.ceatec.com/": 1, "http://gazeinteraction.blogspot.dk/": 1, "http://www.tobii.com/": 1, "http://1.blogspot.com/": 2}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["From the APEX 2012 here's a video where Steve Sizelove from Panasonic demonstrates their eye and gesture control systems for future in-flight entertainment systems. Even if this is a futuristic concept it is clear that Panasonic is pushing the envelope on in-flight systems. Their X-series system is state-of-the-art, just take a look at the upcoming eX3 , a touch-enabled Android platform with an associated app store, support for the Unity 3D engine, fast internet etc. Great stuff for those transatlantic flights that seem to take forever."], "link": "http://gazeinteraction.blogspot.com/feeds/8928485469656523482/comments/default", "bloglinks": {}, "links": {"http://www.thefutureofifec.com/": 1, "http://apex.aero/": 1, "http://panasonic.aero/": 1, "http://www.linkedin.com/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Browsed through my blog today. Realized I hadn't written much about what I've been up to. There's been a reason for that. One year ago I left my position at Duke University . It wasn't an easy decision. The Radiology eye tracking project I was involved with (and still is) was making good progress. I had been working long days since it started at Stanford in 2009 and we were doing pretty neat stuff with volumetric medical image datasets.   The Stanford/Duke Radiology eye tracking project and our novel approach to volumetric gaze data.  At the same time I spent nights and weekends working on the open source ITU Gaze Tracker together with Javier San Agustin. Somewhere I always had the feeling that we should get back together, great things just seemed to happen when we did. So after my grand tour of the US and countless Skype meetings over six months we had a plan. The four former PhD students from the ITU Gazegroup was to start an eye tracking company. At first we called it Senseye but later changed it to The Eye Tribe due to trademark issues.    The Eye Tribe as of Spring 2012 at the US embassy reception.   We decided early not to go for the established market. It's a red sea with a couple of fairly big players that have been working on their high tech creations for years, it's a low volume/high margin game with intricate and expensive solutions primarily for the research and disabled markets.  The Eye Tribe intends to innovate and disrupt by bringing eye tracking to post-pc devices in the consumer market. It just doesn't happen with devices that costs several thousand dollars.  After twelve months of executing our plan we recently raised funds from a group of European investors to accelerate (as covered by The Next Web ). The team has grown and we are looking to make additional hires in a near future. Perhaps you would like join the tribe and be part of something great? There's some very interesting things happening in a near future, for the skilled it's always best to get on early.  One year ago I traded a warm North Carolina for a cold Copenhagen, a relationship for loneliness, a big house for a small apartment and a sport car for a bicycle. Time will tell if that was the right thing to do, with big plans, full commitment and funding in place, it is so far, so good."], "link": "http://gazeinteraction.blogspot.com/feeds/8553850888667762369/comments/default", "bloglinks": {}, "links": {"http://www.duke.edu/": 1, "http://www.gazegroup.org/": 1, "http://sourceforge.net/": 1, "http://theeyetribe.com/": 2, "http://www.theeyetribe.com/": 1, "http://www.stanford.edu/": 1, "http://www.senseye.net/": 1, "http://2.blogspot.com/": 2, "http://thenextweb.com/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Today marks a historic day as the ITU GazeGroup.org open source Gaze Tracker has been downloaded over 30,000 times . Although the current version was released in October 2010 we're still seeing approximately 1000 downloads per month. We're really happy to see how widely distributed it has become, reaching all corners of the planet. When we released the first version, back in 2009, we had no idea it would reach distant places such as Kyrgyzstan , Suriname or Burkina Faso. The objective was, and still is, to \"democratize and provide access to eye tracking technology regardless of means or nationality\". This milestone is an achievement that I'd like to thank everyone involved for.   Top 10 Countries  10. Brazil 720   9. Denmark 803   8. France 865   7. China 888   6. India 1,063   5. Italy 1,170   4. Japan 1,226   3. United Kingdom 1,359   2. Germany 2,266   1. United States 4,647    Top 10 total: 15,007 (50%) Full stats ."], "link": "http://gazeinteraction.blogspot.com/feeds/6169629444894178639/comments/default", "bloglinks": {}, "links": {"http://sourceforge.net/": 2, "http://gazegroup.org/": 1, "http://3.blogspot.com/": 1, "http://www.itu.dk/": 1, "http://www.gazegroup.org/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["From the Pervasive 2012 conference held last week in Newcastle comes a demo of a dual scene-camera head-mounted eye tracking rig that enables users to move objects between two displays using the gaze position. The larger display acts as the \"public\" display ( digital signage etc.) while the smaller represents the personal handheld tablet/smartphone. Nifty idea from Jayson Turner , Andreas Bulling and Hans Gellersen , all from the Embedded Interactive Systems group at Lancaster University ."], "link": "http://gazeinteraction.blogspot.com/feeds/8690435392750990041/comments/default", "bloglinks": {}, "links": {"https://www.andreas-bulling.de/": 1, "http://pervasiveconference.org/": 1, "http://www.ac.uk/": 1, "http://ubicomp.ac.uk/": 1, "http://jaysonturner.com/": 1, "http://eis.ac.uk/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["It slices, it dices! The Eye Tribe from Copenhagen introduces the worlds first Windows 8 eye tracking tablet. The small, lightweight add-on connects via USB, no additional cables or batteries needed. For the time being the specs are 30Hz, accuracy of 0.5 degrees and an exceptionally large tracking range. More info to follow.   The Eye Tribe, formerly known as Senseye , have made significant progress in recent months. In January they won the Danish Venture Cup . Then went on to participate in the Rice RBPC , the worlds premier business plan competition, made it to the semi-finals and was awarded \" Most Disruptive Technology \" while being mentioned in Fortune Magazine and Houston Chronicle . In May the team won the eHealth Innovation Contest followed by the audience award at the Danish Accelerace whereby they were selected to participate at the Tech All Stars event which gives the most promising European startups the opportunity to pitch at the LeWeb conference in London on June 20th."], "link": "http://gazeinteraction.blogspot.com/feeds/5442785603634381669/comments/default", "bloglinks": {}, "links": {"http://rbpc.rice.edu/": 1, "http://techallstars.eu/": 1, "http://theeyetribe.com/": 1, "http://gazeinteraction.blogspot.dk/": 1, "http://symbion.dk/": 1, "http://mobihealthnews.com/": 1, "http://www.leweb.co/": 1, "http://management.cnn.com/": 1, "http://www.venturecup.dk/": 1, "http://www.chron.com/": 1, "http://www.incontextsolutions.com/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Eyecatcher is a prototype combining eyetracking with a gestural camera on a dual screen setup. Created for the Oilrig process industry, this project was a collaborative exploration between ABB Corporate Research and Interactive Institute Umeå ( blog )."], "link": "http://gazeinteraction.blogspot.com/feeds/971564381849464670/comments/default", "bloglinks": {}, "links": {"http://www.tii.se/": 1, "http://interactiondesign.se/": 1, "http://www.abb.com/": 1, "http://vimeo.com/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Copenhagen Business School invites applications for a vacant PhD scholarship in empirical modeling of eye movements in reading, writing and translation. The PhD position is offered at the Department of International Business Communication at the Copenhagen Business School (CBS). The Department of International Business Communication is a new department at CBS whose fields of interest include the role of language(-s) in interlingual and intercultural communication, the role of language and culture competences in organizations, the role of language and culture in communication technology and social technologies, as well as the teaching of language skills. The Department is dedicated to interdisciplinary and problem-oriented research. Considerable progress has been made in eye-tracking technology over the past decade, allowing to capture gaze behavior with free head movements. However, the imprecision of the measured signal makes it difficult to analyze the eye-gaze movement in reading tasks where a precise local resolution of the gaze samples is required to track the reader's gaze path over a text. The PhD position will investigate methods to cancel out the noise from the gaze signal. The PhD candidate will investigate, design and implement empirically-based models of eye-gaze movements in reading which take into account physical properties of the visual system in addition to background information, such as the purpose of the reading activity, the structure of the text, the quality of the gaze signal, etc. The PhD candidate should have: an interest in cognitive modeling of human reading, writing and translation processes a basic understanding of browser and eye-tracking technology knowledge of probability theory and statistical modeling advanced programming skills More information available here ."], "link": "http://gazeinteraction.blogspot.com/feeds/8655123135978194231/comments/default", "bloglinks": {}, "links": {"http://www.cbs.dk/": 3}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["The EyeHarp that I wrote about last summer is a gaze controlled musical instrument build by Zacharias Vamvakousis. In the video below he demonstrates how the interface is driven by the ITU Gaze Tracker and used to compose a loop which then improvise upon. On the hardware side a modified PS3 camera is used in combination with two infrared light sources. This setup was presented in New Interfaces for Musical Expression (NIME 2012) conference in Detroit a week ago, while it will be exhibited in Sonar, Barcelona on 14-16, June 2012. Great to see that such innovative interface being made open source and combined with the ITU tracker.  Vamvakousis, Z. and Ramirez, R. (2012) Temporal Control In the EyeHarp Gaze-Controlled Musical Interface. In the proceedings on the 12th International Conference on New Interfaces for Musical Expression. 21-23 May 2012. Ann Arbor, Michigan, USA. ( PDF )"], "link": "http://gazeinteraction.blogspot.com/feeds/8871614706471414244/comments/default", "bloglinks": {}, "links": {"http://theeyeharp.blogspot.dk/": 1, "http://gazeinteraction.blogspot.dk/": 1, "http://mtg.upf.edu/": 1, "http://www.gazegroup.org/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Henrik Skovsgaard of the ITU Gaze Group successfully defended his PhD thesis “Noise Challenges in Monomodal Gaze Interaction” at the IT University of Copenhagen on the 13th December 2011. The PhD thesis can be downloaded here .    ABSTRACT  Modern graphical user interfaces (GUIs) are designed with able-bodied users in mind. Operating these interfaces can be impossible for some users who are unable to control the conventional mouse and keyboard. An eye tracking system offers possibilities for independent use and improved quality of life via dedicated interface tools especially tailored to the users’ needs (e.g., interaction, communication, e-mailing, web browsing and entertainment). Much effort has been put towards robustness, accuracy and precision of modern eye-tracking systems and there are many available on the market. Even though gaze tracking technologies have undergone dramatic improvements over the past years, the systems are still very imprecise. This thesis deals with current challenges of monomodal gaze interaction and aims at improving access to technology and interface control for users who are limited to the eyes only. Low-cost equipment in eye tracking contributes toward improved affordability but potentially at the cost of introducing more noise in the system due to the lower quality of hardware. This implies that methods of dealing with noise and creative approaches towards getting the best out of the data stream are most wanted. The work in this thesis presents three contributions that may advance the use of low-cost monomodal gaze tracking and research in the field: An assessment of a low-cost open-source gaze tracker and two eye tracking systems through an accuracy and precision test and a performance evaluation.  Development and evaluation of a novel innovative 3D typing system with high tolerance to noise that is based on continuous panning and zooming. Development and evaluation of novel selection tools that compensate for noisy input during small-target selections in modern GUIs.  This thesis may be of particular interest for those working on the use of eye trackers for gaze interaction and how to deal with reduced data quality. The work in this thesis is accompanied by several software applications developed for the research projects that can be freely downloaded from the eyeInteract appstore ( http://www.eyeinteract.com ).   SUPERVISORS   Associate professor John Paulin Hansen - ITU Copenhagen (main supervisor) Associate professor Dan Witzner Hansen - ITU Copenhagen (secondary supervisor)   ASSESSMENT COMMITTEE   Professor Kasper Hornbæk - University of Copenhagen, Denmark  Associate professor Scott MacKenzie - York University, Canada  Associate professor Thomas Pederson - IT University of Copenhagen, Denmark (chairman)"], "link": "http://gazeinteraction.blogspot.com/feeds/6500190442399545503/comments/default", "bloglinks": {}, "links": {"http://www.eyeinteract.com/": 1, "http://www.gazegroup.org/": 1, "http://www.yorku.ca/": 1, "http://www.kasperhornbaek.dk/": 1, "http://www.itu.dk/": 3, "http://4.blogspot.com/": 1, "http://gazegroup.org/": 2}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Intel probably doesn't need any introduction and when it comes to eye tracking Swedish Tobii is probably known to most. The two are now engaged through an investment of $21M which came through the Intel Capital division who have invested in MySQL, VMware, RIM, and another hundred companies or so. Their investment trades for a 10% ownership on a total evaluation around $210M. Not bad for a company of 350 people that´s showing red numbers (-$3.7M on a $46M turnaround for 2010). It´s all about potential here, full steam ahead. Given Tobiis goal of consumer devices and the Windows 8 demo at CES12 the investment adds backing for getting there, or at least closer to it. About five years ago the drum was playing a similar beat when a group led by Swedish firm Investor Growth Capital put in $14M and another $25M a year later. With the new IS2 hardware presented just before Cebit12 it is clear where things are heading. Last year we saw the Lenovo+Tobii laptop , a set of ten prototypes that convinced people believe it was possible. I guess the Microsoft Kinect also helped convince people that consumers want new ways of interacting with machines (sources: Dagens Industri , ComputerSweden )    The three founders of Tobii with good reasons for smiling. Congrats guys."], "link": "http://gazeinteraction.blogspot.com/feeds/4252821577460718491/comments/default", "bloglinks": {}, "links": {"http://www.intel.com/": 2, "http://di.se/": 1, "http://www.investorab.com/": 1, "http://computersweden.idg.se/": 1, "http://gazeinteraction.blogspot.com/": 3, "http://www.tobii.com/": 1, "http://2.blogspot.com/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Well, well, look here. A constellation of eye tracking manufacturers are joining in on the affordable market, perhaps defined some time ago by Mirametrix who launched at @ $5k. Tobii have their PC Eye, perfectly fine but at a cool $7k and is showcasing the new IS2 chipset but apparently can't do CEBIT12 demos. The new player is Sensomotoric Instruments , known for their high quality hardware and finely tuned algorithms. Their new contribution is the RED-M (M is for mini?). Even if the price hasn't been announced I would assume it's less than it's high speed fire-wire sibling, perhaps similar to the PCEye pricing? The M-version is a small device made out of plastics that connects via USB 2.0 (assuming two plugs, one for power), it measures 240x25x33mm - that's pretty small and it's only 130 grams. This is a big difference from their prior models which have been very solid and made out of high quality materials and professional components. The accuracy is specified to 0.5deg, 50-75cm distance where the box is 320x210mm @ 60cm with a sample rate of 60/120Hz, in essence it's the low end version of the RED series where the top model is the super fast RED500 . Although it has yet to be demonstrated in operational state some material has appeared online. Below is the animated setup guide, you can find more information on their website. Looking good!  Technical specs (pdf) Flyer (pdf)"], "link": "http://gazeinteraction.blogspot.com/feeds/8211510837761726935/comments/default", "bloglinks": {}, "links": {"http://www.smivision.com/": 5}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Just came across the RealGaze glasses which is being developed by Devon Greco et al. He's father was diagnosed with ALS some years ago and given that Devon has been tinkering with electronics since early on he set out to build an eye tracker. For a prototype the result looks good, I guess the form factor feels familiar. There isn't too much meat available at the moment other than big ambitions to manufacturer an affordable device. Most of us would love to see that happen!"], "link": "http://gazeinteraction.blogspot.com/feeds/3805158373659433844/comments/default", "bloglinks": {}, "links": {"http://realgaze.com/": 1, "http://2.blogspot.com/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Just in time for CEBIT2012 Tobii Technologies announces the IS2 eye tracker . Notable differences from the previous IS1 , which was launched in 2009, is a reduction in the number of components which gives a smaller physical footprint and reduced power consumption. The trackbox has increased 10cm both vertically and horizontally while the range remains (45-75cm) while accuracy remains the same (<0.5°). Frame rate is vaguely specified to \"above 30\" where as the IS1 was listed as \"variable 25-40\". On the connector side the Ethernet port has been removed, USB2.0 is now the preferred bus. In addition the second PCB found in the IS1 has been incorporated onto a dual layer PCB on the IS2 which to reduce the height of the unit by 16mm. Overall it looks to be a great overhaul of the hardware which opens up for volume production at a reasonable cost. Impressive guys.    Tobii IS2 (left) vs. IS1 (right)     Shameless promovideo"], "link": "http://gazeinteraction.blogspot.com/feeds/2095007918609794909/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 1, "http://www.tobii.com/": 3, "http://www.cebit.de/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["The Eyewriter project which helped Tony 'TemptOne' Quan to draw again was originally document by Mick Ebeling . This material has been incorporated into a documentary called \"Getting up\" and recently won the audience award at the Slamdance . Movie buff Christopher Campbell wrote a short review on his blog. Great job on raising awareness, hope you guys find funding to further develop the software.  Getting Up: The Tempt One Story Trailer   How to build an EyeWriter"], "link": "http://gazeinteraction.blogspot.com/feeds/1749124615233495533/comments/default", "bloglinks": {}, "links": {"http://www.slamdance.com/": 1, "http://eyewriter.org/": 1, "http://theebelinggroup.com/": 1, "http://blogs.indiewire.com/": 1, "http://vimeo.com/": 2}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["The program for the Eye Tracking Research & Applications (ETRA'12) is out and contains several really interesting papers this year. Two supplementary videos surfaced the other day and comes from the User Interface & Software Engineering group at the Otto-von-Guericke-Universität in Germany. In addition the authors, Sophie Stellmach and Raimund Dachselt , have a paper submitted for the ACM SIGCHI Conference on Human Factors in Computing Systems \" (CHI'12). Abstracts and videos below. Abstract I (ETRA) Remote pan-and-zoom control for the exploration of large information spaces is of interest for various application areas, such as browsing through medical data in sterile environments or investigating geographic information systems on a distant display. In this context, considering a user's visual attention for pan-and-zoom operations could be of interest. In this paper, we investigate the potential of gaze-supported panning in combination with different zooming modalities: (1) a mouse scroll wheel, (2) tilting a handheld device, and (3) touch gestures on a smartphone. Thereby, it is possible to zoom in at a location a user currently looks at (i.e., gaze-directed pivot zoom). These techniques have been tested with Google Earth by ten participants in a user study. While participants were fastest with the already familiar mouse-only base condition, the user feedback indicates a particularly high potential of the gaze-supported pivot zooming in combination with a scroll wheel or touch gesture.   To be presented at the ETRA12.  Abstract II Since eye gaze may serve as an efficient and natural input for steering in virtual 3D scenes, we investigate the design of eye gaze steering user interfaces (UIs) in this paper. We discuss design considerations and propose design alternatives based on two selected steering approaches differing in input condition (discrete vs. continuous) and velocity selection (constant vs. gradient-based). The proposed UIs have been iteratively advanced based on two user studies with twelve participants each. In particular, the combination of continuous and gradient-based input shows a high potential, because it allows for gradually changing the moving speed and direction depending on a user's point-of-regard. This has the advantage of reducing overshooting problems and dwell-time activations. We also investigate discrete constant input for which virtual buttons are toggled using gaze dwelling. As an alternative, we propose the Sticky Gaze Pointer as a more flexible way of discrete input.  To be presented at the ETRA12. Abstract III (CHI) While eye tracking has a high potential for fast selection tasks, it is often regarded as error-prone and unnatural, especially for gaze-only interaction. To improve on that, we propose gaze-supported interaction as a more natural and effective way combining a user's gaze with touch input from a handheld device. In particular, we contribute a set of novel and practical gaze-supported selection techniques for distant displays. Designed according to the principle gaze suggests, touch confirms they include an enhanced gaze-directed cursor, local zoom lenses and more elaborated techniques utilizing manual fine positioning of the cursor via touch. In a comprehensive user study with 24 participants, we investigated the potential of these techniques for different target sizes and distances. All novel techniques outperformed a simple gaze-directed cursor and showed individual advantages. In particular those techniques using touch for fine cursor adjustments (MAGIC touch) and for cycling through a list of possible close-to-gaze targets (MAGIC tab) demonstrated a high overall performance and usability.   To be presented at the CHI12."], "link": "http://gazeinteraction.blogspot.com/feeds/8290526087672540334/comments/default", "bloglinks": {}, "links": {"http://isgwww.uni-magdeburg.de/": 1, "http://www.etra2012.org/": 2, "http://chi2012.acm.org/": 1, "http://wwwisg.uni-magdeburg.de/": 2}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["A video from EyeTech that features Michael who suffers from Thoracic Outlet Syndrome (TOS). Great little clip that shows what computer control without gaze-adapted interfaces comes down to. Luckily Michael can use voice recognition software for typing, text input using eye movements alone is a cumbersome process ( source )."], "link": "http://gazeinteraction.blogspot.com/feeds/4580605765744327762/comments/default", "bloglinks": {}, "links": {"http://www.eyetechds.com/": 2, "http://www.nih.gov/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Today's big news in eye tracking: \"Tobii's Gaze interface lets you use your eyes to move a cursor, perform gestures in Windows 8\" ( Engadget ). Plenty of videos from the International Consumer Electronics Show ( CES2012 ) are published online . Interesting quote found on ComputerSweden website \"estimated price is US$6000 when it becomes available\", which as we heard before means sometime later (years).  Live demonstration.   Promotion video.   Reality is said to beat fiction. Every time?"], "link": "http://gazeinteraction.blogspot.com/feeds/7544795828628075014/comments/default", "bloglinks": {}, "links": {"http://www.cesweb.org/": 1, "http://www.engadget.com/": 1, "http://www.idg.se/": 1, "http://www.youtube.com/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Senseye website  The Next Web: Senseye will let you control your mobile phone with your eyes  The Blaze: New meaning for hands free control"], "link": "http://gazeinteraction.blogspot.com/feeds/353008098611557868/comments/default", "bloglinks": {}, "links": {"http://thenextweb.com/": 1, "http://www.senseye.net/": 1, "http://www.theblaze.com/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Driver drowsiness detection is an active area of R&D where eye tracking definitely has a role to play. Tobii just presented a demo video showcasing their system. This is the first public demonstration where we actually get to see their eye detection visualized. One can only hope that this is the beginning of a more transparent approach from a company that previously have avoided showing the core technology in action. Judging by the video the eye region detection appears to be very robust, the dual camera setup clearly aids in reducing the frequency of false detection. For the specific application of driver drowsiness the accuracy of estimated gaze point-of-regard is less important as the primary area of interest is the degree of eye-lid closure, which in the domain is called PERCLOS (percentage of eye closure). This is potentially easier to accomplish compared to full gaze-estimation but placing the equipment inside a vehicle poses additional challenges. The imaging conditions will vary more compared to a traditional computer-display based system, for example direct sunlight, wider angles and head rotation. For a consumer safety application robustness is key, going from 90% to 99.9% detection rates is a clear challenge for all the companies attempting to push this technology into the automotive market. The application is clearly worthwhile and the manufactures want the technology, but is it ready?   On a side note, the sunglasses demonstrated in this video are lightly tainted. I did some testing last night with a pair of dark (black) Rayban and two 850nm IR lightsources (2x20 LEDs) and the eyes were barely visible. Guess it depends on the type of glasses and the illumination.."], "link": "http://gazeinteraction.blogspot.com/feeds/7439336086420166678/comments/default", "bloglinks": {}, "links": {"http://www.nhtsa.gov/": 1, "http://www.nih.gov/": 1, "http://gazeinteraction.blogspot.com/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Demonstration for eye-gaze controlled navigation. The goal was to move the the point of gaze to the center of the screen, simply put \"where you look is where it goes\". This is the popular AR.Drone quadricopter controlled with this policy using an EyeLink 2000 eye-tracker. The drone pivots left and right when the operator looks into those directions. It tilts up and down (making it fly backwards and forwards) when the operator looks up or down. EyeDrone was implemented by Lucas C Parra in C++ with much help from Michael Quintian. The chin rest here is not really needed as the basic control algorithm is inherently stable and miscalibrations are of little concern.  Learn more at: http://bme.ccny.cuny.edu/faculty/lparra/eyeNavigate/index.html  Explore the Neural Engineering Group at CCNY - http://neuralengr.com"], "link": "http://gazeinteraction.blogspot.com/feeds/7240338889462769539/comments/default", "bloglinks": {}, "links": {"http://neuralengr.com/": 1, "http://bme.cuny.edu/": 1}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["Latest update from Stephen Vickers and Howell Istance at the Centre for Computational Intelligence , De Montfort University who have been doing research and development of gaze-based gaming for several years now. Their latest project has been shortlisted in the consumer category of The Enginner Awards 2011 . Congratulations on an awesome job! \"Using your eyes and where you are looking to interact with computer games represents an exciting new direction that game play can take, following the success of whole body interaction enabled by the Kinect and the Wii. The Innovation Fellowship has supported the development and demonstration of a low-cost eye tracker by De Montfort University, in collaboration with Sleepy Dog, the East Midlands games company that produced the Buzz-it controller and games. The low-cost eye tracker utilised the ITU Gazetracking library and was produced as a fully working pre-production prototype. In the project, three different games were produced to demonstrate different ways in which eye gaze can be used to make game play more immersive and exciting. This video demostrates two of them. eyeAsteroids The ship flies towards where you are looking and the space bar is used to fire. eyeShoot in the Dark! The torch shines at where you are looking and the mouse is used to move the cross-hair and fire."], "link": "http://gazeinteraction.blogspot.com/feeds/4851046742363896981/comments/default", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://www.ac.uk/": 2}, "blogtitle": "Martin Tall On Gaze Interaction"}, {"content": ["The SMI Glasses, which we got a sneak-peak at before last Christmas and specs in April are now available for sale. SMI engineers have managed to squeeze two 30Hz eye tracking cameras and a high definition scene camera into the frame weighting only 75 grams. The advantage of tracking both eyes is that it enables parallax compensation where the accuracy is maintained regardless if you look close or far in the scene. In addition, binocular tracking most often yields better accuracy as it provides the opportunity to average both samples or to discard one with low validity. The HD scene camera captures 24 frames per second at 1280x960 pixels, a clear advantage. All in all, better late than never, SMI is back with a highly competitive product in the market."], "link": "http://gazeinteraction.blogspot.com/feeds/3717144713506586039/comments/default", "bloglinks": {}, "links": {"http://www.eyetracking-glasses.com/": 1, "http://en.wikipedia.org/": 1, "http://gazeinteraction.blogspot.com/": 3}, "blogtitle": "Martin Tall On Gaze Interaction"}]