[{"blogurl": "http://www.massgenomics.org\n", "blogroll": [], "title": "MassGenomics"}, {"content": ["Books (like most things), are best enjoyed with coffee and chocolate \n Last week I had some traveling to do and took the opportunity to reread a classic. The Double Helix is James D. Watson’s personal account of the discovery of the structure of DNA (1953), for which he, Francis Crick, and Maurice Wilkins were awarded the Nobel Prize in 1962. It’s a relatively quick read, dwelling less on science and more on the research atmosphere in post-WWII England and the struggles of those involved in the race to discovery DNA’s structure, including Rosalind Franklin, Erwin Chargaff, Linus Pauling, and other famous names from genetics textbooks. If Dr. Watson is anything as a writer, he is straightforward, and his unflinching account of the events is just fascinating. \n Watson and Crick \n Watson met Crick at the Cavendish Laboratory (Cambridge University) in 1951, when he (Watson) came over from the U.S. on a fellowship to join a small group of researchers working on the structure of proteins. At the time, physicists and chemists around the world were rapidly engaged in solving the structures of important biological molecules, aided enormously by the development of X-ray crystallography techniques pioneered by William Astbury . One of the world’s leading chemists, Linus Pauling (Caltech), had used X-ray images of proteins to determine that their secondary structure formed a helix (the alpha-helix). Proteins were a hot topic, and the world wasn’t yet convinced that DNA had an important role to play. \n A Shared Interest in DNA \n Watson, by his own admission, was wandering around Europe (ostensibly to learn biochemistry) and trying to find something that really interested him. His background was virology; a field serendipitously connected to the transfer of genetic material in the form of DNA. At Cambridge, Watson and Crick immediately struck up a friendship fueled by their mutual interest in DNA. They wanted to work on it but encountered a delicate situation: Maurice Wilkins and Rosalind Franklin , of King’s College in nearby London, had been working on that problem for some time, hoping to solve it through X-ray crystallography. \n In England there were certain unspoken rules about entering an area of research already staked out by a colleague.  In the book’s introduction, Sir Lawrence Bragg (head of the Cavendish Laboratory at the time) described the situation: \n “The story is a poignant example of a dilemma which may confront an investigator. He knows that a colleague has been working hard for years on a problem and has accumulated a mass of hard-won evidence, which has not yet been published because it is anticipated that success is just around the corner. He has seen this evidence and has good reason to believe that a method of attack which he can envisage, perhaps merely a new point of view, will lead straight to the solution. An offer of collaboration at such a stage might well be regarded as a trespass.” \n The dilemma was even more troublesome because Maurice Wilkins and Rosalind Franklin were having their own problems getting along. \n False Starts, Dead Ends, and Linus Pauling \n The relationship with Wilkins and Franklin got off to a poor start. Watson and Crick had built a [grossly incorrect] model of DNA in which the nucleotides were on the outside, and invited the King’s College pair to come and see it. Franklin was convinced that the sugar-phosphate backbone must be on the outside of the molecule, and Wilkins believed her. They were quick to point out the faults of the doomed phosphate-in model, and also rather offended that these two upstarts were trespassing on their area of research. It was a huge debacle, after which Watson and Crick were told (by the head of their laboratory) to stay away from DNA. \n Meanwhile, everyone was watching Linus Pauling and holding their breath. He’d already solved the alpha helix, and was actively working to solve DNA’s structure. There was a moment of dread when the group in England got word that Pauling had submitted a paper proposing DNA’s structure as a triple helix. Watson and Crick managed to get an early look at this through Pauling’s son, who was currently their office-mate. They immediately saw obvious flaws in Pauling’s proposed model — it was wrong — but they knew it was only a matter of time until he came up with the right answer. (Side note: I found an interesting chronicle of the race to solve DNA from Pauling’s perspective , put together by Oregon State University). \n X-Ray Photos and Chargaff’s Sums \n Meanwhile, Watson was accumulating some compelling data of his own. He and Crick were convinced that DNA had a helical structure, though they could not agree on a configuration that would satisfy chemistry, physics, and the growing body of data. Watson came across two pieces of evidence that were critical to reaching the answer. The first was Photo 51 , an X-ray diffraction image of DNA in the hydrated “B” form taken by Maurice Wilkins and Rosalind Franklin. There is some controversy about how Watson got a look at this photo. He’d stopped by the Wilkins lab to point out how Pauling’s model was wrong. He had an altercation, of sorts, with Franklin and was rescued by Wilkins returning from lunch. \n In that moment of camaraderie, when Wilkins knew that Watson now understood (viscerally) some of the difficulties he was having with Franklin, he decided to show Watson a print of their latest image. Right away, Watson’s pulse began to race. He wrote, “With the B form… mere inspection of its X-ray picture gave several of the vital helical parameters.” \n  X-ray photograph of DNA in “B” form \n And then there was Chargaff, whose measurements of the proportion of the four nucleotides in various DNA isolates showed that amounts of adenine (A) were proportional to those of thymine (T), and amounts of guanine (G) were proportional to that of cytosine (C). This vital observation contributed to Watson’s intellectual leap: the base-pairing between A & T and G & C. \n 50th Anniversary Edition of Double Helix \n I won’t spoil more of the Double Helix , because I think that anyone working in our field should read it. One might imagine that the author’s direct writing style paint a more accurate picture of the politics and personal conflicts that do exist, for all appearances to the contrary, within the walls of ivory towers. \n A new annotated/illustrated version of the book comes out in a few weeks to commemorate the 50th anniversary of the Nobel prize awarded to Watson, Crick, and Wilkins (1962) for their discovery of DNA’s structure. For all her contributions, Rosalind Franklin was not able to share the prize. She died in 1958 of ovarian cancer at the too-young age of 37."], "link": "http://feedproxy.google.com/~r/Massgenomics/~3/5KgsqBrUAkg/the-double-helix-book-by-james-d-watson.html", "bloglinks": {}, "links": {"http://massgenomics.org/": 5, "http://osulibrary.oregonstate.edu/": 1, "http://en.wikipedia.org/": 2}, "blogtitle": "MassGenomics"}, {"content": ["Using genetic information to improve human health represents the central goal of biomedical research. Achieving it won’t be easy, but from a simplistic perspective, requires three steps. \n \n Cataloging the full extent of genetic variation in cells , tissues, and individuals. Efforts like the HapMap and 1,000 Genomes project are tackling this part, and judging by the explosive growth of databases like dbSNP and COSMIC, we’re well on our way. \n Correlating genetic variants to relevant phenotypes , such as disease predisposition and response to treatment. In principle, this is simply a matter of statistics: study a sufficient number of individuals, and the correlations should emerge. \n Understanding how (1) and (2) are related . In other words, how genetic and epigenetic changes exert their effects on a phenotype. This will undoubtedly be the hardest task of all. \n \n An important step towards item #3 was made by the ENCODE consortium last month, when they published their guide to human genome content and function in the form of more than 30 research papers. Recently I highlighted some of the main ENCODE findings and their efforts to characterize regulatory variation in the human genome . Now, I’d like to summarize the landscape of transcription in human cells revealed by their efforts to characterize RNAs across 15 different human cell lines. \n RNA represents the direct output of genetic information in a cell: the “message” of what’s encoded in its genome. As such, building a catalog of transcription in human cells is critical to understand how the genome functions. ENCODE sought to build a comprehensive dataset of RNA expression in these lines, interrogating both polyadenylated (poly-A) and non-poly-A RNA, long and short fragments, and even sequencing RNA isolated from specific cellular compartments (chromatin, nucleolus, and cytoplasm). \n Pervasive Transcription Across the Genome \n Perhaps the most surprising finding of the pilot project, and recently upheld by the main project, is that the human genome is pervasively transcribed: as many as 75% of bases are represented in at least one primary transcript: \n  Fraction of the genome covered by RNA-seq contigs and introns (ENCODE Nature 2012, Supp Fig. S22) \n Cumulatively, the authors observed that 74.7% of bases were covered by primary transcripts and 62.1% by processed transcripts. Interestingly, however, no single cell line expressed more than 57% of the union (complete set) of transcribed bases, suggesting that a signification portion of this transcription is cell-type specific. \n Genes and Isoforms \n So, we’re all aware that there are more transcripts than genes: differences in transcription start sites and splicing, for example, have almost limitless potential for producing different isoforms of a given gene. Perhaps surprisingly, ENCODE found that genes are not expressed in a minimalist strategy . Look at the number of isoforms per gene: \n  Gene isoforms expressed by the number annotated (ENCODE Nature 2012, Fig 4A) \n By analyzing the different gene isoforms observed within and across cell lines, the authors also observed that: \n \n Alternative isoforms within a gene are not expressed at similar levels. Usually, one isoform predominates. \n About 3/4 of protein-coding genes expressed different dominant isoforms depending on the cell line and condition \n Across cell lines, differences in gene expression levels were more variable than differences in splicing . \n \n Finally, the number of observed isoforms per gene correlated with the number of annotated isoforms (shown in the plot above), hitting a sort of plateau at 10-12 expressed isoforms per gene per cell line . That’s an incredible amount of variation, and it begins to suggest a theme brought home by this and many other studies: that even the basic elements of the genome (genes) are far more complex than we might have anticipated. \n Characterization of Annotated and Novel Transcripts \n One important element of the ENCODE project was its ambitious annotation effort (GENCODE) which sought to compile our current knowledge of splice junctions, transcripts, and genes. About 70% of these were detected by RNA-Seq across the 15 cell lines (85% of annotated exons were represented), and a large number of novel elements were present as well. These novel elements were concentrated around (but not limited to) gene regions, covering 78% of intronic bases (within genes) and 34% of intergenic bases (between genes). They add 20% more exons and 45% more transcripts to the GENCODE annotation. \n The distribution of gene expression was similar across cell lines, with protein-coding genes averaging higher expression levels than long non-coding RNAs (lncRNAs). Indeed, about 80% of observed lncRNAs were present at 1 fewer copies per cell, compared to 25% of protein-coding genes. The authors note that this may be a feature of lncRNA expression occurring only in a subset of cells, rather than a picture for all cells. In some cell lines, lncRNAs exhibited steady-state levels of expression comparable to those of protein-coding genes. \n Also, lncRNAs were more likely to be specific to a single cell line (29%) than protein-coding genes 7%); in fact, more than half of protein-coding genes were constitutive, i.e. expressed in all cell lines. \n  Expression across cell types by transcript type (ENCODE Nature 2012, Supp Fig. S10) \n Note that while most protein-coding genes were expressed in all cell lines, novel intergenic genes were predominantly expressed in a single cell line. \n Alternative Initiation and Termination \n The authors employed two experimental techniques to examine where transcription starts and stops in the genome: \n \n Cap-analysis of Gene Expression (CAGE), in which capped 5′ ends of RNAs were isolated and sequenced, and \n Paired-end Tag (PET) sequencing, in which short tags at the 5′ start and 3′ end of full mRNA transcripts are sequenced \n \n The transcription start sites (TSSs) identified by CAGE, and PET sequencing were compared to the list of 97,778 TSSs that were in the GENCODE annotation and expressed according to RNA-Seq: \n  Distance between CAGE/PET TSSs to GENCODE/RNA-Seq annotated TSSs (ENCODE/Nature 2012, Supp Fig S12) \n About half of the CAGE-identified start sites were located within 500 bp of an annotated TSS that was expressed in RNA-Seq data. However, only 72% of all CAGE sequencing reads mapped near known TSSs, suggesting that the remaining 28% are from re-capping events or else represent a new class of transcription start site. \n Characterization of Small Noncoding RNAs \n Small noncoding RNAs (ncRNAs) have been an area of intense interest over the past several years. By sequencing short fragment size fractions in several cellular compartments, the ENCODE was able to characterize the expression and localization of several classes of small RNA: \n \n Micro-RNAs (miRNAs) , which are short RNA fragments known to have a role in post-transcription regulation \n Transfer RNAs (tRNAs) , the adapter molecules between mRNA and amino acids. \n Small nuclear RNAs (snRNAs) associated with the spliceosome \n Small nucleolar RNAs (snoRNAs) , which guide chemical modifications (methylation and pseudouridylation) of ribosomal and transfer RNAs as well as snRNAs. \n \n Given the function of these classes of RNAs, we might already have a guess as to the cellular compartments in which to find them. In the K562 cell line, here are the ncRNA compositions by cellular compartment: \n  ncRNA composition by cell compartment (ENCODE/Nature 2012, Supp Fig. S14) \n Indeed, small RNAs were enriched in compartments where they perform their functions: miRNAs and tRNAs in the cytosol and snoRNAs in the nucleus. The abundance of snRNAs in chromatin-associated RNA suggests that, as has already been suggested, splicing predominantly occurs as a gene is being transcribed. \n RNA Editing: Widespread or Rare? \n RNA editing is a rare but remarkable phenomenon in which a base in an RNA transcript is changed after transcription. It’s also the subject of recent controversy. A 2011 paper in Science by Li et al had reported that RNA editing was widespread in the human transcriptome. At AGBT 2012, I attended a talk in which Vivian Cheung (the senior author) presented the work. To me, and some members of the audience, the flaws were kind of obvious. They hadn’t controlled for false positives in RNA-Seq data. As a result, they reported way too many events and across the full spectrum of possible substitutions. RNA editing is actually quite rare, and it’s almost always an A to G substitution. \n Unsurprisingly, about a month later Science published comments from three independent groups challenging the findings. Kleinman and Majewski (McGill), for example, wrote “Li et al. did not properly control for a number of technical limitations of HTS and the downstream analysis of the data, resulting in an unacceptably high false-positive rate within this study.” It’s easy to understand how this could happen: variant calling with next-gen sequencing can be difficult, especially in RNA-Seq data because errors are more prevalent (due to reverse transcriptase errors and the challenges of making accurate gapped alignments of the reads). \n In this study, the ENCODE developed a pipeline to identify single nucleotide variants (SNVs) and remove sequencing artifacts. In the GM12878 cell line, which has been deeply resequenced, they called 51,557 “RNA consistent” SNVs of which 65% overlapped dbSNP positions (this indicates they’re germline variants, not RNA editing events). After removing those and applying even more stringent filters, the authors found 1,186 events in 430 genes, of which the vast majority (88%) were A to G changes. \n  RNA Editing Spectrum (ENCODE/Nature 2012, Supp. Fig. S19) \n In the words of ENCODE authors, “These results do not support a recent report of a substantial number of non-canonical SNV edits in the RNA of human lymphoblastoid cells.” \n Conclusion: Relevance of the Transcriptome \n In genetics and genomics, we often think of genetic variation at the level of the genome: inherited variants and acquired changes that may contribute to a phenotype such as disease susceptibility or response to treatment. Judging by the explosive growth of databases like dbSNP, DGV, and COSMIC over the past several years, we are rapidly on our way to cataloging the vast majority of genetic variation in the human genome. In other words, we have a pretty good idea of what the genetic differences are between one person and the next. We have a much less complete picture of what those variants do. \n Understanding the “message layer” between a cell and its genome, through studies like these, will help us make the connection between genotype and phenotype. \n References \n Djebali S, Davis CA, Merkel A, Dobin A, Lassmann T, Mortazavi A, Tanzer A, Lagarde J, Lin W, Schlesinger F, Xue C, Marinov GK, Khatun J, Williams BA, Zaleski C, Rozowsky J, Röder M, Kokocinski F, Abdelhamid RF, Alioto T, Antoshechkin I, Baer MT, Bar NS, Batut P, Bell K, Bell I, Chakrabortty S, Chen X, Chrast J, Curado J, Derrien T, Drenkow J, Dumais E, Dumais J, Duttagupta R, Falconnet E, Fastuca M, Fejes-Toth K, Ferreira P, Foissac S, Fullwood MJ, Gao H, Gonzalez D, Gordon A, Gunawardena H, Howald C, Jha S, Johnson R, Kapranov P, King B, Kingswood C, Luo OJ, Park E, Persaud K, Preall JB, Ribeca P, Risk B, Robyr D, Sammeth M, Schaffer L, See LH, Shahab A, Skancke J, Suzuki AM, Takahashi H, Tilgner H, Trout D, Walters N, Wang H, Wrobel J, Yu Y, Ruan X, Hayashizaki Y, Harrow J, Gerstein M, Hubbard T, Reymond A, Antonarakis SE, Hannon G, Giddings MC, Ruan Y, Wold B, Carninci P, Guigó R, & Gingeras TR (2012). Landscape of transcription in human cells. Nature, 489 (7414), 101-8 PMID: 22955620"], "link": "http://feedproxy.google.com/~r/Massgenomics/~3/mRCLZVeXzqA/redefining-the-gene-transcription-landscape-of-human-cells.html", "bloglinks": {}, "links": {"http://massgenomics.org/": 8, "http://www.nature.com/": 1, "http://www.sciencemag.org/": 2, "http://www.nih.gov/": 1}, "blogtitle": "MassGenomics"}, {"content": ["Now online at Nature is the most comprehensive molecular portrait of human breast tumors published to date. The Cancer Genome Atlas study encompasses more than 500 primary tumors representing the four intrinsic subtypes of breast cancer : Luminal A, Luminal B, Her2-enriched, and Basal-like. Using a suite of high-throughput platforms, TCGA characterized various aspects of these tumors at the molecular level: \n \n Somatic mutations and germline susceptibility variants (exome sequencing) \n Genomic copy number (SNP and CGH arrays) \n DNA methylation \n microRNA expression (sequencing) \n Gene expression (mRNA arrays) \n Protein expression (reverse-phase protein arrays) \n \n Many of the key insights in this study were enabled through integrative analysis across these platforms. The findings suggest a highly heterogeneous disease whose intrinsic subtype was apparent not only by gene expression, but by mutational and DNA copy number profiles as well. Only three genes ( TP53 , PIK3CA , and GATA3 ) were mutated in 10% or more of all tumors; grouping them by gene expression (intrinsic) subtype uncovered a number of subtype-specific events. New recurrently mutated genes, two novel protein expression subtypes, and a previously unrecognized connection to ovarian cancer are just a few of the tantalizing results. Let’s get started. \n  \n Primary Breast Tumors \n There were 507 primary tumors in the main analysis set; these were the focus of most analyses in this study. The breakdown by intrinsic [gene expression] subtype is generally representative of the disease incidence as a whole: \n  \n Luminal A tumors are the most prevalent (44% in this study), followed by luminal B (24%). Both of these subtypes are estrogen receptor (ER) positive, with luminal A carrying the most favorable prognosis. Basal-like tumors compose 19% of the set; these overlap considerably with so-called triple negative breast cancers , which are clinically negative for estrogen receptor (ER), progesterone receptor (PR), and Her2 receptor (HER2). Another 11% are of the Her2-enriched subtype, a group whose prognosis has improved since the development of targeted therapies against Her2 (e.g. Herceptin). Finally, 2% of tumors were of the rare normal-like subtype, which couldn’t be comprehensively studied with so few samples. \n Another way to look at breast cancer tumor is by histology type, which reflects the cell of origin: \n  \n Most often, breast cancer arises from the mammary ducts (ductal) or milk-producing lobules (lobular), though other less common histology types were represented as well. \n Somatic Mutations in Breast Cancer \n Figure 1 nicely encapsulates the characterization of breast cancer genomes as a whole and by intrinsic subtype. \n  Mutation heatmap (TCGA, Nature 2012) \n The most frequently mutated gene overall was TP53 (37% of cases), followed closely by PIK3CA (36%). Mutually exclusive mutations in MAP3K1 , MAP2K4 , and GATA3 were prevalent in luminal A and luminal B subtypes , but almost absent from the others. In contrast, TP53 mutations were frequently observed in Her2 (72%) and Basal-like (80%) subtypes. Mutations in E-cadherin ( CDH1 ) were frequent across subtypes but correlated almost perfectly with lobular tumors. \n The observed mutation rate in coding regions seems to reflect the aggressiveness of breast cancer subtypes : lower in luminal A (0.84 mutations/Mbp) than luminal B (1.36 mutations/Mbp), higher in Her2-enriched (2.05 mutations/Mbp) and Basal-like (1.68). The number and extent of copy number alterations, too, followed this trend. \n Analysis with the Mutation Significance In Cancer (MuSiC) package identified 35 significantly mutated genes (SMGs). Among these were nearly all genes previously implicated in breast cancer ( PIK3CA, PTEN, AKT1, TP53, GATA3, CDH1, RB1, MLL3, MAP3K1 and CDKN1B ) and a number of novel SMGs, including: \n \n TBX3 , which is mutated in ulnar-mammary syndrome and involved in mammary gland development \n Ubiquitous transcription factors CTCF and FOXA1 \n RUNX1 and CBFB , both rearranged in acute myeloid leukaemia and interfering with haematopoietic differentiation \n PIK3R1 , in which mutations clustered in the PIK3CA interaction domain (similar to glioma and endometrial cancer). \n Splicing factor SF3B1 , previously reported in myelodysplastic syndromes and CLL \n Protein tyrosine phosphatases PTPN22 and PTPRD \n \n A statistically significant exclusion pattern among PIK3R1, PIK3CA, PTEN and AKT1 mutations (P = 0.025) reflects the well-known activation of PI3K signaling in breast cancer. \n Basal-Ovarian Connection \n One of the most intriguing findings comes from a comparison of breast cancer subtypes to other common cancers. Figure 5 shows how key pathways are altered in luminal (first % box) and basal (middle box) breast cancer and ovarian cancer (right box). \n  Luminal and Basal breast cancer compared with ovarian cancer (TCGA, Nature 2012) \n Among these and other results integrating multiple platforms, it’s apparent that Basal subtype tumors more closely resemble ovarian tumors than other breast cancer subtypes. This raises the exciting possibility that therapies for ovarian cancer might benefit patients with Basal breast tumors, and vice-versa. \n I won’t spoil any more of this outstanding paper, but recommend that you read it yourself online at Nature where it’s open access. \n References \n The Cancer Genome Atlas Network (2012). Comprehensive Molecular Portraits of Human Breast Tumors Nature DOI: 10.1038/nature11412"], "link": "http://feedproxy.google.com/~r/Massgenomics/~3/zMIe8sNSUHc/a-comprehensive-atlas-of-breast-cancer-genomes.html", "bloglinks": {}, "links": {"http://massgenomics.org/": 7, "http://www.nature.com/": 1, "http://cancergenome.nih.gov/": 1, "http://dx.doi.org/": 1}, "blogtitle": "MassGenomics"}, {"content": ["I’m still working through the outstanding series of articles published by members of the ENCODE Consortium. After my previous post highlighting their marker paper on genome content and function, I came across two companion papers that demonstrate the power of ENCODE data to characterize functional regulatory variants in the human genome. The first article, from authors at the University of Washington, combines genome-wide maps of regulatory DNA with whole-genome sequencing data to characterize patterns of regulatory variation. The second, from authors at Stanford University, investigates the association between multiple ENCODE data types with disease-associated SNPs from GWAS studies. \n Personal and Population Genomics of Regulatory Variation \n Benjamin Vernot and colleagues combined two powerful genome-wide datasets to explore the landscape of variation in regulatory regions of the human genome: \n \n DNase I hypersensitive sites (DHSs) from 138 cell and tissue types obtained via DNase-Seq \n Whole-genome sequencing data for 53 geographically diverse individuals obtained from Complete Genomics \n \n DNase I Data \n The DNase I data exploits a structural feature of regulatory DNA that’s been known for decades: the binding of sequence-specific transcriptional regulators in place of nucleosomes creates DNase I hypersensitive sites, or DHSs . Large-scale localization of these signatures via deep sequencing reveals a pattern within a pattern: within each DNAase I “peak” (100 to 200 bp) are small “footprints” (6 to 20 bp) of sequences that were bound by the regulatory protein, and hence protected from cleavage. This is nicely illustrated in Figure 1A: \n  DNase I Footprinting (Vernon et al., Genome Res. 2012) \n Across all cell and tissue types, ENCODE identified ~2.9 million DNase I peaks and 8.4 million footprints within them. Collectively, these span 577 megabases and 156 megabases (respectively) of unique sequence (18.7% and 5.1% of the genome). \n Whole-genome Sequence Data \n The authors obtained publicly-available WGS data for 53 unrelated individuals representing 5 geographically diverse populations, shown in this phylogenetic-like tree in Figure 1B: \n  WGS Individuals (Vernon et al, Genome Res. 2012) \n Each individual was sequenced to ~40x coverage by Complete Genomics (now BGI-owned). These are samples from populations initially characterized by the International HapMap Project : \n \n CEU    CEPH Utah residents of north/west Europe ancestry (n=9) \n YRI    Yoruba in Ibadan, Nigeria (n=9) \n CHB    Han Chinese in Beijing, China  (n=4) \n JPT    Japanese in Tokyo, Japan (n=4) \n LWK    Luhya in Webuye, Kenya (n=4) \n MKK    Maasai in Kinyawa, Kenya (n=3) \n ASW    African ancestry in Southwest USA (n=4) \n TSI    Tuscans in Italy (n=4) \n GIH    Gujarati Indian in Houston, Texas, USA (n=4) \n MXL    Mexican ancestry in Los Angeles, California (n=5) \n PUR    Puerto Rican in Puerto Rico (n=2) \n \n The variants from each individual were filtered to remove variants with missing data, low coverage across samples, and departures from Hardy-Weinberg equilibrium. GERP scores, which measure evolutionary constraint, were obtained for each passing variant. \n Pervasive Regulatory Variation \n The overlap between sequence variants (WGS data) and DNase I peaks/footprints (ENCODE data) was astonishing: 3.85 million and 1.01 million variants overlapped DHS peaks and footprints, respectively. There were far more variants in these regulatory regions than in the protein-coding exome (just 150,000 variants). However, if one considers only variants with high (>3) GERP conservation scores, the differences are far less dramatic: 146,570 variants, 61,933 variants, and 36,935 variants were found in DHS peaks, footprints, and the exome. The density of variants (an informal proxy for purifying selection) differed as well: 6.7 and 6.5 variants per kilobase in DHS peaks and footprints, respectively, compared to 4.2 variants per kilobase in the exome. \n These findings support the central conclusion of this paper: regulatory variants are pervasive in the human genome, far more numerous but less deleterious (on average) than coding variants. Interestingly, however, the DHS footprints for certain developmental regulators, such as HOX genes, exhibited high levels of evolutionary constraint comparable to those seen in coding regions. \n Signatures of Positive Selection \n To identify signatures of geographically restricted natural selection, the authors searched for DNase I peaks containing variants with significant allele frequency differences between individuals of African, European, and Asian ancestry. For each such peak, they identified genes within 50 kb as potential targets of regulation. This yielded about 3,000 genes in each population; a KEGG analysis identified a total of 15 significantly enriched pathways. Interestingly, the most significant pathway for European ancestry was melanogenesis , a process related to skin pigmentation. This signature of recent positive selection had previously been observed for coding variants in melanogenesis pathway genes. Now, evidence suggests that regulatory variants, too, were acted upon by selection and thus contribute to the phenotype. \n Linking Disease to Regulatory Variation \n The second study, undertaken by Marc A. Schaub and colleagues, took a complementary approach to characterize regulatory variants. They took 5,694 curated genotype-phenotype associations from the NHGRI GWAS catalog (comprising 4,724 unique SNPs associated with 470 different phenotypes), and performed a functional annotation of those variants using data from ENCODE and other sources. \n Annotation of GWAS-Associated SNPs \n First, they took the SNPs that were reported to be associated with a phenotype, and found that ~45% of them overlap at least some ENCODE data : \n \n 7.8% overlap the coding (4.7%) or nonoding (3.1%) portions of known exons \n 36.3% overlap a DHS peak while 7.5% overlap a DHS footprint \n 19.9% overlap a CHiP-seq peak, indicating a region bound by one of the 114 assessed transcription factors. \n \n Annotation of Variants in LD with Associated SNPs \n Although the “associated” SNP identified by GWAS could be a sequence variant that contributes to the phenotype, it may simply be “tagging” a region harboring such functional variation. Remember that GWAS studies use “SNP chips” — high density microarrays which genotype 500,00 to 1 million SNPs simultaneously — whose markers are generally chosen for their informativeness, not necessarily their potential causation . In fact, the most informative markers are likely to have high minor allele frequencies, which likely makes them neutral with respect to selection, and therefore not functional variants. Yet those that are statistically associated with a phenotype must be linked to functional variation. \n The authors exploited linkage disequilibrium (the tendency of variants on the same chromosome to be inherited together) to identify, in Europeans, variants that tend to be inherited together with associated SNPs. As expected, when one considers not just the associated SNP but the nearby variants it represents, a much larger proportion (58%) overlaps some kind of ENCODE-annotated regulatory region . When the authors restricted their analysis to GWAS studies of populations with European ancestry, and use European-only LD information, that proportion jumps to 81%. Figure 2 from the paper provides a colorful view of the annotation breakdown of lead (associated) SNPs, variants in LD with lead SNPs (r^2 > 0.8), and European-only variants in LD. \n  ENCODE annotation of GWAS SNPs (Schaub et al, Genome Res. 2012) \n The authors go on to provide some nice vignettes of functional annotation of certain GWAS associations. Bottom line, their main findings are: \n \n GWAS associations are significantly enriched for DHS peaks, DHS footprints, and CHiP-Seq peaks \n Candidate functional variants were found for as many as 81% of GWAS associations \n Integrating multiple types of functional and expression data yields more likely candidate functional variants in an LD region. \n \n Conclusion: The Landscape of Regulatory Variation \n Taken together, these studies both highlight a fact that I find myself repeating many times: a significant fraction of functional variation in the human genome lies outside the exons of known protein-coding genes . The ENCODE provides a resource for us to begin exploring possible regulatory roles of variants in human disease. As our understanding of the noncoding portion of the genome improves, it will become even more apparent that whole-genome sequencing (and not exome sequencing) will be required to characterize the full extent of phenotypically-relevant genetic variation in humans. \n References \n Vernot B, Stergachis AB, Maurano MT, Vierstra J, Neph S, Thurman RE, Stamatoyannopoulos JA, & Akey JM (2012). Personal and population genomics of human regulatory variation. Genome research, 22 (9), 1689-97 PMID: 22955981 \n Schaub MA, Boyle AP, Kundaje A, Batzoglou S, & Snyder M (2012). Linking disease associations with regulatory information in the human genome. Genome research, 22 (9), 1748-59 PMID: 22955986"], "link": "http://feedproxy.google.com/~r/Massgenomics/~3/mEFmToGD75o/encode-regulatory-variation-in-the-human-genome.html", "bloglinks": {}, "links": {"http://massgenomics.org/": 4, "http://www.nih.gov/": 2, "http://genome.cshlp.org/": 2, "http://www.hapmap.org": 1}, "blogtitle": "MassGenomics"}, {"content": ["Upon completion of the draft sequence of the human genome, it quickly became apparent that only a fraction of DNA (1-3%) comprised known protein-coding genes. This gave rise to the somewhat mistaken notion that ~98% of the genome contains “junk DNA” with no purpose or function. We know, of course, that noncoding portions of the human genome contain functional elements contributing to phenotypic variation. We simply didn’t know what they were. \n In 2003, two large-scale consortia undertook ambitious efforts to understand the variation and function in the human genome. The first of these efforts took the form of the International HapMap Project and later the 1,000 Genomes Project , whose goal was to characterize human genetic variation. A second, perhaps less-hyped initiative (called the Encyclopedia of DNA Elements , or ENCODE) set out to delineate all functional elements in the human genome. \n ENCODE Papers Are Out \n This month, the tremendous efforts of the ENCODE Project Consortium have borne fruit with 30 publications in Nature, Genome Research , and Genome Biology . The main paper in Nature describes the initial production and analysis of 1,640 datasets, encompassing diverse experiments within several cell types to characterize regions of RNA transcription, protein-coding sequences, transcription factor binding sites, chromatin structure, and DNA methylation regions in the human genome. \n The ENCODE Dataset \n Here’s a brief summary of the dataset described in the main paper: \n \n \n \n Element \n Approach \n Description \n \n \n Genes and RNAs \n Annotation \n Automated and manual annotation to produce the GENCODE reference gene set (v7) of protein-coding genes, pseudogenes, and non-coding RNAs. \n \n \n Transcribed regions \n RNA-seq \n An extensive RNA expression catalogue from different cell lines and multiple subcellular fractions. \n \n \n Transcription start sites \n CAGE-seq \n 5′ cap-targeted RNA isolation and sequencing identified 62,403 high confidence TSSs. \n \n \n Full-length RNAs \n RNA-PET \n Simultaneous capture of RNAs with both a 5′ methyl cap and a poly-A tail \n \n \n Protein-coding regions \n Mass spec \n Peptide sequences identified by mass spectrometry in two cell lines (K562 and GM12878) \n \n \n TF binding sites \n CHiP-Seq \n Mapping binding locations of 119 transcription factors and several RNA polymerase components in 72 cell types. \n \n \n Open chromatin \n DNase-Seq & footprinting, FAIRE \n Sequencing of DNase I hypersensitive sites in (125 cell types), FAIRE analysis of reduced nucleosome crosslinking (25 cell types), and genomic DNase I footprinting (41 cell types). \n \n \n Histone modification \n CHiP-Seq \n Assays for up to 12 histone modifications and variants in 46 cell types \n \n \n DNA methylation \n RRBS \n Reduced representation bisulfite sequencing to profile 1.2m CpGs in 82 cell lines and tissues \n \n \n Chromosome interactions \n 5C and ChiA_PET \n Chromosome conformation capture carbon-copy (5C) in a targeted 1% (4 cell types). Genome-wide chromatin interaction analysis with paired tag sequencing (ChIA-PET) of PolII CHiP in 5 cell types. \n \n \n \n Study Highlights \n It would take me weeks to carefully review and digest these 30 publications. There’s just so much discovery that was enabled by the massive dataset. Here, I’ll give you some highlights from the main paper. In the next week, as time allows, I’ll follow up on some of the companion studies that I found particularly interesting. Here we go. \n GENCODE Annotation \n Gencode version 7 is the default annotation for ENCODE integrated analysis. It includes: \n \n 20,687 protein-coding genes with 6.3 alternatively spliced transcripts per locus, whose coding exons encompass 1.22% of the genome . \n 11,224 pseudogenes , of which 863 were transcribed and associated with active chromatin. \n 8,801 small RNAs and 9,640 curated long ncRNAs \n \n Transcribed and Protein-coding Regions \n One of the most striking findings of the ENCODE pilot project was that the genome is pervasively transcribed; an estimated 60-80% of bases were present in at least one transcript. That observation has been confirmed and extended using the latest in RNA sequencing technologies: \n \n 62% of genomic bases are reproducibly represented in sequenced long RNA molecules or GENCODE exons \n CAGE-seq revealed 62,403 transcription start sites (TSSs) of which 27,362 (44%) were within 100 bp of the 5′ end of a GENCODE transcript or known mRNA transcript. \n A significant portion of coding and non-coding transcripts were processed into stable small RNA precursors — tRNA, miRNA, snRNA, and snoRNA — and their processed products tend to align with the capped 5′ ends of long transcripts. \n \n I think that this latter point may suggest that small RNAs are generally processed from larger transcripts and, once processed, their 5′ ends line up right where 5′ capping occurs. If I understand this correctly, it means that the final product is a capped (and therefore stable) small RNA . \n Protein-binding Regions \n ChIP-Seq is a powerful tool to study genetic regulation, because it enables one to accurately identify regions of DNA bound by specific proteins, such as transcription factors or RNA Polymerase II components. The authors applied CHiP-Seq with 119 different DNA-binding proteins (including 87 sequence-specific transcription factors) to 72 cell types, finding: \n \n 636,336 binding regions spanning 231 megabases ( 8.1% of the genome ) were enriched for DNA-binding across all cell types \n 86% of DNA segments occupied by sequence-specific transcription factors contained a strong DNA binding motif ; in most cases (55%) the known motif for the transcription factor was the most enriched. \n CHiP-Seq peaks lacking cognate binding motifs had 21% lower median scores, and most (82% of them) had high-affinity recognition sequences for other factors. \n \n This last observation indicates that CHiP-Seq peaks that didn’t contain known binding motifs are either lower-affinity sites or were captured through the transcription factor’s interaction with other proteins. \n Open Chromatin and DNAase I Hypersensitivity \n Regulatory elements tend to occur in regions of open chromatin (euchromatin), where they are accessible to transcription factors and other proteins. In contrast, closed chromatin (heterochromatin) is inaccessible because it’s tightly wrapped around nucleosomes. When chromatin preparations are exposed to formaldehyde, those nucleosomes are physically cross-linked to the heterochromatic DNA wrapped around them. A phenol extraction then allows one to sequence and map the crosslinked DNA fragments. It then becomes possible to search for the reduced nucleosomal crosslinking associated with open chromatin and regulatory DNA. This technique, called formaldehyde-assisted isolation of regulatory elements (FAIRE), enabled ENCODE to map 4.8 million sites of reduced crosslinking across 25 cell types. \n The DNase I restriction enzyme cleaves regions of open chromatin , and it preferentially does so at places where, nearby, there are non-histone proteins bound to DNA. Sequencing the cut-points of DNase I (DNase-Seq) identifies these DNAse I hypersensitive sites (DHSs) , which are about 200 bp long. Interestingly, within each DHS are short (10 bp) sequences that were not cleaved, because they were protected by the bound protein. This process, called genomic DNase I footprinting, makes for a clever system of isolating isolating cis-regulatory sequences, and is nicely illustrated in this figure: \n \n \n  \n Genomic DNase I footprinting (Hesselberth et al, Nature Methods 2009). \n \n \n Employing DNase-Seq and genomic DNase I footprinting, ENCODE found: \n \n 2.89 million unique, non-overlapping DHSs in 125 cell types. Many coincided with the sites of reduced nucleosome crosslinking identified by FAIRE. \n 8.4 million distinct DNase I footprints across 41 cell types. Motif discovery in these recovered 90% of known transcription factor motifs, plus hundreds of novel (and evolutionarily conserved) motifs. \n \n Many of the novel motifs displayed occupancy patterns that were highly cell-type-specific, similar to the patterns observed among major developmental and tissue-specific regulators. \n Epigenetic Codes: DNA Methylation and Histone Modification \n Methylation of cytosine bases is an epigenetic mechanism by which gene expression is regulated. Methylation of promoters (which are often rich in CpG dinucleotides) is usually associated with repression, whereas methylation of genic regions typically correlates with transcription. ENCODE used reduced representation bisulfite sequencing (RRBS) to profile DNA methylation at 1.2 million CpGs in each of 82 cell lines, finding that: \n \n 96% of CpGs exhibited differential methylation in at leas one cell or tissue type \n Levels of DNA methylation correlated with chromatin accessiblity \n The CpGs with the most variable methylation levels were more often in gene bodies and intergenic sequences than in upstream regulatory regions. \n \n This last observation seems to indicate that promoter methylation does not play a significant role in regulation of gene expression between tissues. \n Regions of Chromosome Interaction \n We often think of the human chromosomes as linear, anaphase-type bodies, a notion reinforced by the graphical depiction of chromosomes as linear two-dimensional objects on, say, the UCSC genome browser. In truth, human chromosomes are tightly organized and packed into the nucleus, a situation which causes physical interaction between regions that might be hundreds of kilobases apart. This interaction is thought to be important in regulation of gene expression. To study it, ENCODE utilized two approaches based on chromosome confirmation capture (3C), in which physically interacting regions are cross-linked by formaldehyde, and isolated from non-interacting chromatin with restriction enzymes. Isolation and sequencing of the cross-linked regions (by carbon-copy 3C, or “5C”), enables characterization of interactions with base-level resolution. A complementary approach, chromatin interaction analysis with paired-end tag sequencing (wonderfully abbreviated ChIA-PET), lets you first enrich for chromatin bound by a specific protein. In ENCODE’s case, they performed ChIA-PET of PolII-enriched chromatin in five cell types. \n \n By applying 5C to a targeted 1% of the genome in 4 cell types, ENCODE discovered hundreds of significant interactions \n On average, 3.9 distal elements interact with a TSS, and 2.5 TSSs are associated with each distal element \n In K562 cells, there were 127,417 promoter-centered chromatin interactions, 98% of which were intra-chromosomal \n The majority of involved promoters participated in multi-gene interaction complexes (often spanning megabases) including promoter-promoter and promoter-enhancer interactions. \n \n As the authors put it, these analyses “portray a complex landscape of long-range gene-element connectivity across ranges of hundreds of kilobases to several megabases, including interactions among unrelated genes.” As if we needed more genetic complexity! \n Conclusion: A Note on Big Science \n Big science has yielded some of the most important advances in human genetics and genomics. Efforts such as the HapMap Project and 1,000 Genomes Project have characterized human genetic variation at an unprecedented scale. The Cancer Genome Atlas is building a road map of the genetic and molecular properties of common cancers. And now, the ENCODE Consortium has provided us exactly what they promised: an encyclopedia of the functional elements in the human genome. \n References \n ENCODE Project Consortium (2012). An integrated encyclopedia of DNA elements in the human genome. Nature, 489 (7414), 57-74 PMID: 22955616"], "link": "http://feedproxy.google.com/~r/Massgenomics/~3/WZf_QE3lcE0/a-new-guide-to-human-genome-content-and-function.html", "bloglinks": {}, "links": {"http://www.1000genomes.org": 1, "http://massgenomics.org/": 1, "http://www.genome.gov/": 2, "http://www.nature.com/": 2, "http://www.nih.gov/": 1, "http://www.hapmap.org": 1}, "blogtitle": "MassGenomics"}, {"content": ["It occurred to me recently, while refereeing a manuscript, that publication in research is a lot more forgiving than publication in fiction. I’d just read a rather long-winded introduction section and noted several grammatical errors. This is not uncommon during peer review, but it continues to surprise me. Granted, some authors may not be writing in their native language, in which case small mistakes are bound to happen (and perhaps slightly more forgivable). But often it’s just a lack of proofreading. \n Competition in Science and Fiction Writing \n You might be surprised to learn that the world of fiction writing is substantially more competitive than scientific publication. If this had been a short story or novel (and I an editor or first reader), that manuscript would be in the trash after the third mistake. Top scientific journals receive hundreds of submissions per month, and perhaps 10% of those will be accepted for publication. Magazines that publish fiction receive thousands of submissions per month, and less than 1% will be accepted. \n One reason for this difference is the barrier to entry. Research requires equipment, funding, and expertise. The people who conduct it have generally spent two decades or more in school. And in most cases, it takes a team of such individuals to put a publication together. \n Fiction writing, in contrast, has no barrier to entry. Anyone can do it, though not everyone should. High school dropouts number among the industry’s greatest successes. \n Literary and Peer Review \n Another important difference lies in the process of review. In science, though editors are certainly involved, your manuscript is essentially reviewed by other scientists in your field. They likely have similar qualifications as yours; they might have published similar studies in the same journal. They may very well be competing for the same research funding. But peer reviewers will make an effort to be fair, and if they don’t like your manuscript, they will tell you why. For the most part, they will be polite about it. \n Publishers of fiction don’t have peer review. The first person to read your manuscript is usually someone called a “slush reader.” This is often a poorly-paid recent college graduate (and aspiring editor or publisher) whose job is simple: read everything that comes in, and reject most of it. Unless you’re a bestselling author of some renown, there are no free passes. If there are typos or grammar mistakes, or your story just doesn’t interest them, it will be turned down. Often via the dreaded “form rejection” (a generic letter along the lines of “Dear Author, thanks but no thanks”. Critique and suggestions for improvement are rare. Slush readers and editors just don’t have the time. \n If you’re looking to publish a novel, you can’t even approach major publishing houses directly. First you need a literary agent. This is someone who will help you revise your manuscript and then try to find a publisher for it. Legitimate agents don’t charge anything up front; they’ll collect a 15% commission upon making the sale. But most have full client lists, and might take on one or two new authors per year. \n Credibility and Track Record \n Research and fiction publishing do have something in common: track records matter. Publications are everything, and the more high profile, the better. Biomedical research is a highly competitive field. We are all competing for a limited amount of research funding, and success rates for grant applications are reaching record lows. Publication and recognition directly impact our ability to obtain funding to continue research. Just as important discoveries and landmark publications bring funding opportunities and career success, a lack of thereof will have dire consequences for an investigator’s future. \n In fiction writing, publication credits are equally (if not more) important. To be published indicates that you are capable of writing something that others are willing to read, and that alone is the basic qualification required for professional writers. But the odds of success are daunting. Your chances of having a short story or novel published are perhaps 1%. Your chances of being able to write for a living are much lower than that. \n When all else fails, there’s something else that both researchers and authors can do. They can turn to blogging."], "link": "http://feedproxy.google.com/~r/Massgenomics/~3/f7wFgKipwuk/science-and-science-fiction.html", "bloglinks": {}, "links": {}, "blogtitle": "MassGenomics"}, {"content": ["Next-generation sequencing is a disruptive technology. It’s changed the way we conduct genetic and genomic research, and perhaps more importantly, where that research takes place. Because high-throughput sequencing is accessible not just to large genome centers but to the wider research community. With this “democratization” of sequencing, many things are changing. Virtually any investigator can conduct exome or whole-genome sequencing, if not in their own lab, then with assistance from a service provider. \n As I’ve written before, samples are the new commodity. And as we enter an era of pervasive sequencing, there are significant challenges ahead. \n Human Genetics Sample Challenges \n Exome sequencing promises to help elucidate the genetic basis of many rare inherited disorders. Indeed, NHGRI recently funded several groups to tackle Mendelian diseases with exome sequencing as one of the primary tools. Dozens of disease-causing mutations identified by exome sequencing in the past few years have demonstrated that this approach is fruitful for many such disorders. \n One problem, however, is that Mendelian diseases, particularly those in which the causal mutation remains unknown, tend to be exceptionally rare – often less than 1 case in 10,000 or even 100,000 births. Simply collecting enough samples to even undertake an exome sequencing study is difficult. Given the low barrier to entry for exome sequencing these days, there are undoubtedly many research groups competing for the same samples. \n  \n The most powerful Mendelian disease studies are facilitated by large family pedigrees with multiple affected individuals (and unaffected but related controls), all of whom: \n \n Have been diagnosed (or cleared) by a specialist using standardized criteria \n Are alive and capable of providing a sample \n Are willing to provide a sample \n Agree to sign ever-more-frightening consent forms \n \n Unfortunately, a substantial fraction of family cohorts won’t meet all of these criteria. Crucial family members may have passed away, or moved elsewhere, or simply have no interest in providing a sample. Growing concerns about individual privacy and sample misuse undoubtedly reduce volunteerism. Heck, I’m in the field myself and I’d be nervous about granting someone full access to my genetic information. \n Even if you can get the samples to study a disease of interest, you have to get the right samples. Recent reports of somatic mosaicism — in which the causal mutation in a patient is only present in certain tissues — have highlighted that a blood or saliva sample might not be enough. \n Cancer Genomics Sample Challenges \n Few fields of research have benefited more from next-gen sequencing than that of cancer genomics. \n  Image Credit: Nature \n The genomes and exomes of thousands of human cancers have been characterized already, implicating new genes and pathways, informing diagnosis and prognosis, and highlighting new therapeutic targets. The more we’ve sequenced cancer genomes, the more we’ve come to realize how complex they are: \n \n Many tumors comprise multiple, genetically distinct sub-populations of cancer cells (subclones), each with a different complement of somatic alterations. \n Tumor cells constantly undergo mutation and evolution to compete for growth advantages, to metastasize, to avoid host defenses, and to survive therapy. \n The vast majority of somatic mutations in a tumor genome are unique to that genome. Few are shared (or “recurrent” as we like to say) between tumors from different patients, even when hundreds of tumors of the same type are screened. \n \n One of the collaborating oncologists I work with pointed me to a recent protocol review on measurement of prognostic factors in breast cancer . In it, the authors acknowledged the growing array of tools and technologies for studying human breast tumors, but noted that “Routine pathologic evaluation of a breast cancer must never be compromised by the demand to submit portions of the tumor for special studies.” \n There are many, many studies that could be performed on a tumor specimen, but there’s only so much tumor to go around. Further, when patients undergo treatment prior to the surgery that removes the tumor (this is called neoadjuvant therapy ), the goal is to shrink the tumor. That makes for even less material to study, and now you’re working with a tumor that has been influenced by chemotherapy. \n Fewer Samples and Less DNA \n One interest of many technology development groups is reducing the amount of input DNA (or RNA) required for capture and/or sequencing. My interpretation of their results is simple: the more DNA, the better . And yet for the reasons I’ve outlined above, we’re likely to see less and less available DNA for sequencing experiments. \n Whole-genome amplification (WGA) seems like a reasonable strategy to obtain enough DNA for sequencing. The problem is that WGA tends to produce artifacts that look like low-frequency variants. One can eliminate many of these, but they’re virtually indistinguishable from, say, somatic mutations unique to a minor clone in a tumor sample. \n Immortalized cell lines , such as those created for the HapMap and 1,000 Genomes Projects, provide plenty of high-quality DNA. As much as you want. Unfortunately, cell lines acquire some random mutations during the immortalization process. Not many, but enough that those well-characterized trios are virtually useless for discovering true de novo mutations. \n Formalin fixation and paraffin embedding (FFPE) has been the standard of sample archiving among pathologists for decades. There exist, right now, large collections comprising thousands of well-characterized tumors dating back 20 years or more. There’s treatment response and relapse and other outcome data. But there are a couple of drawbacks to these incredible resources. First, the process of FFPE generates artifactual random mutations due to formalin cross-linking of cytosines on either strand, leading to misincorporation of adenosines during PCR. Also, the matched normal tissue for these samples may not be available, making it impossible to determine if a mutation is truly somatic. \n Sample Ethics and Propriety \n A growing number of ethical and legal issues surrounding human samples and DNA sequencing have become more prominent in recent years. The recognition of how valuable certain samples are becoming has already caused legal spats between investigators and their institutions. Who owns the sample? The clinician or his employer? In the future, access (and rights) to a relevant cohort will be an even more important part of grant applications. \n There are many ethical angles to consider, enough that I hesitate to scratch the surface. I’ll mention two concerns: first, one of privacy. As we learn more about genetic variation and its role in disease, the predictive power (and perceived predictive power) of genetic information grows. What if that gets into the wrong hands? \n I know, we have GINA legislation. Still, one could easily picture a nefarious corporation that, when interviewing potential employees, collects the candidate’s empty soda can and puts it into a clear plastic bag for quiet testing with a loyalty-productivity-intelligence-longevity SNP chip. \n For any patient considering an informed consent document, there are uncountable considerations. Because your genetic information does not just belong to you. Thanks to bioinformaticians like us, when you grant access to your genome or exome data, you’re not just revealing things about you. We’ll learn about your parents and grandparents. We’ll know something about your children or future children. \n A sample’s not just a sample any longer. It’s a family legacy. \n References \n Yost SE, Smith EN, Schwab RB, Bao L, Jung H, Wang X, Voest E, Pierce JP, Messer K, Parker BA, Harismendy O, & Frazer KA (2012). Identification of high-confidence somatic mutations in whole genome sequence of formalin-fixed breast cancer specimens. Nucleic acids research, 40 (14) PMID: 22492626"], "link": "http://feedproxy.google.com/~r/Massgenomics/~3/p8b9FnPzOh0/sample-challenges-in-an-era-of-pervasive-sequencing.html", "bloglinks": {}, "links": {"http://massgenomics.org/": 3, "http://www.hapmap.org": 1, "http://www.nih.gov/": 1, "http://www.1000genomes.org": 1, "http://www.uptodate.com/": 1}, "blogtitle": "MassGenomics"}, {"content": ["Many, if not most human diseases have a genetic component. Thanks to advances in next-gen sequencing, a plethora of studies in recent years have shed light on the role of germline variants in heritable diseases, and of somatic mutations in cancer. They are also beginning to unravel the role of true de novo mutations — genetic variants that arise in a child but are not present in either parent — in human disease. This was the subject of an excellent article just out in Nature Reviews Genetics . Let me give you the highlights. \n Most of what we know about de novo mutations in humans comes from recent whole-genome and exome sequencing studies in families: \n \n On average, humans acquire ~74 de novo single nucleotide variants (SNVs) per genome per generation. \n The rate of de novo mutations seems higher in individuals with genetic diseases, particularly sporadic disorders such as intellectual disability and autism. \n Perhaps surprisingly, the de novo mutational load seems correlated with paternal (as opposed to maternal) age. \n Mutations linked to sporadic disease are usually highly disruptive to gene function, often affecting important domains of developmental genes. \n \n Diseases Linked to de novo Mutations \n De novo mutations tend to be more deleterious than inherited variation because they haven’t undergone the same level of evolutionary selection. This fact, combined with the observation that they occur with some appreciable frequency, makes de novo mutation an an intriguing explanation for sporadic diseases. In support of this notion, recent family-based exome sequencing studies have implicated de novo mutations in a number of rare syndromes. \n \n \n \n Gene \n Product \n Disorder \n \n \n SETBP1 \n SET binding protein 1 \n Schinzel-Giedion syndrome (mental retardation and neurodegeneration). \n \n \n MLL2 \n Mixed-lineage leukemia 2 \n Kabuki syndrome (intellectual disability and congenital anomalies). \n \n \n ASXL1 \n Additional sex-like combs 1 \n Borhing-Opitz syndrome (severe intellectual disability and congenital malformations. \n \n \n ANKRD11. \n Ankyrin repeat domain 11 \n KBG syndrome (facial/skeletal malformations and developmental delay). \n \n \n CHD7. \n Chromodomain helicase DNA binding protein 7 \n CHARGE syndrome (birth defects, heart defects, breathing problems). \n \n \n ACTB/ACTG1 \n Actin beta / actin gamma 1 \n Baraitser-Winter syndrome (brain malformation). \n \n \n AKT1 \n V-akt murine thymoma viral oncogene homolog 1 \n Proteus syndrome (skin overgrowth and atypical bone development). \n \n \n \n The last example, Proteus syndrome, does not run in families but has been reported in discordant monozygotic twins . Intriguingly, the causal mutation was only identified when exome sequencing was performed on the disease overgrowth tissue; it was absent from peripheral blood. This phenomenon of somatic mosaicism has since been observed in other sporadic disorders. \n Challenges for Detection of de novo Mutations \n The authors of this article are well-informed, and they take particular care to highlight some of the challenges facing de novo mutation discovery. True mutations are quite rare, which means that the vast majority of initial predictions from next-gen sequencing will likely be artifacts. A search for variants found in a child but absent from both parents will enrich for two types of errors: false positives found only in the child, and false-negatives that were simply missed in one or both parents. Indeed, when I heard about some of the first attempts to characterize de novo variants by whole genome sequencing, the false positive rate was >99%. \n Since sequencing mother-father-child trios is the preferred method to discover these mutations, one immediately thinks of an outstanding resource: the CEU (CEPH European) and YRI (Yoruban) trios that were part of the HapMap and later 1,000 Genomes projects. These are among some of the most extensively characterized genomes in the world, from genotyping to sequencing to gene expression to cellular phenotyping. Unfortunately, while the DNA from these samples is readily available, it comes from lymphoblastoid cell lines (LCLs). LCLs harbor mutations of their own due to immortalization and culturing. A similar difficulty would be encountered with WGA DNA. \n Because true de novo mutations occur randomly (and newly) in individuals, there’s no database like dbSNP to guide discovery. We must instead rely on deeper sequence coverage, better algorithms, and ultimately, orthogonal validation. \n Large Forms of De Novo Mutation \n True de novo mutations need not be SNVs. Cytogenetic analysis has been used to characterize large-scale de novo events (such as trisomy 21 in Down Syndrome) for decades. Deletions and duplications have been linked to mental retardation for some time, initially using microarray technology. More recent studies have estimated that  large (>100 kbp) de novo CNVs occur in about 1 in 50 individuals. Undoubtedly there are smaller structural variants and indels that we simply aren’t yet able to detect accurately. \n Predicting Phenotypic Consequences of de novo Mutations \n Even when true de novo mutations have been characterized, predicting their phenotypic consequences presents a number of challenges. In coding sequences, the best evidence to implicate a gene requires looking across a significant number of samples, to find genes that: \n \n Harbor mutations in multiple (unrelated) cases with a similar phenotype, and \n Lack similarly damaging mutations in populations of unaffected individuals \n \n This evidence can be bolstered, of course, with information from model organisms, functional assays, pathway analysis, and evolutionary conservation of the affected nucleotides. \n The realization that de novo mutations are collectively common across human populations (~74 per individual) suggests that they may contribute to common disease susceptibility as well. The authors deduce that for any given genetic disease, the proportion of cases due to de novo mutation will be high if: \n \n   Monogenic causes predominate \n   The number of dominant disease-associated genes is high \n   Dominant mutations have strongly negative fitness effects, which reduces the likelihood that inherited variation plays a role due to natural selection. \n \n Conversely, if dominant mutations have modest fitness effects, then inherited variants likely play a larger role because they’re far more numerous. \n Maternal and Paternal Age and Social Change \n The long-known fact that maternal age is correlated with incidence of aneuploidy in offspring, and the recent observation that the number of de novo SNVs correlates to paternal age, have important implications in light of this trend: people are waiting longer to start families. Average maternal and paternal ages have risen steadily for decades. \n \n \n  \n \n Fraction of New Mothers Aged >35 (R. Resta, AJMG 2005) \n \n While there are many social and economic factors contributing to this, the biology is unchanged. This suggests that the number of diseases caused by de novo mutations, too, is probably on the rise. \n References \n Veltman JA, & Brunner HG (2012). De novo mutations in human genetic disease. Nature reviews. Genetics, 13 (8), 565-75 PMID: 22805709"], "link": "http://feedproxy.google.com/~r/Massgenomics/~3/DI2cdA2MldI/de-novo-mutations-and-human-disease.html", "bloglinks": {}, "links": {"http://massgenomics.org/": 1, "http://www.nih.gov/": 1, "http://bestoftwins.com/": 1}, "blogtitle": "MassGenomics"}, {"content": ["A study now online at Cell employs has revealed new insights about the normal processes of aging and mutation, and their role in development of acute myeloid leukemia (AML). \n  \n \n Mutation and Evolution in AML: Full Disclosure \n \n Most tumors harbor numerous somatic mutations, but only a fraction are believed to contribute to cancer development and growth. In fact, most malignancies are thought to arise after a single initiating event, which may lead to genomic instability and thereby cause additional mutations. Through a process called clonal evolution, tumor cells acquire mutations and undergo natural selection for growth advantages. \n Thus, many tumors (especially solid tumors) are not a uniform mass of identical cells, but a heterogeneous mixture of different cell subpopulations. They share the initiating mutation thanks to their common ancester, the “founding clone.” But they might have developed hundreds or thousands of mutations on their own. That’s one of the challenges faced by those of us who sequence cancer genomes. Among dozens of somatic coding mutations, which ones are the initiators, and which are just along for the ride? \n Why Sequence AML? \n AML offers an opportunity to study these processes because genomic instability is rare, and it’s believed that there are only a few initiating mutations. In this study, our group performed whole-genome sequencing on 24 AML cases. Twelve of these were FAB type M3, where the initiating event, a PML-RARA fusion, is known. The other twelve were FAB type M1 with normal cytogenetics, where the initiating event is usually unclear. \n Mutations in AML \n The success of this study in characterizing mutations in AML comes from two important components: \n \n Systematic validation by custom capture and deep sequencing of somatic SNVs, indels, and structural variation. This not only confirmed which predicted events were valid somatic mutations (an important step because these are rare), but provided deep read counts by which we could compute accurate allele frequencies and examine tumor clonality. \n Extension of the analysis to additional AML cases (53 M1 and 31 M3), in we screened for additional mutations in the 384 mutated genes. This provided a better picture of the prevalence of recurrent mutations in AML. \n \n Among the 108 genomes assessed, there were 23 genes harboring non-silent mutations in at least three independent tumors, suggesting an important role in tumor development or growth. We observed an average of 14.5 “tier 1″ (coding) mutations per tumor in the 24 WGS cases; on average, ~3 of these affected recurrently mutated genes in M1 tumors, and ~2 affected recurrently mutated genes in M3 tumors. This fits nicely with the idea that M1 genomes harbor an initiating mutation, a “driver”, analogous to the known driver ( PML-RARA ) in M3 genomes. \n Driver Mutations in M1 Leukemia \n Because the driver in M3 genomes is known, any mutations we find in M3 genomes aren’t likely to be initiating events. FLT3 mutations, for example, often co-occurred with PML-RARA in M3 genomes and are already known to be a cooperating (but not initiating) alterations. Therefore, we looked for genes recurrently mutated only in M1 genomes, and there were three: \n \n NPM1 , a classic mutation known to be pathogenic in AML \n DNMT3A , encoding a DNA methyltransferase and found in the last couple of years to be recurrently mutated across various liquid tumors and even solid tumors \n IDH1 , encoding isocitrate dehydrogenase 1, a gene with a “mutational hotspot” at amino acid 132, first observed in glioblastoma, and since found to be recurrent in numerous tumors including AML. \n \n Background Mutations in Hematopoietic Stem Cells \n \n \n  \n \n Welch et al, Cell 2012. \n \n Now comes a second part of the study, something that sets it apart from other cancer sequencing efforts. We obtained human hematopoietic stem cells (the progenitors of blood cells) from 7 healthy volunteers of different ages (cord blood from newborns all the way to 70 year olds). For each sample, single HSCs were isolated and grown into colonies of homogenous cells to obtain enough DNA for exome sequencing. The exomes of each HSC colony were then compared to those of a matched blood normal, whose cells are produced by an estimated 1,000 operating HSCs. The idea is to determine, in healthy people, whether HSCs accumulate background mutations over time. \n As it happens, yours truly had the task of analyzing HSC exomes and identifying somatic mutations. Here’s the thing about somatic mutation detection: the more mutations there are, the easier it gets . That’s why it’s possible to have a very high validation rate (>90%) for somatic mutations in solid tumors like lung cancer. There are just so many good, high-confidence mutations that the majority of them validate. \n The HSC exomes, however, tended to have very few coding mutations (bad news for me, but good news for the healthy volunteers). Even with such tools as VarScan 2 and SomaticSniper, it was not an easy task. But we got it done, and the findings were striking: the number of coding mutations in HSC exomes directly correlated with the age of the volunteer . Cord blood cells from a newborn had virtually none, young people in that key disposable income marketing demographic had relatively few. Only over-the-hill volunteers in their 40′s and 50′s had appreciable numbers (5-9 mutations), and the 70-year-old had the most. \n Mutations Correlate with Age in HSCs and AML \n So mutations in the hematopoietic stem cells of healthy volunteers seemed to accumulate over time. Intriguingly, when AML patients were segregated by age, the correlation was also apparent. In other words, the number of mutations in both AML tumors and the stem cells from which they arise are correlated with age. Not only that, they’re similar in number and distribution across the mutation spectrum: \n \n \n  \n \n Welch et. al, Cell 2012 \n \n Background Mutation, Tumor Initiation, and Progression \n This suggests that the majority of mutations in AML are random background mutations that occurred in HSCs. Then, an initiating mutation was acquired (e.g. NPM1 or PML-RARA ) . At that point, the background mutations in the cell were “captured” and carried forward as the progenitor gave rise to AML. \n \n \n  Welch et al, Cell 2012 \n Cells from the founding clone sometimes acquired additional cooperating mutations (e.g. FLT3 ), yielding subclones that may have contributed to progression or relapse. \n These findings reinforce many things that we already know: that mutations acquire gradually with age, that most of the mutations in AML (and likely other tumors) are random background events not contributing to tumorigenesis, and that subsequent mutation and evolution can give rise to subclones that ultimately determine cancer progression and response to therapy. \n References \n Welch JS, Ley TJ, Link DC, Miller CA, Larson DE, Koboldt DC, Wartman LD, Lamprecht TL, Liu F, Xia J, Kandoth C, Fulton RS, McLellan MD, Dooling DJ, Wallis JW, Chen K, Harris CC, Schmidt HK, Kalicki-Veizer JM, Lu C, Zhang Q, Lin L, O’Laughlin MD, McMichael JF, Delehaunty KD, Fulton LA, Magrini VJ, McGrath SD, Demeter RT, Vickery TL, Hundal J, Cook LL, Swift GW, Reed JP, Alldredge PA, Wylie TN, Walker JR, Watson MA, Heath SE, Shannon WD, Varghese N, Nagarajan R, Payton JE, Baty JD, Kulkarni S, Klco JM, Tomasson MH, Westervelt P, Walter MJ, Graubert TA, Dipersio JF, Ding L, Mardis ER, & Wilson RK (2012). The origin and evolution of mutations in acute myeloid leukemia. Cell, 150 (2), 264-78 PMID: 22817890"], "link": "http://feedproxy.google.com/~r/Massgenomics/~3/0ywPA51IvwU/aging-mutations-and-leukemia.html", "bloglinks": {}, "links": {"http://massgenomics.org/": 3, "http://www.nih.gov/": 2, "http://varscan.sourceforge.net": 1}, "blogtitle": "MassGenomics"}, {"content": ["Four-year-old Maya Neider has undergone multiple operations, is unable to speak, and has difficulty hearing. Her parents have taken her to numerous physicians; she’s undergone extensive testing, but no explanation for her developmental delay could be found. Doctors agreed that a genetic cause was likely, but a battery of genetic tests came back negative. \n So Maya’s parents turned to next-gen sequencing and the generosity of strangers. About a year ago, they created a personal genome project for Maya and raised donations on the internet to fund it . Within seven hours, donors from across the United States, most of them donating between $5-50, had raised the $3500 necessary for exome sequencing. \n The sequencing and analysis were coordinated by the Rare Genomics Institute , a non-profit organization that hopes to help children with rare genetic diseases using sequencing and other biotechnology. This week, researchers believe they’ve identified the cause of the disorder: a novel mutation in a gene that’s active in fetal development and early childhood. \n While the gene and precise location of the mutation are under wraps until publication, I’m told it’s a nonsense (protein-truncating) mutation that’s not been seen in any public databases. It’s also not present in either parent , meaning it was a de novo mutation in the child. \n Maya appears to have a completely new disease. Now that its genetic basis is known, studying the causal gene and its encoded protein may lead to a better understanding of her disease. \n Concerns: Personal Genomics and Press Releases \n There are obviously some treacherous ethical and legal waters that efforts such as these will face moving forward. We know the name of the patient, her parents’ names, and we’ll eventually know much about their genetic makeup. In 20 years, will Maya want to be known as the “first crowd-funded exome diagnosis” or would she prefer to have remained anonymous? These are difficult questions to answer. \n My other concern is that this is yet another example of genomics by press release. RGI is making some bold claims, clearly hoping to get some press attention (I found out about this because I was approached by their media relations people). Where’s the paper? I’m excited about the potential of this project, but until it’s accepted by a peer-reviewed publication, there’s no reason to believe the results. What if the science or algorithms were flawed? What if the results are unsound? \n Wait until the paper is accepted, and then send out your press releases. That’s the rule we all are trying to play by. You’d better have a pretty good reason to break it, and I don’t see one here. \n Crowdfunding and Families with Rare Diseases \n That being said, I’m writing about this because it’s a good story. Friends, relatives, and total strangers made cash donations, in tough economic times, to help this little girl. \n As Daniel MacArthur ( @dgmacarthur ) put it on Twitter, this story makes me feel good about humanity. \n Exome and whole-genome sequencing have enabled the discovery of many causal variants behind rare disorders, but this is the first time it’s been accomplished by raising funds on the internet. The “crowd-funding” model, as it’s called, may offer some hope to the thousands of families dealing with a rare genetic disorder . The majority of them won’t have the opportunity to be studied in a government-funded research. And next-gen sequencing isn’t usually covered by health insurance. If they can raise the funds on their own, however, a genetic diagnosis may be possible. \n It will not come easy. The analysis and interpretation of sequence data requires considerable time and expertise. And as I’ve recently written, exome sequencing does not guarantee an answer even for Mendelian diseases . Even so, discoveries are possible. That likely provides a glimmer of hope for those with rare genetic disorders."], "link": "http://feedproxy.google.com/~r/Massgenomics/~3/jcIcnv6-UW4/crowd-funded-exome-sequencing-for-rare-genetic-diseases.html", "bloglinks": {}, "links": {"http://massgenomics.org/": 2, "https://twitter.com/": 1, "http://www.raregenomics.org": 1}, "blogtitle": "MassGenomics"}]