[{"blogurl": "http://mathblogging.wordpress.com\n", "blogroll": [], "title": "Mathblogging.org -- the Blog"}, {"content": ["Mathematical Instruments. \n  via Wikimedia Commons \n This post is part of the series Mathematical Instruments in which we introduce you to some of the math bloggers listed on our site. Today: \n \n John D. Cook — The Endeavour \n Any places like Twitter, Google+, Facebook, etc. we can find you on? \n I have a personal Twitter account, @JohnDCook, and I have a dozen Twitter accounts where I schedule daily tips on various topics, mostly related to math and computing. There’s a list here: http://www.johndcook.com/twitter/ . \n I’m also on Google+ . \n Would you tell us a little bit more about yourself? E.g., Where are you coming from (both geographically and philosophically)? What is your background? Any scientific education? \n I live in Houston, Texas. I did a PhD in math at University of Texas, then a postdoc at Vanderbilt. After that I left academia and worked as a software developer for a few years. Now I’m working in biostatistics at M. D. Anderson Cancer Center. \n When and how did you first discover mathematical blogs? \n It’s funny, but I don’t remember. \n When did you start blogging? \n January 2008. \n What do you write about? \n I write about math and computing the most, but I also write about other topics: creativity, books, coffee, anything I think other people might find interesting. \n What wouldn’t have happened to you without the internet? \n There are a lot of people I wouldn’t know, and a lot of ideas I would not have been exposed to. But I also might have had deeper friendships and been more focused. \n What does the internet need more of? \n People with patience and a sense of humor. \n Your daily web reading (mathematical or otherwise): \n I subscribe to a lot of blogs, but most of them don’t post very often, so the mix changes. I enjoy reading “ What’s New ” from Terry Tao when I can understand it. “ God plays dice ” and “ Division by Zero ” are a couple good math blogs. Ribbonfarm  is thought-provoking. Twenty two words is a lot of fun. \n  \nMathblogging.org — The Blog by mathblogging.org is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License . \nPermissions beyond the scope of this license may be available at http://www.mathblogging.org ."], "link": "http://mathblogging.wordpress.com/2012/10/26/the-endeavour/", "bloglinks": {}, "links": {"http://www.johndcook.com/blog": 1, "https://plus.google.com/": 1, "http://www.mathblogging.org": 1, "http://twentytwowords.com/": 1, "http://creativecommons.org/": 2, "https://gottwurfelt.wordpress.com/": 1, "http://divisbyzero.com": 1, "http://www.ribbonfarm.com/": 1, "http://www.johndcook.com/": 1, "https://commons.wikimedia.org/": 1, "http://feeds.wordpress.com/": 1, "http://mathblogging.wordpress.com/": 1, "http://terrytao.wordpress.com/": 1}, "blogtitle": "Mathblogging.org -- the Blog"}, {"content": ["Mathematical Instruments. \n  via Wikimedia Commons \n This post is part of the series Mathematical Instruments in which we introduce you to some of the math bloggers listed on our site. Today: \n Mr. Honner — Patrick Honner \n What’s your blog’s name? Any other places we can find you on (Twitter, Google+, Facebook etc)? \n MrHonner.com ,  @MrHonner on twitter,  +PatrickHonner on G+,  Mr Honner on Facebook. \n Would you tell us a little bit more about yourself?  E.g., Where are you coming from (both geographically and philosophically)? What is your background?  Any scientific education? \n I’m a math teacher in Brooklyn, New York.  I teach at Brooklyn Technical High School (a “specialized” HS in NYC with around 5,000 students).  I teach Math Research, Single and Multivariable Calculus, and other courses. \n I have a BS in Math, a BA in Philosophy, an MA in Math, and an M Ed in Math Education. \n When and how did you first discover mathematical blogs? \n I’m not sure it’s a “blog”, but Alexander Bogolmony’s “Cut the Knot ” was one of the first math sites I used heavily, both for teaching and learning. I probably started stealing his stuff in the early 2000′s. Wolfram Mathworld was around back then, as well as the Math Forum . \n When did you start blogging? \n I started blogging in June, 2010. \n Why did you start? \n I wanted to explore blogging as a teaching and learning tool, and I figured I’d start by curating some of the wonderful mathematical content out there for my students. My hope was to extend our mathematical conversation beyond the physical classroom and the daily schedule. \n What do you write about? \n I primarily write about my mathematical experiences. I encounter mathematics all the time in my life and I try to share those encounters with my students, other teachers, and other math enthusiasts. \n I also post mathematical photography and occasionally share my thoughts and ideas about teaching and learning. \n What wouldn’t have happened to you without the internet? \n I probably would have traveled less. I probably wouldn’t have been able to maintain so many good relationships throughout the years. I wouldn’t have learned as much, or as quickly. I wouldn’t have met such a wide variety of interesting and inspiring people. \n What does the internet need more of? \n Real conversation and real collaboration. \n Mathematicians on the web have… \n Greatly influenced me as a teacher and a mathematician. I routinely get great ideas to share with my students from the digital mathematics community, and it’s fun to observe and interact with working mathematicians and participate in their conversations. \n Your daily web reading (mathematical or otherwise): \n Twitter \nNYT \nESPN \nCNN \n  \nMathblogging.org — The Blog by mathblogging.org is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License . \nPermissions beyond the scope of this license may be available at http://www.mathblogging.org ."], "link": "http://mathblogging.wordpress.com/2012/10/20/mr-honner/", "bloglinks": {}, "links": {"http://mathforum.org/": 1, "https://twitter.com/": 1, "http://feeds.wordpress.com/": 1, "https://plus.google.com/": 1, "http://mathworld.wolfram.com/": 1, "http://www.cut-the-knot.org/": 1, "http://creativecommons.org/": 2, "http://www.bths.edu/": 1, "http://www.mathblogging.org": 1, "https://commons.wikimedia.org/": 1, "http://mathblogging.wordpress.com/": 1, "http://www.mrhonner.com/": 2, "http://www.facebook.com/": 1}, "blogtitle": "Mathblogging.org -- the Blog"}, {"content": ["Mathematical Instruments. \n  via Wikimedia Commons \n This post is part of the series  Mathematical Instruments  in which we introduce you to some of the math bloggers listed on our site. Today: \n \n Katie Steckles –  The Aperiodical \n What’s your blog’s name? Any other places (Twitter, Google+, Facebook  etc) we can find you on? \n I blog as part of the Aperiodical , a shared maths blogging outlet started by myself, Peter Rowlett and Christian Perfect. I’m on Twitter as @stecks , and also on G+ and FB. I’m terrifyingly easy to find on the internet. \n Would you tell us a little bit more about yourself? E.g., Where are  you coming from (both geographically and philosophically)? What is your  background? Any scientific education? \n I’m a maths communicator, which means I give talks about maths and perform at science festivals and basically anywhere people will pay me to come and do maths in front of a crowd. I started doing this during the latter stages of my pure maths PhD, which I finished last summer and have since been building up a freelance career. I believe maths is a fantastic subject and something people can really get a lot out of if they give it a fair chance. My work visiting schools is hopefully a way to help people realise it’s about more than the stuff you’re required to learn for your exams, and I try to take maths to places you wouldn’t expect to find it. Doing outreach is really rewarding but it’s not easy, as sometimes maths is seen as the horrible difficult boring subject (and don’t get me wrong, it can sometimes be all three) – there’s a problem with people’s general attitude and I’m hoping that will change, albeit slowly. \n When and how did you first discover mathematical blogs? \n As part of the stuff I’ve been doing I’ve found myself working with Peter Rowlett and other mathematical bloggers, and I love reading stuff that interests me so it’s a great thing. I know there’s far too much out there for me to read it all, and I partly regret not getting into it while an undergrad. I guess blogs weren’t so much of a thing back in those days (all of eight years ago!). \n When did you start blogging? \n I’ve had various blogs since I was young, on different topics – both personal and factual, and as I’m increasingly busy I found myself limited to one blog (which was mainly a round up of things I’d found online which interest me, and almost entirely comprised posts about robots and baking). I was asked by Peter and Christian if I was interested in joining a new thing they’d had an idea for, which at the time was slightly amorphous and was something to do with maths and the internet, which turned out to be the Aperiodical. I started writing posts there and making videos for it when the site was created, so maybe a few months ago, although we had our official launch on 25th April. \n Why did you start? \n I was intrigued by the idea of having a shared blogging outlet, as they’re both prolific maths bloggers and the idea was to also draw in other media such as video, and a regular feed of mathematical news posts, as well as inviting guest posts from other authors. Nothing quite like that already existed, and I was very excited to become part of it – we weren’t sure how much success we’d have, and we were realistic about the kind of audience we’d get. The launch was a huge success, and a couple of our posts have been mentioned/linked to elsewhere (not least on Radio 4, and on Hacker News, which has generated a huge amount of traffic). We get a fairly decent regular readership now, as well as having a bunch of people following on Twitter and via RSS, although who knows what will happen in the future. \n What do you write about? \n I tend to write posts about things I’ve found which I think people will find interesting, which could be anything from a toy or game to some nice application of maths I’ve seen. I also hope to make increasing numbers of videos, although time is a huge factor and we all have actual jobs, so it’s a wonder we have as much material on the site as we do! I write roundups of the monthly MathsJam event we have in Manchester, which I’m the organiser of, and occasionally persuade people to write guest posts. I also help with general editing and tweaking of the site. All the decisions we make are group decisions, so there’s a lot of emails flying around but it pretty much works. \n What wouldn’t have happened to you without the internet? \n The internet is an amazing and terrifying beast, and it’s bizarre to think that this time twenty years ago it was barely anything, and something nerds were playing with. Now, it’s such a big part of everything and it’s fantastic. Any information you could ever want is there. Not knowing something is no longer a valid excuse, ever, and it’s changed everything. It’s even on my phone now! I can look things up while waiting for a bus. And people are so much more connected – I have friends in Australia, and I’m kept more up-to-date with what they’re doing than my friends in the same city as me. \n What does the internet need more of? \n Politeness, courtesy, and thinking twice before you hit submit. I get quite riled up by the attitude that since it’s anonymous, anything goes. People can be rude and vicious and it’s completely unnecessary. Kids get bullied by their friends on Facebook, and they type things they’d never even dream of saying to their face. Not only that, but when something is typed, it’s so easy to misinterpret what you’re saying and even well-meant comments can become hurtful if the person’s not there to explain themselves. It’s a blunt instrument I guess, and not everyone sees the effect of what they’re doing. \n Mathematicians on the web have… \n … a fantastic way to communicate with each other and share things they love. \n Your daily web reading (mathematical or otherwise): \n Twitter is amazing. I follow just enough people that I have time to read it all, and it nicely fills my spare time (waiting for buses and so on). I can’t make specific follow recommendations, as it’s a personal thing, but I do recommend trying new people sometimes, as they can surprise you. And follow people you disagree with! It’s great to keep you grounded. I also have a lot of RSS feeds, so I read things like Ben Goldacre, various Guardian columnists, Cake Wrecks (of course) and a blog called Futility Closet which posts some lovely linguistic and mathematical oddities. I also read a couple of webcomics – Saturday Morning Breakfast Cereal, Buttersafe and XKCD. Also, even having been finished for almost a year now, PhD Comics never fails to raise a smile, with its witty take on the experience of working in research. \n  \nMathblogging.org — The Blog by mathblogging.org is licensed under a  Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License . \nPermissions beyond the scope of this license may be available at  http://www.mathblogging.org ."], "link": "http://mathblogging.wordpress.com/2012/10/12/mathematical-instruments-katie-steckles/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://aperiodical.com/": 2, "http://www.mathblogging.org": 1, "http://creativecommons.org/": 2, "http://twitter.com/": 1, "https://commons.wikimedia.org/": 1, "http://mathblogging.wordpress.com/": 1}, "blogtitle": "Mathblogging.org -- the Blog"}, {"content": ["Mathematical Instruments. \n  via Wikimedia Commons \n This post is part of the series Mathematical Instruments in which we introduce you to some of the math bloggers listed on our site. Today: \n \n Christian P. Robert — Xi’an’s ‘Og \n What’s your blog’s name? Any other places (Twitter, Google+, Facebook  etc) we can find you on? \n I called my blog Xi’an’s ‘Og as Xi’an is my abbreviation for Christian (as in X’mas or X’ing), even though this endlessly confuses people and ‘Og was the abbreviation for blog I found most endearing. I would not call it thus now but it is too late to change! \n Would you tell us a little bit more about yourself? E.g., Where are  you coming from (both geographically and philosophically)? What is your  background? Any scientific education? \n I am a (full) professor of statistics at the Université Paris-Dauphine (in Paris, France), and a researcher in Bayesian Statistics and (Monte Carlo) computational methods. My philosophy about statistics is driven by Bayesian decision theory, in connection with Bayes’ theorem, even though I try not to sound too preaching about it. I am involved in statistical societies like ASA (American Statistical Association), ISBA (International Society for Bayesian Analysis), IMS (Institute of Mathematical Statistics), and I am a former editor of the Journal of the Royal Statistical Society Series B. \n When and how did you first discover mathematical blogs? \n I think the first blog that caught my attention was Andrew Gelman’s blog . \n When did you start blogging? \n I was writing a few pieces on my webpage since the early 2000′s, mostly about statistics and mountain climbing, but I truly started my blog on October 2, 2008, a few days before my yearly half-marathon… \n Why did you start? \n To comment about statistical papers. And thus induce unofficial discussions on interesting (or wrong) papers. For a while I had hoped for the on-line free journal Bayesian Analysis to start an on-line discussion option but as it was not coming in a near future (and still is not on the radar!), I decided to start on my own. Pretty soon I was also blogging about other things, but the core of my readership is interested in statistics not in my reading, as far as I can judge from the blog statistics! \n What do you write about? \n Mostly about my statistical interests (new papers, my own papers and questions, my visits and conferences, book reviews), with some side interests like books, running, mountaineering, photography, and the occasional wine. I try to keep away from politics and personal items (although some readers may disagree)! \n What wouldn’t have happened to you without the internet? \n I do not really know how to answer this question. Internet brings me a lot in terms of references and items of information, as well as planning my travels, but it is also addictive and I spend too much time reading news items and blogs… \n What does the internet need more of? \n More…broadband?! \n Mathematicians on the web have… \n more formulas?! better fonts?! \n Your daily web reading (mathematical or otherwise): \n arXiv (stat) – Andrew Gelman – StackExchange (Cross Validated) – The Guardian – The New York Times – Le Monde – R-bloggers – Mathblogging – Particle Physics Planet – Patrick Rothfuss Blog – Freakonometrics – Error Statistics Philosophy – Tor – Significance – The Cleanest Line – &tc… \n  \nMathblogging.org — The Blog by mathblogging.org is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License . \nPermissions beyond the scope of this license may be available at http://www.mathblogging.org ."], "link": "http://mathblogging.wordpress.com/2012/10/05/xians-og/", "bloglinks": {}, "links": {"http://www.thecleanestline.com/": 1, "http://www.nytimes.com/": 1, "http://feeds.wordpress.com/": 1, "http://xianblog.wordpress.com/": 2, "http://blog.patrickrothfuss.com/": 1, "http://freakonometrics.free.fr": 1, "http://www.mathblogging.org": 1, "http://errorstatistics.blogspot.com": 1, "http://www.tor.com/": 1, "http://arxiv.org/": 1, "http://andrewgelman.com/": 2, "http://creativecommons.org/": 2, "http://stats.stackexchange.com/": 1, "http://mathblogging.org": 1, "http://www.r-bloggers.com/": 1, "https://commons.wikimedia.org/": 1, "http://teilchen.at/": 1, "http://mathblogging.wordpress.com/": 1, "http://www.co.uk/": 1, "http://www.lemonde.fr/": 1, "http://www.significancemagazine.org/": 1}, "blogtitle": "Mathblogging.org -- the Blog"}, {"content": ["Mathematical Instruments. \n  via Wikimedia Commons \n This post is part of the series Mathematical Instruments in which we introduce you to some of the math bloggers listed on our site. Today: \n \n David Wees — 21st Century Educator \n What’s your blog’s name? Any other places (Twitter, Google+, Facebook etc) we can find you on? \n My blog’s name is 21st century educator , which was really a hastily made decision. Were I to rename my blog, I can think of many other choices which would be better, but for now I’ve decided to stick with this name. You can find me on Twitter and Google+ . My Facebook account is for friends and family only. \n Would you tell us a little bit more about yourself? E.g., Where are you coming from (both geographically and philosophically)? What is your background? Any scientific education? \n I grew up in beautiful British Columbia, in a quiet place called Denman Island. I’ve since lived in Vancouver (where I did two of my university degrees), Brooklyn, London, and Bangkok, and I am now back in Vancouver. My educational philosophy is that learning happens best through a mixture of exploration, and guided exploration. My education background is that I have a Bachelor of Science (Mathematics) (which would have been honours, but I didn’t bother to finish up the 4 elective courses I needed), a Bachelor of Education (Secondary Mathematics), and a Masters degree in Educational Technology. I have been teaching for the past 10 years, mostly mathematics course, but a few science courses as well. I have future plans to complete a PHD program as well, although I have not yet decided where, or in what. \n When and how did you first discover mathematical blogs? When did you start blogging? \n I started blogging in 2005, and about the same time, I started reading other people’s blogs. I have always found it fascinating to connect with other people. Most of my reading has been on mathematics education, but I’ve recently started following blogs of mathematicians as well. \n Why did you start? What do you write about? \n My created my first blog as a way to keep in touch with family and friends when my wife and I were about to move to London. I shared the link with my mother, who was my primary audience (she even commented on some of my posts!), and used the blog to share pictures and stories from our life in London. My next blog was about computer programming, and focused on the development I was doing in JavaScript, ActionScript/Flash, and PHP. It actually remains somewhat popular today, and I receive almost 1/3 of the hits to my site to my old programming blog. In 2008, I started an educational blog where I talk about technology, philosophy, and mathematics education. \n What wouldn’t have happened to you without the internet? \n The Internet is the most powerful tool for communication ever invented on this planet. When I do not have access to the Internet for small periods of time, I take the time to reflect and talk to the people around me more. When I do have access to the Internet, I try and make sure that the people who are around me take priority, and that the Internet is a tool I use for communication with people who are not present. I find the Internet incredibly useful as a way to learn about a wide variety of perspectives, and to share my perspective with a wide variety of people, and hence get feedback on my work. Without the Internet, I’m sure I would have not been exposed to the variety of ideas that I now know about, and I would be a far less effective educator. \n What does the internet need more of? \n There is a lot of dross on the Internet. We need better ways to rate the reliability of information on the net, so that people who are not as careful about checking the reliability of information they find are not pulled in by the scammers quite as easily. \n Mathematicians on the web have… \n Opened up a new era for mathematical collaboration. Some ideas will be much easier to solve with many people working on them simultaneously, as the sum of the abilities of the various mathematicians working on a project is greater than the individual parts. Similarly, we will always need some people working more in isolation who bring forward more complete ideas that aren’t influenced by the misconceptions of others. A great example of this type of collaboration is the Polymath blog . \n Your daily web reading (mathematical or otherwise): \n I read an enormous amount each day as I am following several hundred blogs, a few hashtag conversations on Twitter (right now #edchat #mathchat but I also follow conference hashtags as they appear). See here for the mathematics education blogs I am following. \n  \nMathblogging.org — The Blog by mathblogging.org is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License . \nPermissions beyond the scope of this license may be available at http://www.mathblogging.org ."], "link": "http://mathblogging.wordpress.com/2012/09/28/21st-century-educator/", "bloglinks": {}, "links": {"http://polymathprojects.org/": 1, "https://twitter.com/": 1, "http://davidwees.com": 1, "https://plus.google.com/": 1, "http://www.mathblogging.org": 1, "http://creativecommons.org/": 2, "http://feeds.wordpress.com/": 1, "https://commons.wikimedia.org/": 1, "http://mathblogging.wordpress.com/": 1, "http://davidwees.com/": 3}, "blogtitle": "Mathblogging.org -- the Blog"}, {"content": ["Mathematical Instruments. \n  via Wikimedia Commons \n This post is part of the series Mathematical Instruments in which we introduce you to a math blogger. Today: \n ACME Science (and more), Samuel Hansen \n What’s your blog’s name? Any other places we can find you on (Twitter, Google+, Facebook etc)? \n I am the producer of the new mathematical story podcast Relatively Prime , one of the people behind the expository mathematics blog Second-Rate Minds , and the sole proprietor of the podcast empire known as ACMEScience.com . You can also find me on twitter under the names @Samuel_Hansen and @acmescience , and if you are industrious you could add me to a G+ circle, being warned that I have not posted to it in months and have no plans on posting to it again anytime soon. \n Would you tell us a little bit more about yourself?  E.g., Where are you coming from (both geographically and philosophically)? What is your background?  Any scientific education? \n I am a good midwestern boy. I was born in the same house that I currently base myself out of, and that house if a good 10 miles outside of the nearest 2 horse town. I spent a lot of my early life starved for media, and people, that would hold my interest and then, as if by divine intervention, came the internet. Without the internet, well I do not want to think of where I would be without the internet. As soon as I could I left my birthplace and got myself a couple of degrees in mathematics, while at the same time realizing that the mathematical establishment was not a place I would function well. So I took my love of radio and podcasts and combined it with mathematics, and 6 podcasts later here I am. I am a huge proponent of wider scientific communication, in fact I believe that scientists have an obligation to talk about their work to anyone who happens to want to listen. Finally, I support copy-left and release all of my content under creative commons licenses so that everyone can remix and reuse. \n When and how did you first discover mathematical blogs? \n Google, how else? \n When did you start blogging? \n When I was first applying to graduate schools I went looking for mathematical podcasts, and the fields were depressing bare. Once I got to graduate school I decided that I would do everything that I could to fix that problem and started a chatty, and rather vulgar, panel show called Combinations and Permutations. Soon, I found that was not enough and started interviewing people with mathematical jobs and called that show Strongly Connected Components. That led to the Math/Maths podcast and Second-Rate Minds and an audience big enough to fund my Relatively Prime Kickstarter and Science Sparring Society and now this questionnaire that I am answering. \n Why did you start? \n I wanted to make something so that the next person who went looking like I had would have something to find. \n What do you write about? \n Most of my content is in audio form which covers everything from discursive pop-culture filled conversations about some mathematical topic to interviews with researchers, communicators, and movie directors to fights from the history of science. When I do write I tend to prefer narrative, be that in the form of a fictional future or the moment that I decided mathematics was right for me (that is a soon to be released post actually). \n What wouldn’t have happened to you without the internet? \n My life. \n What does the internet need more of? \n Everything. Really, this is an ecosystem that has more content than I could ever hope to consume and still there are things that I can not find. \n Mathematicians on the web have… \n made the subject simultaneously less and more frightening. The community that has been created by mathematicians on the internet is amazing, things like Polymath and MathOverflow are awe inspiring, but there is so much more that can and should be done. So, let’s go do it. \n Your daily web reading (mathematical or otherwise): \n I follow at most 150 people on my personal twitter account, and I read every single thing that they post. I also follow a lot more people with my acmescience twitter account that I skim every couple of hours. That is where I get almost all of my mathematical content. \n I also subscribe, via rss, to 70 or 80 blogs, boingboing , polis , bldgblog , io9 ,  Brain Pickings ,  Gowers’s Weblog , etc, from which I read at least all the headlines. I am also an active tumblr user, where I follow around 100 different people and post one cool thing I found on the internet everyday. \n Finally, I am subscribed to around 40 podcasts that I stay mostly on top of, I am currently caught up with all of the weekly release episodes and am working through the back catalog of a History of the Earth in 100 Objects , that range from comedy, Stop Podcasting Yourself , The Best Show on WFMU , and You Look Nice Today , to news, Wait, Wait Don’t Tell Me , On the Media , and Slate’s Political Gabfest , to sheer awesome, RadioLab , 99% Invisible , and The Memory Palace . \n  \nMathblogging.org — The Blog by mathblogging.org is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License . \nPermissions beyond the scope of this license may be available at http://www.mathblogging.org ."], "link": "http://mathblogging.wordpress.com/2012/09/21/acme-science/", "bloglinks": {}, "links": {"http://gowers.wordpress.com/": 1, "http://polymathprojects.org/": 1, "http://io9.com/": 1, "http://www.radiolab.org/": 1, "http://www.co.uk/": 1, "http://maximumfun.org/": 1, "http://feeds.wordpress.com/": 1, "http://www.npr.org/": 1, "http://creativecommons.org/": 2, "http://mathoverflow.net/": 1, "http://relprime.com/": 1, "http://www.thepolisblog.org/": 1, "http://boingboing.net/": 1, "http://99percentinvisible.org/": 1, "http://www.slate.com/": 1, "http://www.friendsoftom.com/": 1, "http://www.pulse-project.org/": 1, "http://acmescience.com/": 3, "http://thememorypalace.us/": 1, "http://www.onthemedia.org/": 1, "https://commons.wikimedia.org/": 1, "http://minds.acmescience.com/": 1, "http://www.brainpickings.org/": 1, "https://twitter.com/": 2, "http://relprime.com": 1, "http://www.mathblogging.org": 1, "http://youlooknicetoday.com/": 1, "http://mathblogging.wordpress.com/": 1, "http://bldgblog.blogspot.nl/": 1}, "blogtitle": "Mathblogging.org -- the Blog"}, {"content": ["Mathematical Instruments. \n  via Wikimedia Commons \n This post is part of the series Mathematical Instruments in which we introduce you to a math blogger. Today: \n The Accidental Mathematician , Izabella Laba \n What’s your blog’s name? Any other places we can find you on (Twitter, Google+, Facebook etc)? \n I blog at The Accidental Mathematician . (The name is a variation on “The Accidental Tourist,” the title of an Anne Tyler book.) I have a professional webpage at UBC (for preprints, CV, teaching), and another one shared with my research group. I also have accounts on Google+ , Twitter , and a couple of others that I keep more private. My Google+ page is mostly for photography, although I post math links occasionally and have mathematicians and scientists in my circles. Twitter has long been a source of good links and an easy way to post such links on the sidebar of my blog, but I’ve only recently started to use it to talk with people. \n Would you tell us a little bit more about yourself? E.g., Where are you coming from (both geographically and philosophically)? What is your background? Any scientific education? \n I grew up in Poland and did my undergraduate studies at Wroclaw University. I moved to Canada in 1989. I received a Ph.D. degree in mathematics from the University of Toronto in 1994, then held a postdoctoral position at UCLA (1994-97), and an assistant professor position at Princeton University (1997-2000). I have lived in Vancouver and worked at UBC since 2000. \n As for my life background (philosophical, cultural, etc), I have already written a few long posts that only scratched the surface. I won’t attempt a one-paragraph explanation here. \n When and how did you first discover mathematical blogs? \n I have been reading blogs on a regular basis since sometime in the mid-2000s. Most of them have not been math blogs. I was spending enough time on mathematics and work already and felt that my other interests were slipping away. I craved reading about politics, history, social issues, art, books, writing, everything else in life. \n I liked the flexibility of the blog format. In the short run, you can adapt it any way you want: posts can be long or very short, formal or not, frequent or scarce, comments might or might not be allowed. Over time, the short pieces add up to a larger body of work. A discussion can be continued over a series of posts, so that one doesn’t have to start from scratch every time. Great communities can form around some of the more popular blogs. \n The engaging writing style found on blogs was a welcome reprieve from mathematical writing. Too often, we slip when we write for a captive audience. We tell the reader repeatedly that the subject of our writing is “interesting” or “exciting,” because otherwise they’d never be able to tell. I also loved the creative use of language in blogging. Beautiful things can happen when a good writer is set loose without a copyeditor looking over his or her shoulder. \n When did you start blogging? Why did you start? What do you write about? \n I started in Fall 2007 and kept a low profile for the first few months while I was sorting out how it worked. Eventually people found it, of course. \n I wanted to try writing something other than research papers and grant proposals on a regular basis, preferably for an actual live audience, since otherwise I wasn’t sure I would stay motivated enough in the long run. I didn’t quite know yet what I was going to write, but I would figure it out. This was and always will be the main reason. \n Second, my patience was being tested by popular misconceptions and one-dimensional views of university professors, mathematicians, and women in male-dominated professions. Too many people have no idea of what our work actually looks like, but feel that they are entitled to very strong opinions nonetheless. I needed a way to sort through it, not just for my readers (I didn’t even know if I would have any) but also for myself, so that I’d know what to say next time it comes up. \n The conversations about women in math were especially annoying. They still are. They keep going around in very small circles: what if there are biological differences, what if there aren’t, what if diversity policies cause more harm than good, what if they don’t, and so on. Once I started writing on the subject, I tried to push the discussion beyond that. It’s difficult. I can write a long argument attempting some nuance, and commenters still tell me that “women are just different” or “but this [insert specific examples from my own experience here] just doesn’t happen.” Still, the posts have been read and linked fairly widely in the community, so hopefully I’ve made some contribution there. \n On matters of research and academic policy, I wanted to have my own public voice. I was tired of administrators and self-appointed spokespeople (there are many) expressing opinions on my behalf that I did not agree with. \n Once in a while I write about something more personal and unrelated to my profession: art, languages, books, politics. In that regard, I have no agenda or long-term goal; these are subjects that interest me in real life, I read and think about them, and sometimes it gets to the point where I need to write a blog post. \n What wouldn’t have happened to you without the internet? What does the internet need more of? \n Without the internet, I would have never seen Bowie perform The Elephant Man on Broadway. Now I have – there are several clips posted on YouTube. Seriously. \n The internet is great for communicating, networking, disseminating information. I’ve made contacts through the internet that probably wouldn’t have happened otherwise. There is a tendency, though, to speak of “the internet” and “real life” as if they were separate from each other. They’re not. I write on the internet, but the subject of my writing is usually drawn from my life experience. The internet offers instant access to vast stores of information that might not be available to me otherwise, but the value of that information lies in its relation to the actual, non-virtual world. I often seek out older material that pre-dates the internet. When I interact with people online, it is different from meeting them in person, but that does not make it less “real.” \n This is a roundabout way of saying that I can’t tell what wouldn’t have happened to me without the internet. The internet is a means, not an end, and I would have likely sought the same ends by whatever means might have been available instead. \n Mathematicians on the web have… \n probably forgotten what life was like before the internet. We can be awfully slow to adapt new technologies when the effort involved might, in our judgement, trump the benefits. Clickers and in-class educational videos have elicited a mixed response at best. The internet, though, offered a solution to a problem that clearly needed one. The dissemination of research really used to be a problem in ye goode olde days. Now, the author can post a paper on the arXiv the day it’s finished, the interested researchers download it the next day, then use the results in their own research a month or two later. Can’t argue with that. \n Your daily web reading (mathematical or otherwise): \n I read a wide variety of books and articles: fiction and non-fiction, old and new. I’m not sure how to separate my “web reading” from reading in general. If I download a classic book from Project Gutenberg , does that count as web reading? That said, there is a remarkable variety of writing available on the internet, and I’ve learned not to dismiss any part of it for superficial reasons. Some of the best writing I’ve found on the web has been near the far end of the “long tail,” on obscure subjects that nonetheless mean the world to the author. \n If we restrict it to blogs, then it’s easier to pick my favourite: Ta-Nehisi Coates at the Atlantic, by a large margin. If I could only read one blog, that would be it, for the range of topics, the depth of analysis, the fantastic writing, and the best comment section I’ve seen anywhere. After that, it gets pretty diverse again. I check a number of math blogs on a regular basis, but I also read general interest blogs leaning towards science, culture and politics ( Boing Boing , 3 Quarks Daily ) as well as blogs written by writers, scientists, historians, artists, musicians. This is stuff I used to get second-hand from newspapers or magazines, but now I can go directly to the source of the information. That’s one of the best things about the internet. \n  \nMathblogging.org — The Blog by mathblogging.org is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License . \nPermissions beyond the scope of this license may be available at http://www.mathblogging.org ."], "link": "http://mathblogging.wordpress.com/2012/09/14/the-accidental-mathematician/", "bloglinks": {}, "links": {"http://boingboing.net/": 1, "http://www.mathblogging.org": 1, "https://plus.google.com/": 1, "https://ilaba.wordpress.com/": 1, "http://creativecommons.org/": 2, "http://www.gutenberg.org/": 1, "http://arxiv.org/": 1, "http://twitter.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.theatlantic.com/": 1, "http://www.3quarksdaily.com/": 1, "http://ilaba.wordpress.com/": 1, "https://commons.wikimedia.org/": 1, "http://mathblogging.wordpress.com/": 1, "http://www.ubc.ca/": 1}, "blogtitle": "Mathblogging.org -- the Blog"}, {"content": ["Mathematical Instruments. \n This is the first post in a new series, in which we will let bloggers tell you a little bit about themselves. We call it “Mathematical Instruments” because we see blogging as a valuable addition to the toolbox for research and education. But it is still fairly new and sometimes gets overlooked or dismissed by people who don’t know what to use it for. \n The idea of these short interviews is that we can learn a little more about how this instrument can be used, and meet some of the people who are already using it. \n  via Wikimedia Commons \n Nuit Blanche : Igor Carron \n What’s your blog’s name? Any other places (Twitter, Google+, Facebook etc) people can find you on? \n It’s called Nuit Blanche . I also occasionally write on Robust Mathematical Modeling , Wondering Star , and “Where are the clouds?” . \n Nuit Blanche mainly focuses on new emerging fields such as compressive sensing and low rank matrix factorization, and really everything that provides an insight on how to deal with very large datasets and complex problems. I also use Twitter , Google+ and Pinterest . \n All these platforms are not a place to find me but rather they are means to start a conversation with some of the best minds in the world. Most interesting discussions happen by direct emails or as a result of retweets on Twitter, comments on the blog or on Google+ and, most of all, in the discussions taking place on the LinkedIn groups dedicated to compressive sensing and advanced matrix factorization . Both groups feature more than 1400 and 230 professionals from all walks of engineering and science ranging from the oil or the financial industry, to large internet companies to biology, optical engineering, physics all the way to theoretical computer science and mathematics. We have a pretty unique discussion that I do not think is occurring in the walled garden of specialties favored in academia. \n Would you tell us a little bit more about yourself? E.g., Where are you coming from (both geographically and philosophically)? What is your background?  Any scientific education? \n On the interwebs, nobody knows you are a dog. Let’s just say I hold a Ph.D in engineering and I have mostly lived in the U.S. and Europe. I did my undergrad in France where there is much emphasis on math as a selective process. I think it’s a mistake for no other reasons than it selects people who tend to believe Mathematics as a canned process. \n Philosophically, my motto is: “We don’t have much time, I want to see mesmerizing technology in my lifetime.” \n For instance, through our discussions, I want to see if “These technologies do not exist” and if “Imaging with Nature” is even possible. I have been proven wrong twice on the “technologies do not exist” list since it was started. I want to see more… \n When and how did you first discover mathematical blogs? \n The first two mathematically inclined blogs I took heart to follow were those of Andrew Gelman  and Terry Tao . I must have started reading them a year into each of them had started. \n When did you start blogging? \n 2003, the year the Columbia crashed over Texas. \n Why did you start? \n Nuit Blanche stands for restless night in French. Let’s just say that most entries were written in the middle of the night because I could not get to sleep. Since then, most entries are posted at 12 am Texas time. As the readership increased I noticed entries were always posted at midnight for someone…Blogging came as a way to decrease my ignorance on the subject of compressive sensing. I figured that asking and answering dumb questions in a public forum was the best way for others not to ask them. I eventually figured that it provided a community service of sorts. I eventually noticed that these discussions eventually had an impact on how some papers were written and that some people got to talk to each other as a result. That singlehandedly blew my mind, I did not realize that a blog could be an agent of change. \n What do you write about? \n I blog about the whole spectrum of issues related to compressive sensing, how to deal with ever increasing data flood, how we can have better sensors and much more. \n What wouldn’t have happened to you without the internet? \n I’d be a Billionaire. \n What does the internet need more of? \n Better search engines on what is said on blogs. These blogs are having the best discussions in the whole world and nobody is paying attention on how to mine this unique resource. Like they say in Texas, it’s a damn shame. \n Mathematicians on the web have… \n …an ability to be agents of change. \n Your daily web reading (mathematical or otherwise): \n Too numerous to list. A few of them are listed on the right hand side of Nuit Blanche . \n \n (published under creative commons CC BY-NC-SA 3.0 )"], "link": "http://mathblogging.wordpress.com/2012/09/07/nuit-blanche/", "bloglinks": {}, "links": {"http://www.linkedin.com/": 2, "https://twitter.com/": 1, "http://robustmathematicalmodeling.blogspot.com": 1, "https://plus.google.com/": 1, "http://pinterest.com/": 2, "http://creativecommons.org/": 1, "http://terrytao.wordpress.com/": 1, "http://andrewgelman.com/": 1, "http://feeds.wordpress.com/": 1, "http://where-are-the-clouds.blogspot.com": 1, "https://sites.google.com/": 1, "https://commons.wikimedia.org/": 1, "http://nuit-blanche.blogspot.com": 3, "http://wondering-star.blogspot.com": 1}, "blogtitle": "Mathblogging.org -- the Blog"}, {"content": ["We’re on vacation for the next couple of weeks. In the mean time, you can stop by on twitter ( @mathblogging ) to get your daily dose of picks."], "link": "http://mathblogging.wordpress.com/2012/08/24/mathblogging-org-weekly-picks-on-vacation-2/", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.flickr.com/": 1}, "blogtitle": "Mathblogging.org -- the Blog"}, {"content": ["We try to read every blog post that goes through Mathblogging.org. For the Weekly Picks, we collect posts in  one category  from last week to give you an impression of what the mathematical blogosphere has to offer. ( Read this  for more information on this change.) \n Last week, we focused on ” General “, ” Journalism “, and “ Institutions “ . \n \n Exposition, Research \n \n At Error Statistics Philosophy , Deborah Mayo has a new series collecting reactions to Larry Wasserman’s “Low Assumptions, High Dimensions”. \n At The DeMorgan Journal , Alexandre Borovik tells a tale of long division. \n At Girls’ Angle you’ll learn how to make Pythagorean triples with matrix magic. \n \n \n Institutions \n \n \n At Images des Mathématiques  ( translation ), Frederic Brechenmacher gives a kaleidoscopic portrait of Camille Jordan. \n \n \n Journalism \n \n At the New Scientist , Jacob Aron reports on the first simple, symmetric 11-set Venn diagram. \n bit-player explores the odd story of Jevons’ Number. \n \n \n Enjoy!"], "link": "http://mathblogging.wordpress.com/2012/08/17/mathblogging-org-weekly-picks-31/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.mathblogging.org/": 4, "http://education.ac.uk/": 1, "http://girlsangle.wordpress.com/": 1, "http://www.newscientist.com/": 1, "http://translate.google.com/": 1, "http://bit-player.org/": 1, "http://errorstatistics.com/": 1, "http://mathblogging.wordpress.com/": 1, "http://images.cnrs.fr/": 1}, "blogtitle": "Mathblogging.org -- the Blog"}]