[{"blogurl": "http://mathpages.blogspot.com\n", "blogroll": [], "title": "Math Pages Blog"}, {"content": ["A long time ago, in ancient Greece, one of the philosophers asked a simple yet very important question - is matter infinitely divisible? He of course formulated the question in a much more intuitive way: what will happen if you take a stick and break it in half, than take one of the halves and break it in half again and so on. Thinking about this problem, he concluded that at some point we will not be able to continue breaking the stick. According to him, after a finite amount of time we will reach an indivisible component of matter. He named this indivisible component \"atom\". As with any new idea, there were those who believed in it and those who concluded that this idea is wrong. Likely for both sides, there were no means to actually check it so they could argue as much as they wanted. Even though we are much more advanced today we still don't know the answer to this problem. Ironically we have discovered particles which we named atoms only to find out that they can be split apart as well only a few years later. Although, to be really precise, we need to remember that the problem can be formulated as the \"atom\" being the basic component of a specific type of mater. In other words, one possible understanding of the problem is that it asks to find a \"part\" that if divided further looses the recognizable properties of the object we started with. If we formulate the problem in this way, then there are indeed such \"atoms\" - molecules. At this point you are probably wondering what is this about and how is it connected to infinity. To understand this lets look on a somewhat famous paradox - the Thomson lamp. Consider a lamp with a toggle switch. Flicking the switch once turns the lamp on. Another flick will turn the lamp off. Now suppose a being able to perform the following task: starting a timer, he turns the lamp on. At the end of one minute, he turns it off. At the end of another half minute, he turns it on again. At the end of another quarter of a minute, he turns it off. At the next eighth of a minute, he turns it on again, and he continues thus, flicking the switch each time after waiting exactly one-half the time he waited before flicking it previously. The sum of all these progressively smaller times is exactly two minutes. So, in the end, is the lamp on or off? It turns out that there is no clear answer to this problem. While we know the state of the lamp at any time during the process, we cannot tell what is the state at the end. Now lets return to our original problem. Lets suppose for a second that \"atoms\" don't exist. With this in mind we can take the being from the lamp paradox and instead of it toggling the switch we will make it break sticks in half. Since there are no atoms, the process doesn't end before two minutes pass. But what do we have after two minutes? In this case it is rather simple to look on the problem mathematically. Lets substitute the stick for the line [0,1]. The whole process can be described then as just a limit of [0,2^(-n)] when n goes to infinity. The limit is a single point, so that would mean that we will get a \"particle\" with size and mass equaling zero. However, that would suggest that the matter is build from particles with zero mass, and this is a rather bizarre conclusion. The only possible result we can get from this line of thought is that if such a being actually exists then there are \"atoms\". However, if there is no such being then we cannot say anything. While I would like to finish this post with at least a partial solution to the problems I presented, there is no solution as far as I know. There is, however, a funny \"solution\" to the Thomson lamp paradox. Lets assign numbers to the states of the lamp - 1 and 0. If we do this then the state of the lamp after n steps is: 1-1+1-1+...+(-1)^n. Therefore, if we take the limit when n goes to infinity, we will get the state of the lamp after two minutes. So lets see what the limit is. A=1-1+1-1+1-.... 1-A=1-1+1-1+1-....=A 2A=1 A=0.5 As you can see, after two minutes the lamp is half on. :)"], "link": "http://mathpages.blogspot.com/2010/06/infinite-processes-in-real-world.html", "bloglinks": {}, "links": {}, "blogtitle": "Math Pages Blog"}, {"content": ["Today I went to the last lecture of this semester. As it is somewhat typical with last lectures, the professor talked about interesting problems that are somewhat above the scope of the course. If only those problems didn't tend to be more complex that what can be explained in a 45 minute lecture... Luckily, this is of little importance. While the problems discussed were interesting, I rather spend my time working on staff that is more relevant to me now. With the semester finally over, I now have tests to worry about, but I should also have plenty of time to write new posts. Actually, I have a few posts already in the making, I just need some time to actually finish writing them. With the semester over, I finally have time to do so. To be honest, this year was for some reason really difficult for me. I never was good with making timetables for myself, so I ended studying till I was too mentally tired to do anything else. While I am pretty sure that I managed to do well in all of my courses, I barely kept up with my activity on the net. Both this blog and my stumble upon blog were not active most of the year. Hopefully next year will go in a more normal fashion. In other news, I am considering to close my Windows Live account. It is not very useful to me, and I noticed that I am getting a lot of spam from it. Initially I opened it in order to have access to free online storage for my files. However, I cannot say that I am satisfied with the service, and therefore I will likely close this account. To be honest, I sometime think about closing my Facebook account as well, but it is slightly better than Windows live. And what is more important is that I can login to other sites using my Facebook account. I have also started a little project. About two weeks ago, I got an invite to Dropbox . Basically, it is a file sharing site, but it has two features that make it nearly perfect for my uses. Firstly, Dropbox integrates into the desktop. That is instead of having to upload your files to the site manually, all you need to do is to put the files in a specific folder on your computer and Dropbox will upload them to the web and then sync them with your other computers. Secondly, and much more importantly for me, Dropbox officially supports Linux and works well on it. I tried to find other similar services, but they all either don't support linux or they worked horrible. This even includes Ubuntu One (at least the version I tried about half a year ago). The only downside it has is that they only give 2GB to free users. However, it is possible to get more space by inviting others - go to the site if you are interested in details, I am pretty sure that this policy will not last for a long time so there is no point to write much about it. Right now I am using Dropbox to backup and share some video files (documentaries about dinosaurs and other scientific topics) that I have collected. I never cared much about video quality, so I encode the video files in low quality (all the important details are still there) add subtitles and then upload them. In one case, I managed to compress 3 hours into 300MB. As long as I watch them on the computer display, it is perfectly fine."], "link": "http://mathpages.blogspot.com/2010/06/end-of-semester.html", "bloglinks": {}, "links": {"https://www.dropbox.com/": 1}, "blogtitle": "Math Pages Blog"}, {"content": ["If you take a glass of water and then shake it, it turns out that some point in the liquid will remain unmoved - this is known as a real world three dimensional example of the Brouwer fixed point theorem . However, as I once wrote in the past, this example works only if we assume that the matter is continues. If we start to think in terms of atoms, the theorem cannot be applied. While disappointing, it is not surprising. It is after all pretty obvious that a theorem that works with an infinite number of points will not work the same if we use instead a finite (but large) number. But what about the opposite? Can a theorem that is used to prove something about a finite number of objects be used to prove something about an infinite number of them? The Sperner lemma is an example of such a case. This lemma is sometimes called a combinatorial analog of the Brouwer fixed point theorem. It is called so because it is rather simple to get the fixed point theorem for any dimension from the Sperner lemma for the same dimension. The two dimensional case is: Given a triangle ABC, and a triangulation T of the triangle. The set S of vertices of T is colored with three colors in such a way that 1. A, B and C are colored 1, 2 and 3 respectively 2. Each vertex on an edge of ABC is to be colored only with one of the two colors of the ends of its edge. For example, each vertex on AC must have a color either 1 or 3. Then there exists a triangle from T, whose vertices are colored with the three different colors. More generally, there must be an odd number of such triangles. The general, n-th dimensional case, uses n-dimensional simplex instead of a triangle which is a 2D simplex. There are a number of different proofs of the lemma, I personally know 3 of them. The usual idea is to show that the lemma works for the 2D space and then use induction to show that it works for all dimensions. While not difficult, this method of proof requires some thought and careful work. Interestingly enough there is also a proof that is both very short and doesn't require induction. It allows to prove the lemma for any given dimension in just one step. So for all those who prefer simple and easy proofs - read on: To prove the lemma for the n-th dimension all we need to do is: Let v be an inner vertice in T. Define a linear function of t that moves this vertice to the outer vertice of the same color when t goes from 0 to 1. The volume of any given simplex in T is the determinant of the vectors that correspond to the vertices of the simplex. Since all the vectors are linear functions of t, the volume is a polynomial of degree n. The sum of the volumes is thus also a polynomial of degree n. For t=0 the polynomial is obviously the volume of the outer simplex (for n=2 it is the volume of ABC). However if t is only slightly bigger then zero, we still have a triangulation so the sum of the volumes is the same and therefore the polynomial is a constant. For simplicity lets say that the volume is exactly 1. Now, when t=1 the volume of all the simplexes that are not colored in n colors becomes zero. On the other hand, the volumes of the other simplexes are either 1 or (-1) (depends on orientation). And with this we are done - if the sum of the volumes is 1 there are must be simplexes that have volume 1 but this is only possible if there is an odd number of simplexes with n colors."], "link": "http://mathpages.blogspot.com/2010/05/sperners-lemma.html", "bloglinks": {}, "links": {"http://en.wikipedia.org/": 1}, "blogtitle": "Math Pages Blog"}, {"content": ["In this post I want to share some ways of working with course notes that I am currently using. As you all know taking notes is one of the most basic parts of studying. While it is possible to do well without it, it usually only means that you are borrowing somebody else notes (or downloading them). However, taking notes and using them are two totally different things. Firstly, handwritten notes tend to differ greatly in quality due to people handwriting and the lecturer. In my case my notes are close to being unreadable for anyone except for me (for some reason I can read what I wrote easily enough, but I have problems reading other people notes). Also, if the lecturer speaks in a disorganized way the notes become difficult to read and understand. Obviously handwriting and organization of notes is not much of a problem - it is after all perfectly possible to take notes on a computer. Actually, if I were studying a subject that don't have formulas I would use a computer to take notes myself. Since I study math, I do not believe that I should try to take notes on a computer, although I know people who do just that. However, the really difficult part comes when you need to go over your notes. In the first and second year the lecturers tend to give you all the material in a very detailed way, but with time they stop doing this. Instead you are now supposed to figure all the extra stuff yourself. As a result, you basically need to add to your notes on your own. So how do you do this, while still keeping the notes organized and in a format that allows you go over them easily? At this point of time I cannot honestly say that I found a real solution to this question. But I managed to come to the conclusion that I need two things. The first thing is to make sure that I have the notes made in an organized way. To do this I make a second (also handwritten) copy of my course notes. In this copy I write all the definitions and theorems (with their proofs) with as much details as I need to understand them. This copy is later used when I need to prepare for the exams. The second thing is basically a reference list. The idea is to make a list of all the definitions and theorems, as well as links to any useful source of extra information on the topic. It is obvious that such a list should be done on a computer. The end result is basically another version of your notes, but instead of being detailed and organized it is easily to search. This makes it easy to check any general fact you are unsure of. It is especially useful if you want to check some specific definition of the wording of a theorem. Obviously you can do the same thing just by searching on Wikipedia, but using such a reference list makes it much easier - you are able to see what you look for by just taking a glance on it, instead of searching a whole site. Also, making such a list on the computer allows (depending on what software you use) to add extra notes and to modify them easily. Since I do not want to type math formulas myself I ended using Google notebook to clip content (mainly from Wikipedia) and then edit and categorize it the way I want. Unfortunately, Google notebook is the only service I managed to find that had all the features that I wanted. If you follow all this you will end with three different sets of notes (plus, if available, a textbook). Obviously this is a lot of work, but I feel that this approach allows me to understand the material as well as I can."], "link": "http://mathpages.blogspot.com/2010/01/taking-notes.html", "bloglinks": {}, "links": {}, "blogtitle": "Math Pages Blog"}, {"content": ["Complex numbers appeared initially as a way to solve equations that don't have real solutions. However, what are we getting from this? We can write that i is the solution to x^2=-1, but what exactly is this result? It is an imaginary number, so it is not something that can represent for example area. The obvious result from this line of thinking is - are complex numbers really needed? What problems do they solve? Somewhat surprisingly complex numbers solve a lot of different problems or at least make them easier. In this post I want to introduce one particular problem that is solved by using complex numbers. The problem is to define a^b for all values of b and for all values of a except zero. We can partially solve this problem without complex numbers. For example, we can agree that the functions log and exp are defined as usual and then: a^b=exp(b*Log(a)) This will work for all values of b but only as long as a>0. This is as far as we can get without using complex numbers. It is important to note, that any solution of this problem must agree with the partial solution that we have here. In other words, in order to solve this problem we must basically extend the functions exp and log in such a way that log will be defined for negative values and exp will be defined for all values of log. As a start, lets try to define exp(z) and log(z): exp(z)=exp(x+iy)=exp(x)exp(iy) exp(iy)=cos(y)+isin(y) We now need to check what we got from this definition. Firstly, if y=0 then exp(z)=exp(x) as we wanted. Secondly: exp(z+w)=exp(x+iy+a+ib)=exp(x+a)exp(iy+ib) exp(x+a)exp(iy+ib)=exp(x)exp(a)[cos(y+b)+isin(y+b)] cos(y+b)+isin(y+b)=cos(y)cos(b)-sin(y)sin(b)+isin(y)cos(b)+icos(y)sin(b) cos(y+b)+isin(y+b)=[cos(y)+isin(y)][cos(b)+isin(b)] exp(z+w)=exp(x)exp(a)exp(iy)exp(ib) exp(z+w)=exp(x)exp(iy)exp(a)exp(ib) exp(z+w)=exp(x+iy)exp(a+ib)=exp(z)exp(w) The last last thing we want to check is the derivative. This is done in a similar way, and is left as an exercise. As you can see it is rather easy to extend exp to the complex numbers. Extending log is more difficult. Lets start with what we want the function to do. We want that for any complex number z: exp(log(z))=z So, we want to say that if exp(w)=z then log(z)=w. Unfortunately, we cannot use this as a definition for log. The problem is that there are many different complex numbers that satisfy this equation. According to the definition of exp: exp(w+2(pi)i)=exp(w)exp(2(pi)i)=exp(w)[cos(2pi)+isin(2pi)]=exp(w)=z This is obviously a problem. To solve this problem we must remove part of the complex numbers. There are many different ways to do this removal. In this post I decided to remove the numbers {z|z=ik, k=0 or k>0}. Now that we do not have these numbers we can define log. We know that any complex number z can be written as z=r*exp(it), where t represents the angle between the line that connects zero and z. Obviously exp(it)=exp(it+2(pi)i). However, since we have some numbers removed we cannot go in a circle around zero. Therefore, for numbers that have a negative real or complex part we will take t to be 2pi minus the angle. This solves our little problem because we now have exactly one value of t assigned to every z. And now we can define log exactly as we tried to do before. Since the negative numbers were not removed we have log defined for negative numbers as well. For example: log(-1)=i*pi. Now that we have this we can indeed define that for all real a,b such that a is not zero:  a^b=exp(b*Log(a)) This is true for complex numbers as well, but this a different topic."], "link": "http://mathpages.blogspot.com/2010/01/complex-numbers-and-roots.html", "bloglinks": {}, "links": {}, "blogtitle": "Math Pages Blog"}, {"content": ["A few days ago, one of the lectures in the university told us about a funny (but real) news report he once heard on TV. It was shortly after the discovery that 2^(42,643,801)-1 is a prime. (For more information about this go to Mersenne prime search website ). On this TV program a reporter was interviewing a math professor. The conversation went like this: (R= reporter, P=professor) R: So what do you have to say about the discovery of the largest prime number 2^(42,643,801)? P: The number 2^(42,643,801) is not prime since it is an even number. You must have ment to say 2^(42,643,801)-1. R: Well, they are close enough. The important thing is that this is the largest prime number. P: It is not the largest. Euclid proved that there is an infinite number of prime numbers so there is no such thing as the largest prime. R: Is it still correct today that there are infinity many prime numbers? I really find it hilarious how some people think that a mathematical proof is something that is subject to changes. Sure, sometimes we have errors or we find better proof, but the there is no change in the fact itself. I suppose it is somewhat understandable why people act like this - they are too used to seeing things change. But it is still hilarious to watch, as long as you not part of the discussion."], "link": "http://mathpages.blogspot.com/2009/12/common-misunderstanding.html", "bloglinks": {}, "links": {"http://en.wikipedia.org/": 1, "http://www.mersenne.org/": 1}, "blogtitle": "Math Pages Blog"}, {"content": ["We all have our own way of using the net and the services available on it. In this post I want to present my own current method of organizing my online activity. This doesn't mean that this post is about promoting yourself on the net. I do not have any problem with those who try to promote their content by networking with similar people and influencing the social networks, but the result that these methods give are the opposite of what I want. I suppose it is a bit surprising for you that I am writing about this practice from a negative point of view. After all, I have my own blog, accounts on some social sites as well as accounts on Digg and StumbleUpon. However, I decided long ago that I have no reason to try and promote my blog or any account I have. The reason for this is rather simple. I just don't have the time to do this or to manage a popular blog. Being in the spotlight is great and all, but it also requires time and concentration. I feel that I rather have a not really popular blog, but I will write about what I find interesting and I will spend only as much time working on my blog as I want to. Because of this I don't ask people to promote my posts, even if they offer it. With this cleared, lets move on to the actual post. As you all know, there are lots of different sites and services available on the net that require opening an account to use (or at least have extra features for those who opened an account). As a result one can find himself with lots of accounts. Some of them are not even used anymore - but they are still there. Some accounts are even forgotten by those that open them. A few days ago I happened upon someones Google profile. It had links to his other accounts. The problem is that there were so many accounts that I didn't even bother to try and take a look on them. The question is, how many of those accounts are actually being used? Or an even better question - How many accounts can one person make use of? Having accounts that are not used or used really rare is in no way a problem. I myself have accounts that I no longer use. I think I have about 10-20 such accounts. While I try to keep tabs on them, they tend to multiply almost on their own :). Actually, a few years ago I was rather surprised to find out that I somehow got an Yahoo email account when I am completely sure that I never opened one. It turned out that I got it automatically because of my flickr account. However, if something is not being used it practically doesn't exist and as such is not a problem. But, unfortunately, some people believe that it is fine to use many low quality accounts in order to get the result that they want. In other words, they open lots of accounts on different social networks and then try to keep all of them active and use them mostly to promote their own content. This obviously end up with duplicated content and overall low quality account on all of the social networks. But, if such a user is active enough he may manage to attract people. Especially others like him. Since I own a blog, I am approached from time to time by such people. They usually ask me to review their posts or to digg them, and offer to do the same in return. As long as the amount of requests is small enough, I do not see this as a problem. While I do not ask people to promote my blog, I do not mind helping them - as long as I have nothing against their content. For example, there is absolutely no way that I will help promote anything about music or poetry. I hate music (I cannot really say why, this is just how it is) and lately I am starting to feel the same about poetry (don't ask why). What follows is a story of how I came to use the current accounts that I have and what I am using them for. It is in a somewhat chronological order, but I naturally don't remember when I started to use what account. The accounts listed are not all of my accounts, but all the main accounts I have on social networks are mentioned. StumbleUpon Perhaps somewhat surprisingly it all started with StumbleUpon. I installed the toolbar when I was looking for interesting extensions to add to Firefox. It proved to be interesting enough, so I started to use if a bit - at first I only used it to stumble on sites. After some time (about a year maybe) I decided to start adding some simple content to my SU blog. As a result people started subscribing to it. When I saw that what I did was interesting to other people I started to increase the amount of staff I posted. I also started to write reviews of other people and at some point even wrote some bits of advice about using StumbleUpon. I cannot say that I made any friends on SU, but it was and is a rather nice experience. Currently I use SU as a photoblog. I post photos that I find on the Internet with a short comment. At first I tried to post other staff as well, but as time went by I decided that what I want is to post photos only. After some time I decided that trying to post 4 good photos per day works best for me. Photobucket I got the account after reading posts about how great photobucket is. I wanted to take a look on it, so I got an account. Months later, I noticed that some photos on my SU blog were gone and others were loading slowly. So I decided to start uploading all the photos I post to photobucket and then link them from there. The free account is probably too small for some people, but I usually post only 4 photos per day and they are rather small. Who knows, maybe Photobucket will upgrade the amount of space it gives before I ran out. If not, I will just start storing photos on another site, probably Flickr. Picasa Originally I started using it because of its ability to find all the photos you have on your computer and then present them and organize them rather well. Later I started to use Web Albums to keep an online backup of my photos. The only problem I have is the storage limit. Picasa cannot be used to store all of your photos online, but it gives me the ability to keep backups of photos I found on the net. While some of these photos I also have on my SU blog and therefore on Photobucket, Picasa allows me to keep an organized collection of photos I found on my computer so I use web albums to backup these collections. Eventually, when I will run out of space to use, I will start uploading photos to Flickr, or maybe some other site. It obviously depends on my activity on the net, but I think that I will run out of space next year. Facebook If I remember correctly I got the account because I was bored. Even now I admit that I do not see what is so great about it. The only really good thing is the way it is connected to other sites. For me it means that I for example can post an YouTube video on Facebook with just one click on YouTube. Frankly this is also the only real use I have for this account. I have been trying to think ways to use Facebook to do something that I do not already do using some other site, but the only thing I came up with is to use it to post some random interesting staff I found on the net. However, it appears that Google reader shared staff is doing it better. While it makes some sense to have similar content in Google reader shared items and my Facebook account, I am not really sure if this is what I want. I hope that I will find some permanent use for this account eventually. Maybe I will use it to store photos, they seem to have some fair support for this. Digg I don't really remember why I opened this account. I think it was because I hoped that having it will help me to stay on top of the current news. If so I probably forgot that since I am not really interested in news I will not use this account unless I have some sort of motivation to go to it. As a result this account was left alone for some time. Eventually I found the correct motivation - all those nice people who ask me to help them promote their sites on Digg. By doing so I visit the main site and as a result I see other popular posts. Google Reader and FriendFeed These two sites as well as Facebook can be considered an activity feed. Their main purpose is to show my activity collected from different sites. In other words, it is a mix of updates. These sites work with different services and differ in quality. Somewhat surprisingly, the best one by far is Google Reader. But all three of them have their uses. FriendFeed is totally overloaded because of my StumbleUpon activity and I noticed that it misses some entires I have made on other sites. However it provides the most information out of all three services. Facebook provides an option to put FriendFeed into a tab in your account. This means that all of your activity can be seen from your Facebook. In addition to this it also allows to post links to different pages on the web, somewhat similar to SU. However, the format in which it is done is more fitting for a status update than a blog. Google Reader is much more like a blog any of the other two. While it allows to post status updates, the format it uses is more suited for longer posts. It also deals well with showing videos that I added to favorites on YouTube. Basically it is an activity feed that doubles as a blog. As I already said it is the best one of the three. However, it lacks visual polish and unlike the other two there is no obvious community around the service. I really don't know what will happen with activity feeds in the future. It is obvious that they are here to stay, but it seems to me that it is rather possible that I will find it reasonable to have more than one activity feed for a long time. YouTube This account is currently in the making. I have some plans for it, but it is probable that they will change as time goes by. Right now I am considering making it into a collection of math\\science related videos. I am not really planning to upload anything at this time (although it is possible), but from what I have seen there is more than enough content on YouTube already - it just waits to be found. Wikipedia This account I opened so that my really rare edits to Wikipedia will be attributed to me. I doubt that I will ever use it for anything more than this, but time will tell. Right now it is just an about me page with some links to my other profiles. Google profile This particular profile is a good example of the recent attempts to provide centralized account and identity on the net. Google is not the only one who is trying to do so, but it will come as no surprise if they will be the ones to actually make it happen. While the profile is rather simple, this is actually a good thing, because it doesn't encourage users to overload it with information. Instead it allows one to focus on main function of this profile - provide a centralized gateway to all your other profiles. I am not really sure that it would be a good idea to have one profile for all sites, but as long as we can provide different information on any site in addition to what is written in our main profile, the idea itself is something I have been waiting for for a long time. Right now my Google profile is just a description of who I am and what I do with links to my profiles around the net. Conclusion As you can see from this list I have a rather small number of accounts. My activity is divided between two blogs - SU and Math Pages. In addition to this I also keep two activity feeds updated - Facebook and Google Reader shared items. All the rest of my accounts are either updated as part of my activity on the mentioned sites or are rarely used, if at all. However, as you probably noticed, sometimes I don't update my blogs and activity feeds for relatively long periods of time. Maybe if I had less of them it would be easier, but I doubt it. Right now my activity is divided rather well between my interests, so if I fail to update it just means that I am to busy or have some other reason that prevents me from updating."], "link": "http://mathpages.blogspot.com/2009/12/social-accounts.html", "bloglinks": {}, "links": {}, "blogtitle": "Math Pages Blog"}, {"content": ["We often hear about how all mathematics is interconnected, but rarely see clear and simple examples of such connections. In this post I want to show one example in which theorems developed in Calculus are used to solve a range of combinatoric problems. To begin lets consider the following problem. For any natural number K what is the number of ways it can be written as a sum of powers of two, if we allow each of them to be used only ones? Lets suppose that the number of ways is a(k). It is obvious that a(1)=1, a(2)=1. Lets define a function: f(x)=a(0)+a(1)x+a(2)x^2+.... a(0)=1 It is easy to see that if a(k) is defined this way then it is also true that: f(x)=(1+x)(1+x^2)(1+x^4)(1+x^8)...... This is true because if we open the brackets we will get that x^k appears exactly a(k) times. Now lets multiply f(x) by (1-x). It is easy to show that: (1-x)f(x)=1 You show this by looking on a finite multiplication and then taking limit. However, now we got that: f(x)=1/(1-x)=1+x+x^2+x^3+x^4+..... This is true because this is the formula for the sum of the geometric series for any 0 F(n)=F(n-1)+F(n-2) , F(0)=0, F(1)=1 f(x)=F(0)+F(1)x+F(2)x^2+.... Lets look on the following multiplications xf(x), x^2f(x). Because of the recursive formula we get: f(x)(1-x-x^2)=F(0)+(F(1)-F(0))=1 f(x)=1/(1-x-x^2) The only thing left to do is to calculate the series and we are done. This part is left as an exercise for the bored reader. The important thing is that the same idea works for any different series - this is not something that is true only in a specific case. As such this is indeed an example of how mathematics is interconnected and how calculus that is the study of infinite can be used to solve finite combinatoric problems."], "link": "http://mathpages.blogspot.com/2009/12/analysis-and-combinatorics.html", "bloglinks": {}, "links": {}, "blogtitle": "Math Pages Blog"}, {"content": ["I didn't write anything about paradoxes for a long time, so here is a little something. Lets look on the volume we get by rotating the graph of the function y=1/x, for x>1. The object we get is called Gabriel's Horn. It is easy enough to show that its volume is finite and in is equal to pi. If we cut the horn in any finite point a we will get that the volume is exactly: If we now take the limit when a goes to infinity we will get that the volume is indeed pi. However the surface area is infinite. For any finite a we will get that it is exactly:  But the limit of this expression is infinity. Now that we know this , we can go on to the description of the paradox. Suppose that you want to paint the Horn with finite amount of paint. Obviously, it is not possible because the surface area is infinite. But you can fill it with a finite amount of paint. Lets now suppose that Horn is made from a transparent plastic. In this case, filling it with paint is the same thing as painting it. As a result we get that it is both impossible and possible to paint the Horn with finite amount of paint. So which one is true? The solution is in fact rather simple. Firstly lets look on the graph of y=1/2x. Obviously this is again Gabriel's horn, but in a scaled down version. Lets put it inside the original while it is still filled with paint. In this way we painted it from the outside. How did we do it? The answer to this is in the distribution of paint. The thickness of paint is given by g=1/x-1/2x=1/2x. And this is the whole trick. We can paint even an infinite surface, the only thing we need to worry about is allowing the thickness of paint to approach zero in a way similar to this example (we need the integral of the paint distribution to be finite)."], "link": "http://mathpages.blogspot.com/2009/12/gabriels-horn.html", "bloglinks": {}, "links": {"http://1.blogspot.com/": 2}, "blogtitle": "Math Pages Blog"}, {"content": ["For a long time buying books was considered at the very least practical. As long as it was economically sound, having a nice small library at home was without doubt a useful thing. However is this still true now? Naturally, I am not talking about buying fiction (this is after all a math blog). To better illustrate the question, lets consider the following example. About a year ago some friends of my grandfather gave me a good multi volume encyclopedia. Obviously it is not something that is expected to be used everyday, but I didn't open it even once in all this time. The reason for this is simple - if I want information about some specific subject, it is easier for me to search in the Internet. It is almost certain that there will be an article on this subject on Wikipedia, or some other place. To a certain degree the same is true even for my math textbooks\\notes. Frequently enough I prefer to search on the Internet for a specific definition or proof of a certain theorem. Unfortunately, this is often less successful than searching for staff one can find in an encyclopedia. As a result we get the following situation - while we have lots of available books it doesn't seem practical to invest money in buying them. This is especially true about buying new editions of books we already have, or books that cover the same topic but use different approaches. This is especially true considering how overpriced some books are. A possible solution to this is downloading books (for free). While not all books can be downloaded for free from the net, it is possible to find good books on any given topic. For example there is currently a collection of over 600 math books available on bittorent . There is also a nice collection of calculus books on the same site . The only problem with those collections is that they will not remain available forever. In other words, it is a good idea to download it even if you don't need it right now. This however brings us to a second problem. While it is possible to download lots of books from the net, we also need some way to organize them so that it will be possible to use them. Another problem is keeping an up to date backup (you wouldn't want to lose 10GB of books suddenly would you?). I must admit that I don't feel that I managed to make any serious progress in solving either of these two problems. For backup, I long ago decided that burning my files to CD or DVD is not a good idea. It becomes difficult to keep track of the backups, and also the discs tend to be damaged so it is not very safe. Another option, is to keep a copy of your files on the web. I personally use Google Docs. It can only be used for pdf files up to 10mb, so some books I cannot upload, but it is really reliable and the way it is build makes organizing books relatively easy. Some times ago I tried to use Scribd for storing some of the large books I have. Unfortunately, it didn't work. They check the files that you upload, and if they notice that you have books that are copyrighted they will delete them. I also tried to use DivShare, but it is rather unreliable and overall not something I would recommend. In the end the decision whether to have a digital book library or not is a personal one. In my case I decided to do it out of pure love for books. I just cannot say no to an opportunity to have a library. I do hope however that I will manage to make use of all those books I collected..."], "link": "http://mathpages.blogspot.com/2009/12/collecting-and-storing-books.html", "bloglinks": {}, "links": {"http://isohunt.com/": 2}, "blogtitle": "Math Pages Blog"}, {"content": ["Over the years I made a little online collection of math and other books. In order to organize and manage this collection better, as well as to share it with other people, I decided to post links to all these books here, on my blog. I hope that you will find this collection of links useful. As of now it is rather small, but I plan to add more books. There is a surprising number of such books available online for free - but it takes time to find them. Some If you have a problem with your book linked from here, please let me know and I will remove the link immediately. Since most of these books are available for free on the author page, I just linked those pages. In some case, the book is on a site that has no connection with the author. In such a case it is possible that it is an illegal copy - use it on your own risk. I provide the links for educational use only. If you want to recommend a link for addition, you can leave a comment. In order to keep this post as tidy as possible I will not publish the comment, but I will consider adding the book(s). In order for a book to \"qualify\" it must be about math, physics or programing and it must be large enough (that is, not an article but an actual book). If a link a broken please leave a comment about it, I will try to fix it if possible.  Math: 1. Elements of Abstract and Linear Algebra - E. H.Connell ( author page ) 2. Foundations of Combinatorics with Applications - Edward A. Bender, S. Gill Williamson ( author page ) 3. Graph Theory 3rd Edition - Springer-Verlag Heilderberg ( order / author page) 4. Algebraic Topology - Allen Hatcher ( author page ) 5. A Problem Course in Mathematical Logic - Stefan Balaniuk ( author page ) 6. Multivariable Calculus - George Cain and James Herod ( author page ) 7. Calculus - Gilbert Strang ( author page ) 8. Linear Methods of Applied Mathematics - Evans M. Harrell II and James V. Herod ( author page - this book has a rather nasty license) 9. Complex Analysis - George Cain ( author page ) 10. Linear Algebra, Infinite Dimensional Spaces, and MAPLE - James Herod ( author page ) 11. Linear Algebra - Jim Hefferon ( author page ) This book has complete solutions of exercises. 12. The Geometry and Topology of Three-Manifolds - William P. Thurston ( author page ) 13. Introduction to Probability - Charles M.Grinstead ( author page ) 14. Elementary Linear Algebra - Keith Matthews ( author page ) This book has complete solutions of exercises. 15. Understanding Calculus ( author page - this is an online book, you can download it for 5$) 16. Elementary Calculus: An Infinitesimal Approach - H. Jerome Keisler ( author page ) 17. Combinatorics - Russell Merris ( link ) 18. Real Analysis - Royden ( link ) Programing: 1. Dive into Greasemonkey ( author page ) 2. SQL server 2008 ( link ) General: 1. Flatland: A Romance of Many Dimensions - Edwin A. Abbott ( link - there are lots of other books on this site) Bittorent links: 1. Mathematics - a collection of over 600 math books on different subjects. 2. Calculus Book Folder - a small collection of calculus books. Alternative link . 3. 100 Great Problems of Elementary Mathematics - link . 4. Mathematics As a Science of Patterns - link ."], "link": "http://mathpages.blogspot.com/2009/09/my-library.html", "bloglinks": {}, "links": {"http://www.numbertheory.org/": 1, "http://diveintogreasemonkey.org/": 1, "http://www.worldwideschool.org/": 1, "http://www.wisc.edu/": 1, "http://ocw.mit.edu/": 1, "http://www.cornell.edu/": 1, "http://math.ucsd.edu/": 1, "http://www.dartmouth.edu/": 1, "http://joshua.smcvt.edu/": 1, "http://www.scribd.com/": 3, "http://diestel-graph-theory.com/": 1, "http://isohunt.com/": 5, "http://www.understandingcalculus.com/": 1, "http://www.miami.edu/": 1, "http://people.gatech.edu/": 3, "http://www.mathphysics.com/": 1, "http://euclid.trentu.ca/": 1, "http://msri.org/": 1}, "blogtitle": "Math Pages Blog"}, {"content": ["This post is a response to a comment that was left on my post Google OS is already here . I don't usually post responses to comments in such a way, but the answer to this comment ended up being rather long (I though initially that I can split it into two comments, but in the end it is almost as large as two regular posts) . Also, while the initial comment was about Glide, in order to properly answer the points raises I needed to give a little summary of the ways I use to share and store files on the web. This post can be thought of as a list of services that provide the functionality that is provided by Glide, but are not \"packed\" in an online OS. (This obviously brings us to the following question - Why use many services if there is one that provides all that functionality? The answer to this will be given in the end of the post). Firstly, concerning the main point of the comment, I agree that Glide has features that a remote desktop doesn't have. I didn't say it clear enough in the previous post so I will say it in this one - the part that Glide cloned from Windows is the visual aspect. The functionality that it has is close to what one would expect from an online OS, but the problem is the \"frame\". As I see it, Glide attempts to easy the transition from other operating system to itself, but by doing so it is bound to compromise on the visual aspect and thus on the user experience. With this in mind lets look on the features Glide provides that were mentioned in the comment and what alternatives to them are available (if any). The first point to consider is compatibility. I must say that I have been using Linux for about 3 years and I never had a problem opening any file I got my hands on. I did have some problem with a .gbi file a few weeks ago, but in the end I found a way to open it is well. In the latest Linux distributions there is more then enough support for main file formats, and unless you happen to live in a country with draconian copyright laws, there is no problem to install support for many other file types. In Ubuntu, there is an official package that installs all the needed programs. Besides, there are sites (like Google Docs and DivShare ) that automatically convert files to a format that most devices don't have a problem with. If your files are on the web anyway, it doesn't mater what site they are on exactly. All you need to do is to send a link. The second point is synchronization. I never had real need for synchronizing files between many computers. However, I am aware of some programs that allow easy synchronization as long as the operating system is the same. For Ubuntu you have a nice program called Ubuntu One . It offers a free 2GB online storage that is automatically synchronized across all of your computers (right now it is in beta, but I doubt it will stay like this for a long time). I don't think that it is a good idea to use it for large files, but as long as the files are small enough (lets say under 5mb) it is a perfect solution. For Windows, Diino offers similar functionality. They provide much more space (100GB and more), but it is a paid service. It is also worth mentioning that Picasa allows to sync albums. The free account is rather small, only 1GB, but as you are probably aware it is possible to buy more storage space. I personally prefer not to sync files across computers, but to store them on the web and if I need them to access them on the web. In this way, my files are scattered around my computers, but they are all available on the web. Although, even there they may be on different sites. For example right now my files are distributed in the following way: 1. Google Docs - for small documents. Most of my documents are well within the size limit. 2. DivShare - for large Documents and Video/Audio. This site provides 5GB of free storage (you can buy more). It works well for storing large (but not huge) files. 3. Picasa and flickr- for photos. They both don't reduce the photo quality and allow an easy enough privacy management. 4. Photobucket - for photos that I use on my SU blog. Photobucket is excellent for monitoring bandwidth use, so since the photos I post on SU are usually small, it is a perfect solution for me. The third point is accessibility. As you all know it is possible to use Glide from any device that has an Internet connection and a browser. Thus, all your files are always accessible from any computer with an Internet connection. But using an online OS is not the only way to get this. This is another thing that I apparently didn't say clearly enough in my previous post - my example with a phone. It is well known that it is possible to store files on a mobile phone. But you can do more than this. It is possible to install an operating system on it. A modern mobile phone can act as an USB drive. And it is possible to boot a computer from such a disc and thus it is possible to install a full operating system on the phone. Then, for example, if you installed Ubuntu like this, you can add it to your Ubuntu one account and all your files will be synchronized. In addition to this, you don't need an Internet connection to use the OS. This means that all the programs you have on your computer are always with you. The only downside to this is that you need to connect the phone to another computer to use the OS, while Glide is possible to use from the phone itself. I was asked in the comment: \"How would you share a 1GB video with someone in a distant location when you were traveling with your mobile phone away from all of your computers?\" - The answer to this depends on the location of the file. If it is on my phone, I would probably use Filemail . It allows sending files up to 2GB for free. If I have the file somewhere on the net, I would just send a download link. Obviously, if the file is only on my computer I would have no way of sending it, but I try to have an online copy of all the important files I have on my computer. The fact that my files a scattered around the web makes it a little disorganized, but I don't think that this is a bad thing. Moreover, did you hear about a site named eggdisk? They offered a really nice online storage service and delivered it for sometime. But then one day (without any warning), they stop providing the service, turned the site into ads and didn't even allowed the people to get their files. Because of this case I prefer to keep my files scattered like this around the web. The forth and last point is integration of services. About this I agree completely. Right now the level of integration between Google services is rather lacking. However, it is probably worth mentioning that too much of integration will effectively force the user to use only the services provided by Google. But this is just a remark, I most certainly hope that the level of integration will increase. This point is, I think, an important one for those who want a system \"that just works\". Because of this, Glide is better for those who need to use an online OS for work. To wrap it up, for different people and situations different solutions are needed. For me Glide fails to be anything else but a remote desktop. Since I don't want my staff to be in only one location on the net, I cannot use Glide in a way other people do effectively. Also, because of this I prefer to use all the services I mentioned in this post, and I am always looking for new sites that provide functionality useful to me. However, since this leads to a loss of time, there are people who prefer their files to be centralized and they want to have one simple way to access them all. For such people an online OS like Glide is clearly the perfect solution. Even the fact that it clones Windows appearance is only a bonus to them."], "link": "http://mathpages.blogspot.com/2009/09/storing-files-on-internet.html", "bloglinks": {}, "links": {"http://www.filemail.com/": 1, "http://www.diino.com/": 1, "http://www.divshare.com/": 1, "http://mathpages.blogspot.com/": 1, "https://one.ubuntu.com/": 1}, "blogtitle": "Math Pages Blog"}, {"content": ["This post is an attempt to explain what the term indescribable number means. Unfortunately, while this is a relatively well know term I frequently see it being misused. To understand it, we must firstly look on the proof that such numbers exist. It is a rather basic proof from set theory. What we need to do is to define two sets: A={all the mathematical symbols and all the letters} B={finite words in A} Now, it is obvious that A is finite. B is not finite but it is only countably infinite (this is the smallest infinity). Therefore, B is smaller than the set of all numbers - R. Since all the possible descriptions are in B we conclude that there are numbers in R that cannot be described at all. Moreover, if you take away all the numbers that can be described the size of R will not change (this is a basic theorem in set theory). From this we can conclude that in fact most numbers are indescribable. This is a perfectly valid example of nonconstructive proof . Unfortunately, this simple and short proof (I didn't proof all I said, but it is all just basic theorems of set theory) does little to explain what an indescribable number is. Lets consider some examples. For the first example, look on the following set: C={words in A shorter than one hundred letters} It is obvious that C is finite. Therefore there is a maximum number described by C. The next integer number (lets call it Y) is thus \"the first integer number that cannot be described in 100 letters\". But this description is less then 70 letters long. And this means that this number should be in C. Obviously this is a paradox. We got a number that is both in C and not in C. Here is another example of a similar problem. It is possible to proof that if you randomly choose a real number the probability of it being an indescribable number is 1. So lets randomly choose a number (since we are choosing only one number we don't need the choice axiom). Naturally we get an indescribable number. Well, lets call this number \"indescribable number 1\". In the case you didn't notice I just gave a description to an indescribable number. What really is going on is just an indexing problem. It is important to understand that both B and C are just sets of index numbers. If we have such a set we can use it to index another (in our case the set R). Mathematically, description as it was used in those examples is just a function from B to R (or from C to R). But the way we apply the indexing is arbitrary - we can choose any function we want. Lets first look on the 100 letters case. When we defined the set C what we really defined is the pair (C, f). In this pair f is a description function that for any x in C returns a specific number in R (I suppose that all the words in C describe some number, but you can do without it). Since we cannot define Y without firstly defining (C,f) the word \"\"the first integer number that cannot be described in 100 letters\" is assigned by f to some random number. Then when we got a description for Y, we basically created a new pair (C, g). In this pair g is a new function that agrees with f on all C except for one word - \"\"the first integer number that cannot be described in 100 letters\". To this word it assigns Y. For us this may seem illogical, because we think about meaning of words. But in this proof meaning is not important - the words are just a way to index. With this in mind, lets consider the second example. In this case the number we choose belongs to a set R\\f(B). When we gave it a description all we did was to change f in such a way that now this number belongs to f(B). It is obviously not a problem to do such a change (if we wanted to change the function for an infinite amount of values it might have been a problem, but for one index it is always easy to do). So, what is an indescribable number? After all, we just saw that it is possible to describe any random number. The answer to this is actually simple. Mathematically it is a number that was not indexed by the function f. In normal language it means that it is a number that wasn't described. Form a normal person point of view this is a weird definition, but mathematically it actually makes a lot of sense. The basic idea is that while we have the option to choose any function f, we can only choose one and we cannot change our choice to another function latter on (this is because we need our language to be consistent). Under this conditions it becomes obvious that both examples are just a misunderstanding of what an indescribable number is. You cannot take a number that is not described and give it a description, because the description is already in use and you can have only one number for one description . But then, what is the point in saying that such numbers exit? It is after all obvious that there are numbers that are not described as of now. Unfortunately this is not what the theorem is about. The point of this theorem is not to say that there are numbers that we didn't describe. This theorem says that no matter what function f we use there are always numbers that are not in f(B). In other words, there are always will be numbers that we didn't describe even if we used all of B for the purpose of such description."], "link": "http://mathpages.blogspot.com/2009/09/indescribable-numbers.html", "bloglinks": {}, "links": {"http://mathpages.blogspot.com/": 1}, "blogtitle": "Math Pages Blog"}, {"content": ["As you all probably know Google recently announced that they are going to build a natural extension to Chrome. Obviously, a natural extension to a web browser is an OS (and no this is not a joke). Well, I wonder when I will get to use this.... I just hope I will manage to restrain myself from installing the first beta version available to the public.... Sometimes I feel that I love installing software a bit too much. But anyway, lately I feel that the final release of Google OS will be more of a formal step than anything else. The reason for this is that the services provided be Google are already close to being a real on-line OS. Before explaining what that means, lets look on a typical online OS. For example, Glide . If you look on it ( here is a little video), you will see that it is basically an attempt to clone a regular OS on the web. The reason I am saying this is simple - just look on the way it looks. It is just like Windows. Obviously some details are different, but the overall idea didn't change. And this is a problem. There is no reason for an online OS to look like a regular OS - the whole point in the transition to online OS is to find a new concept, a new look for the OS. Moreover, the system offered by Glide is nothing more than an remote desktop. The only advantage it has over a normal system is the fact that it is available from any computer with Internet. But this is not enough for a system to be an online OS. Actually, if you want you files to always be available, you can install an operating system on you mobile phone, and then you will be able to use it on any computer with an USB port- even an Internet connection is not needed. Obviously this is better than what such an \"online\" OS offers. Google on the other hand is close to making a real online OS. Even now their web services cover most of the things we expect from an OS. To better understand this point lets look on what we expect to get with an install of Windows and attempt to find the corresponding functionality in what Google currently offers. Naturally we will be only looking from the end user point of view. The most obvious thing we get when installing Windows is \"My Documents\" folder. In the two latests releases there are attempts to further divide this folder into pictures, documents music and videos. Google provides us with Google Docs, YouTube, Google Video and Picasa Web Albums. Each one of them is meant for only one type of content and they are much better for managing your files that what you get with a default installation of Windows. (I don't know any good place to store music online, but I am sure that there are ways to do this as well, although it is not provided be Google). It is important to remember that while right now Google doesn't do mass file storage, there are sites on the Internet that do just that, and there are rumors flying around the Internet for years about Google storing 100% of our files. Besides, any really large files (like video longer that what you can put on YouTube) you probably don't want to store on the net because getting it from there takes a bit too much time with current Internet connection speeds. The second thing we get is Office (and notepad, for those who use it). It is not provided be default but it is a basic enough product. Google gives us Google Docs which are for most users a good enough replacement for Microsoft office. Also if you don't like Google Docs you can use other products like Zoho for example. On this note, it is also possible to do light photo editing on the web. While I don't know about sites good enough for professional graphic design, I do know about a nice site for simple graphic editing - FotoFlexer . The third and final step is communication. This is not something provided be Windows, but the reason we buy computers is to be able to communicate with other people. Since we are talking about an online OS, things like communication become something that is only natural for an OS to provide. And Google does just that. We get Gmail, Blogger, YouTube, Google Video, Google Docs and etc.. All of these products are either build for communication or have the option for collaboration like Google Docs. Right now we view them as services but for an online OS, those are major components. The only thing Google is missing right now is a \"frame\". In order for all those services to become an OS we need something that will put them together and offer them to the public as an OS. The building of this frame is being done in three stages. The first stage is the links to other Google products that appear on the Google main page. Those links make all those services connected and easy to reach from each other. The second stage is the browser. The browser has a lot of importance. The way it works and looks is extremely important for an online OS (the reasons should be obvious). For this we now have Google Chrome. Did you notice that by default it has only two lines of menus compared to Firefox five lines? It is obvious that the developers attempt to make it even look like a frame, like the status bar in Windows. The third and final stage is the Kernel. It is rather pointless to have two OS on one computer in the same time. If we are too use Google OS from Windows (or a Linux distro) we are basically using one OS to connect to another. This is something that needs fixing and Google is now doing just that - they are making a desktop component for the online OS, a component that will remove the need to use two OS in the same time. The only thing that this component needs to do is to boot up, start Google chrome and connect to the Internet. This simplicity is also the reason why they say that the OS is a natural extension of the browser. All it has to do is to make the browser start without anything else on the computer. Obviously, this also means that all the configurations that are needed to be done for the computer to work will be done from inside the browser (at least I think so). Doing this will require a lot of work on Google Chrome, but with Google resources and the help from the Linux community this project will almost surely receive, doing this all in a reasonable time is perfectly possible. Update: There was an interesting comment on this post that caused me to write another post about Glide and the functions it provides. The post is titled Storing files on the Internet ."], "link": "http://mathpages.blogspot.com/2009/09/google-os-is-already-here.html", "bloglinks": {}, "links": {"http://googleblog.blogspot.com/": 1, "http://www.zoho.com/": 1, "http://www.youtube.com/": 1, "http://mathpages.blogspot.com/": 1, "http://fotoflexer.com/": 1, "http://www.google.com/": 1}, "blogtitle": "Math Pages Blog"}, {"content": ["This post is basically a collection of reviews of different programs (not related to math) and my opinion about their uses. It also includes my opinion (and hopes) for some upcoming products. Windows 7 Yesterday I finally got my hands on Windows 7. Since I am using Linux I obviously tend to think that Windows is inferior to Linux, but I believe that it is important to at least keep an eye on other operating systems. Also, from what I found about it on the net this particular release of Windows is worth looking into. In this short review I am going to only talk about installation and the overall feel of the system. The rest I'd rather leave to more competent people. I used qemu to install it on a virtual machine, so I didn't test all the features (especially not all the graphic features) but I did get a general feel of the system. Somewhat surprisingly I will that I neither like nor dislike it - in another words it failed to make any impression. The install process went without any trouble and I think that it was faster than that of Win Xp (it is hard to tell when using qemu). It also looked much better in terms of graphic (although compared to linux it is ages behind, live CD is much better for installing an OS). The desktop itself looks rather impressive. It is also good that you have a sticky note program as part of the OS already installed. I personally prefer to use a Google to-do list gadget, but for others notes might work better. The start menu is also rather nice, although I think I would like it to consist only of its left side - there is no need for the right side of the start menu to appear all the time, most users don't even use the options you have there (except for the shut down button). I also think that the way it slides instead of opening new menus is definitely an improvement. A similar menu is available for Ubuntu, you can get the deb file here . Virtual folders are another wonderful idea. I would really like to test them using a few thousands photos. Hope they will appear in linux soon enough. If you want a more in-depth review of Windows 7, I suggest these two posts: Windows 7 End user experience and Windows 7 Performance . However, despite all those improvements Windows 7 is still well behind Linux. It requires a lot of space to install, it is less safe and it is still behind in usability. The graphics is clearly improving but there are less useful effects than I have in Linux (frankly there is no way that I will use an OS that doesn't support multiply desktops). I hope that in the future Microsoft will adapt more fearutres from linux, especially the desktop cube. There are other areas in which it is lacking but they didn't changed from XP so I m not going to repeat them here. Overall, this is a very nice version of Windows. I am definitely going to recommend it to those who still insist on using Windows. The only thing to be careful about is RAM. You need at least 2GB of it so if you are upgrading from XP you must make sure that you have enough RAM. In my simulation I was running it on a 3GH single core virtual processor, so you don't need to think much about processors. Any computer bought in the last 3-4 years should be capable to run it just fine.  Google Chrome Since I don't like downloading software that is not available for Ubuntu from a repository, I installed Chrome only recently. I was quite impressed with it. It is a very well build browser. It is fast and has a nice collection of features. Its main shortcoming is the lack of extensions. While some extensions are available, they are just too few. Actually I considered switching to it from Firefox, but decided not to. If there were more extensions I would switch in a second. Since it is going to be an important part of the future Google OS it is quite encouraging to see it doing so well even now. It is also interesting to note that it looks like a frame. The developers clearly put a lot of effort in thinking ways to maximize the part of the browser that actually displays the web page. Frankly it looks like they are already thinking about how Chrome will be part of their OS.  Google Wave I obviously didn't try this one myself - it will be available to the public only at the end of the month. But there is already enough information about it to make an opinion. Overall it looks like a very nice example of software evolution. It is definitely a great concept, especially for those who communicate with lots of friends using the Internet. Since I don't communicate with many people, I don't know how much I will be effected by this product but some of the ways it can be used are clearly interesting to me as well. For example there is an idea to use it for managing comments on blogs. In this way commenting will be done in real time. Also, it will probably be possible to comment on a blog post \"inline\". Such an option would allow one to talk with the author about the post in a wave. A typical case can be asking for futher information or explanation from the author or other readers (a bit like Wikipedia edit page) and then the author will be able to automatically update the actual post with the explanation. Obviously a feature like this is rather interesting for those who have blogs. The only thing that seems to be missing (for now) is the ability to make a video call from inside a wave. However, this is a simple enough matter of integrating Google talk into it, so it will be probably done soon enough (if not by Google than by someone else). Despite the fact that all the information I have about it comes from a few videos, it appears that Google wave is a perfect candidate for a communication center of the upcoming Google OS. In the next post I plan to write a bit about Google Chrome OS and what is an online OS."], "link": "http://mathpages.blogspot.com/2009/09/new-software-wave.html", "bloglinks": {}, "links": {"http://mashable.com/": 1, "http://googlesystem.blogspot.com/": 1, "http://www.gnome-look.org/": 1, "http://www.facebook.com/": 2}, "blogtitle": "Math Pages Blog"}, {"content": ["I wonder if I should write that time went by slowly or should I instead say that it went by without me noticing? I suppose both will be correct. Anyway, I am rather happy to celebrate the second anniversary of Math Pages blog. I once read that most blogs only survive for about 6 month, after this period the person who made the blog leaves it for one reason or another. On the other hand, the blogs that manage to survive after six month usually stay around for a long time. Well, I certainly intend to continue posting, at least untill I am no longer a student. Unfortunately, I must admit that my posting is really irregular. Originally I was aiming for one post per two days, but it didn't work out on the long term. Occasionally I do manage to post this many posts (and even more on some weeks) but there are periods when I don't post anything for more than a week. Right now the ratio of posts to days is one post per 4 days. As you can see that is far from what I want it to be... Well, since this is an anniversary post I suppose it would be logical to resolve to be more committed to posting, but I seriously doubt that that will really help.  It also worth to mention that while originally I intended for this blog to be about math with mentions of physics, that didn't work out. Instead I found out that I don't like to be restricted or even directed in my writing. I prefer to simply wright about what seems to be interesting to me at this particular moment. This is probably one of the main reasons why I couldn't put to use the skribit suggestion widget... But anyway, this blog ended up being mainly about math but I also occasionally write about computers (most linux). In the beginning I wrote a bit about physics, but with time it seems that my interests shifted away from it. This post is probably a good opportunity to announce a little project that I am trying to start. Over the years I managed to collect a small library of math books in pdf format. Right now it is rather small, but it is easy enough to expand. There are after all lots of free math books available (legally) on the net. What I want to do is to create a post with links to all these books I collected and plan to collect (currently stored on my Google docs account). Having such an index will clearly make it easier for me to use my library, and will also make it easier for you to find those books if you need them. I already started to work on this idea, it will probably appear here in about two days (maybe more if I run in some kind of problem). Meanwhile if you have math (programing and physics will do as well) books in pdf format that you don't mind sharing with others, or you know about a site where such books can be found please contact me. While I am not going to promise to use what you sent, I will definitely consider it."], "link": "http://mathpages.blogspot.com/2009/09/math-pages-is-two-years-old-today.html", "bloglinks": {}, "links": {"http://2.blogspot.com/": 1, "http://mathpages.blogspot.com/": 1}, "blogtitle": "Math Pages Blog"}, {"content": ["A few days ago I stumbled on an excellent collection of fractals . According to the site the collection is no longer updated, but nevertheless the images there are among the best fractal images I ever saw. There is also more fractals by the same author available here . I am somewhat worried about the site disappearing so I am going to download all the images on it to my computer and then upload them to a private Picasa album. This way I am not breaching the copyright on the images and if the page indeed closed down, please leave a comment on this post and I will link my Picasa album to this post. In the case that you want even more fractal images, here is another site with hundreds of excellent fractals - Fractal world gallery . Also, I noticed that a lot of visitors to my blog are actually after mathematical wallpapers. Form my own attempts to find such wallpapers I know that they are somewhat of a rarity (at least good ones). I currently have 14 math wallpapers in my Picasa albums , but this is obviously too little (and unfortunately not all of them are good enough to put on a screen). Since there seems to be a demand for such wallpapers I am going to try and get more maybe I will even attempt to draw some myself."], "link": "http://mathpages.blogspot.com/2009/09/fractals.html", "bloglinks": {}, "links": {"http://www.idreamincolor.com/": 1, "http://www.enchgallery.com/": 1, "http://picasaweb.google.com/": 1, "http://home.comcast.net/": 1}, "blogtitle": "Math Pages Blog"}, {"content": ["In the previous post I mentioned that in some situations even the math we used is correct, the result we arrive at might not be correct or it might not apply in the real world. In this post I intend to discuss three such examples. The first example is known as the Tompson lamp problem. Imagine the following situation: You switch a lamp on, than after one minute you switch it off. After 30 seconds you switch it on again, and then after 15 seconds you turn it off. We continue like this for two minutes. Now, is the lamp on or off? There is no real mathematical solution to this problem. One proposed solution is to say that the state of the lamp after two minutes is independent of its state before. So for all we know, after two minutes the lamp could have mutated into a pumpkin. Seriously. Another solution originates from noticing that the behavior of the lamp can be though of as the infinite sum: 1-1+1-1+1-1+.... So if we find the sum we will get the solution. Consider the following: S=1-1+1-1+1-1+... 1-S=1-(1-1+1-1+1-1+...)=1-1+1-1+1-1+...=S 1-S=S 1=2S S=0.5 And thus we found the sum. The result is usually interrupted as the lamp being half on. I don't know about you but I never saw a lamp being in that state. What would happen if we are to do this switching in reality? Thats simple - the switch will break. As you can see in this case modeling the situation mathematically fails completely. The second example is an implementation of a theorem to a situation it cannot be applied in. The theorem I am talking about is the Brouwer's fixed point theorem. It is one of many fixed point theorems, which state that for any continuous function f with certain properties there is a point x0 such that f(x0) = x0. Sometime ago I read a statement that according to this theorem, if you take a glass of water and then mix it in anyway, there always will be a small part of the water that didn't change its position. If you are not careful this may seem reasonable. After all, mixing the water is a continues process. Unfortunately, this is simply wrong. The theorem itself is of course correct, but it cannot be used to discribe water in a glass. For this theorem to be used the body it is used on must be continues, but the water is discrete - it is composed from atoms. Because of this the theorem cannot be applied to such a situation, and the result we get by applying it forcefully is wrong. The third example is known as the Banach–Tarski paradox. It is a theorem in set theoretic geometry which states that a solid ball in 3-dimensional space can be split into a finite number of non-overlapping pieces, which can then be put back together in a different way to yield two identical copies of the original ball. The reassembly process involves only moving the pieces around and rotating them, without changing their shape. Obviously this is not something that is possible to do in reality. Again, the theorem is perfectly fine. The problem is that it cannot be applied to actual balls. During the proof of the theorem (at least the proof I am familiar with) we get a countable infinity of finite degree polynomials of the form p(sinx)=q. We need to choose x in such a way that for all the polynomials q is not 0. Since any polynomial have a finite number of roots, there is at most a countable infinity of values for x that doesn't give us what we want. Therefore we can always choose a value that will work. Unfortunately x is the angel of rotation of the ball. If we want to choose a specific x we need firstly to make sure that we can rotate the ball by such an angel. Surprisingly this is not always possible. The reason for this is physical and not mathematical, so I am not going to explain it in detail, but the main idea is that we cannot make \"moves too small\" in the real world. Mathematics is often said to be describing the real world. Personally I don't think so. Those and other similar examples have one common trait - correct math that cannot be applied in our world (at least not the way we want it to). But it can be used to describe a world of math."], "link": "http://mathpages.blogspot.com/2009/09/correct-math-wrong-results.html", "bloglinks": {}, "links": {}, "blogtitle": "Math Pages Blog"}, {"content": ["Consider the following problem - given a road system is it possible to have a set of instruction which if followed will cause you to end in one specific point regardless of were you started? Obviously this depends on the road system. It is very easy to give examples of road systems for both cases. It turns out however that there are really simple conditions that guarantee the existence of such an instruction set. In order to discuss this mathematically we will need to define a few things. Firstly we are not going to talk about roads but about finite directional graphs. Secondly for every vortex on the graph we will allow exactly d (d is the same for all vortexes) edges to come out from it and an unspecified number of edges to go to it. In such situation talking about \"turning right\" is meaningless so we will instead use colors. Thus every \"color\" is a function that for a given vortex tells us were to go. Naturally there is d colors. In this blog post I will denote colors with letters - for example (a), (b). Only one color means doing only one \"step\", so for longer steps we need \"words\" instead of letters. For example (abdc) means to execute (c) then (d) then (b) and finally (a). In this notation we are looking for a word that when executed will result in us landing on a vortex V regardless of our starting point. We will call such a word a sync word. Required conditions Firstly, lets see what obvious conditions are required. Basically we want a graph that is possible to color in such a way that there will be a sync word. So lets demand the following conditions: 1. The graph is strongly connected - there is a path between any two different vortexes. 2. The graph is not cyclic. To be more precise what we want is: a. The greatest common divisor of the lengths of all the closed paths in the graph is 1. b. It is not possible to divide the graph to a finite number of sets S1,....Sk such that for all i the edges go from Si to Si+1. Theorem The conditions listed above are enough. Prove history I am not going to prove this theorem here. It is possible, but it requires a bit too much explanations and the explanations are hard to understand without drawings. Because of this I am not going to prove the theorem, but I will shortly discuss the history behind the prove and some important points behind the proof. If you want to read the actual prove it should be available online (somewhere). There were three main stages in the attempt to prove the theorem. The first stage was done by Friedman. He defined a weight function of the graph, and showed that if the weigh of the graph is a prime number than there is a way to get a sync word unless the maximum weight (the maximum weight is the weight of the largest (by weight) subset of the graph that can be synced) is 1. As you can see this result is very far from proving the theorem, but it turned out to be an important step - the weight function he defined turned out to be useful in future attempts to prove the theorem. The second stage was done by Kari. He proved that if the graph also has a fixed number of edges entering each vortex and this number is also d, then there is a way to get the sync word. While this is not what is needed this is a much better result than the previous one. It is also interesting to note that he managed to use induction in his prove, by finding a way to reduce the problem of finding a sync word for a large graph to finding such a word in a smaller graph. The third and last stage was done by Abraham Tracman. This was done only in 2007. As I already said his prove requires complex explanations so I am not going to say much about it. The only thing that is important to say is that in the prove we look closely on the results of continuously using the same function on the graph. By analyzing the result we find out that in all the cases we can get two vortexes that satisfy a condition needed for Kari proof to work. Basically he showed that it is not needed to ask for a fixed number of edges entering the vortex, and by this completed the proof. In a way this is an interesting example of how people build on other people work. Conclusion I hope that by now it is clear that the problem has absolutely nothing to do with roads. Well, except for the name. Originally this problem originated from symbolic dynamics. However the name road coloring sound much better and it is possible to use the result in road building, although it is rather pointless to do so. All we managed to do is to show that there is a way to color the graph, so if we color the roads in the appropriate way we will be able to get the needed instruction set but it will require a more complex road system that what we have now. In this particular case mathematical analysis of a problem gave a solution that is accurate and possible to use in the real world - but is this always correct? In the next post I will discuss some rather famous cases where correct math leads to solutions that are impossible in the real world."], "link": "http://mathpages.blogspot.com/2009/09/painting-roads.html", "bloglinks": {}, "links": {}, "blogtitle": "Math Pages Blog"}, {"content": ["If you were reading this blog for a long time you already know that I ditched Windows and moved to linux years ago. I have been using Linux for about 3 years now and I never regretted moving to it. However, annoyingly enough, there is one tiny thing that I cannot do on linux but I can do on Windows. In the Hebrew University, in order to get the exercises you need to download them from the university site. Most of the site works just fine in Firefox, but for some reason it is impossible to download the exercise with it. It is only possible to do so in IE. The students have been asking the university to fix the site for the last two years, but without much success. It is of course possible to go to an university computer and to download everything there, but it is inconvenient. I tried installing IE using wine, but it didn't work. So in the end the only option I could think about was to install Windows using qemu. This post is a short how-to that shows how to install and then configure windows under qemu for it to work without doing problems. The first step is obviously to obtain a windows cd or an iso file. The next is to install all the required packages: sudo aptitude install qemu kqemu-common kqemu-source samba smbfs This will install qemu and also samba for sharing files between Windows and Ubuntu. Next is to configure kqemu - it is an accelerator used by qemu: sudo module-assistant prepare sudo module-assistant auto-install kqemu sudo addgroup --system kqemu sudo adduser $USER kqemu sudo modprobe kqemu Now you need to log out for the changes to take effect. After logging in, the next step is to create a disk image. The minimum size is 4GB (because of the SP3 and other updates), but I used 10GB because I want to be able to install programs latter on without worrying about free space. The image will change it size dynamically, so don't worry about throwing away too much space. To create the image type: qemu-img create -f qcow windows.img 10G Now we can start the install process. If you have a CD insert it and type: qemu -localtime -cdrom /dev/cdrom -m 512 -boot d windows.img I set memory to 512MB but you can enter something else, preferably at least 384. If you want to install from an iso, put the iso in your home directory and type: qemu -localtime -cdrom cdimagefile.iso -m 512 -boot d windows.img After doing this, the install process will start. It worth to note that it will go on for longer than a regular install, so you will have to be patient. Once the install is done, you can start using Windows. To run windows you type: qemu windows.img -localtime -m 512 Optionally you can create a launcher on the panel or the desktop. For this you will need an appropriate icon. I used this one:  As we all know, windows is much less safe than Linux. Luckily qemu has some options that allow us to protect the installation. The first such option is to create an overlay. This will allow you to use windows while saving all the changes in the overlay file and not in the original img file. If you do this and at some point at time Windows becomes corrupt you can just delete the overlay and create a new one without installing Windows from the beginning. To create an overlay type: qemu-img create -b windows.img -f qcow windows.ovl To use the overlay you will need to type: qemu windows.ovl -localtime -m 512 For increased safety you can also use the snapshot mode. In this mode all the changes you make are written to a temporally file which is removed when you close qemu. To use this just add \"-snapshot\" to the end of the command. The final step is to make it possible to share files between Windows and Ubuntu. To do this we can use samba. The first step is to create a shared folder. In my case I created a folder named AnatolySharedFiles in my home directory. Now we can setup samba to share this folder: sudo addgroup samba sudo adduser $USER samba sudo aptitude install system-config-samba Now you can go to System->Administration->Samba, and use it to add the folder you want to share and to add a user password for yourself. Now all that remains is to configure Windows. The first step is to go to My Computer->Properties->Computer name and enter the correct data. Then go to Network places to create the network. The next step is to mount the shared folder as a network drive (this seems to be the best option to me,buy you can access it from network places as well), this is done by clicking on My Computer->Map network drive. After doing all this you hopefully have a working Windows and I have an easy way to get my math homework..."], "link": "http://mathpages.blogspot.com/2009/09/windows-xp-on-ubuntu-with-qemu.html", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1}, "blogtitle": "Math Pages Blog"}, {"content": ["I added new wallpapers to my collections of Firefox and math wallpapers, follow the links to download.    From Firefox Wallpapers"], "link": "http://mathpages.blogspot.com/2009/06/math-and-firefox-wallpapers.html", "bloglinks": {}, "links": {"http://picasaweb.google.com/": 4}, "blogtitle": "Math Pages Blog"}, {"content": ["I once read about a theory that said that numbers can be described as a common property of two groups that have nothing in common excluding their size. For example the number three is a common property of the following groups - three deers, three stones and three trees. In modern mathematics we have a sort of an extension to this idea - ordinals. An ordinal is a well ordered set such that if A is an ordinal and x is in A and y is in x then y is in A. The first ordinals are phi (=empty set), {phi}, {phi,{phi}}, {phi,{phi}, {phi,{phi}}}. Those ordinals correspond to 0,1,2,3. As you probably noticed there is a very simple rule that produces the next ordinal - if A is an ordinal than A(union){A} is the next ordinal. From this we can conclude that: The set of all ordinals is a well ordered set and the union of any number of ordinals is an ordinal. What makes the ordinals truly interesting for me is the fact that in for them \"infinity plus one\" is not equal to infinity. This is very simple to see, infinity is the so called least infinite ordinal - w. It can be defined as the union of all finite ordinals. The next ordinal is w+1=w(union){w}. It is rather obvious that the two sets are not equal and therefore w+1 is not equal to w. Ordinals are not the only example of infinity not being equal to infinity and one, but in my opinion they are extremely intuitive in this regard. After all, all we basically do with ordinals is to constantly \"add one\". This is the same thing we did with natural numbers long ago, but it appears that the natural numbers don't follow our basic intuition that says that \"it is always possible to add one\" In the beginning of the post I told that numbers can be described as a common natural property. This however brings an interesting philosophical question - if our intuition is a product of our world than why do natural numbers that come from it don't follow our intuition after a specific point? A possible answer is that \"infinity is not natural\" and therefore there is no reason for it to follow our intuition in any way. However, infinity appeared as a concept a lot of time ago. At first it appeared as \"many\" which basically told that there was no known number large enough.When a new number (or even a number system) where invented the \"many\" was replaced by an appropriate number. And this brings us to the following thought: Is it possible that we are in the same condition again? That is, should we use ordinals instead of natural numbers? After all, they are pretty much an extension of the natural numbers."], "link": "http://mathpages.blogspot.com/2009/06/ordinals.html", "bloglinks": {}, "links": {}, "blogtitle": "Math Pages Blog"}, {"content": ["Apparently some sites use captchas to assure the intelligence level of their users:"], "link": "http://mathpages.blogspot.com/2009/06/unique-captchas.html", "bloglinks": {}, "links": {"http://4.blogspot.com/": 2}, "blogtitle": "Math Pages Blog"}, {"content": ["I recently found an interesting site called Project Euler . This site attempts to provide a platform for the inquiring mind to delve into unfamiliar areas and learn new concepts in a fun and recreational context. This is being done by publishing different mathematical problems of varying difficulty. I liked the concept so I thought about joining the site, but after taking a closer look on the problems I lost my motivation - most of the problems are meant to be solved using a computer. I just can't feel motivated to write a program in order to sum all the primes less than 2 million (this is problem number 10). However, if you like this type of problems this is clearly an excellent site. They have lots of problems of varying difficulty and new problems are constantly added. For those who like my don't like using computer to solve problems there are problems that don't require a computer to solve - for example the first problem: \"Add all the natural numbers below one thousand that are multiples of 3 or 5.\" This one is a very simple problem, so I guess it will be fine to post a hint to a solution. All you need to do is to sum the arithmetic progressions 3,6,9,..... and 5,10,15..... If you add the sums you will get the result, but the numbers that are multiples of both 3 and 5 will be counted twice. I also really liked problem number 205 . It is pretty easy to solve, but it requires some thinking and there is no need for a computer."], "link": "http://mathpages.blogspot.com/2009/04/project-euler.html", "bloglinks": {}, "links": {"http://projecteuler.net/": 2}, "blogtitle": "Math Pages Blog"}, {"content": ["In the previous post, I wrote about division by zero. In this post I want to talk about one particular case when such division, and its definition are important. As you probably guessed from the title, this post is about calculus. (In this post I am talking only about one variable calculus). One of the most basic questions in calculus is finding slopes of functions. The simplest example of such a problem is to find the slope of a linear function, f(x)=mx+b. In this case we get a straight line, so the slope is uniform. To find is we need to calculate the difference in y divided by the difference in x: (f(x+h)-f(x))/h=(m(x+h)+b-mx-b)/h=m(h)/h=m For a less friendlier functions, we cannot talk about globe slope, but only about slope of a certain part of the function, or even only in one single point. And this is were the problem appeared. We want to know the slope in every point, but how can we calculate it? Firstly we need to define what such a slope is. For example lets look on the function f(x)=x^2 and on the point x=3. Lets look on the points f(3.5) and f(3). If we connect those two points by a straight line, we can calculate the slope of that line. If we draw this on a paper, you will see that the function and the line are really close to each other on a small area around 3. Therefore we can thing about the slope of this line as an approximation to the slope of the function. But, obviously if instead of 3.5 we will take 3.1, we will get a better approximation. In the end we can think about the slope as: slope=(f(3+h)-f(3))/h , h=0 And here we have it - devision by zero. It is obvious that there is no way around it. If h is not zero we get only an approximation and one which can be improved easily enough. The solution to this problem was found by Newton and Leibniz. Their idea was to define a non negative \"number\" that is smaller that any positive number. Such a number is called infinitesimal. The only real infinitesimal is zero, but if we agree to imagine that there is another such number, they we get many such numbers. This is because if dx is an infinitisimal that 0.5dx is also an infinitisimal. Since dx is not zero, we can divide by it. And becasue it is smaller than any positive number we can disregard it as if it was zero. It is simple to find the slope of x^2 usinig dx: slope=(f(3+dx)-f(3))/dx=(9+6dx+dx^2-9)/dx=(6dx+dx^2)/dx=6+dx=6 Although the result is correct, we no longer use infinitesimals, but use limits instead. The reason for this is that infinitesimals are problematic. The problem lies in the very definition - it is not clear what do we mean by a number that is smaller than any positive number, but not negative or zero. We also treat it as both zero and as not zero. However, they are still in use in physics. The reasons for this is that while they are not rigorous enough for mathematicians to use, they give good intuition and they appear rather naturally in physical problems."], "link": "http://mathpages.blogspot.com/2009/03/infinitesimals.html", "bloglinks": {}, "links": {}, "blogtitle": "Math Pages Blog"}]