[{"blogurl": "http://mathnotations.blogspot.com\n", "blogroll": [], "title": "MathNotations"}, {"content": ["Hi All! Long time, no blog... \n \n I've been spending most of my 'spare' time on Twitter and my Facebook Fan Page but I decided to share some of the activities I've developed with the few faithful readers who might still remember me! For those of you looking for richer problem-solving which conforms to the Mathematical Practices of the State Standards, here's one you might find useful. Please let me know how you adapt it for your students and how they responded. I hope to be writing more of these. \n \n Note: If the image below is cut off, click on it and zoom in if needed. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n If interested in purchasing my NEW 2012 Math Challenge Problem/Quiz book, click on BUY NOW at top of right sidebar. 175 problems divided into 35 quizzes with answers at back. Suitable for SAT I, Math I/II Subject Tests, Math Contest practice and Daily/Weekly Problems of the Day. Includes multiple choice, case I/II/III type and constructed response items. Price is $9.95 and includes detailed solutions, strategies, tips, hints and key facts for the first 8 quizzes as well as answers for all quizzes Secured pdf will be emailed when purchase is verified. DON'T FORGET TO SEND ME AN EMAIL (dmarain \"at gmail dot com\") FIRST SO THAT I WILL BE ABLE TO SEND THE ATTACHMENT! VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/6407891536813929879/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1}, "blogtitle": "MathNotations"}, {"content": ["Excerpt from my local paper, The Record, 9-3-12 \n \n For the first time there is broad national consensus on the most necessary skills, so a third grader in Paramus and his camp buddy in Peoria will face roughly the same expectations when they walk back through the school doors this week. \n \n \"It's almost the entire country coming to an agreement about what kids should learn.\" Many parents in affluent suburbs might assume that widespread worries about weaknesses in the American education system relate to poverty and think their own kids' schools are doing just fine but this shift aims to raise the bar for everybody. Some studies for example conclude that even advantaged U.S. children with college educated parents can barely compete internationally in math. \n \n How long have I waited to read these words? \n How long have I been advocating this and supporting Prof. Wm. Schmidt's recommendations? \n How many of my blog posts have been dedicated to this topic in the past 6 years? \n How many of you supported me? Opposed me? Argued that this will never happen? \n  \n So do I feel vindicated? I'll let my readers guess! \n \n \n \n \nIf interested in purchasing my NEW 2012 Math Challenge Problem/Quiz book, click on BUY NOW at top of right sidebar. 175 problems divided into 35 quizzes with answers at back. Suitable for SAT I, Math I/II Subject Tests, Math Contest practice and Daily/Weekly Problems of the Day. Includes multiple choice, case I/II/III type and constructed response items.\nPrice is $9.95. Secured pdf will be emailed when purchase is verified. DON'T FORGET TO SEND ME AN EMAIL (dmarain \"at gmail dot com\") FIRST SO THAT I CAN SEND THE ATTACHMENT! VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/6158102874273123283/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Mr. Canastar had 3 identical decks of cards, and told his class that each contained more than 100 but less than 200 cards. He told Yohan to count the 1st deck by 3's and there were 2 left over. He told Matt to count the 2nd deck by 5's and there were 3 left over. CC counted the 3rd deck by 7's and there were 2 left. \n \nHe challenged the rest of the class to figure out how many cards were in each deck. Can you? And explain your method too! \n  \n \n \n \n \n \n \n If interested in purchasing my NEW 2012 Math Challenge Problem/Quiz book, Revised Version 1.1, click on BUY NOW at top of right sidebar. 175 problems divided into 35 quizzes with answers at back . There are now detailed solutions, hints and strategies for the first 8 quizzes. Suitable for SAT I, Math I/II Subject Tests, Math Contest practice and Daily/Weekly Problems of the Day. Includes multiple choice, case I/II/III type and constructed response items. Special Limited Price $7.9 9. Secured pdf will be emailed when purchase is verified. DON'T FORGET TO SEND ME AN EMAIL (dmarain \"at gmail dot com\") FIRST SO THAT I CAN SEND THE ATTACHMENT! VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/3344786812128932786/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Never too late in the school year to review percents, right? Well, even if you don't agree, here goes... \n \nFirst a problem similar to the one I posted on Twitter the other day. \n \n Middle School Level? \n \n The cost of a meal including a 10% tip was $13.75.\nWhat was the tip, in dollars? \nAns: $1.25 \n \n SAT-type (Higher level of difficulty) \n \n The cost of a meal is $M. With an x% tip included, the bill came to $T.\nWhich of the following is an expression for x in terms of M and T?\n\n(A) T/M (B) (T-M)/M (C) 100T/M (D) 100(T-M)/M (E) (T-M)/(100M) \nAns: D \n \n \n Thoughts and Questions... \n \nWhat % of your middle school students could handle the first question? For that matter, what % of your secondary students would solve it? \n \nCan you predict which of your students would be able to solve the first question mentally or with some quick trial-and-error (ok, G-T-R), using their calculators. I chose 10% to make this possible. Do you get upset when students do this? Should you? \n \nWhat do you predict would be the difficulties your algebra students might confront in the 2nd problem? \n \nIs it easy to eliminate some of the answer choices and to make an educated guess from the rest? \n(NOTE: I composed the question and the answer choices and I know some of you could improve upon my efforts!) \n \nNOTE: The 2nd question is representative of the harder problems on the SATs and there are many of these in my new Challenge Math Problem/Quiz Book mentioned below. \n \n \n \n \n \n \n \n \n \n If interested in purchasing my NEW 2012 Math Challenge Problem/Quiz book, click on BUY NOW at top of right sidebar. 175 problems divided into 35 quizzes with answers at back. Suitable for SAT I, Math I/II Subject Tests, Math Contest practice and Daily/Weekly Problems of the Day. Includes multiple choice, case I/II/III type and constructed response items.\nPrice is $9.95. Secured pdf will be emailed when purchase is verified. DON'T FORGET TO SEND ME AN EMAIL (dmarain \"at gmail dot com\") FIRST SO THAT I CAN SEND THE ATTACHMENT! VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/7560987222000248479/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["No matter where you introduce a lesson on geometric sequences, we can always begin with definitions, rules and formulas. \n \nThe alternative is to build on student intuition and natural curiosity by asking them to write their own observations and questions they would like to have answered. \n \nImaginary Scenario (or is it?) \n \nJack: Mom, all the terms are just powers of 3 or their opposites, right? \n \nMom (Jane): Write your hypothesis, test it and let me know. \n \nIf your students or your son is not 15 year old Jack Andraka, here are some suggestions... \n \n \n1. What are the next 3 terms? \n2. If the 99th term is x, write an expression for the 100th term? (Recursive thinking) \n3. Which terms are positive? Negative? \n4. Write an expression for the nth term. \n5. How would we graph the sequence? \n6. Are the terms of the sequence increasing? Decreasing? Both? Neither? \n7. Which terms of the sequence are greater than a million? A trillion? Less than - 1000000 ? \n \nAnother Imaginary Scenario (or is it?) \n \nUh, show me where this topic is in the CCSSM. \nUh, where does it say I have to ask all these questions? \nJack who? \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/6122041721562974079/comments/default", "bloglinks": {}, "links": {"http://feeds2.feedburner.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["READ COMMENTS TO GET FULLER PICTURE!\n\n\n I'm the host, you're the player. \nI shuffle 3 cards, 2 of which have the word \"LOSE\" on them, one has \"WIN\". \n \nYou randomly select a card but you're not allowed to turn it over and I do not turn over my 2 cards. \nAT THIS POINT, WHO IS MORE LIKELY TO HOLD THE WINNING CARD? \n \nI look at my cards and reveal a losing card. \nNOW, WHO IS MORE LIKELY TO HOLD THE WINNING CARD! \n \nI ALLOW YOU TO SWITCH TO THE REMAINING FACE DOWN CARD. SHOULD YOU? \n \nI WOULD! \n \nHey, I figured I'd try my \"hand\" at this classic too! An important point here is whether my model of the original puzzle is equivalent. \n \nYour thoughts? \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/6357981478896591693/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Which growth rate will make the Hulk taller? \n  \n  A growth of 60% for the year OR \n  1% growth per week? \n  EXPLAIN!! \n \n \n POLYANAGRAM \n  \n Fresh fruit is so expensive these days. I cannot find a _ _ _ _ _ _ _ _ _ _. \n \nFill in blanks, with two 5-letter words which are anagrams of each other. \n \n First 3 correct answers to the math problem (with explanation) and the PolyAnagram will win my Challenge Math Book. Email me at dmarain at gmail dot com. \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/2900426049917724351/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["DYSFUNCTIONAL \nDEF: ONE WHO STRUGGLES WITH FUNCTIONS \n \n The x- and y-intercepts of a line are 2t^3 and 3t respectively. If the slope of a perpendicular line is 3/2, the positive value of t is ? \n \nAns: 3/2 \n \nRANDOM THOUGHTS \n1.  I've received several thoughts re my PolyAnagrams. I'm a word puzzle fanatic as you might have guessed by now and I enjoy writing these. Let me know if you'd like to see more or restrict a math blog to math! \n \n2) I'm actually thinking of writing 50 of these and offering it on Amazon for a couple of bucks. My question for my readers is, would you buy it? \n \n3) I'm still frustrated by reviews of this blog that no one comments that it is essentially intended for teachers. I use the problems as a vehicle for deeper reflection about our practice. That's why I usually ask a series of questions after the problem. Does anyone actually read these! \n \n4) I noticed that my post about an explanation of one of my problems drew more readers than all others combined! Should I interpret that to mean that my readers want to see solutions more than answers? Pls comment! \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/1662843153814641598/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["For how many pairs (x,y) of positive integers is 2x+3y<24? \n \nAns:37 \n \nAns to QuadAnagram: \nFILER,RIFLE,FLIER,LIFER \n \n \n Today's PentAnagram! \nComplete the sentence with FIVE 4-letter words which are anagrams of each other. \n \nMr. Jones' students watched with ---- attention when he took a -----fall, onto the ----. But this was just ---- of a ---- he was setting \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/5562932159699445644/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["First, here's a restatement of yesterday's probability question : \n \n Compare these 2 probabilities and explain method: \n \n (a) Prob of rolling exactly 3 sixes in 5 rolls of a fair die. \n \n (b) Prob of rolling exactly 3 sevens in 5 rolls of a pair of fair dice \n \nDiscussion : \nBoth are examples of binomial probability because they involve repeated independent  trials each of which has 2 outcomes. The following explanation is intentionally detailed and 'repetitious'. \n \nThe prob of a 6 on each roll is 1/6. Each roll produces only 2 outcomes, either a 6 (prob=1/6) or not a 6 (prob = 5/6). \n \nThe prob of a 7 on each roll of a pair of dice is 6/36 or 1/6. Each roll of the pair has only 2 outcomes, either a 7 (prob=1/6) or not a 7 (prob=5/6). \n \nTherefore, the probabilities of getting 3 successes in 5 trials is the same. Since the question asks for a comparison, we're done. \n \nThe actual prob is C(5,3)(1/6)^3•(5/6)^2 where C(5,3) is the 'MathNotation' for the number of ways of arranging 5 objects, one group of 3 identical objects and a separate group of 2 identical objects. This is not the usual way of defining combinations but I like this interpretation. \n \nI guess the QuadAnagram was a bit challenging. Here's a hint for the ending: \n \n ...he's a bored L---R. \n \n \n \n \n Email me at dmarain at gmail dot com with your answer. \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/8351700949151178281/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Well if you tried yesterday's TriAnagram you know the rules. This time we're looking for FOUR 5-letter words to fill in the blanks. The words are all anagrams of each other. \n \n \n John was so bored with being a ----- that he took his -----, went to the airport, saw his boss who was a regular ----- and now John is a bored -----. \n \n \nOk, some math.. \n \n Compare these 2 probabilities and explain method: \n  \n (a) Prob of rolling exactly 3 sixes in 5 rolls of a fair die. \n  \n (b) Prob of rolling exactly 3 sevens in 5 rolls of a pair of fair dice \n  \n We had 2 winners yesterday and each received my new New Math Challenge Book. \n \nFIRST 3 TO SOLVE TODAY'S ANAGRAM AND MATH PUZZLE WILL RECEIVE MY BOOK AND THEIR NAME WILL BE PUBLISHED! \nEMAIL ME AT dmarain at gmail dot com \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/1555218862580494670/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Update... \nMark James is our first winner today and he already has received his prize! Two to go... \nCharles Drake Poole is our 2nd winner! \nJoshua Zucker is our 3rd and final winner!\nCongratulations!\n\n\n\nFirst if you haven't seen my QuadAnagrams and Trianagrams on Twitter, I'll start you off with a fairly easy Triple- or TriAnagram.2 \n \n I opened my mouth ----- but my ----- braces still felt -----. \n \nObject: Replace the dashes with 3 different 5-letter words which are anagrams of each other. \n \n First 3 to email me at dmarain at gmail dot com with the solution to my TriAnagram and the unique property shared by 135 and 144 will receive a free copy of my new Math Challenge Problem Quiz Book. \n \nOk, back to asking your students the bigger question: \n \n What makes 135 and 144 so special! \n \n1) Have them work individually or in pairs? \n2) Use calculator? \n3) Get them started or ask someone for an idea? \n4) What if they say 144 is a perfect square? Does the question imply that the properties must apply to both ? Should I have made it clearer in the wording of the problem or is the word and sufficient to convey that? \n5) The really unusual property I'm looking for is only shared by 0,1,135 and 144. Good luck finding it! \n \n \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/2013020378613817067/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["For exercise, a prisoner was chained to one corner (lower) of a 10 ft concrete cube located in the center of the yard. If the chain was 16 ft long and was not obstructed except for the cube, over how many sq ft of ground could he roam? \n  \n  Ans: 210π sq ft \n  \n \n \n1. Give the students the diagram or have them draw it themselves? \n2. Have them work individually or in groups? \n3. How much time would you give them to work on this in class? \n4. After discussion, how would you know if they 'got' it? Assessment? \n5. Makes more sense to give them a variant of the problem for HW or ask them to design their own and solve it? \n \n \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/4349582821579098723/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["A fairly common standardized test question for Algebra 1,2 or SATs is something like \n \n The sum of 2 numbers is 20 and their product is 64. What is the larger number? \n \nThis question requires the student to actually find the numbers as opposed to a question with the same given info but asking for the positive difference of the numbers. \n \nDo you suggest to students that many of these types of questions can be handled by inspection with mental math? This is because the majority of standardized math questions involve simple integer values or adhere to the \"Keep it Simple\" philosophy! \n \n \nFrom either of the given relationships students should be able to arrive at 16 and 4 as the values and proceed from there. For the 25% or so of questions which do not admit a simple solution there's always straight algebra or the \"test each answer choice\" strategy for Multiple Choice. By the way this is why item writers often shy away from direct \"solve for x\" types, preferring the \"find the positive difference \" type. \n \nPlease don't forget to make that critical connection to the graph of a linear-quadratic system. A quick sketch of the line x+y=20 and the rectangular hyperbola xy=64 suggests there are 2 pairs of solutions which involve the same numbers by symmetry, i.e., (4,16) and (16,4). \n \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/1939764375948069213/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Well, SATs are now over for this month but anytime we can exercise students' minds is not a waste of time IMO. \n \n \n If x=2.76, what is the value of \n  (x-3)/(x-2) - (1-x)/(x-2)? \n  NO CALCULATORS - 30 sec... \n \n(1) Would students think \"there must be a trick here\"? \n(2) Do you see value in this quickie? \n(3) It might be fun to have half the class use pencil, paper and calculator while other half does it mentally. \n(4) Of course most students should be careful when doing standardized test questions so we're not advocating quick mental math methods for all questions! \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/1212743269147456688/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Once students learn the strategy for doing these kinds of questions, the SAT and other standardized tests seem rather easy! \n \nx+y=10 \nx^2+y^2=10 \nFind x^3+y^3 \n \nAns: -350 \n \nNotes: \n \n(1) Before giving students this question you may wish to scaffold with finding xy first. \nAns: 45 \n \n(2) To promote connection-making and to deepen their thought processes, give them the answer -350 and ask: \n(a) Without graphing. explain why the graphs of the 2 given eqns DO NOT INTERSECT! \n(b) Then how can there be a solution! \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/2697150314266484311/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Vi Hart must be having an effect on me! After proudly explaining for over 40 years why 0.9999 ... must equal 1 using the Density Property of the Reals (see my post Another Proof that 0.9999 ...=1), I just had an epiphany of sorts. \n \nIf 0.9999 ...=1, then ( 0.9999 ...)^2 must also equal 1 from the properties of the reals. But squaring a finite string of 9's (with or without a decimal point) produces a fascinating result: \n(0.99)^2= 0.9801 \n(0.999)^2= 0.998001 \n( 0.9999 )^2= 0.99980001 etc... \nThis sequence of decimals seems to suggest the existence of a non-real number which differs from 1 by an infinitesimal amount, so-called hyperreal numbers, leading to the non-standard analysis of Abraham Robinson . Who knows where the teaching of calculus might be today if Dr. Robinson had not died at the age of 55 from the disease that took my wife 2 months ago -- pancreatic cancer. \n \nWell, maybe it's healthy to have one' roots shaken after many years. After all, my tag line for this blog for a couple of years involved how new ideas are often at first ridiculed, then vehemently opposed and finally accepted as obvious ... \n \nNOTE: I omitted the hyperlinks in this article. I was getting too 'hyper'! \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/992955682110396497/comments/default", "bloglinks": {}, "links": {"http://feeds2.feedburner.com/": 8, "http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Here's another quick exploration for middle schoolers and beyond. I believe it builds mental math and number sense skills and more. \n \n With your partner write as many \"interesting\" observations about the number 841 as you can in the next 5 minutes. Yes, calculators are permitted. \n  \n If they've learned the Pyth Thm, you may want to suggest afterward that 841 could be the square of the hypotenuse of a right triangle - let them find the 3 sides (unless a team comes up with that! ).Talk about making connections! \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/7091896360793350186/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["How many positive integers less than 1000 have exactly \n \n(a) 3 positive integer factors \nAns: 11 \n \n(b) 5 pos int factors \nAns: 3 \n \n(c) 7 factors \nAns: 2 \n \nIs this topic in the middle school core standards? Under divisibility? Factors? \n \nHave you seen questions like these on state tests? SATs? \n \nWhat strategy would you like your 6th-8th graders to use? Assuming they don't know a 'rule' for this problem, how can they best discover a pattern? Would it make sense for students to make a 2-column table of integers and number of factors? \n \nWhy am I addressing middle school curriculum when the title of this post refers to SATs? \n \nIs this question not worth all the time it would consume? \n \nDo you believe this question is only for the 'mathletes' who take math contests? \n \n \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/3972210427564198215/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["1) To show myself that I still can \n2) To let my faithful readers and fellow/sister bloggers know that I'm back \n3) To have that feeling of accomplishment seeing my posts ranked #1 on Alltop again \n4) To keep busy and distract my mind from other thoughts \n \nDon't worry if you can't keep up with my manic publishing pace. I will soon be slowing down! \n \nDave Marain \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/7627534829177148860/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Ever wonder about practical applications of those 'some liquid is being drained from a conical tank' calculus problems? \n \nWell, they do manufacture storage tanks with cylindrical tops and cone-shaped bottoms. Ask your students why, then share the following  excerpt 'borrowed' from the website of a company which makes these: \n \n\" Cone bottoms provide for quick and complete drainage.\" \n \n Alright already - enough motivation for a geometry  problem! No calculus needed! \n \n A conical storage tank with a maximum depth of 10 feet  is completely filled with a chemical solution. Some of its contents are then drained from the bottom.  \n \nAsk your students: \n \n(a)  When depth of liquid falls to 5 ft, explain intuitively (no calculations) why much more than half the contents has drained out. \n \n(b) Now for the geometry application... \nWhat % of the total liquid has been drained when depth drops to 5 ft? \n \nAns: 87.5% \n \n(c) (More challenging) What should depth be for tank to be half full? Give both one place approx and 'exact' answer. \n \nAns: approx 7.9 ft \nI'll leave exact answer to my astute readers! \n \nNote for instructor: You may want to explore different depths like 6', 7', 8' first to see how close we can come to half full. \n \nQUESTIONS FOR THE INSTRUCTOR \nWHAT ARE THE BIG IDEAS HERE? \nDO YOU BELIEVE THIS CONCEPT IS ASSESSED ON SATs? \nGIVE PRECISE WORDING OF THIS OBJECTIVE IN THE CORE CURRICULUM. \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/837474472917632382/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["Show that the area of a  13-14-15  triangle is 84. Compute mentally - 30 seconds tick tick tick... \n  \n I'm being silly with the ticking clock but it is possible to do this if you choose the \"right\" base! Unless of course you can mentally apply Heron's formula which is doable! Ok, so there's more than one way as always! \n \nSo what makes it special!? Somebody out there knows... \n \n If you like these challenges consider purchasing my new Math Challenge Problem/Quiz Book - 175 questions - SAT format - with answers. Go to top of right sidebar to order. \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/3729843861654582179/comments/default", "bloglinks": {}, "links": {"http://feeds2.feedburner.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["A diagonal of length x of a rectangle makes a 30° angle with the base. \n \n(a) Show that the area of the rectangle is \n(x^2)√3/4. \n \n(b) The formula in (a) is also the area of an equilateral triangle of side length x. What triangle is this the area of? Explain! \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/8401385959301726496/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["I just tweeted this flight of fancy... \n \n The next time a student says, \"When are we ever going to use this?\", try \n \"If you're referring to your brain, I was thinking the same thing!\" \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/6256119768275303754/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}, {"content": ["The mean of 3^(m+2) and 3^(m+4) can be expressed as b•3^(m+3). If m>0, then b=? \n \nAns: 5/3 \n \nOn an actual College Board test, this would likely be multiple choice and perhaps a bit easier but s similar question appeared on the October 2008 exam. \n \n Would you recommend to your students 'plugging in' say m=1? \n \n Even if students avoid an algebraic approach, we as educators can still use this example to review exponent skills, yes? \n \n Sent from my Verizon Wireless 4GLTE Phone  VISIT ME DAILY ON TWITTER AT twitter.com/dmarain"], "link": "http://mathnotations.blogspot.com/feeds/7411085019394091299/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "MathNotations"}]