[{"blogurl": "http://www.maxgadney.com\n", "blogroll": [], "title": "maxgadney.com"}, {"content": ["One lunchbox per child \n Tom Chi and Marty Cagan were the stand-out speakers of a recent conference devoted to product management. (theirs was an outlook more suited to new product development/ reinvention than mid-cycle management) \n To summarise - \n - product development is product validation - a means of both exploring what you Could do, but just as importantly, deciding what you Should do \n - you need a lot of collateral to test as only a small percentage is ever any good  \n - you'll therefore need to make lots of prototypes - quickly \n - you'll need materials that let you work as quickly as you can think (Chi showed how they made basic Google Goggles after a day, testing the balance/weight using just wire and clay) \n I think this is very exciting - the realisation of work with quick results. \n So what purpose prototyping? Some of my recent work has involved prototyping in the following guises -  \n Pathfinding - Data x expert + what we can and cannot do \n Selling/ convincing - Selling to clients and departments with real, running code - allows them to sell on internally too \n Feasibility - see above - satisfies all that the basics are covered - there are many more \n So I'm currently looking at people, companies and tools that will let me understand, test, display very very quickly. \n But be careful what you wish for - a Tableau genius I worked with said that Tableau \"can make things quicker than you can think\" - not necessarily a good thing - let's start with speed of thought and go from there."], "link": "http://www.maxgadney.com/2012/10/prototyping-at-the-speed-of-thought-1.html", "bloglinks": {}, "links": {"http://maxgadney.typepad.com/": 1, "http://unreasonableinstitute.org/": 1, "http://svpg.com/": 1, "http://aftertheflood.co/": 1}, "blogtitle": "maxgadney.com"}, {"content": ["Detail from recent work for GDS department at UK government \n Wow, September has just finished and things are extremely busy. \n At After the Flood, we celebrated our first anniversary with the release of two major projects - one for UEFA.com and one for the GDS department of the UK Government .  \n The site has been modified too, to show off work better and to feature our steady stream of press too, including a recent interview with the Economist Intelligence Unit. \n And I've just spoken at O'Reilly Strata - nice to have a full room, hearing about the cross over between user centred design and data product design. \n The rest of the year is shaping up to be busy - two current projects in progress and a few more in the pipeline. \n I'll be writing a bit more on the end of our first year - but posts will be intermittent while there is a company to run."], "link": "http://www.maxgadney.com/2012/10/busy-days-1.html", "bloglinks": {}, "links": {"http://strataconf.com/": 1, "http://aftertheflood.co/": 6}, "blogtitle": "maxgadney.com"}, {"content": ["Our speaker line up for Design of Understanding is filling up nicely - one more to go. \n Check out who is coming - a typically, fabulously diverse bunch \n And get a ticket here"], "link": "http://www.maxgadney.com/2012/09/design-of-understanding-2013-speakers.html", "bloglinks": {}, "links": {"http://www.thedesignofunderstanding.com/": 2}, "blogtitle": "maxgadney.com"}, {"content": ["I've written an article for Domus. \n As an architecture magazine, they are looking to expand their horizons, spearheaded by Dan Hill's Supernormal department."], "link": "http://www.maxgadney.com/2012/07/domus-article-sports-visualisation.html", "bloglinks": {}, "links": {"http://www.domusweb.it/": 3, "http://www.cityofsound.com/": 1}, "blogtitle": "maxgadney.com"}, {"content": ["PSFK recently did and interview with us about our approach to work - and especially the Titanic video. \n PSFK has a broad audience but it got me thinking about who is interested in what we do. \n Why would advertisers be interested in data products? (the upcoming Cannes Lions creativity festival will likely be more film that app heavy) \n The answer to this is that many advertisers are interested in anything that grows a customer relationship with a brand or product. \n Data-enabled products do this at their core - they take in data (often from the customer - blood pressure, miles run, food bought) and feed back recommendations or show the activity of others. \n Nike+ is the classic example of these 'personal analytics' - they do so well because they are collecting the data as well as presenting it and as advertisers will know from their travails with the market research industry, decisions/products are only as good as the data collected. \n The main problem facing advertisers - who are by large a smart bunch is their clients inability to commit to the length (cost is secondary) of projects that require this software/product development, data collection and feedback. \n This is one reason that the companies (such as MassiveHealth) develop their own consumer analytics apps. But not all companies have capable development teams - and that is where advertisers may get involved - if they don't, the clients will look elsewhere. They may not have the internal capability (data-product development teams in agencies?) either - and that is where companies like us come in. \n So I think there is a place for advertisers to get in on the act with creating data apps for their clients - there is no doubt that such work will benefit their relationship with the clients as well as their clients customers. Even people who like words like CRM will be happy. It just needs the right client to see the light."], "link": "http://www.maxgadney.com/2012/05/psfk-and-data-products-in-advertising.html", "bloglinks": {}, "links": {"http://vimeo.com/": 1, "http://www.canneslions.com/": 1, "http://nikeplus.nike.com/": 1, "http://massivehealth.com/": 1, "http://aftertheflood.co/": 1, "http://www.psfk.com/": 1}, "blogtitle": "maxgadney.com"}, {"content": ["The new eye magazine is out and I've got a couple of articles in it. \n This one is about the current state of information design in industry. \n And there is another one that features in a look back at important information design from history. \n If you don't know Eye magazine, it is the best graphic design magazine in the world. It is generally a challenge to get designers to say anything insightful, but Eye manages to find those that can.  \n It is also a marvelous piece of design in itself. Many design magazines abdicate a mission of beauty, worried that their customers will gripe - but Simon Esterson and team are more than up to it. \n Buy Eye."], "link": "http://www.maxgadney.com/2012/04/you-are-here-article-in-new-eye-magazine.html", "bloglinks": {}, "links": {"http://www.stackmagazines.com/blog": 1, "http://www.eyemagazine.com/": 3}, "blogtitle": "maxgadney.com"}, {"content": ["My company After the Flood has made another video for BBC Knowledge and Learning. \n This time we did a film for the upcoming 100 year anniversary of the sinking of Titanic. \n It will sit in their Titanic section of the History website \n There is more write-up here on the main site."], "link": "http://www.maxgadney.com/2012/04/titanic-video-for-bbc-history.html", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://vimeo.com/": 2, "http://aftertheflood.co/": 1}, "blogtitle": "maxgadney.com"}, {"content": ["I've just seen a tweet from a US sportscaster on the Man Utd result \"With the win, Manchester United is 90.4% favorite to win PL title, per SPI. Odds were 77.1 pct before weekend.\" Fair enough - but that isnt the way most of everyone else talks about football. The things people want evidence on are not the things that supply obvious data. This is why football is a different game than most US sport(s). We want depth - but not of that stuff. A big project at the moment (separate from the MC work) addresses this. And so does an upcoming article. More soon."], "link": "http://www.maxgadney.com/2012/04/ive-just-seen-a-tweet-from-a-us-sportscaster-on-the-man-utd-result-with-the-win-manchester-united-is-904-favorite-to-wi.html", "bloglinks": {}, "links": {}, "blogtitle": "maxgadney.com"}, {"content": ["This is an interview I did while at Strata 2012. \n It is about video data graphics and how to to them.  \n The video refers to this one which I showed at the conference. \n I'm not sure if the actual conference talk is up yet, but the interview is a decent summary. \n There was a lot more about how video design can teach UI design a thing or too also."], "link": "http://www.maxgadney.com/2012/03/strata-2012.html", "bloglinks": {}, "links": {"http://www.youtube.com/": 1, "http://vimeo.com/": 1}, "blogtitle": "maxgadney.com"}, {"content": ["In case you have come to this blog to find out whether it will be worth selecting my talk at Strata, let me give you some clues and you can make up your mind. \n The talk is about video graphics and what makes good ones. But it is also about how the design principles of decent graphics can be applied to interface design. \n It is more likely that people at Strata are involved with the latter, so at the end of each segment, I'll be stating some ideas on where visualisation interfaces should be headed. \n I'll be showing some examples of videos but if you want tonnes of that, that's what the internet is for - especially here. \n I'll look at why video graphics are becoming popular and also some of what they are not so good at. \n I'll spend a bit discussing what compelling stories are - because without these, any video is unwatchable. I think it is important that video graphics have as much craft at the story level as at the visual level. \n I hope to see you there."], "link": "http://www.maxgadney.com/2012/02/my-talk-at-strata.html", "bloglinks": {}, "links": {"http://strataconf.com/": 1, "http://vimeo.com/": 1}, "blogtitle": "maxgadney.com"}]