[{"blogurl": "http://mfadiagrams.blogspot.com\n", "blogroll": [], "title": "MFA Diagrams"}, {"content": ["Source: Ken USHIJIMA, Mitsuteru IRIE, Neni SINTAWARDANI, Jovita TRIASTUTI, Umi HAMIDAH, Tadaharu ISHIKAWA, Naoyuki FUNAMIZU, 2012. Sustainable design of sanitation system based on material and value flow analysis for urban slum in Indonesia  This MFA was created in partnership between Japanese and Indonesian universities. The paper includes MFA and Value Flow Analysis (VFA… new blog?). In trying to find the affordability to pay for waste services, they found that garbage and excreta costs are 0.7% and 1.1% respectively of per capita income."], "link": "http://mfadiagrams.blogspot.com/feeds/4874028998305565250/comments/default", "bloglinks": {}, "links": {"http://lh3.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: T. A. Terekhanova, B. Helm, J. Traenckner and P. Krebs, 2012. IWRM decision support with material flow analysis: consideration of urban system input.  This MFA was created as part of a review of material flow analysis tools by the authors who examined the potential of MFA in the field of integrated water resources management (IWRM) in urban systems. In the above diagram, depicted emission pathways include Flows from combined sewer system diverted directly into receiving water object (C7) and Effluent from municipal WWTP (E1). I find the diagram to be compelling, and wonder how it would work as a base for a substance flow analysis looking at pollutants."], "link": "http://mfadiagrams.blogspot.com/feeds/3555437827382014138/comments/default", "bloglinks": {}, "links": {"http://lh3.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Liao, Wenjie, 2012. A thermodynamic perspective on technologies in the anthropocene : analyzing environmental sustainability."], "link": "http://mfadiagrams.blogspot.com/feeds/5790995909556104133/comments/default", "bloglinks": {}, "links": {"http://lh3.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Hiroaki Takiguchi and Kazuku Morita, 2012. Global Flow Analysis of Crystalline Silicon . The University of Tokyo, Japan This paper looks at the production of crystalline silicone, one of the basic ingredients of solar photovoltaic panels."], "link": "http://mfadiagrams.blogspot.com/feeds/4793501907811026479/comments/default", "bloglinks": {}, "links": {"http://lh5.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Bruno Kestemont, Marc Kerkhove, 2010. Material flow accounting of an Indian village.  This illustrated MFA shows the synthetic ecosystem of an Indian village. Created by scholars from Belgium, I would say this fits into the “Belgian School” of MFA diagrams, influenced by the urban metabolism of Brussels illustrated MFA diagram, as I posted earlier , with heavy reliance on cartoonish pictograms. Noticeable symbiotic elements are the connection of the human waste and manure into the Silva and Saltrus grove, which then supplies the settlement with fuel wood."], "link": "http://mfadiagrams.blogspot.com/feeds/7818807208063609997/comments/default", "bloglinks": {}, "links": {"http://lh6.ggpht.com/": 1, "http://mfadiagrams.blogspot.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Olli Salmi, 2006. Eco-efficiency and industrial symbiosis – a counterfactual analysis of a mining community.  This MFA pertains to a non-realized industrial symbiosis project planned for the Russian Kola Science Center in mid-1980, in which the author investigates what may have been the benefit of the symbiotic system. What is interesting about the specific methodology of this MFA is that several different materials are considered simultaneously in the various flows. For example, one flow is “phosphate” while another is “cement”. While the author does not go so far as to include energy flows in addition, it is noticeably different than single-material MFAs."], "link": "http://mfadiagrams.blogspot.com/feeds/3264889082468273742/comments/default", "bloglinks": {}, "links": {"http://lh6.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Fabrice Mathieuxa, Daniel Brissaud, 2010. End-of-life product-specific material flow analysis. Application to aluminum coming from end-of-life commercial vehicles in Europe.  System definition and results of this MFA of aluminum in vehicles. What is interesting about this research is the use of sub-systems to describe EU-15 and EU-10 (EU-15 is the member countries in the European Union prior to the accession of ten candidate countries on 1 May 2004)."], "link": "http://mfadiagrams.blogspot.com/feeds/8889722235657250077/comments/default", "bloglinks": {}, "links": {"http://lh3.ggpht.com/": 1, "http://lh6.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Mingming Hu, Stefan Pauliuk, Tao Wang, Gjalt Huppes, Ester van der Voet, Daniel B. Müller, 2009. Iron and steel in Chinese residential buildings: A dynamic analysis.  Some of the dynamics considered in this MFA are lifetime, birthrates, per capita floor area, and urbanization rates in China. Previously, a dynamic material flow analysis (MFA) model was developed to analyze the dynamics of the rural and the urban housing systems in China. That model was expanded to analyze iron and steel demand and scrap availability from the housing sector. In the diagram, a conceptual outline of the stock dynamics model, rectangles represent processes, ovals depict flows, hexagons illustrate determinants or drivers and dashed lines represent influences between variables. Certainly interesting work from Chongqing University, Institute of Environmental Sciences, and Norwegian University of Science and Technology. I am not that familiar with dynamic MFA, but I can certainly appreciate how it expands the static MFA methodology."], "link": "http://mfadiagrams.blogspot.com/feeds/1350652961736909753/comments/default", "bloglinks": {}, "links": {"http://lh4.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Gernot Stoeglehner, Peter Edwards, Peter Daniels, Michael Narodoslawsky, 2011. The water supply footprint (WSF): a strategic planning tool for sustainable regional and local water supplies.  Merry Christmas 2011, this year I present to you this unintelligible MFA from Australia. I have never been a fan of the MFA diagram methodology that uses overly-large sankey arrows in comparison to the processes, but this takes it to another level by incorporating a background satellite image, gradients, transparency overlays of flows, and photos. Plus there is a bonus sankey-distortion on the “discharge to ocean” flow on the right, which grows after turning right from the “sewerage and drainage services” process."], "link": "http://mfadiagrams.blogspot.com/feeds/6359510028232229812/comments/default", "bloglinks": {}, "links": {"http://lh5.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Min Qiao, Yuan-Ming Zheng, Yong-Guan Zhu, 2011. Material flow analysis of phosphorus through food consumption in two megacities in northern China.   This simple MFA shows the phosphorus flows through food consumption in Beijing in 2008 (in tons)."], "link": "http://mfadiagrams.blogspot.com/feeds/4394423510994973079/comments/default", "bloglinks": {}, "links": {"http://lh6.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: M. Federicia, S. Ulgiatib, R. Basosi, 2008. A thermodynamic, environmental and material flow analysis of the Italian highway and railway transport systems.  This fascinating methodology including MFA is a multi-method multi-scale of terrestrial transport modalities that reduces each case down to the equivalent amount of solar energy required. I have often wondered how using solar gain in time per area could operate as a comparative tool, and here it is! It is similar to the other MFA within a decision-making model that I covered in that the MFA result is cross-referenced with a database, in this case energy intensities of materials, to arrive at the desired result. This methodology uses four different evaluation methods: material flow accounting (MFA), embodied energy analysis (EEA), exergy analysis (EXA) and emergy synthesis (ES). The local framework encompasses the direct inputs supporting the transport activities: mass balance, energy analysis and EMIPS are used in this context. Global scale framework takes into account the indirect and hidden material and energy flows supporting the transportation process. Specific material, energy and emergy intensities are used to shift from local to global scale."], "link": "http://mfadiagrams.blogspot.com/feeds/5047956677737671048/comments/default", "bloglinks": {}, "links": {"http://lh6.ggpht.com/": 1, "http://mfadiagrams.blogspot.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Aya Yoshida, Tomohiro Tasaki1, Atsushi Terazono, 2008. Material flow analysis of used personal computers in Japan.   This diagram is the system definition for the MFA study of PC flows in Japan. The methodology is very precise. They considered all flows except illegal dumping, as the origins of illegal dumping are unknown."], "link": "http://mfadiagrams.blogspot.com/feeds/5637793152875068749/comments/default", "bloglinks": {}, "links": {"http://lh6.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Brandon Kuczenski, Roland Geyer, 2010. Material flow analysis of polyethylene terephthalate in the US, 1996–2007.   These two diagrams are the MFA scheme set-up for the research followed by the MFA diagram for PET flows in the year 2007. In the sankey diagram, the dashed lines indicate upper bounds for highly uncertain flows. I like how the import and export fractions of each flow are represented by small slivers peeling away from the main flows."], "link": "http://mfadiagrams.blogspot.com/feeds/2212527861535160979/comments/default", "bloglinks": {}, "links": {"http://lh6.ggpht.com/": 2}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: T.C. Changa, S.J. Youb, B.S. Yuc, K.F. Yaoa, 2008. A material flow of lithium batteries in Taiwan.   This diagram takes an interesting strategy for representing the substances within the flow of batteries in Taiwan, by indexing the quantities of Li, Co, Al, Cu and Ni per process. The choice of flow arrows in unfortunate, but the message is clear."], "link": "http://mfadiagrams.blogspot.com/feeds/7169505466142509122/comments/default", "bloglinks": {}, "links": {"http://lh4.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Shu-Li Huang, Chun-Lin Lee, Chia-Wen Chen, 2006. Socioeconomic metabolism in Taiwan: Emergy synthesis versus material flow analysis.   As discussed in an earlier post , Emergy is another species of flow analysis. This diagram, from the same author who was referenced in the previous Emergy post, is in my opinion rather difficult to decipher. The curvaceous nature of the flow lines leads to a breaking apart of the figure-ground relationship, wherein the viewer looks for meaning in shapes that are not processes."], "link": "http://mfadiagrams.blogspot.com/feeds/454187329822270936/comments/default", "bloglinks": {}, "links": {"http://lh6.ggpht.com/": 1, "http://mfadiagrams.blogspot.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Seok-jin Honga, Yoon-sil Choia, Kyoung-ryun Kima, Joon-gu Kangb, Gil-jong Ohb, Tak Hur, 2011. Material flow analysis of paper in Korea. Part I. Data calculation model from the flow relationships between paper products.   This neat diagram shows the material flows of paper in Korea. I like how the different phases of the process are broken down into columns within the MFA, it increases the readability. A slightly variation of graphic language is used, wherein stocks are represented by a double-wall box rather than within the process box, and losses and exports are shown as small arrows on the process box. I think the authors may have missed labeling the landfill as a stock."], "link": "http://mfadiagrams.blogspot.com/feeds/172364631386559036/comments/default", "bloglinks": {}, "links": {"http://lh5.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Allen, David T. and R. Jain, 1992. Special issue on industrial waste generation and management."], "link": "http://mfadiagrams.blogspot.com/feeds/2752280512452944175/comments/default", "bloglinks": {}, "links": {"http://lh5.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Claudia R. Binder, Raffaele Quirici, Svetlana Domnitcheva, and Beat Staubli, 2008. Smart Labels forWaste and Resource Management.  This Material Flow Analysis diagram shows electrical appliances in Switzerland (2002), flows are in kilograms per capita per year; stocks are in 1,000 kg/capita. While there are stocks represented in household and commerce, the stocks for landfill and other treatment options are missing. The high ratio of electronic waste that is separated and recycled is surprising."], "link": "http://mfadiagrams.blogspot.com/feeds/5161574803430208789/comments/default", "bloglinks": {}, "links": {"http://lh3.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Duvigneaud and Denaeyer-De Smet 1977. The urban metabolism of Brussels, Belgium in the early 1970s .  This fantastic diagram combines many sorts of representation into an early example of a urban metabolism analysis. It is one of the earliest and most comprehensive studies by the ecologists Duvigneaud and Denaeyer-De Smet (1977). It includes quantification of urban biomass and even organic discharges from cats and dogs. While not strictly a MFA, it does incorporate Sankey-style flows and does consider flows and stocks in the system."], "link": "http://mfadiagrams.blogspot.com/feeds/1475295214538049265/comments/default", "bloglinks": {}, "links": {"http://lh5.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Yossi Bukchini, Russell Meller, Qi Liu, 2005. Assembly system facility design .  This Material Flow Analysis diagram is a striking alternative application of MFA. It addresses the design of an assembly system facility with several assembly lines of various shapes. The above diagram shows the required material flows through the assembly system.  This paper addresses the design of an assembly system facility consisting of multiple assembly lines of different shapes. In such a design problem there are two conflicting objectives: (i) to minimize the overall area of the facility; and (ii) to maximize the efficiency of the material handling transportation system. We first address the optimization problem of objective (ii) when replacing objective (i) with a constraint on the facility area. The objective function of the layout model is to minimize the distances traveled by material flow. The problem is solved to optimize the assembly line in terms of space:"], "link": "http://mfadiagrams.blogspot.com/feeds/615873266572663793/comments/default", "bloglinks": {}, "links": {"http://lh5.ggpht.com/": 1, "http://lh6.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Marina Fischer-Kowalski, Veronika Gaube, and Gerhard Rainer, 2006. MEFASPACE A Model Predicting Freight Transport from Materials Flows, and Transport Activity in Europe  Despite being from Vienna, the “birthplace” of MFA, it is safe to say that the authors did not “get” the MFA methodology. What appear to be flow quantities sit next to the processes, and a mysterious thick line cuts through the system boundary. I appreciate the attempt to include transport in a MFA diagram, but this sample is more a demonstration of what can go wrong."], "link": "http://mfadiagrams.blogspot.com/feeds/7678540554662665742/comments/default", "bloglinks": {}, "links": {"http://lh6.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Andreas Bode, Roman Kühner, Thomas Wisniewski, 2011. Identification of economic potentials in production processes: An industrial case study.   This diagram is technically a process diagram, as it uses icons to represent various processes in an industrial process, however, it is interesting to compare to a Material Flow Analysis diagram, as the graphic languages are rather similar."], "link": "http://mfadiagrams.blogspot.com/feeds/898960027444655606/comments/default", "bloglinks": {}, "links": {"http://lh6.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Villalba, G., Liu, Y., Schroder, H., Ayres, R., 2008. Global Phosphorus Flows in the Industrial Economy From a Production Perspective."], "link": "http://mfadiagrams.blogspot.com/feeds/4741242032780686893/comments/default", "bloglinks": {}, "links": {"http://lh4.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Shu-Li Huang, 2009. Urbanization and Socioeconomic Metabolism in Taipei.   In this analysis of “socioeconomic metabolism” of Taipei, the author uses the Emergy methodology to describe the flow of materials and energy. The concept and methodology of Emergy was pioneered by Howard Odum, an ecologist. Certain aspects are similar to Material Flow Analysis, such as the system boundary, flows, and processes. Emergy has different symbols for different types of processors, for example consumer and producer, whereas MFA neutrally represents all processes in the same way. While both MFA and Emergy are concerned with metabolism, as you can see their way of representation is quite different.      Source: Odum, H. T. 1996. Environmental accounting: Emergy and environmental decision making ."], "link": "http://mfadiagrams.blogspot.com/feeds/4715873963159890005/comments/default", "bloglinks": {}, "links": {"http://lh5.ggpht.com/": 1, "http://emergysystems.org/": 1, "http://lh6.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}, {"content": ["Source: Schmid Neset, Tina-Simone et al., 2006. Food Consumption and Nutrient Flows .  The Material Flow Analysis looks at the average citizen of Linköping, Sweden and her impact on the nitrogen cycle through food.  The flow of nitrogen in 2000 engendered by the consumption and production of food for an average inhabitant of Linköping. The data give the flow of nitrogen in kg per capita and year. The rate of addition to stock for the given year (dt) is shown in the lower left corner of each process. Stocks in plant production are not applicable for the region, because crop sequence and fallow are not included in this per capita system. Surplus includes not only manure, but also by-products (remaining products), losses, and animal carcasses. Thus, emissions from animal production are possibly somewhat exaggerated having been calculated for emissions from manure. The shading of the lines indicates whether they are input (dark gray), output (black), or internal flows (light gray). The thickness of the lines is proportional to the size of the flows."], "link": "http://mfadiagrams.blogspot.com/feeds/97135198919746499/comments/default", "bloglinks": {}, "links": {"http://lh5.ggpht.com/": 1}, "blogtitle": "MFA Diagrams"}]