[{"blogurl": "http://michaelnielsen.org/blog\n", "blogroll": [], "title": "Michael Nielsen"}, {"content": ["As many of you no doubt know, the Federal Research Public Access Act ; (FRPAA, pronounced fur-pa) was introduced into the US Congress a few days past.  It’s a terrific bill, which, if it passes, will have the effect of making all US Government-funded scientific research accessible to the public within 6 months of publication. \n Open access legislation like FRPAA doesn’t just happen in a vacuum.  The  Alliance for Taxpayer Access  (ATA) is a Washington D.C.-based advocacy group that works to promote open access policies within the US Government.  The ATA worked with Congress (and many other organizations) to help pass the NIH public access policy in 2008, and have been working for the past several years with members of Congress on FRPAA. \n In this post, I interview Heather Joseph , the Executive Director of the Scholarly Publishing and Academic Resources Coalition (SPARC) , which convenes the ATA, and ask her about the bill, about next steps, and about how people can help. \n Q: Heather, thanks for agreeing to be interviewed! What is FRPAA, and what’s it trying to accomplish? \n Thank you, Michael – I’m happy to talk about this bill! \n In a nutshell, FRPAA is designed to make sure that the results of scientific research paid for by the public can be accessed by the public. Most people are surprised to learn that this isn’t automatically the case; they assume that if their tax dollars pay for a research study, they should be entitled to read the results.  But the reality is quite different.  Right now, if you want to access articles that report on publicly funded science, you have pay to do so, either through a subscription to a scientific journal (which can cost thousands of dollars a year), or though pay-per-view, which can easily cost upwards of $30 per article. This presents an often-unsurmountable obstacle for exactly those people who most want (or need) access – scientists, students, teachers, physicians, entrepreneurs – who too often find themselves unable to afford such fees, and end up locked out of the game. \n Out of eleven federal agencies that fund science here in the United States, only one – the National Institutes of Health – actually has a policy that ensures that the public can freely access the results of their funded research online. FRPAA is designed to tackle this issue head on, and to make sure that the science stemming from all U.S. agencies is made freely available to anyone who wants to use. it. \n FRPAA is a very straightforward bill – it simply says that if you receive money from a U.S. Agency to do scientific research, you agree (upfront) to make any articles reporting on the results available to the public in a freely accessible online database, no later than six months after publication in a peer-reviewed journal. \n Q: What is the Alliance for Taxpayer Access (ATA)? What role did the ATA play in advocating for FRPAA? \n The ATA is a coalition of groups who are working together to try and craft a positive solution to this problem.  In 2004, the library community (led by my home organization, SPARC) decided that there must be other groups who shared our frustration over the current access situation. We reached out to research organizations, patient advocacy groups, consumer organizations, publishers, student groups – anyone we could think of who shared the goal of unlocking access to taxpayer funded research.  We quickly attracted more than 80 organizations, representing millions of individuals. This created a whole new opportunity to advocate for national access policies from a much stronger position… there really is  strength in numbers! \n The ATA has evolved into the leading advocacy organization for taxpayer access to the results of taxpayer funded research. We knock on Congressional doors, talking with policymakers about  the current barriers  to access, and about new opportunities for scientific progress once those barriers are brought down. We are all about leveraging the public’s investment in science by making sure that anyone who is interested can easily access and build on this research. That’s how science advances, after all. \n Q: In 2008, the Congress passed the NIH public access policy.  Can you tell us about that, and the ATA’s role? \n Absolutely!  As I mentioned, the NIH is currently the only U.S. agency that has a policy guaranteeing the public access to the results of its funded research. The idea for the policy surfaced in 2003, when Congress expressed concern that results of the public’s nearly $30 billion annual investment in NIH research were not being made as widely accessible as they should be.  They asked the NIH Director to create a policy to address the problem, setting in motion what would become 4 long years of intense debate in the scientific community.  \n Not surprisingly, some journal publishers expressed immediate concern that any policy that provided access to research results through any other channels other than subscription-based journals would irreparably damage their businesses. Because journal publishing is big business (nearly $9 billion in annual revenues) publishers were able to use their long-established trade associations to aggressively lobby the NIH and Congress against the establishment of such a policy. \n The scientists, librarians, patients, and others who favored the policy found themselves at a disadvantage, advocating as individual organizations without a coordinated voice. This was the main reason the ATA was established, and we quickly found ourselves at the center of the debate, helping to ensure that all stakeholders who favored the establishment of a public access policy had a way to present a united message to policymakers. Ultimately, Congress passed a landmark policy fully supported by the ATA that was enacted in 2008.  \n Q: Who works at the ATA? \n The ATA is essentially a virtual coalition. While we’ve grown to represent over 100 organizations, the organization’s advocacy is carried out by a pretty small core group of staff (all of whom have other full time jobs!)  Besides myself, the wonderful Nick Shockey and Andrea Higginbotham are responsible for the coalition’s online presence – keeping our website up to date, maintaining our Congressional Action Center , and keeping our members looped in on various email lists.  We also rely on our incredibly active members to help us continually refine our messages, and look for opportunities to spread the word about our work.  People like Sharon Terry at the Genetic Alliance , Prue Adler at the Association of Research Libraries , and Pat Furlong at Parent Project Muscular Dystrophy are prime examples of some of the people who keep the ATA active on the front lines. Also: there is no cost to join the ATA (SPARC picks up the relatively low tab to keep it humming!); and the door is open for any organization to sign on as a member through our website . If you’re interested, please let us know! \n Q: What happens next, with FRPAA?  How does it (hopefully) become law? What could derail it? \n The next steps for FRPAA will be for us (and our advocates) to encourage other members of Congress to sign onto the bill as co-sponsors. Generating a nice, robust list of supporting members of Congress is key in helping to keep the profile of the bill high.  Procedurally, the bill will be referred to Committee for further consideration; in the Senate, it will go to the Homeland Security and Government Affairs Committee, and in the House, the Committee on Oversight and Government Reform will receive the bill.  As with any legislation, FRPAA faces an uphill battle in an election year, but given the growing attention this issue has received in the past year (from the White House Office of Science and Technology Policy, to the America COMPETES Act, to the recent Research Works Act), we’re hopeful that the bill can continue to advance. \n I think the biggest threat is inaction, so vocal support from stakeholders will be crucial! \n Q: What can people do to help FRPAA become law? \n The most important thing that people – especially active scientists – can do help advance this bill is to speak out in support of this bill.  And we need folks to speak out in two ways: \n First, speak out to your members of Congress. The ATA has an Action Center set up so that you can simply log on, pick your Senators and Representatives, and automatically generate a letter asking them to support FRPAA.  The Action Center has all kinds of information about the bill, including Talking Points, FAQ’a and even template letters, to help make the process as easy as possible. Check it out! \n Second, speak out to your colleagues and your community.  Blog about the bill, or spread the word on Twitter.  Consider writing an OpEd for your local newspaper, or writing an article for your organization’s newsletter. The more people become aware of this issue, the more they support it. Help us spread the word! \n Q: Finally, how can people follow what the ATA is doing, and keep up with your calls for action? \n You can sign onto the Alliance for Taxpayer Access by going to our website . There’s no charge. \n If you simply want to be added to our email list for alerts and updates, contact either or myself (heather@arl.org)  or Andrea Higginbotham (andrea@arl.org), or follow us on Twitter at @SPARC_NA ."], "link": "http://feedproxy.google.com/~r/michaelnielsen/wmna/~3/UuriktzEedc/", "bloglinks": {}, "links": {"http://community.parentprojectmd.org/": 1, "https://twitter.com/": 2, "http://www.taxpayeraccess.org/": 7, "http://www.geneticalliance.org/": 1, "http://publicaccess.nih.gov/": 1, "http://www.arl.org/": 3, "http://www.geneticalliance.org": 1, "http://www.parentprojectmd.org/": 1, "http://www.arl.org": 1, "http://cyber.harvard.edu/": 1}, "blogtitle": "Michael Nielsen"}, {"content": ["Elsevier is the world’s largest and most profitable scientific publisher, making a profit of 1.1 billion dollars on revenue of 3.2 billion dollars in 2009 . Elsevier have also been involved in many dubious practices, including the publishing of fake medical journals sponsored by pharmaceutical companies , and the publication of what are most kindly described as extraordinarily shoddy journals. Until 2009, parent company Reed Elsevier helped facilitate the international arms trade . (This is just a tiny sample: for more, see Gowers’s blog post, or look at some of the links on this page .) For this, executives at Reed Elsevier are paid multi-million dollar salaries (see, e.g., 1 and 2 , and links therein). \n All this is pretty widely known in the scientific community. However, Tim Gowers recently started a large-scale discussion of Elsevier by scientists, by blogging to explain that he will no longer be submitting papers to Elsevier journals, refereeing for Elsevier, or otherwise supporting the company in any way. The post now has more than 120 comments, with many mathematicians and scientists voicing similar concerns. \n Following up from the discussion on Gowers’s post, Tyler Neylon has created a website called The Cost of Knowledge (see also Gowers’s followup ) where researchers can declare their unwillingness to “support any Elsevier journal unless they radically change how they operate”. If you’re a mathematician or scientist who is unhappy with Elsevier’s practices, then consider signing the declaration. And while you’re at it, consider making your scientific papers open access, either by depositing them into open repositories such as the arXiv , or by submitting them to open access journals such as the Public Library of Science . Or do both."], "link": "http://feedproxy.google.com/~r/michaelnielsen/wmna/~3/M-y-aHqm2gE/", "bloglinks": {}, "links": {"http://gowers.wordpress.com/": 2, "http://www.nyu.edu/": 1, "http://michaelnielsen.org/": 1, "http://arxiv.org": 1, "http://plos.org": 1, "http://people.forbes.com/": 2, "http://classic.the-scientist.com/blog": 1, "http://thecostofknowledge.com/": 1, "http://www.co.uk/": 1, "http://www.reed-elsevier.com/": 1, "http://scholarlykitchen.sspnet.org/": 1}, "blogtitle": "Michael Nielsen"}, {"content": ["That’s the question I address (very partially) in a new post on my data-driven intelligence blog . The post reviews some of the recent work on causal inference done by people such as Judea Pearl . In particular the post describes the elements of a causal calculus developed by Pearl, and explains how the calculus can be applied to infer causation, even when a randomized, controlled experiment is not possible."], "link": "http://feedproxy.google.com/~r/michaelnielsen/wmna/~3/9KdbDZj_1q0/", "bloglinks": {}, "links": {"http://en.wikipedia.org/": 1, "http://www.michaelnielsen.org/": 2}, "blogtitle": "Michael Nielsen"}, {"content": ["Click through for event details. I’ve included a few private events at organizations where it’s possible some readers work. \n \n The Tech Museum (Bay Area) November 1\n Harvard Book Store / Cambridge Forum (Boston) November 9\n Authors@Google (Bay Area) November 15.\n San Francisco Public Library (San Francisco) November 15\n Microsoft Colloquium (Seattle) November 16\n Town Hall Seattle (Seattle) November 16\n Powell’s Books (Portland) November 17\n LiveWire (Portland) November 18\n Howard Hughes Medical Institute (Washington DC) November 29\n TEDxPrincetonLibrary (New Jersey) November 30\n Carnegie Council (New York) December 1"], "link": "http://feedproxy.google.com/~r/michaelnielsen/wmna/~3/kFkZHypNGB0/", "bloglinks": {}, "links": {"http://townhallseattle.org/": 1, "http://www.harvard.com/": 1, "http://tedxsalonopensourcing-eorg.eventbrite.com/": 1, "http://www.livewireradio.org/": 1, "http://www.powells.com/": 1, "http://www.thetech.org/": 1, "http://www.sfpl.org/": 1, "http://www.google.com/": 1}, "blogtitle": "Michael Nielsen"}, {"content": ["During a recent talk David Weinberger asked me (paraphrasing) whether and how the nature of scientific knowledge will change when it’s produced by large networked collaborations? \n It’s a great question. Suppose it’s announced in the next few years that the LHC has discovered the Higgs boson. There will, no doubt, be a peer-reviewed scientific paper describing the result. \n How should we regard such an announcement? \n The chain of evidence behind the result will no doubt be phenomenally complex. The LHC analyses about 600 million particle collisions per second . The data analysis is done using a cluster of more than 200,000 processing cores , and tens of millions of lines of software code. That code is built on all sorts of extremely specialized knowledge and assumptions about detector and beam physics, statistical inference, quantum field theory, and so on. Whatsmore that code, like any large software package, no doubt has many bugs, despite enormous effort to eliminate bugs . \n No one person in the world will understand in detail the entire chain of evidence that led to the discovery of the Higgs. In fact, it’s possible that very few (no?) people will understand in much depth even just the principles behind the chain of evidence. How many people have truly mastered quantum field theory, statistical inference, detector physics, and distributed computing? \n What, then, should we make of any paper announcing that the Higgs boson has been found? \n Standard pre-publication peer review will mean little. Yes, it’ll be useful as an independent sanity check of the work. But all it will show is that there’s no glaringly obvious holes. It certainly won’t involve more than a cursory inspection of the evidence. \n A related situation arose in the 1980s in mathematics. It was announced in the early 1980s that an extremely important mathematical problem had been solved: the classification of the finite simple groups . The proof had taken about 30 years, and involved an effort by 100 or so mathematicians, spread across many papers and thousands of pages of proof. \n Unfortunately, the original proof had gaps. Most of them were not serious. But at least one serious gap remained . In 2004, two mathematicians published a two-volume, 1,200 page supplement to the original proof, filling in the gap. (At least, we hope they’ve filled in the gap!) \n When discoveries rely on hundreds of pieces of evidence or steps of reasoning, we can be pretty sure of our conclusions, provided our error rate is low, say one part in a hundred thousand. But when we start to use a million or a billion (or a trillion or more) pieces of evidence or steps of reasoning, an error rate of one part in a million \nbecomes a guarantee of failure, unless we develop systems that can tolerate those errors. \n It seems to me that one of the core questions the scientific community will wrestle with over the next few decades is what principles and practices we use to judge whether or not a conclusion drawn from a large body of networked knowledge is correct? To put it another way, how can we ensure that we reliably come to correct conclusions, despite the fact that some of our evidence or reasoning is almost certainly wrong? \n At the moment each large-scale collaboration addresses this in their own way. The people at the LHC and those responsible for the classification of finite simple groups are certainly very smart, and I’ve no doubt they’re doing lots of smart things to eliminate or greatly reduce the impact of errors. But it’d be good to have a principled way of understanding how and when we can come to correct scientific conclusions, in the face of low-level errors in the evidence and reasoning used to arrive at those errors. \n If you doubt there’s a problem here, then think about the mistakes that led to the Pentium floating point bug . Or think of the loss of the Mars Climate Orbiter . That’s often described as a failure to convert between metric and imperial units, which makes it sound trivial, like the people at NASA are fools. The real problem was deeper. As a NASA official said : \n People sometimes make errors. The problem here was not the error [of unit conversion], it was the failure of NASA’s systems engineering, and the checks and balances in our processes to detect the error. That’s why we lost the spacecraft. \n In other words, when you’re working at NASA scale, problems that are unlikely at small scale, like failing to do a unit conversion, are certain to occur. It’s foolish to act as though they won’t happen. Instead, you need to develop systems which limit the impact of such errors. \n In the context of science, what this means is that we need new methods of fault-tolerant discovery. \n I don’t have well-developed answers to the questions I’ve raised above, riffing off David Weinberger’s original question. But I will finish with the notion that one useful source of ideas may be systems and safety engineering , which are responsible for the reliable performance of complex systems such as modern aircraft. According to Boeing , a 747-400 has six million parts, and the first 747 required 75,000 engineering drawings. Not to mention all the fallible human “components” in a modern aircraft. Yet aircraft systems and safety engineers have developed checks and balances that let us draw with very high probability the conclusion “The plane will get safely from point A to B”. Sounds like a promising source of insights to me! \n Further reading: An intriguing experiment in distributed verification of a mathematical proof has been done in an article by Doron Zeilberger . Even if you can’t follow the mathematics, it’s stimulating to look through. I’ve taken a stab at some of the issues in this post before, in my essay Science beyond individual understanding . I’m also looking forward to David Weinberger’s new book about networked knowledge, Too Big To Know . Finally, my new book Reinventing Discovery is about the promise and the challenges of networked science."], "link": "http://feedproxy.google.com/~r/michaelnielsen/wmna/~3/sqksGkqa9pg/", "bloglinks": {}, "links": {"http://www.ams.org/": 1, "http://lhc-machine-outreach.cern.ch/": 1, "http://www.combinatorics.org/": 1, "http://www.hyperorg.com/blog": 2, "https://e-math2.ams.org/": 1, "http://www.toobigtoknow.com/": 1, "http://www.boeing.com/": 1, "http://en.wikipedia.org/": 6, "http://www.amazon.com/": 1, "http://michaelnielsen.org/blog": 1, "http://mars.nasa.gov/": 1, "http://lcg.cern.ch/": 1, "http://www.coverity.com/": 1}, "blogtitle": "Michael Nielsen"}, {"content": ["I wrote the following essay for one of my favourite online forums, Hacker News , which over the past few months has seen more and more discussion of the issue of open access to scientific publication. It seems like it might have broader interest, so I’m reposting it here. Original link here . \n The topic of open access to scientific papers comes up often on Hacker News. \n Unfortunately, those discussions sometimes bog down in misinformation and misunderstandings. \n Although it’s not exactly my area of expertise, it’s close — I’ve spent the last three years working on open science. \n So I thought it might be useful to post a summary of the current state of open access. There’s a lot going on, so even though this essay appears lengthy, it’s actually a very brief and incomplete summary of what’s happening. I have links to further reading at the end. \n This is not a small stakes game. The big scientific publishers are phenomenally profitable. In 2009, Elsevier made a profit of 1.1 billion dollars on revenue of 3.2 billion dollars . That’s a margin (and business model) they are very strongly motivated to protect. They’re the biggest commercial journal publisher, but the other big publishers are also extremely profitable. \n Even not-for-profit societies often make an enormous profit on their journals. In 2004 (the most recent year for which I have figures) the American Chemical Society made a profit of 40 million dollars on revenues of 340 million dollars . Not bad! This money is reinvested in other society activities, including salaries. Top execs receive salaries in the 500k to 1m range (as of 2006 , I’m sure it’s quite a bit higher now.) \n The traditional publishers make money by charging journal subscription fees to libraries. Why they make so much money is a matter for much discussion, but I will merely point out one fact: there are big systematic inefficiencies built into the market. University libraries for the most part pay the subscription fees, but they rely on guidance (and often respond to pressure) from faculty members in deciding what journals to subscribe to. In practice, faculty often have a lot of power in making these decisions, without bearing the costs. And so they can be quite price-insensitive. \n The journal publishers have wildly varying (and changing) responses to the notion of open access. \n For example, most Springer journals are closed access, but in 2008 Springer bought BioMedCentral , one of the original open access publishers, and by some counts the world’s largest. They continue to operate. (More on the deal here .) \n [Update: It has been pointed out to me in email that Springer now uses a hybrid open access model for most of their journals, whereby authors can opt to pay a fee to make their articles open access. If the authors don't pay that fee, the articles remain closed. The other Springer journals, including BioMedCentral, are fully open access.] \n Nature Publishing Group is also mostly closed access, but has recently started an open access journal called Scientific Reports , apparently modeled after the (open access) Public Library of Science’s journal PLoS One . \n It is sometimes stated that big commercial publishers don’t allow authors to put free-to-access copies of their papers on the web. In fact, policies vary quite a bit from publisher to publisher. Elsevier and Springer , for example, do allow authors to put copies of their papers on their websites, and into institutional repositories. This doesn’t mean that always (or even often) happens, but it’s at least in principle possible. \n Comments on HN sometimes assume that open access is somehow a new issue, or an issue that no-one has been doing anything about until recently. \n This is far from the case. Take a look at the Open Access Newsletters and you’ll realize that there’s a community of people working very, very hard for open access. They’re just not necessarily working in ways that are visible to hackers. \n Nonetheless, as a result of the efforts of people in the open access movement, a lot of successes have been achieved, and there is a great deal of momentum toward open access. \n Here’s a few examples of success: \n In 2008 the US National Institutes of Health (NIH) — by far the world’s largest funding agency, with a $30+ billion dollar a year budget — adopted a policy requiring that all NIH-funded research be made openly accessible within 12 months of publication. See here for more . \n All 7 UK Research Councils have adopted similar open access policies requiring researchers they fund to make their work openly accessible. \n Many universities have adopted open access policies. Examples include: Harvard’s Faculty of Arts and Sciences , MIT , and Princeton . \n As a result of policies like these, in years to come you should see more and more freely downloadable papers showing up in search results. \n Note that there are a lot of differences of detail in the different policies, and those details can make a big difference to the practical impact of the policies. I won’t try to summarize all the nuances here, I’m merely pointing out that there is a lot of institutional movement. \n Many more pointers to open access policies may be found at ROARMAP . That site notes 52 open access policies from grant agencies, and 135 from academic institutions. \n There’s obviously still a long way to go before there is universal open access to publicly-funded research, but there has been a lot of progress, and a lot of momentum. \n One thing that I hope will happen is that the US Federal Research Public Access Act passes. First proposed in 2006 (and again in 2010), this Act would essentially extend the NIH policy to all US Government-funded research (from agencies with budgets over 100 million). My understanding is that at present the Act is tied up in committee. \n Despite (or because of) this progress, there is considerable pushback on the open access movement from some scientific publishers. As just one instance, in 2007 some large publishers hired a very aggressive PR firm to wage a campaign to publicly discredit open access. \n I will not be surprised if this pushback escalates. \n What can hackers do to help out? \n One great thing to do is start a startup in this space. Startups (and former startups) like Mendeley , ChemSpider , BioMedCentral , PLoS and others have had a big impact over the past ten or so years, but there’s even bigger opportunities for hackers to really redefine scientific publishing. Ideas like text mining, recommender systems, open access to data, automated inference, and many others can be pushed much, much further. \n I’ve written about this in the following essay: Is Scientific Publishing About to be Disrupted? Many of those ideas are developed in much greater depth in my book on open science, Reinventing Discovery . \n For less technical (and less time-consuming!) ways of getting involved, you may want to subscribe to the RSS feed at the Alliance for Taxpayer Access . This organization was crucial in helping get the NIH open access policy passed, and they’re helping do the same for the Federal Public Research Access Act, as well as other open access efforts. \n If you want to know more, the best single resource I know is Peter Suber’s website . \n Suber has, for example, written an extremely informative introduction to open access . His still-active Open Access Newsletter is a goldmine of information, as is his (no longer active) blog . He also runs the open access tracking project . \n If you got this far, thanks for reading! Corrections are welcome."], "link": "http://feedproxy.google.com/~r/michaelnielsen/wmna/~3/f3v5mtIzaOA/", "bloglinks": {}, "links": {"http://www.chemistry-blog.com/": 1, "http://www.earlham.edu/": 9, "http://roarmap.eprints.org/": 1, "http://www.mendeley.com/": 1, "http://www.springer.com/": 1, "http://www.biomedcentral.com/": 2, "http://www.taxpayeraccess.org/": 1, "http://www.plosone.org/": 1, "http://news.ycombinator.com/": 2, "http://www.dailyprincetonian.com/": 1, "http://twitter.com/": 1, "http://www.nature.com/": 2, "http://www.arl.org/": 1, "http://en.wikipedia.org/": 1, "http://www.amazon.com/": 1, "http://www.plos.org": 1, "http://michaelnielsen.org/blog": 1, "http://www.scientificamerican.com/": 1, "http://www.reed-elsevier.com/": 1, "http://www.chemspider.com/": 1}, "blogtitle": "Michael Nielsen"}, {"content": ["I have a piece in the Wall Street Journal arguing that publicly funded science should be open science ."], "link": "http://feedproxy.google.com/~r/michaelnielsen/wmna/~3/QqEP1FKZDhg/", "bloglinks": {}, "links": {"http://online.wsj.com/": 1}, "blogtitle": "Michael Nielsen"}, {"content": ["I’m very excited to say that my new book, “Reinventing Discovery: The New Era of Networked Science”, has just been released! \n  \n The book is about networked science : the use of online tools to transform the way science is done. In the book I make the case that networked science has the potential to dramatically speed up the rate of scientific discovery, not just in one field, but across all of science. Furthermore, it won’t just speed up discovery, but will actually amplify our collective intelligence, expanding the range of scientific problems which can be attacked at all. \n But, as I explain in the book, there are cultural obstacles that are blocking networked science from achieving its full potential. And so the book is also a manifesto, arguing that networked science must be open science if it is to realize its potential. \n Making the change to open science is a big challenge. In my opinion it’s one of the biggest challenges our society faces, one that requires action on many fronts. One of those fronts is to make sure that everyone — including scientists, but also grant agencies, governments, libraries, and, especially, the general public -– understands how important the stakes are, and how urgent is the need for change. And so my big hope for this book is that it will help raise the profile of open science. I want open science to become a part of our general culture, a subject every educated layperson is familiar with, and has an opinion about. If we can cause that to happen, then I believe that a big and positive shift in the culture of science is inevitable. And that will benefit everyone. \n The book is shipping in hardcover from Amazon.com, and should ship through other booksellers by October 21. Note that the Kindle edition isn’t out as I write, but should arrive by October 21. A few relevant links: \n \n Hardcover at Amazon.com (available now)\n Kindle at Amazon.com (can pre-order now, ships by Oct 21)\n Hardcover at Amazon.co.uk (can pre-order now, ships by Oct 21)\n Hardcover at Amazon.ca (can pre-order now, ships by Oct 21)\n \n Two caveats. First, I’m occasionally asked if the book is being released under a Creative Commons license. I discussed this option at length with my publisher, who ultimately declined. A couple of people have said to me that they find this ironic. This isn’t so, since the book argues as a broad principle that publicly funded science should be open science; the book is neither publicly funded nor, strictly speaking, science. However, as a personal preference I’d still like to see it enter the commons sooner rather than later. After the paperback has been out for a while, I will approach my publisher again to see what can be done. \n Second, the book is not meant to be a reference work on open science. Instead, I’ve highlighted a small set of focused examples, inevitably leaving many great open science projects out. I hope the people running those other projects can forgive me. My aim wasn’t to write a reference work, but rather to write the kind of book that people will enjoy reading, and which enthusiasts of open science can give to their friends and family to help explain what open science is all about, and why it matters so very much. \n Let me conclude by quoting one of my favorite lines from Tolkien: “The praise of the praiseworthy is above all reward”. And so it gives me great delight to finish with quotes from a few of the endorsements and reviews the book has received: \n Science has always been a contact sport; the interaction of many minds is the engine of the discipline. Michael Nielsen has given us an unparalleled account of how new tools for collaboration are transforming scientific practice. Reinventing Discovery doesn’t just help us understand how the sciences are changing, it shows us how we can participate in the change. - Clay Shirky \n This is the book on how networks will drive a revolution in scientific discovery; definitely recommended. - Tyler Cowen \n Anyone who has followed science in recent years has noticed something odd: science is less and less about a solitary scientist working alone in a lab. Scientists are working in networks, and those networks are gaining scope, speed, and power through the internet. Nonscientists have been getting in on the act, too, folding proteins and identifying galaxies. Michael Nielsen has been watching these developments too, but he’s done much more: he’s provided the best synthesis I’ve seen of this new kind of science, and he’s also thought deeply about what it means for the future of how we understand the world. Reinventing Discovery is a delightfully written, thought-provoking book. - Carl Zimmer \n \n Reinventing Discovery will frame serious discussion and inspire wild, disruptive ideas for the next decade. - Chris Lintott in Nature \n \n Nielsen has created perhaps the most compelling and comprehensive case so far for a new approach to science in the Internet age. - Timo Hannay in Nature Physics"], "link": "http://feedproxy.google.com/~r/michaelnielsen/wmna/~3/GpRYuUOqisY/", "bloglinks": {}, "links": {"http://michaelnielsen.org/blog": 1, "http://blogs.discovermagazine.com/": 1, "http://www.shirky.com/": 1, "http://www.nature.com/": 2, "http://en.wikipedia.org/": 1, "http://www.amazon.ca/": 1, "http://twitter.com/": 1, "http://www.amazon.com/": 2, "http://www.co.uk/": 1, "http://marginalrevolution.com/": 1}, "blogtitle": "Michael Nielsen"}, {"content": ["I’ll be speaking about open science at events at Georgia Tech, Duke University, and the University of North Carolina over the next few days. Here’s my current schedule of public and semi-public events: \n \n Events on Monday, October 3, at 11:30am and 3:00pm at Georgia Tech: details of both events .\n Event on Tuesday, October 4, at 4pm at Duke University: details .\n I will be at the University of North Carolina on Wednesday, October 5. I am not currently doing any public events, but let me know if you’d like to meet, and it’s possible something can be arranged."], "link": "http://feedproxy.google.com/~r/michaelnielsen/wmna/~3/YeCf8ZDG8W0/", "bloglinks": {}, "links": {"http://library.duke.edu/": 1, "http://www.gatech.edu/": 1}, "blogtitle": "Michael Nielsen"}, {"content": ["I’ll be speaking about open science at events in Berlin, New York and Boston over the next week. Here’s my current schedule of public and semi-public events: \n \n Berlin, Friday 16 September, 5pm, event at the Freie Universität of Berlin: more details \n New York, Courant Institute Colloquium, NYU, Monday 19 September, 3:45pm.\n New York, event organized by the Coles Science Center and the NYU Libraries Information Futures Group, Monday 19 September, 6:30pm: more details \n Boston, Harvard, Colloquium at the Institute for Theory and Computation in the Center for Astrophysics, Thursday 22 September: more details .\n Boston, MIT Physics Colloquium (MIT only), Thursday 22 September: more details"], "link": "http://feedproxy.google.com/~r/michaelnielsen/wmna/~3/rGvR8QIEoZQ/", "bloglinks": {}, "links": {"http://events.mit.edu/": 1, "http://blogs.nyu.edu/blog": 1, "http://www.harvard.edu/": 1, "http://okfn.de/": 1}, "blogtitle": "Michael Nielsen"}]