[{"blogurl": "http://migration.wordpress.com\n", "blogroll": [], "title": "Migrations"}, {"content": ["Zitting Cisticola, AKA Fan-tailed Warbler, Cisticola juncidis \n \nCredit: BirdLife Cyprus \nSource: BirdLife Cyprus on Facebook \n \n Tagged: Ambelopoulia , birds of Cyprus , Cyprus , limesticks , trapping"], "link": "http://migration.wordpress.com/2011/09/20/warbler-meets-limestick-limestick-wins/", "bloglinks": {}, "links": {"http://migration.wordpress.com/": 5, "http://feeds.wordpress.com/": 1, "http://birdlifecyprus.org/": 1, "http://www.facebook.com/": 2}, "blogtitle": "Migrations"}, {"content": ["..have been illegally killed by trappers in Cyprus so far this Autumn! \n This number represents the BirdLife Cyprus estimate for how many birds have been slaughtered by trappers using mist nets and limesticks between September 1st and October 23rd 2011. \n \n From BirdLife Cyprus : \n If you would like to play your part in our long-running campaign to end the illegal bird trapping with mist nest and limesticks, then please SIGN THE ONLINE PETITION HERE . If you witness any trapping (or other illegal bird killing activity) then please take the time to report it to us by filling in our simple on-line form here . \n You can also support us in this and our other activities to protect birds and wildlife by becoming a member here or by making a donation here . \n Membership not only provides an invaluable part of our funding but it also enhances our influence and makes our voice heard at local, national and international level. As a growing organization, we rely on the support of our members to continue our work protecting the birds, their habitats and the nature of Cyprus. Your membership will help support a range of conservation activities across Cyprus. For more on members benefits please click here . \n Tagged: Ambelopoulia , Cyprus , mist nets , trapping"], "link": "http://migration.wordpress.com/2011/09/14/trapping-toll-for-early-september/", "bloglinks": {}, "links": {"http://www.gopetition.com/": 1, "http://migration.wordpress.com/": 4, "http://feeds.wordpress.com/": 1, "http://www.birdlifecyprus.org/": 7}, "blogtitle": "Migrations"}, {"content": ["Blogging has taken a backseat in my life right now, but I have kept up the bi-weekly post on 10,000 Birds. Check ‘em out and read my latest. \n Killing birds in Cyprus – Fall 2011 version \n Waterbirds that Bred in Cyprus this Year \n A Crowded House of Martins"], "link": "http://migration.wordpress.com/2011/09/13/updates-3/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://migration.wordpress.com/": 1, "http://10000birds.com/": 3}, "blogtitle": "Migrations"}, {"content": ["18TH AUGUST 2011 — I picked up birders Harry and Luke from the car park of the Agia Napa Waterpark at 6.00am for four hours of birding and we headed straight to Cape Greco. I was hoping that there would be more birds around the area than I saw on my visit the previous week as autumn migration stuttered into life. Parking the car at the picnic site we soon located several of the resident Spectacled Warbler, while a juvenile Red-backed Shrike watched over the area from the top of a bush. Above us thirty European Bee-eaters flew over shortly followed by around twenty Yellow Wagtails. Two Common Kingfisher were chasing each other down below in the bay and four Common Sandpiper were resting on rocks there. These birds and the several Lesser Whitethroats in the bushes led to the conclusion that finally autumn migrants were starting to pass through. However at this spot we were specifically looking for the endemic Cyprus Warbler. As we were ready to move on a male flew to the top of a bush close to the shrike and we were able to get good views of it. \n Moving on we added Hoopoe to our list. We parked to find a juvenile Cyprus Warbler keeping company with several more Spectacled Warbler and a Spotted Flycatcher. Two striking male Red-backed Shrike were in the area. Down near the coast we heard several Chukar calling and saw Cyprus Wheatear. We headed to the gate in front of the mast where the day before Harry and Luke had located a Rufous-tailed Robin. A reversal of roles occurred as they tried to find it for me to add to my year-list but it was not to be! However we did find an Eastern Orphean Warbler and an Audouin’s Gull passed over. Near the Sea Caves we had great views of two Rollers perched on the telegraph wires. Looking behind us we found a Lesser Grey Shrike had moved onto the wires although the sun was now in our eyes so we couldn’t see him as well as we would have liked. Two Common Kestrels flew around and a couple of Isabelline Wheatears were on the ground. \n Harry was keen to be taken to Agia Napa Sewage Works so we drove there next. Again there were several Red-backed Shrikes in the area. Another Orphean Warbler flitted in and out of the wires of the fence as we checked the pools. As well as Little Grebe we found Green and Common Sandpiper while Barn Swallow, Common Swift and Alpine Swift chased the insects over the area. We managed to pick out at least one Pallid Swift but there were possibly more. In the small area of olive trees we could see several warblers feeding and fluttering between branches and bushes. These included Common and Lesser Whitethroat and Orphean and Olivaceous Warbler. Again we found several of the resident Spectacled Warbler as well as a Cyprus Warbler. As we headed off two falcons flew over the pools which after much discussion were identified by Luke as Eleonora’s Falcon – more likely to be seen west of Akrotiri at this time of the year. We then drove towards Agia Napa village to get lovely views of the Laughing Dove that turned up there this year. \n We then agreed to move to Achna Dam for a quick look around the area of shallow water away from the dam wall. We drove up to see two Common Kingfishers speeding around the area and watch several Squacco Herons fly off. Grey Heron and Little Egret were also feeding and roosting at the water’s edge. Two Whiskered Terns were fishing in the distance but before we left came closer to enable Harry to see them well. The local population of Spur-winged Plovers was very vocal while Little Ringed Plover, Common and Wood Sandpiper few nervously around the mud feeding as they stopped. They were accompanied by several Yellow Wagtails. As we returned to the car one of Luke’s target birds flew in front of us. A juvenile Masked Shrike ended our time out and we headed back out of the heat of the sun. \n Species list: \n \nLittle Grebe \nSquacco Heron \nLittle Egret \nGrey Heron \nMallard \nCommon Kestrel \nEleonora’s Falcon \nChukar \nEurasian Coot \nLittle Ringed Plover \nSpur-winged Lapwing \nGreen Sandpiper \nWood Sandpiper \nCommon Sandpiper \nAudouin’s Gull \nWhiskered Tern \nCommon Woodpigeon \nCollared Dove \nLaughing Dove \nCommon Swift \nPallid Swift \nAlpine Swift \nCommon Kingfisher \nEuropean Bee-eater \nEuropean Roller \nEurasian Hoopoe \nCrested Lark \nBarn Swallow \nYellow Wagtail \nIsabelline Wheatear \nCyprus Wheatear \nSpotted Flycatcher \nZitting Cisticola \nOlivaceous Warbler \nSpectacled Warbler \nCyprus Warbler \nOrphean Warbler \nLesser Whitethroat \nCommon Whitethroat \nRed-backed Shrike \nLesser Grey Shrike \nMasked Shrike \nHooded Crow \nHouse Sparrow \nEuropean Greenfinch \nEuropean Goldfinch \n Tagged: birds of Cyprus , Cyprus , tours"], "link": "http://migration.wordpress.com/2011/08/26/trip-report-18-august-2011/", "bloglinks": {}, "links": {"http://migration.wordpress.com/": 3, "http://feeds.wordpress.com/": 1}, "blogtitle": "Migrations"}, {"content": ["In case you missed it yesterday: \n Hunters expect a spree on first day – Cyprus Mail — \n UP TO 20,000 hunters will take to the fields for the opening of the turtledove, woodpigeon and quail shooting season today, which is set to be the island’s largest to date thanks to increasing game bird population and the second highest number of licences ever issued. \n The hunting federation has granted 47,716 licences this year, down just slightly from 48,137 in 2010 after more than 300 hunters’ licences were revoked because they were twice caught poaching. \n BirdLife Cyprus ‘s Martin Hellicar was given a chance to give his input, nicely expressing the NGO’s official policy on hunting in Cyprus: \n Asked about the forthcoming season, Hellicar said: “It would probably be better to start later to let birds complete their breeding cycle, but as long as the hunters stick to the rules, it is not a conservation issue. Our concern remains that a significant number of hunters do not stick to the rules. For example we get a lot of complaints about hunters shooting near to peoples’ homes.” \n Hellicar called on the hunters association to take stronger measures to reign in the rule-breakers and create a responsible hunting culture. “Sustainable hunting is better for all,” he added. \n I can’t underline that last statement enough: “Sustainable hunting is better for all.” While there are worse conservation issues BirdLife Cyprus faces, a little moderation on the part of hunters wouldn’t hurt. \n Tagged: Cyprus , hunting"], "link": "http://migration.wordpress.com/2011/08/22/open-season-in-cyprus-2/", "bloglinks": {}, "links": {"http://migration.wordpress.com/": 2, "http://feeds.wordpress.com/": 1, "http://www.cyprus-mail.com/": 1, "http://birdlifecyprus.org/": 1}, "blogtitle": "Migrations"}, {"content": ["In the last 33 years some amazing work has been taking place at the Akamas Reserve and along the beaches of Cyprus where the Green Turtle (Chelonia mydas) and the Loggerhead Turtle (Caretta caretta) create their nests. \n  \n Tagged: Cyprus , sea turtles , video"], "link": "http://migration.wordpress.com/2011/08/17/sea-turtle-hatchery-33-years-at-lara-beach-in-cyprus/", "bloglinks": {}, "links": {"http://migration.wordpress.com/": 4, "http://feeds.wordpress.com/": 1}, "blogtitle": "Migrations"}, {"content": ["The big story of the fortnight in Cyprus isn’t about birds, but it crosses the path of birding (kinda). I’ll get to that below. But the biggest story that is about birds is the conference that took place last week… \n More, at 10,000 Birds … \n Tagged: Ambelopoulia , Cyprus , poaching , trapping"], "link": "http://migration.wordpress.com/2011/07/16/european-call-to-end-bird-trapping/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://migration.wordpress.com/": 4, "http://10000birds.com/": 1}, "blogtitle": "Migrations"}, {"content": ["Over here on a holiday to coincide with attendance at a family wedding Derek and Cathy McEwan were keen to get a taste of Cypriot wildlife during their stay. We had arranged to help them see as many birds as possible during a hot summer day to satisfy that part of their interests. I picked them up at just after seven from their accommodation in Agia Thekla and we headed straight over to Cape Greco. There we saw a male Cyprus Warbler obligingly sitting on an exposed branch of a juniper bush. The many Spectacled Warbler we could see flitting around the vegetation all over the area would not stay still long enough for good views however. We moved on to the beach near Kermia Hotel where two individuals of our target species, Greater Sandplover , were found – one of them still showing remnants of its breeding plumage. A family of Chukar were climbing over the poly-tunnels while many Crested Lark were also around. \n  Common Kestrel, ©Jane Stylianou \n We drove on to Achna Dam which this year is full of water and we soon saw the resident Coot and Little Grebe. We could hear both Cetti’s and Reed Warbler when two of the latter flew in the reeds close by enabling us to see them. Two Spur-winged Lapwings were located on the opposite bank. Moving to the other side of the Dam we drove closer to the edge. Here we saw several more Spur-winged Lapwings, up to six Little Egrets, two Squacco Heron,  a Cattle Egret and several Grey Herons . There were several Common Sandpiper and a Green Sandpiper flew over our heads – early returning autumn migrants already. More surprising was   a Eurasian Spoonbill – never common in Cyprus so always a great find. In the distance we could see three terns which we tentatively identified as Whiskered Terns while as we drank our coffee a Gull-billed Tern patrolled and fished the water in front of us. Refreshed we drove away from the Dam only to stop again to watch one of two Hoopoes   we had noticed flying around perched on a dead branch of a waterside tree. \n Another surprise awaited us at Oroklini Marsh – a Pied Avocet was feeding there with the characteristic sweeping of his upturned bill. He was attracting the attention of the Black-winged Stilts who reacted aggressively towards him – maybe concerned for their young which were nearby. As at Achna there were several Spur-winged Lapwing and well as Coots, Moorhen, Mallard and Little Grebe. More interesting were the female and young Red-crested Pochard on the middle of the lake – proof of a successful breeding season for one of the newest additions to the list of Cyprus’ breeding birds. The Greater Flamingo that had been at Oroklini since the winter was still there so Derek and Cathy could add a bird better known as a winter visitor to their day list. \n Larnaca Sewage Works Pools proved disappointing. Derek’s recent leg injury, which precluded him from climbing the steps to the hide, meant that he managed to get good views of Spectacled Warbler flitting in and out of the perimeter fence there, while Cathy and I were unable to add any new species to our day list on the Pools. We drove behind the Pools and found 16 adult Yellow-legged Gull on the dried out salt marsh. A Stone Curlew dashed for cover but we only had a fleeting view of it. Around Spiro’s Pool we found many Crested Lark as well as several Corn Bunting   and a juvenile Black-headed Wagtail. \n We then drove up to the Troodos range. We stopped at the Livadhi tou Pashas picnic site and had our lunch. As we ate a pair of Masked Shrike were busy in the vicinity and we guessed they must have been feeding young nearby. Derek and Cathy got good views of several Jay - an endemic Cyprus sub-species. The other endemic sub-species, the Coal Tit and Short-toed Treecreeper were not so obliging and only offered fleeting views as they called continually in the area. There were many Barn Swallow, House Martin and Red-rumped Swallow flying across the grassy area taking advantage of the many insects. We moved up to Troodos Square where patient checking of the many Common Swift allowed us to pick out at least four Pallid Swift and we were sure that there were more. There were several Cyprus Wheatear families, many calling Chaffinches and at least one Olivaceous Warbler vying for our attention as we looked down from the car park. \n We stopped in an area of vines just outside the village of Omodhos on our way down to the Akrotiri peninsula. A male Black-headed Bunting was sitting on the electricity wires next to the road and as we watched him he was joined by a female and also two juveniles flying amongst the vegetation. Derek’s attention was caught by an unusual insect which he later identified as an Ant-Lion  Palpares libelluloides . While he photographed it Cathy and I watched the Buntings and also found a Long-legged Buzzard  roosting in a distant tree. A Quail was also heard calling while several Linnets were observed. \n At Kensington Cliffs we were treated to a flying display by around thirty Alpine Swift while two Eleonora’s Falcon were hunting in the area. Our final stop was Phassouri Reed Beds where a female Black Francolin ran in front of us as we drove up. Here we were attacked by many small midge-like insects but nevertheless were able to see Squacco Heron again, a Wood Sandpiper and a lovely male Black-headed Wagtail who was feeding on the insects disturbed by the feet of one of the grazing cattle.  The sun was setting now so we called it a day and I returned Derek and Cathy to their holiday home. We had seen more species than I had anticipated on a July Cyprus day but it would have been nice if the Coal Tit and Short-toed Treecreeper had been more accommodating! \n Full species list \n \n Little Grebe \nSquacco Heron \nCattle Egret \nLittle Egret \nGrey Heron \nEurasian Spoonbill \nGreater Flamingo \nMallard \nRed-crested Pochard \nLong-legged Buzzard \nCommon Kestrel \nEleonora’s Falcon \nChukar \nBlack Francolin \nCommon Moorhen \nEurasian Coot \nBlack-winged Stilt \nPied Avocet \nStone Curlew \nGreater Sand Plover \nSpur-winged Lapwing \nGreen Sandpiper \nCommon Sandpiper \nWood Sandpiper \nYellow-legged Gull \nGull-billed Tern \nWhiskered Tern \nCommon Woodpigeon \nCollared Dove \nCommon Swift \nPallid Swift \nAlpine Swift \nEurasian Hoopoe \nCrested Lark \nBarn Swallow \nRed-rumped Swallow \nHouse Martin \nBlack-headed Wagtail \nCyprus Wheatear \nCetti’s Warbler \nZitting Cisticola \nReed Warbler \nOlivaceous Warbler (H) \nSpectacled Warbler \nCyprus Warbler \nCoal Tit \nGreat Tit \nShort-toed Treecreeper (H) \nMasked Shrike \nCyprus Jay \nCommon Magpie \nHooded Crow \nHouse Sparrow \nCommon Chaffinch \nEuropean Goldfinch \nCommon Linnet \nBlack-headed Bunting \nCorn Bunting \n Tagged: Birding , birds of Cyprus , Cyprus , tours"], "link": "http://migration.wordpress.com/2011/07/14/trip-report-tuesday-5th-july-2011/", "bloglinks": {}, "links": {"http://migration.wordpress.com/": 5, "http://feeds.wordpress.com/": 1}, "blogtitle": "Migrations"}, {"content": ["On the heals of CABS’ attention-grabbing Spring Camp in Cyprus video , BirdLife Cyprus has its sober and scientific assessment of Spring 2011 trapping . Besides the fact that the BirdLife Cyprus report is more thorough (owing to greater amount of time put into it), BirdLife’s also focuses more on the mist netting operations which are the greater threat to biodiversity. \n First, if you’re not familiar with the situation, read either the 2010 trapping report or various posts included in my Stop Ambelopoulia FAQ . \n What does the 2011 report conclude though: \n  Figure 1: Long term trend in spring bird trapping activity for period 2007 - 2011 for the 36 commonly surveyed squares. \n Figure 1 [above] presents the trend in spring trapping activity for the 36 survey squares covered in spring 2011 and in the preceding 4 spring surveys (2007-2010). Figure 1 above suggests an increase in trapping activity over the last 3 years, though levels are lower than in 2007 or 2008 (using the total length of net rides recorded as the indicator). Spring 2011 findings for these 36 squares indicate an increase of 9% of the total length of active net rides and an increase of 133% of the number of mist nets found (set or furled) compared to Spring 2010. Comparing spring 2011 with spring 2009 the increase in total length of active net rides is even higher, 72%, while the increase in the number of mist 3 FoE Cyprus in collaboration with CABS (Committee Against Bird Slaughter) undertook a trapping surveillance campaign between 13 – 25 April 2011 in Eastern and Western Larnaca areas. \n 17 nets found was around 75%. It should be noted that the 6 squares that could not be covered in spring 2011 (considered high risk or for firing practice reasons) are well known “hotspots” for trapping activity and it is almost certain that the increases presented in Figure 1 for Spring 2011 would be even higher had they been checked (based on information provided from FoE Cyprus and CABS during their campaign). \n  Golden Oriole (Credit: RSPB) \n How many birds though? The BirdLife report estimates that 491,000 birds were killed in the Spring of 2011 in Cyprus, up from 261,000 birds in Spring 2010. Tassos Shialis reports that up to 50 birds were trapped per mist net per day, frequently with all dead (including the many birds caught which are not kept for the restaurants). \n \n Corroborating this data? An estimate of how many ambelopoulia were served in restaurants lends weight to the estimate of birds killed mentioned above. \n What about the authorities? Response time to discovered poaching operations by the authorities was not what it should’ve been, and the BirdLife team observed that the Game Fund in particular had had its resources stretched to the limit. \n  Kingfisher on a limestick (Credit: Hüseyin Yorgancı) \n In summary, the report paints a dim picture of Cyprus. The first paragraph of the report’s discussion sums it up mildly : \n The data collected of the trapping levels for the Spring 2011 season are very discouraging, indicating that unless enforcement actions are stepped up to seriously clamp down illegal trapping activity during the main autumn season, 2011 will more than likely be another record year in bird death tolls. \n So the raping of Europe’s avian biodiversity every spring and autumn remains a serious concern for Cyprus. \n Tagged: Ambelopoulia , Cyprus , mist nets , poaching , trapping"], "link": "http://migration.wordpress.com/2011/07/01/spring-2011-bird-trapping-in-cyprus/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://migration.wordpress.com/": 13, "http://10000birds.com/": 1}, "blogtitle": "Migrations"}, {"content": ["CABS has a new 10-minute video out, now with English subtitles, that was shown on the German station Stern TV: ‘ Dirty business: How millions of song birds end up as table delicacies .’ \n  \n Tagged: Ambelopoulia , Cyprus , limesticks , poaching , trapping"], "link": "http://migration.wordpress.com/2011/06/26/cabs-spring-camp-in-cyprus/", "bloglinks": {}, "links": {"http://migration.wordpress.com/": 6, "http://feeds.wordpress.com/": 1, "http://www.komitee.de": 1}, "blogtitle": "Migrations"}]