[{"blogurl": "http://www.mikesudal.com\n", "blogroll": [], "title": "mikesudal"}, {"content": ["http://mikesudal.blogspot.com/"], "link": "http://www.mikesudal.com/new-blog/", "bloglinks": {}, "links": {}, "blogtitle": "mikesudal"}, {"content": ["A quick shout out to Robbie Pavlick, Paul Kalna and my uncle Sam June. I am a man of my word!"], "link": "http://www.mikesudal.com/holiday-shout-out/", "bloglinks": {}, "links": {}, "blogtitle": "mikesudal"}, {"content": ["“The Boston THREE Party”… Get it? Boston Tea Party-Three Party. I know, it’s the best idea ever, possibly right up there with the people who put peanut butter and jelly in the same jar, or the guy who designed that little diagram that shows you how to put batteries in stuff. \n Ok, sarcasm aside I had a bunch of fun on this illustration to accompany AP’s NBA package. I made this the main illustration because I think other than the Kobe Bryant trade rumors, the Celtics’ “big three” (Paul Pierce, Kevin Garnett and Ray Allen) is the biggest story of the NBA right now."], "link": "http://www.mikesudal.com/24/", "bloglinks": {}, "links": {}, "blogtitle": "mikesudal"}, {"content": ["In a bit of an unrelated topic, striped bass fishing has been a bit of a let down this Spring. New Jersey beaches had a push of huge fish last year, within a pebble’s throw from the beach, but action since has been spotty at best. \n How do we find the fish when this happens? I call one of my best buds and we launch our kayaks to paddle-fish Long Island! Our trips can last from a few hours in the bay, to entire weekends on both North and South shores using our maps, gps and fish finders to “hunt” for a solid striper bite. \n We had an epic trip this spring. Here’s an excerpt from my surf journal: \n“(Friday 10:00 p.m.) Launched with my buddy Dan to fish the back of a Harbor on the North Shore of Long Island. Our original plan was to hit a spot in the Sound, but the threat of thunderstorms kept us close to home. We threw plugs and broke the ice for the weekend catching a few schoolies. \n (Sat. 12:30 a.m.) We pulled the kayaks out of the harbor, then ran up to Dan’s house to check the radar. Storms moved out so we decided to take a gamble and launch into the Long Island Sound. We launch in a little estuary that empties into the Sound and immediately found feeding bass at the mouth of the tiny inlet. Bass were popping all around us and we landed a few with ease. Fish were still small, largest being around 28 inches. \n (3:30 a.m.) After we took a break and downed some coffee, we decided to ride the tide out into the Sound and head west about a mile to a large rocky point. The last time we fished here I dropped a very heavy bass, so I was dreaming of getting out there for another shot. We paddled out into 25 feet of water and trolled our way west trying to mark fish on Dan’s fishfinder. The rocky point was something striper fisherman dream of… water ranging from 8 to 30 ft. deep with boulders the size of SUV’s and a rocky bottom. We hit some fish out trolling bombers and shads. \n (sunrise) At false dawn the fishing started to heat up. I paddled to the west side of the point and drifted west to east through the boulders tossing a white pencil popper. First cast and “BAM” fish exploded on my pencil. I landed bass to 17 lbs, getting multiple hits each cast. Some were very explosive, and others just “sucked” the pencil under in one gulp. \n After I released a few quality fish a COW tail slapped my pencil. I stopped my retrieve… “twitch” “twitch” …pause… “twitch” and she exploded on the surface. I tried to hook up and missed, and she slashed at the plug all the way to my kayak, swimming right underneath me. Bass was beautiful, at least in the 30lb class, which started to make my blood boil. “They’re some bigger fish here” I yelled to Dan, who was working the point wrestling with his own bass. \n I made another cast and SLAM my pencil is under and drag is singing. Dan heard this one and called out to make sure I was ok. The sleigh ride was on and the fish stayed deep. I tugged and tugged and finally got her to the surface. A big bluefish. The blue was a total surprise as she must’ve been raised by bass. No head shakes, and no surfacing. I called Dan over for some assistance and decided to take a snapshot. I usually never get excited for bluefish, but this was a picture worthy moment: \n \n I looked at Dan’s setup, and handed him over a pencil popper from my bag that was equipped with a rattle. “Just walk the dog?” He asked me and made a U-turn off to investigate his own suspicions. I saw he was focused. \n A few minutes passed and I heard a giant “KABOOM”. I immediately turned around thinking Dan dumped his kayak when I saw his rod doubled over and kayak turning. The sleigh-ride was on and I could tell he was into something heavy. I yelled “Need a hand” and he replied “Both of ‘em” so I gave a few more casts and worked my way over to him. \n When I got there he was minutes into the battle and getting pulled out to deeper water. I asked “You see it yet?” and Dan replied “She’s still on the bottom” which now proved to me it was a quality fish. This slugged out street fight continued for a few more minutes when finally we saw the start of the top of his leader. This is what was on the other end: \n \n It was Dan’s personal best bass. We’ve been fishing together since we were in fifth grade (out of a little canoe in his parents pond) He’s been on Long Island for close to 4 years, and definitely earned this one.” \n Anyway.. that’s an example of what we get ourselves into. Can’t wait to get back out there!"], "link": "http://www.mikesudal.com/spring/", "bloglinks": {}, "links": {}, "blogtitle": "mikesudal"}, {"content": ["My work load the past few weeks has been dominated by a package for global warming and its affects on our planet. The Intergovernmental Panel on Climate Change (IPCC) is releasing their reports of a grim outlook. \n One idea of many brought to me was to show a few “threatened” species on a world map. The IPCC was kind enough to forward us a list of animal species researched before released their report, which we put to good use. I researched it a bit more and proposed to expand the piece and include global climate data to add a bit more punch. Easier said than done. \n After a few hours of researching and some phone calls I found exactly what I was looking for through NASA and started on the map. The layered data gave me a visual problem in the size we were working with, which I tried to handle by separating the map with the illustrations. I’m still a bit unhappy with this formula but overall I feel the piece gave readers a good look into global warming and its impact on the planet. \n Overall I did about 8 climate pieces in the past 2 months. I’m happy to see this subject getting a lot of attention this spring. Hopefully it will spark some public awareness."], "link": "http://www.mikesudal.com/global-warming-package-2/", "bloglinks": {}, "links": {}, "blogtitle": "mikesudal"}]