[{"blogurl": "http://mrepidemiology.com\n", "blogroll": [], "title": "Mr Epidemiology"}, {"content": ["Applying for funding is a tough, but necessary, part of the graduate school experience. But luckily, I’m going to be writing about it in my post today, with GIFs from The Big Bang Theory! \n \n If you hope to continue in academia, constantly applying for funding will be a reality you’ll face until retirement, so might as well start enjoying it. And if you’re in your Masters and thinking about a PhD, you’ll probably be applying for funding for that too, so this cycle never really ends. It’s tough, it sucks, but here are a few tricks you can use to make the whole process much more enjoyable. I’ll be talking mainly about my experiences with OGS and CIHR as those are the funding bodies I’m most familiar with, but if you have experience with NSERC or SSHRC (or any others), please feel free to comment below. \n Click here to continue reading!!"], "link": "http://mrepidemiology.com/2012/10/09/new-post-on-gradifying-applying-for-funding-big-bang-theory-gifs-and-the-joy-of-personal-statements/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.queensu.ca/": 1}, "blogtitle": "Mr Epidemiology"}, {"content": ["Reblogged from epidemiologista:  \n So I started my final year as a PhD student yesterday. Or so I am told, as the REF exercise is coming up, and PhD students finishing on time seem to make up at least part of that score. Also, my funding runs out in 12 months – 1 day which might be a bit more of a personal motivator to actually try and achieve that still seemingly unattainable goal (I seem to be slightly stuck in the… \n  Read more… 1,027 more words  \nA phenomenal list of epidemiology courses - both of the \"short course\" and \"online\" variety!"], "link": "http://mrepidemiology.com/2012/10/04/1400/", "bloglinks": {}, "links": {"http://epidemiologista.wordpress.com/": 3}, "blogtitle": "Mr Epidemiology"}, {"content": ["We’ve talked a lot about resources that are all available for new students, in terms of settling in , finances etc. What we haven’t talked about are things that might affect returning students or those who are approaching the end of the degree. Given that we all hope to be at that point in the near future it’s worth discussing it here. \n About half way through your degree you might realize that you put in a long time and effort but have very little to show for it. In marathon running this point is known as “hitting the wall” – the point where when you run out of energy to continue your race. \n Click here to continue reading!!"], "link": "http://mrepidemiology.com/2012/09/24/new-post-on-gradifying-hitting-the-wall-the-graduate-school-marathon/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.queensu.ca/": 3}, "blogtitle": "Mr Epidemiology"}, {"content": ["Well, that was a cool email to get \n You can check out their full list of Public Health Resources here . They’ve got a ton of blogs there, including ones on HIV/AIDS, cancer, diabetes, mental health and a whole slew of others. I’d definitely recommend bookmarking a few of them. \n Thanks MasterofPublicHealth.org!"], "link": "http://mrepidemiology.com/2012/09/17/mr-epidemiology-named-a-top-public-health-resource-by-masterofpublichealth-org/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://masterofpublichealth.org/": 2}, "blogtitle": "Mr Epidemiology"}, {"content": ["One of the crucial factors in graduate school success is a good supervisor. While some faculties mandate that you come in with an identified supervisor, others let you start your program and identify a supervisor several months into your degree. Picking a supervisor is a very difficult decision and one that shouldn’t be made lightly. \n Sometimes there is an obvious person; especially if you have a defined research interests in mind. However, if you don’t really know, or you have a multitude of interests, your options are quite broad. At that point the question is not “what would you  like  to study” but “who will give you the  best environment  to study in.” \n I’ll highlight what I think is important to talk about with your potential supervisor, or to at least consider, before you make any decisions. However, everyone has different perspectives, and I encourage you to give your opinions in the comments section below. I’ve also discussed this issue on my other blog ( Mr Epidemiology ) and I encourage you to take a read of that. \n Click here to continue reading!!"], "link": "http://mrepidemiology.com/2012/09/10/new-post-on-gradifying-picking-a-supervisor-and-other-concerns/", "bloglinks": {}, "links": {"http://mrepidemiology.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.queensu.ca/": 1}, "blogtitle": "Mr Epidemiology"}, {"content": ["My colleagues have touched on some of the more serious issues of the day . However, when I arrived at Queen’s, I had bigger questions: Why do people keep yelling “how do you feel?” What’s a “greasepole” and why do people want to climb it? And most importantly, why are there purple people? \n For those of you who are confused, lucky you are. Guide you through perils of Queen’s University Frosh Week I will. Ways of the Frosh you will know. Laugh you shall. Yes. Hrmmmmmmmmm . \n Also, you should listen to this in the background as you read. \n So, without further ado … \n \n Click here to continue reading!!"], "link": "http://mrepidemiology.com/2012/08/27/new-post-on-gradifying-queens-frosh-week-as-told-by-star-wars-gifs/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.com.br/": 1, "http://www.queensu.ca/": 4, "http://www.youtube.com/": 1}, "blogtitle": "Mr Epidemiology"}, {"content": ["Reblogged from Amasian Science:  \n        \n Barr bodies used to bar men from competing as women \n Last week, I discussed the inadequacies of genetic-based gender verification . What I failed to mention was that at the 1968 Olympic games in Mexico, \n “Barr body detection was introduced and was widely proclaimed to be the solution to gender misrepresentation in sport. This reportedly ‘simpler, objective and more dignified’ test involved the cytological analysis of a buccal smear. \n\n  Read more… 2,317 more words  \nA great read over on Amasian Science about the Olympics and some important, but sensitive, issues."], "link": "http://mrepidemiology.com/2012/08/17/1375/", "bloglinks": {}, "links": {"http://mrepidemiology.com/": 1, "http://wp.me/": 1, "http://amasianv.wordpress.com/": 7}, "blogtitle": "Mr Epidemiology"}, {"content": ["This was my arm after the accident. I’m sure these are the technical terms the Ortho and ER staff use to describe such injuries. \n Those of you who follow me on Twitter will know that last week, I was in a biking accident on my way to work. While avoiding a pedestrian, I hit the curb and fell off my bike, resulting in me breaking both the radius and ulna in my left arm. I’m going to try and work around it, but there likely won’t be any new posts in the next little while as I deal with the monster cast I have on and then rehab. \n I was very fortunate to make it out with just the one injury to my arm and some road rash . Luckily, because I was wearing my bike helmet, I was saved from any major head injury. So, in short: \n Please, please, please, if you’re riding a bike, wear a helmet. \n I’ve literally biked this route every day from March – October every year that I’ve been in Kingston. If I wasn’t wearing my helmet, I don’t know if I’d be writing this message to you today. \n Special thanks to the paramedics and all the wonderful doctors, nurses and PCAs at the Kingston General Hospital who helped put me back together. You guys are awesome"], "link": "http://mrepidemiology.com/2012/07/30/no-new-posts-for-a-while/", "bloglinks": {}, "links": {"http://mrepid.wordpress.com/": 1, "http://feeds.wordpress.com/": 1, "https://twitter.com/": 1}, "blogtitle": "Mr Epidemiology"}, {"content": ["So last time I talked about my favourite places to hang out in Kingston. Given the heatwave that has swept across the country this month, I thought I’d shift gears slightly and talk about my favourite places to grab ice cream and other cold treats. \n Kingston’s restaurant industry moves in waves. When I started my Masters, there was a sushi place opening on every block. When I started my PhD, it was poutine and burgers. Now, Kingston is in the middle of an ice cream and froyo explosion. \n So let’s begin. \n Click here to continue reading!!"], "link": "http://mrepidemiology.com/2012/07/23/new-post-on-gradifying-favourite-dessert-places-in-kingston/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.queensu.ca/": 1}, "blogtitle": "Mr Epidemiology"}, {"content": ["I like to tweet interesting stories and articles during the week (follow me @ MrEpid ); if you follow me you might have seen these links already: \n \n A tale of two runners exposes flawed Olympic thinking : One with prosthetic legs and the other a female with high levels of testosterone \n A must read for those on the job hunt: The 15 Toughest Interview Questions (with good and bad answers!) \n Friend of the blog Viet Le asks that you Leave Aquaman Alone ! \n A fascinating read: How to succeed in science (without doing any!) \n Are we turning into fitness bullies ? \n \n Have a great weekend! \n -Atif"], "link": "http://mrepidemiology.com/2012/07/20/interesting-reads-july-14th-july-20th-2012/", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.newscientist.com/": 1, "http://mrepidemiology.com/": 1, "http://newgradlife.blogspot.ca/": 1, "http://www.jencomaskeck.com/": 1, "http://arstechnica.com/": 1, "http://amasianv.wordpress.com/": 1}, "blogtitle": "Mr Epidemiology"}]