[{"blogurl": "http://my.biotechlife.net\n", "blogroll": [], "title": "My Biotech Life"}, {"content": ["It’s saturday night again and while baby is sleeping and I’m not in the mood for coding or reading, I decided to finish up these graphics and share. So, here is a set of 9 differently coloured test tubes I recently created. The zip file has all 9 colourful transparent background PNGs. Let me know what you think and feel free to make suggestions for my next pixel pushing endeavours. \n \n And here you can download the zip file containing all 9 images . Enjoy! \n 9 colourful high-resolution test tube graphics"], "link": "http://feedproxy.google.com/~r/MyBiotechLife/~3/GecH-KIUPOU/", "bloglinks": {}, "links": {"http://my.biotechlife.net/": 4}, "blogtitle": "My Biotech Life"}, {"content": ["It’s been a while since I’ve posted anything here. I blame it on Twitter (or just laziness). Anyhow, I stopped coding a bit this Saturday night and decided to fool around with some graphics tools. I wanted a new wallpaper for my shiny new macbook pro retina display and couldn’t find anything I liked so I decided to make something myself. \n So here is the result: 5 different coloured variations of a DNA themed wallpaper. They’re hosted at my alternate website-to-be – bioinformati.co (more on that later…) \n Check them out here (files are quite large): \n \n \n \n \n \n I hope you enjoy them. I’ll try get back to this blogging thing soon… I’ll try. Meanwhile, enjoy the wallpapers and let me know what you think. Here, or on twitter @rvidal \n New DNA themed wallpapers (retina display ready 2880×1800)"], "link": "http://feedproxy.google.com/~r/MyBiotechLife/~3/qwIv2erOA-s/", "bloglinks": {}, "links": {"http://my.biotechlife.net/": 1, "http://bioinformati.co": 1, "http://www.twitter.com/": 1, "http://bioinformati.co/": 5}, "blogtitle": "My Biotech Life"}, {"content": ["Over the last few months I’ve been spending more and more time with R . Not only R but also Bioconductor packages which allow me to easily work with the massive data contained within the microarrays I’m currently looking at. \n As this is my first post about R, statistics and Bioconductor, I won’t go over the various things I believe should change within the R/Bioconductor community. I’d rather just take this opportunity to show my appreciation for such a cool and powerful tool, or should I say, set of tools. \n From simple statistics to amazingly complex visualizations, I’ve slowly grown to fall in love with R. Well, I love and hate R. But I’ll keep things positive for now. \n Where my biggest interest falls is in the interface between data and art. Visualizing data in interesting and new ways that allow us to extract new or better understanding from said information. This is what I hope I’m moving towards as I spend many and long hours coding R and attempting to find patterns in my scores of biological data. \n Another side effect from spending so much time sifting through data sets is seeing data everywhere. It’s as if everything can be re-analyzed or further processed to produce new and interesting results. \n Simple things like waiting at the bus stop lead me to think that it would be interesting to see how efficient the buses are or if their routes could be improved. Looking at the seating in the cafeteria makes me consider the many possible optimizations in table/chair positioning, etc. \n I know that this is not necessarily due to R or data but rather more interest in mathematics and statistics. However, the fact that I live and breathe R, statistics and data sets has been making the cogs move… \n Diving into R and swimming in data"], "link": "http://feedproxy.google.com/~r/MyBiotechLife/~3/73FjWCLUPpY/", "bloglinks": {}, "links": {"http://my.biotechlife.net/": 1, "http://www.bioconductor.org/": 1, "http://www.r-project.org/": 1, "http://www.flickr.com/": 1}, "blogtitle": "My Biotech Life"}, {"content": ["Accessing the web from a smartphone is great but feels confined. \n For roughly 10 days, while on Christmas holidays, I was limited (sort of) to my smartphone for email and web access. This is all good and fine for things that have specific apps such as Twitter , Facebook and other popular websites. However, the web is far more than a collection of apps. Not to say that apps are not great, it’s just that the lack of screen real-estate, access to flash (for video) and other technologies leave me wanting more. It just feels like something is missing… \n Keep in mind I’m talking about mobile access and I’m aware that tablet computers such as the iPad or the Galaxy Tab would probably be much more pleasant to use while away from a “real” computer/laptop. \n For example, many times a day someone will tweet or post a link to some cool new site or video. I’ll see the link, click it and then see that either Youtube does not yet have that video available for mobile or the given site is not properly formatted for mobile devices and takes a long time. \nIf the site is interesting not only for it’s content but also it’s design, many times half of that awesomeness is lost while on a mobile. \n So what ends up happening is that I bookmark the site or the tweet (favorites) and check them all when I get back to my home computer. \n I know it’s not supposed to be the same to navigate the web on a computer and a mobile device but with the massive push that has been put forward to get content mobile-ready, I was expecting that things would be less limiting. It looks like there is still quite a bit of work ahead and I’ll be here clicking and bookmarking “for later” as things progress… \n 10 days of mobile web"], "link": "http://feedproxy.google.com/~r/MyBiotechLife/~3/-zqfBClyuyo/", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://my.biotechlife.net/": 1, "http://www.flickr.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "My Biotech Life"}, {"content": ["Warning: I’m going to get a little meta here. Not a usual thing for me but here it goes, nonetheless. \n \nOne of these weekends, I was trolling around the interwebs and came across a post by someone with a hypothetical (far-fetched) question along the lines of: “What would you do if you suddenly discovered that you could not die?” \n Quite immediately the silly and equally far-fetched comments/answers started coming in. Some would do such things as walk into volcanoes, leap from buildings/planes and perform other generally mortal activities. However, others took a more cautious route by stating that they would not tell anyone for fear of scientific probing or media exposure. The answers said quite a bit about each commenter’s personalities, to say the least. \n However, what I found most interesting were the follow-up questions to the original question. Some quite entertaining and others rather important, given the hypothetical situation. \n \n “If I jumped from a building, would I get injured at all? If so, would I recover from my injuries or remain injured for eternity?” \n “Although immortal, can I feel pain?” \n “How did I discover that I could not die?” \n “Do I grow old despite not dying?” \n \n My inquisitive nature finds the questions to the original question far more enticing than the immediate comments made without further interrogation. They [the following questions] open up far more hypothetical answers to the original question. The necessity of specifics to provide a correct and conclusive answer to a question is so ingrained in my thought process that it sometimes leads an answer to be delayed until all scenarios are covered. Rambling a bit more, the answers to the various questions asked after the original question would further define my answer and therefore lead to a more specific hypothetical answer. \n In short, if you had to answer the question above, would you answer as is or attempt to find out more about the hypothetical situation before answering? \n I guess the easiest (and probably lamest ) answer is “It depends.” \n The questions to the hypothetical question"], "link": "http://feedproxy.google.com/~r/MyBiotechLife/~3/dOAbD-HuTzM/", "bloglinks": {}, "links": {"http://my.biotechlife.net/": 1, "http://www.flickr.com/": 1}, "blogtitle": "My Biotech Life"}, {"content": ["I have a special interest in most things that sit at the interface of art and science . Be it, graphic design through data visualizations , fancy portraits of your DNA or just geeky hand-made jewelery , it’s all good in my books. \n A couple (6?!) months ago I was contacted by Alexandra Pajak, a graduate student from the University of Georgia, with an interesting project. She told me that she was working an album based on the genome of the HIV virus called Sounds of HIV . It immediately caught my attention and I said I’d love to give it a listen. \n Sounds of HIV is a musical translation of the genetic code of HIV, the Human Immunodeficiency Virus. Every segment of the virus is assigned musical pitches that correspond to the segment’s scientific properties. In this way, the sounds reflect the true nature of the virus. When listening from beginning to end, the listener hears the entire genome of HIV. \n So how does one listen to DNA, RNA or proteins you ask? It’s somewhat explained by Alexandra’s notes: \n DNA-based music is music in which the natural chemical properties of DNA is translated into music. In English, the nucleotides adenine, cytosine, thymine, and guanine are abbreviated with the letters a, c, t, and g, respectively. Since A, C, and G are also musical pitches in the Western melodic scale, these pitches were assigned to the matching nucleotides. To form two perfect fifths (C-G and D-A), “D” was arbitrarily assigned to musically represent thymine. The notes of the A minor scale have been assigned to the amino acids based on their level of attraction to water. \n \n On Sounds of HIV, depending on the track, nucleotides and/or amino acids “play” as music. Tracks 1 and 10 are based on the first and last nucleotides of the DNA chain. Tracks 2-9 “play” the proteins and sometimes the nucleotides on top of the proteins. \n \n I’ve listened to the full album and have found it to be a bit strange at times but was mostly expecting the music to very different as it is in fact driven by genetic information which most probably didn’t evolve based on it’s audible features! \nYou can listen to excerpts at Amazon and if you like what you hear, be sure to buy a copy as a part of the proceeds from the sale of this album will go to the Emory Vaccine Center which does extensive AIDS research. \n Sounds of HIV – From nucleotides to notes"], "link": "http://feedproxy.google.com/~r/MyBiotechLife/~3/Vf-yHM0ZOEk/", "bloglinks": {}, "links": {"http://my.biotechlife.net/": 3, "http://www.amazon.com/": 3, "http://dna11.com/": 1, "http://www.madewithmolecules.com/": 1, "http://www.emory.edu/": 1}, "blogtitle": "My Biotech Life"}, {"content": ["Keeping my pledge to write a short blog post about an outstanding woman in science for Ada Lovelace Day , I have chosen the curious little sister of the famous astronomer Sir William Herschel . Her name was Caroline, Caroline Herschel . \n From what I’ve read about her, she was a small framed woman, that worked hard in keeping her brother focused on what he loved, scanning the night sky. Not only did she entertain guests, keep the house, sing and care for her sibling, she also fell in love with the stars as she accompanied her brother on his many nightly scans. \n Considering all the chores, the singing lessons and the long nights, she played a big part in her brothers success and even got her name immortalized on an asteroid. Her second name , to be correct. Oh, and a moon crater too. \n Update: \nI’ve received a few emails regarding this post. I’m sorry if I made it look like all Caroline Herschel did was take care of her brother. I did not mean to pass on that message. I wouldn’t have picked her for Ada Lovelace Day if that were the case. \n Considering her difficult upbringing, the fact that she was a woman in an age where only men were taken seriously in science, living with a very talented and demanding brother, I considered her impact and determination toward science to have been quite impressive. Thus my choice. \n I could have easily mentioned another more famous and generally known female scientist, but I enjoyed learning about her life and thought it would be interesting to share the fact that there was a great woman doing incredible work in astronomy. Even if she was overshadowed by her brother. \n The astronomical and petite Caroline Herschel"], "link": "http://feedproxy.google.com/~r/MyBiotechLife/~3/qTjOqmDfUhw/", "bloglinks": {}, "links": {"http://my.biotechlife.net/": 1, "http://en.wikipedia.org/": 6, "http://findingada.com": 1}, "blogtitle": "My Biotech Life"}, {"content": ["Among many other things, I recently read the wide-scope and well disseminated paper by Beroukhim et al (a very very loaded et al !) titled “The landscape of somatic copy-number alteration across human cancers”. An impressive study of 3,131 cancer specimens from 26 histological types of which 158 regions of focal somatic copy-number alterations were found. \n I could go into detail about this study but what I wanted to mention here was not necessarily about the potential candidate genes or their possible functional implications. I wanted to mention the awesome web application that was produced along with this study which allows folks like me (read lazy !) to go over their datasets with minimal effort. \n The Broad Institute ‘s Tumorscape is a portal that allows one to browse/search through a database of copy number alterations across multiple cancer types. Basically the findings of the previously mentioned paper. \n In my opinion, this is much better than having to go through the raw supplementary data. If I were interested in further pursuing any of the studies performed, I could download the supplementary data, but if I’m just interested in browsing the results of this paper, the Tumorscape makes it far more pleasant. \n There is obviously an overhead related to producing this type of portal, however the sheer number of people working on this project and the amount of data produced definitely justified the creation of such a web application. \n Sorry if the title of this post was a bit misleading, but hey… it should be awesome, right? :) \n Supplementary data should be awesome like this"], "link": "http://feedproxy.google.com/~r/MyBiotechLife/~3/CLaecrRMFR0/", "bloglinks": {}, "links": {"http://my.biotechlife.net/": 1, "http://www.broadinstitute.org": 1, "http://www.nature.com/": 1, "http://www.broadinstitute.org/": 2, "http://www.flickr.com/": 1}, "blogtitle": "My Biotech Life"}, {"content": ["About a year ago I wrote a blog post containing my top 10 list of science related apps for the iPhone and iPod Touch . The list is (was?) a personal selection of apps that I had tried at the time and thought others would enjoy. And I’m sure many did, given the feedback I received. \n With this in mind, here’s a few more interesting life science related apps that I have recently added to my iPhone and iPod Touch which may be of some interest. \n I was amazed that this took so long but Nature.com only recently came out with an iPhone app that is free for download and gives you access to their latest content (Don’t mind the pay-wall :) ) and provides you with an easy way to search and save content. \n While using Nature.com’s app, I found Promega’s app (also free) that although needs some design work, it does come packed with great content. Protocols of all type, video media and a simple BioMath calculator which helps with unit conversions. \n Another app that’s just recently become available is made by the folks at Invitrogen. Their app called Daily Calcs helps with routine calculations like Molarity calculations, Molecular weight, dilutions, unit conversions and interesting cell culture references. And it’s also free. \n If browsing genomes on the go is your thing, then I must recommend you download the GenomePad which basically provides you with UCSC’s Genome Browser on your iPhone . I find it to be a bit difficult to navigate and parse all that data on such a small screen, but it’s great for quick look-ups. Did I mention it’s free? \n The last two apps I’ll mention are not so much tools but didactic apps in the sense that they are awesome learning apps. One called Mitosis provides an interactive way to learn about the process of cell division and the other is a science glossary packed with science goodness. Once again, free and free. \n As you can see, I’ve only mentioned a hand full of free apps this time as I haven’t had or required to purchase any other science apps. However, if there’s a scientific app out there that you think is worth spreading the word (free or not!), please let me know. \n More life science apps for iPhone and iPod Touch"], "link": "http://feedproxy.google.com/~r/MyBiotechLife/~3/Sk4MgMJJKOg/", "bloglinks": {}, "links": {"http://my.biotechlife.net/": 2, "http://itunes.apple.com/": 13}, "blogtitle": "My Biotech Life"}, {"content": ["6 months later, this is what I’ve been up to and what is currently going on… \n \n I finished my thesis, I presented my thesis, I concluded my Master’s degree. Good grade, Happy dance. \n I took my (32!!) driving lessons, I passed the written tests, however I did not conclude my driving exam (more on this, later). \n We made a decision, a difficult decision. Time will tell. \n We celebrated our 1 year wedding anniversary. Champagne for all! \n We moved to Canada. First Toronto for a while, now Kingston. \n I switched to Mac. My 6 year old laptop may rest in peace. \n I’m now a Ph.D. student in Squire Lab at Queen’s University . \n \n There were some good (great!) and bad (really bad!) moments since last August, but no need to go further into detail here. \n OK, done that, let’s get back to semi-regular blog posts of awesome science stuff. \n It’s been a while…"], "link": "http://feedproxy.google.com/~r/MyBiotechLife/~3/281_z0ieHN0/", "bloglinks": {}, "links": {"http://www.queensu.ca": 1, "http://my.biotechlife.net/": 1, "http://cancyto.queensu.ca/": 1}, "blogtitle": "My Biotech Life"}]