[{"blogurl": "http://mygenomix.wordpress.com\n", "blogroll": [], "title": "my GenomiX"}, {"content": ["myGenomiX continua il suo viaggio alla scoperta delle aziende italiane che hanno scelto di puntare sul settore della genomica. Questa volta faccio tappa a Firenze, sede della NEXT Genomics . Ne parlo con il CEO Matteo Cerboneschi, PhD, che ci lavora dal 2009, cioè da quando NEXT Genomics è nata. Essendo uno degli ideatori di NEXT Genomics, Matteo – laureato in Scienze e Tecnologia dell’Alimentazione e dottore di ricerca in Biotecnologie – è sicuramente la persona più adatta per raccontarci la storia e le finalità di questo progetto. \n Che cos’è NEXT Genomics? Hai voglia di raccontarmi la vostra storia? \nNEXT Genomics è nata in seno a due crude considerazioni: una esclusivamente amara, legata all’incapacità finanziaria dell’Università ad assorbire giovani ricercatori (precari), ed una sconsideratamente visionaria, relativa alla voglia di dimostrare che le idee sono spesso più importanti dei budget e delle raccomandazioni. Quando questo gruppo di ragazzi “terribili”, di cui anche io facevo e faccio parte, decise di mettersi in gioco sfruttando in pieno le sue abilità, non solo tecniche, ma anche organizzative e manageriali, NEXT Genomics non era che una sfumata visione, una qualche idea a cui tutti, più o meno intensamente, credevamo. La possibilità di generare uno spin-off universitario completamente autonomo dalla gerarchia accademica, una sfida contro un sistema poco meritocratico che schiacciava i giovani e ne masticava capacità e sogni. Da questo grande senso di rivalsa, nell’agosto del 2009, un notaio decise di apporre la sua firma, con la sua bella penna stilografica, in calce all’atto di costituzione di NEXT Genomics, quello che in prima battuta fu da noi ribattezzato il primo “spin-out” d’Italia. Oggi, dopo circa tre anni di duro lavoro, frullati dal mercato e dai suoi player (questo termine è uno dei tanti che abbiamo dovuto imparare), NEXT Genomics fa parte dell’incubatore Alimenta , all’interno del Parco Tecnologico Padano di Lodi, motore e sostegno di tantissime idee imprenditoriali. E da Aprile del 2011 spin-off in pre-incubazione presso l’Università degli Studi di Firenze ( IUF, Incubatore Universitario Fiorentino ). Da Pirati a Corsari in soli tre anni. \n Sul sito leggo che vi occupate di service, counseling e problem solving nel settore della genomica, e vi rivolgete sia al pubblico che al privato. Qual è il vostro cliente-tipo e che genere di servizi vi vengono richiesti con maggior frequenza? \nIl core business di NEXT Genomics ad oggi è rappresentato dalla progettazione e dallo sviluppo di test genomici. Ma non per i pazienti, bensì per i Medici. Questo è il primo e più importante elemento di demarcazione fra NEXT Genomics e “tutto il resto”. Noi non lavoriamo “mai” con i pazienti, ma solo ed esclusivamente con i medici ed i professionisti del settore (vedi nutrizionista, odontoiatra ed altri). Non è mai esistito un test AIDNA venduto in farmacia o su internet. Abbiamo pensato infatti di sviluppare questo servizio (il famoso service che ti incuriosisce) con il solo obiettivo di creare uno strumento utile, economicamente sostenibile e scevro da qualsiasi fregatura commerciale (vedi linea di prodotti correlati di tante aziende dei nostri giorni). I nostri test sono concepiti con un unico obiettivo: mettere in mano al tuo medico una guida genomica capace di mettere in luce pregi e difetti – sempre e comunque potenziali – del tuo organismo. \n I servizi che offrite sono piuttosto vari e richiedono competenze molto diversificate. Quali figure professionali è possibile trovare nel team di Next Genomics? \nNEXT Genomics è nata con una connotazione esclusivamente scientifica, non poteva essere diversamente vista l’estrazione dei suoi fondatori. Ad oggi potremmo definirci un contenitore di competenze, una vera e propria rete, un network molecolare che mese dopo mese cresce a dismisura. Il comitato scientifico è stato infatti allestito in base alle migliori competenze disponibili nel settore, con oltre undici professionisti di comprovata esperienza. Inoltre a suggellare il tutto è arrivato il riconoscimento di una associazione scientifica internazionale, completamente indipendente, a nome ReGenera Research Group . Il comitato direttivo e scientifico di ReGenera, visibile su internet, annovera fra le sue fila alcuni dei più grandi medici italiani, in tutti i settori sensibili per la progettazione dei nostri test. Non è un caso che i test AIDNA siano gli unici in Italia ad essere stati “approvati” da un’associazione scientifica indipendente. \n Parliamo dei vostri test genomici, i test AIDNA . I pacchetti che offrite sono molto variegati, si va dai test di nutrigenetica a quelli per l’attività sportiva, fino ai test per la calvizie e quelli anti-aging. Come sono stati realizzati i pannelli di SNP che avete scelto? Quali criteri sono stati utilizzati per includere una variazione piuttosto che un’altra? \nSpesso nelle mie presentazioni orali quando parlo della metodologia con cui vengono allestiti questi panel cito una proverbiale locuzione latina, hic sunt leones. A dimostrazione che la selezione dei marcatori genomici, assieme alle caratteristiche strumentali, alla professionalità del personale ed alle certificazioni di qualità, determinano nei fatti il potere analitico dei test genomici. Sbagliare marcatore significa sbagliare parametro, come se andando a farvi un’analisi del sangue, alla vostra richiesta del livello di colesterolo totale vi consegnassero il punteggio di glicemia. Un errore che potremmo definire “marchiano”, anche se in realtà è più diffuso di quanto si pensi. I test AIDNA sono stati progettati sulla base delle specifiche competenze dei nostri medici, biologi e professionisti, sulla base delle più recenti pubblicazioni scientifiche. Senza dimenticare che le Linee Guida del Ministero della Salute del 1998 offrono delle indicazioni più che esaustive sul come e sul quando si scelgono determinati parametri genomici. \n Nel mondo della genomica personalizzata si discute se sia meglio offrire questi test tramite un professionista medico, piuttosto che venderli online direttamente ai consumatori. Voi che tipo di modalità di distribuzione avete scelto? E quanto costano i vostri test? \nHo già risposto a questa domanda ma ho piacere di rimarcare un concetto descritto nella domanda precedente. Le Linee Guida per i test Genetici redatte dalla European Society of Human Genetics (ESHG) nel 2010 parlano chiaro: nessun test genetico, genomico nel nostro caso, sebbene sia questione di “lana caprina”, al di fuori della rete medica. No internet, no farmacia. Ma soprattutto niente DTC (direct to consumer). Il Medico deve necessariamente fare da filtro, deve offrire quella consulenza in pre-vendita che è necessaria ad orientare il paziente in questa scelta. Quante persone recuperiamo “scontente” dai servizi genomici su internet oppure dall’occasione low cost in farmacia. Una vera piaga per il nostro settore. Chi vuole acquistare un test AIDNA va sul nostro sito, sceglie il medico più vicino o più adatto alla sua problematica, e fissa un appuntamento. Durante il primo incontro viene a conoscenza, direttamente dal medico, delle potenzialità e dei limiti di questo strumento. Per il costo invece posso fare un paragone molto semplice, il nostro pacchetto più ampio, NEXT LIFE Plus, che a novembre conterrà quasi 150 marcatori, scelto da atleti e società sportive professionistiche (anche all’interno della Serie A italiana) per la qualità e quantità delle informazioni genomiche, costa meno di un iPhone e non dura due anni, ma tutta la vita. Ovviamente ci sono anche versioni ridotte a costi “ridicoli”. \n Recentemente, insieme a Keith Grimaldi, ho pubblicato un articolo sulla rivista Personalized Medicine ( qui un riassunto ), in cui denunciamo il problema della trasparenza nel settore dei test genetici. Secondo noi, le aziende di personal genomics dovrebbero rendere accessibili al pubblico, ad esempio, l’elenco degli SNP analizzati, un esempio di referto e i riferimenti bibliografici che supportano la vendita del test. Un comportamento trasparente tutela il consumatore, proteggendolo da test inutili o dannosi. Voi cosa ne pensate? \nE’ la strada giusta e questo tipo di problematica si supera anche attraverso la qualità delle risposte, dei report genomici. NEXT Genomics ad oggi non ha eguali nella qualità e quantità di informazioni che mette a disposizione del Medico. I nostri report non dicono solo che tu sei a rischio di diabete, ma identificano patway metabolici, contestualizzano geni e parametri biologici oltre ad applicare algoritmi matematici multi-locus progettati e sviluppati da NEXT Genomics. Oltre all’analisi del problema offrono anche una “soluzione” pratica, in base a quello che abbiamo definito un “approccio a cinque dita”: approfondimenti diagnostici, alimenti, comportamenti, integrazione e terapie. Ogni marcatore e più marcatori in uno stesso ambito applicativo inducono il nostro genetista medico, nella nostra società infatti ogni professionalità è stata selezionata su parametri qualitativi inderogabili, a suggerire una serie di azioni che poi il medico curante deciderà se applicare oppure no. \n Sull’homepage del vostro sito c’è un link a un invitante quanto misterioso USB Genome , che però rimanda a una pagina web ancora in costruzione. Puoi darci qualche anticipazione? Cosa state progettando? \nUna rivoluzione, partendo da una citazione del mai abbastanza rimpianto Tiziano Terzani, secondo cui “l’unica rivoluzione possibile è quella interiore”. Abbiamo sviluppato dei nuovi chip che permetteranno di analizzare il 100% della parte variabile del nostro genoma, oltre 4 milioni di marcatori, con la possibilità di ricostruire digitalmente i nostri cromosomi, a cifre potenzialmente concorrenti con i nostri test più completi. Il tutto non basato sulle attuali NGS, caratterizzate dal sequenziamento selvaggio, ma su di una struttura logica/informatica estremamente organizzata. Oggi in Italia esistono offerte di sequenziamento del Genoma a prezzi dichiarati “ridotti”. NEXT Genomics uscirà nel 2013 con un chip che costerà in media 1/4 – 1/6 dei concorrenti di mercato con una differenza sostanziale: un conto è acquistare un bel quadro dal tratto marcato e dal colore nitido, il nostro USB-Genome, un conto invece acquistare un puzzle da 1.4 terabyte di pezzi da cui difficilmente se ne verrà a capo. Una nuova frontiera, a disposizione della gente, a cifre realmente sostenibili, una rivoluzione che potrebbe davvero lanciarci tutti nell’Era della Genomica, una speranza a mio avviso per tutte quelle “malattie rare” che ancora oggi affliggono molti dei nostri figli."], "link": "http://mygenomix.wordpress.com/2012/10/27/aziende-di-genomica-in-italia-next-genomics-firenze/", "bloglinks": {}, "links": {"http://www.alimentaitalia.org/": 1, "http://www.tecnoparco.org/": 1, "http://www.usbgenome.com/": 1, "http://www.nextgenomics.it/": 2, "http://iuf.csavri.org/": 1, "http://www.regeneragroup.com/": 1, "http://mygenomix.wordpress.com/": 1}, "blogtitle": "my GenomiX"}, {"content": ["Oggi ho scoperto questo bellissimo video che spiega come funziona attualmente il sistema dell’editoria scientifica, e come invece potrebbe diventare se si puntasse di più sull’Open Access. I disegni sono del noto fumettista Jorge Cham (quello di PhD Comics ), mentre le voci narranti sono di Nick Shockey ( righttoresearch.org ) e Jonathan Eisen ( phylogenomics.blogspot.it )."], "link": "http://mygenomix.wordpress.com/2012/10/26/open-access-explained/", "bloglinks": {}, "links": {"http://www.phdcomics.com/": 1, "http://www.righttoresearch.org": 1, "http://phylogenomics.blogspot.it/": 1}, "blogtitle": "my GenomiX"}, {"content": ["Le primarie del centrosinistra sono l’evento politico del momento, negli ultimi due mesi non si parla d’altro. Purtroppo, però, se ne parla nel modo sbagliato. Le accuse reciproche non si basano infatti su punti specifici del programma, ma su altre questioni di cui francamente faccio volentieri a meno. Secondo il mio modesto punto di vista, la scelta del candidato dovrebbe dipendere dalla sua credibilità e affidabilità, ma soprattutto dal programma che intende realizzare. Certo le buone intenzioni non sono sufficienti, i punti del programma devono essere attuati e tra il dire il fare ce ne passa. E’ comunque evidente una cosa: del programma non si può fare a meno. E’ la condizione necessaria, benché non sufficiente. Sono andato quindi a vedere che cosa i due principali candidati hanno da dire a proposito dell’argomento che più mi tocca da vicino: la scienza. Ecco quindi i progetti di Bersani e Renzi per quanto riguarda università, ricerca e bioetica. La prima cosa che si nota leggendo i due programmi è che quello di Renzi è molto più dettagliato: mentre Bersani sceglie pochi punti arricchiti da molti slogan ad effetto, il sindaco di Firenze descrive più precisamente che cosa cercherà di realizzare se dovesse vincere le primarie e successivamente le politiche. Ma veniamo ai punti che ci interessano. \n Università – Una delle “dieci idee per cambiare” di Bersani (l’idea denominata “Sapere” ) è dedicata all’istruzione e alla ricerca. Per quanto riguarda l’università, il segretario del PD si propone di arrestare la flessione delle iscrizioni ai corsi universitari (non dice però come intende farlo). Le priorità di Renzi sono altre. Il rottamatore fiorentino vorrebbe dare maggiore autonomia alle singole università: nella visione di Renzi, le università italiane che vorranno attuare progetti di eccellenza didattica potranno decidere di alzare le tasse (saranno comunque previste delle compensazioni per i redditi medio-bassi). Un altro punto a cui Renzi tiene particolarmente riguarda l’erogazione – da parte di istituti bancari convenzionati – di prestiti agli studenti, per il finanziamento degli studi e delle tasse d’iscrizione. \n \n Ricerca – Bersani dichiara che la ricerca e l’istruzione sono “gli strumenti più importanti per assicurare la dignità del lavoro e per combattere le diseguaglianze”. Il leader del PD ritiene che sia necessario promuovere la ricerca scientifica e la ricerca di base in ambito umanistico, e inoltre investire sulla ricerca avanzata “nei settori trainanti” e “a più alto contenuto d’innovazione”. Un proposito abbastanza generico, così come l’intenzione di “arrestare la sfiducia dei ricercatori”. Renzi, piaccia o no, si presenta in modo diverso e appare più concreto del suo rivale. Come in altri punti del programma, anche in questo la meritocrazia la fa da padrona. Il sindaco di Firenze vorrebbe rendere infatti più meritocratica l’erogazione dei finanziamenti alla ricerca, attraverso la messa a punto di un sistema di valutazione che favorisca la competizione tra università. In buona sostanza, secondo Renzi “i dipartimenti universitari che reclutano male devono sapere che riceveranno sempre meno soldi pubblici”. Con questo sistema, si vuole penalizzare le università che reclutano i ricercatori sulla base di “logiche familistiche e clientelari”. Il raggiungimento di questo obiettivo dipenderà ovviamente dal sistema di valutazione, cioè lo strumento con cui si misura il merito (e mettere a punto un simile strumento sarà certamente più complicato del previsto). Nel programma di Renzi ci sono anche incentivi fiscali per i contributi alla ricerca universitaria: detrazioni dalla base imponibile per le donazioni alla ricerca, e tassazione agevolata per chi investe negli spin-off universitari. Infine, si vuole istituire un fondo nazionale per la ricerca che sia gestito con criteri da venture capital. \n Fecondazione assistita – Sulla bioetica Bersani ricorda la laicità del diritto e sottolinea che “su argomenti come la vita e la morte la politica deve conoscere il proprio limite”. Non è dichiarato esplicitamente, ma penso che Bersani alluda al testamento biologico e alla fecondazione assistita. Renzi è più chiaro : secondo lui, in materia di fecondazione assistita la legislazione attuale deve adeguarsi alla giurisprudenza italiana ed europea. In altre parole Renzi vuole rivedere la legge 40, che impedisce alle coppie fertili portatrici di malattie genetiche di accedere alla diagnosi preimpianto. Il sindaco di Firenze intende inoltre costituire un’autorità apposita sul modello della Human Fertilisation and Embryology Authority . \n In conclusione, è difficile fare un confronto serio delle due proposte, principalmente perché Bersani è stato estremamente sintetico nel suo documento programmatico e di conseguenza non è possibile capire quali azioni concrete intraprenderà una volta salito al governo. Traspare un interesse abbastanza astratto nei confronti della ricerca e dell’istruzione universitaria (entrambe vanno supportate), mentre in materia di bioetica ci si deve attenere al principio della laicità del diritto. Renzi è più concreto praticamente su ogni punto: meritocrazia, maggiore autonomia per le università, prestiti agli studenti e agevolazioni fiscali per chi punta sulla ricerca. Quanto alla bioetica, anche qui Renzi è chiarissimo: la legge sulla fecondazione assistita va cambiata. C’è inoltre l’intenzione di creare un fondo nazionale per la ricerca e di istituire un’autorità apposita che supervisioni tutti gli aspetti legati al trattamento dell’infertilità e alla fecondazione in vitro. Chiudo dicendo che nessuno dei due candidati ha espresso un’opinione a proposito degli OGM, un altro importante punto di contatto tra scienza e società. Ecco, ora avete qualcosa di più concreto su cui basare la vostra scelta, nel caso in cui foste così temerari da decidere di partecipare alle primarie del centrosinistra. \n \n Il programma di Bersani \n Il programma di Renzi"], "link": "http://mygenomix.wordpress.com/2012/10/25/la-scienza-secondo-renzi-e-bersani/", "bloglinks": {}, "links": {"http://www.gov.uk/": 1, "http://www.matteorenzi.it/": 3, "http://www.bersani2013.it/": 3, "http://www.ilpost.it/": 1}, "blogtitle": "my GenomiX"}, {"content": ["Quella che pubblico oggi è una bruttissima notizia. La Gruner+Jahr/Mondadori, editore di riviste storiche come Focus, ha intenzione di licenziare circa 60 persone (praticamente metà della forza lavoro) e chiudere ben 8 testate: Focus extra, Focus domande e risposte, Focus Brain trainer, Wars, Biografie, Jack, Geo e Focus Wild. Tra queste ci sono riviste di tecnologia e di storia, ma soprattutto ci sono dei magazine che in Italia sono ormai diventati dei punti di riferimento nel panorama (altrimenti desolante) della divulgazione scientifica. \n A quanto pare, la casa editrice non ha delle motivazioni economiche valide per dimezzare il personale: in effetti, il 2011 si è chiuso in positivo di 4 milioni di euro. Nel piano di ristrutturazione presentato dalla G+J/Mondadori si legge che il rilancio della casa editrice sarà realizzato attraverso un rafforzamento del marchio Focus e una maggiore attenzione verso i prodotti multimediali. Come questo si debba per forza tradurre nel licenziamento di 36 giornalisti e 24 grafici non è ben chiaro. Al di là dei posti di lavoro persi, comunque, mi preoccupano gli effetti negativi che questa ristrutturazione editoriale avrà sul settore della comunicazione scientifica in Italia. Curiosamente, nello stesso momento in cui si decide di chiudere questi importanti canali di informazione, appare in edicola la rivista Kazzeng.. ehm volevo dire Voyager. E’ una coincidenza tragica. La scienza conta ancora qualcosa in questo Paese? \n Non importa se avete a cuore l’aspetto umano della vicenda o se invece siete più preoccupati per il futuro della divulgazione scientifica italiana, l’importante è diffondere questo appello e sperare che i vertici della G+J/Mondadori cambino idea. Forse siamo ancora in tempo! \n Potete manifestare il vostro sostegno anche iscrivendovi al gruppo Facebook “Gli Esuberanti” ."], "link": "http://mygenomix.wordpress.com/2012/10/17/la-fine-della-divulgazione-scientifica/", "bloglinks": {}, "links": {"https://www.facebook.com/": 1}, "blogtitle": "my GenomiX"}, {"content": ["Nel mondo, in particolare in quello anglosassone, è forte lo stimolo dei blogger scientifici ad aggregarsi in vari network. Il capostipite è stato scienceblogs.com, dal quale poi sono partite molte e varie esperienze, come Field of Science o il recente network di Scientific American. Molti di questi blogger partecipano a più network o hanno anche un blog personale, spesso anche questo tarato sulla scienza. In Italia, invece, come in molti campi, siamo fermi da tempo al solo network degli autori de Le Scienze. Si prova a capire quali possono essere le possibilità di un network italiano e chi potrebbero essere i componenti di questo gruppo. \n di Gianluigi Filippelli e Moreno Colaiacovo \n [ Questo lavoro è stato presentato oggi da G. Filippelli a Comunicare Fisica 2012 ] \n \n Il fenomeno dei weblog o più comunemente dei blog è in continua espansione: ad esempio dall’ottobre 2006 all’ottobre 2011, il numero di blog si è quasi quintuplicato ( dati nielsen ). All’interno di questo mondo in espansione una nicchia, più o meno consolidata, è occupata dai blog scientifici. \n \n In generale un blog è di facile definizione: una pagina web aggiornata periodicamente attraverso un software apposito che permette anche l’interazione con i lettori attraverso i commenti agli aggiornamenti (i post) scritti e pubblicati dall’autore. Quando però si cerca di classificare i blog in grandi categorie, ci si trova di fronte a tutta una serie di sfumature, e a queste non sfuggono nemmeno i già citati blog scientifici. \n \n Già Walker, che, oltre ad essere uno dei primi blogger scientifici, ha scritto, insieme con Torill, il primo (o comunque uno dei primi) articoli dedicati allo studio di questa sottocategoria di blog (11) , in Blogging From Inside the Ivory Tower (1) distingueva tra due distinte tipologie: public intellectuals , che si occupa soprattutto del dibattito politico, e research blogs , centrato essenzialmente sul mondo della ricerca. In particolare questa seconda tipologia è oggi quella maggiormente identificata come blog scientifico in senso stretto, e anche quella che presenta tutta una serie di sfumature cui si accennava poc’anzi, come rivelato da molti studi e ribadito da Bora Zivkovic , blog editor di Scientific American , nel suo articolo “ Science Blogs: definition, and a history “: \n Usually it is meant to be a blog that satisfies one or more of these criteria: blog written by a scientist, blog written by a professional science writer/journalist, blog that predominantly covers science topics, blog used in a science classroom as a teaching tool, blog used for more-or-less official news and press releases by scientific societies, institutes, centers, universities, publishers, companies and other organizations. \n Per gli scopi della discussione attuale, ha scarso interesse andarci ad occupare di blog scritti da scienziati ma che non trattano di scienza (vanno considerati blog scientifici anche questi?), ma potrebbe non essere così inutile distinguere il sottogruppo dei blog scritti da scienziati che però non si occupano della disciplina in cui si sono formati. Certo, in questi casi è buona norma, seguendo ad esempio i consigli di Peppe Liberti , avere come fonte preferenziale un bravo ricercatore che prova a raccontare ciò che succede nella sua disciplina, tuttavia il primo e più importante criterio per valutare se un blog è scientifico o meno sono l’approccio e il metodo scelti dal blogger . \n \n Un buon modo per distinguere tra i vari blogger scientifici è l’aggregatore Research Blogging (RB), un progetto creato dal Seed Media Group , ora acquisito dal National Geographic , lo stesso del Seed Magazine e del famoso network di blog scientifici Science Blogs. RB è un aggregatore multilingue (a differenza di Scienceseeker , che è solo per i blog in lingua inglese, ma che funziona allo stesso modo se non meglio) che propone un portafoglio di blogger scientifici preventivamente valutati da una squadra di editor , che per l’Italia sono tre: il già citato Peppe Liberti insieme con Amedeo Balbi e Moreno Colaiacovo . Questa struttura dovrebbe garantire al lettore la serietà e la competenza del blogger innanzitutto nel trattamento degli argomenti strettamente legati con la disciplina di ciascuno degli iscritti, e più in generale imponendo agli autori delle norme e delle regole sul metodo e sull’approccio degli autori. Resarch Blogging, infatti, prevede che gli articoli aggregati siano dei commenti o degli approfondimenti strettamente legati alla letteratura scientifica accademica: in fondo a ogni post appaiono una o più citazioni ad articoli pubblicati su riviste scientifiche peer-reviewed, una caratteristica che rende RB sinonimo di serietà e professionalità. \n \n Oltre agli aggregatori tematici, però, un’altra possibile garanzia di qualità e competenza dei blogger proviene dai network di blog scientifici, che possono a loro volta essere distinti in due grandi tipologie: quelli di supporto agli editori cartacei classici, come il network di Scientific American, o quelli per così dire indipendenti, come Science Blogs o Field of Science. In entrambi i casi i network sono realizzati, per quel che riguarda i contenuti, essenzialmente da dottorandi o giovani ricercatori o anche insegnanti delle scuole superiori e solo sporadicamente da professori. \n \n D’altra parte utilizzare i blog per comunicare la scienza presenta degli indubbi vantaggi: permette una condivisione della conoscenza, che può essere sviluppata anche in modo collaborativo (2) (in questo caso attraverso ad esempio blog multi utente, network , o wiki ), è un modo eccellente per comunicare la passione per il proprio campo di ricerca (2) , permette di partecipare in qualche modo al dibattito pubblico e mantenere la cittadinanza informata (2) , permette di restare in contatto con colleghi lontani o di stringere nuovi contatti (3) , di migliorare la propria scrittura anche in funzione della stesura di un articolo di ricerca (3) . \n They are a perfect tool for informal interactive discussions by allowing the authors to post an article about any topic they want and having visitors interact through comments (4) \n Nonostante tutti questi indubbi vantaggi, rilevati da vari studi basati più che altro su (poche) interviste a blogger scientifici che lavorano in ambito accademico, e malgrado il loro crescente successo, questa tipologia di comunicazione non sembra ancora riscuotere consensi all’interno delle istituzioni accademiche. Non è solo una questione legata al tempo che bisogna concedere all’attività di blogging e più in generale alla comunicazione (che già da sola non è una attività generalmente ben vista), ma probabilmente anche legata alla così detta caduta delle gerarchie che di fatto avviene con l’uso dei blog e la conseguente interazione (1) : \n In a well-known case study, Zuboff (1988) documented the tension created within a corporation when a computer-based electronic communication system was installed. The openness, inclusiveness, and anonymity of computer-mediated communication was antithetical to the organization’s hierarchical structure; it facilitated the rise of democratic dialogue among workers, thereby placing stress upon traditional hierarchical roles. (Stephen and Harrison 768-69) \n In un certo senso i blog scientifici, che per comodità spesso vengono opposti ai soli giornalisti scentifici in una visione piuttosto semplicistica di una discussione più ampia (5) , sono in effetti in contrapposizione anche con le stesse istituzioni accademiche non solo per le questioni poc’anzi accennate, ma anche per la preferenza di queste ultime a veicolare la comunicazione attraverso metodi standard come i comunicati stampa, senza prendersi quella responsabilità diretta ricordata nell’articolo di Ashlin e Ladle (2) . \n Ad ogni modo, una cosa è certa: l’efficacia dei blog sembra crescere quando questi riescono a fare rete, sia nel caso di un network vero e proprio, come quelli già descritti, sia nel caso di reti costruite attraverso interazioni basate sui link o sui carnevali scientifici (in Italia abbiamo i Carnevali della Matematica , Fisica , Chimica , e dei Libri di Scienza , oltre all’esperienza limitata nel tempo del Carnevale della Biodiversità) o sugli aggregatori. \n \n Dei vari modi per creare una rete di discussione con altri blog, sicuramente l’utilizzo dei link è il più semplice e immediato. E’ interessante notare come María José Luzón Marco in Scholarly hyperwriting: The function of links in academic weblogs (6) abbia cercato di studiare proprio l’uso dei link nei blog accademici, determinando una serie di usi per questa pratica (via hyperlink ): i link sono utilizzati per posizionarsi all’interno di una comunità e costruire delle relazioni; per distribuire e organizzare le informazioni; per collaborare nella costruzione della conoscenza; per creare una identità per il blogger e/o il suo blog; per conversare; per pubblicizzare la propria ricerca; per aumentare la visibilità del blog. \n \n Tutti questi compiti possono essere supportati anche grazie ai già citati aggregatori, e in particolare in ambito scientifico il primo e di maggior successo è Research Blogging, che è stato studiato in maniera abbastanza esaustiva da ben due articoli, Groth e Gurney (7) , concentratisi sui blog chimici, e Shema , Bar-Ilan e Thelwall (8) , che hanno generalizzato quello studio a tutte le categorie (fino ad ora la quasi totalità degli articoli sui blog scientifici era o di tipo editoriale o basato su campioni piuttosto piccoli, poche decine di blogger , e quindi il campione raccolto da RB si presta per uno studio certamente più solido). E’ evidente, come ricordano Shema et al. (8) , che non è possibile studiare l’intero gruppo dei blog scientifici, in ogni caso molto vasto, ma i criteri di selezione e gestione di RB rendono questo database un ottimo campione per esaminare lo stato di salute della blogosfera scientifica. \n \n Dalla combinazione dei risultati dei due studi (con il secondo che conferma e generalizza il primo), risulta che la discussione scientifica tra i blog iscritti all’aggregatore è più immediata rispetto a quella della letteratura tradizionale (come ricorda Larry Moran A scientific journal is not the right vehicle for debate and discussion (9) ), è più contestualmente rilevante, si concentra sulla scienza di alta qualità, si concentra sulle implicazioni non tecniche della scienza. \n \n Nell’ottica di gettare le basi per un network vero e proprio di blog scientifici in lingua italiana, sulla falsariga di quelli citati in precedenza, noi crediamo che proprio RB possa rappresentare un ottimo punto di partenza per realizzare una rete che sia una fonte affidabile e dinamica di approfondimento sul mondo della ricerca. Per questo motivo, siamo andati a spulciare un po’ nelle statistiche dei blogger italiani presenti sul progetto RB. Dai dati raccolti emerge immediatamente una differenza rispetto all’analisi pubblicata su PLoS : la blogosfera italiana ha nella fisica, nella matematica e nelle discipline direttamente correlate i maggiori punti di forza. Questo dato si spiega da un lato con una maggiore presenza di blogger appartenenti a questa categoria, dall’altro anche con una maggiore prolificità degli stessi: \n \n \n \n D’altra parte, nel periodo preso in esame (tutto il 2011), dopo una frequenza di utilizzo abbastanza elevata, l’uso della piattaforma si è stabilizzato su una cifra tra i 20 e i 30 post aggregati al mese (dato che per il 2012 sembra si debba correggere al ribasso): \n \n Un altro dei possibili vantaggi che potrebbe portare l’apertura di un network di blog scientifici sta anche nella possibilità di poter semplificare i rapporti con le istituzioni accademiche e i loro uffici stampa da una parte, e con i giornalisti dall’altra. Per la loro natura di prodotto ibrido, spesso creato da esperti di scienza con il pallino della divulgazione, i blog scientifici si prestano infatti molto bene a svolgere il ruolo di intermediario tra le università e i media tradizionali. Un network di blog scientifici consentirebbe di sfruttare al meglio questo aspetto. \n \n Parallelamente alla creazione del network , sarebbe opportuno interagire con il mondo dei social network e promuovere in questo modo le attività dei blogger iscritti: il supporto di un account social per tutto il progetto, così come le interazioni tra gli account dei singoli componenti della rete con altri blogger scientifici e con i propri lettori possono contribuire al successo e alla visibilità dell’iniziativa, come anche indirettamente mostrato dai dati pubblicati su PLoS (8) e più direttamente nel caso di articoli scientifici i dati raccolti da Melissa Terras (10) . Sono tutti aspetti che vanno inevitabilmente curati, senza però dimenticare il punto centrale: i blog e i loro autori. \n \n In quest’ottica il profilo ideale di ciascuno dei blogger sembra essere quello di ricercatori ed esperti (anche non afferenti al mondo accademico) nel proprio campo con un minimo di esperienza nel blogging scientifico. Gli iscritti a Research Blogging, ad esempio, sembrano incarnare perfettamente la figura del blogger richiesto per un simile progetto. Sono infatti proprio la qualità dei contenuti e la serietà dei componenti del network a determinare, secondo noi, il buon esito dell’iniziativa. \n \n Con questo post intendiamo stimolare la blogosfera scientifica italiana, composta fino a questo momento da autori indipendenti, a prendere in considerazione l’ipotesi di aggregarsi in un network e fare rete. Ovviamente, il fatto che un simile progetto non sia ancora stato realizzato in tutti questi anni ci fa pensare che potrebbero esserci dei problemi e degli ostacoli intrinsecamente legati alla situazione italiana, ed è anche di questo che vorremmo discutere: quali sono queste difficoltà? Sono davvero insormontabili? Noi siamo convinti che fare rete possa essere importante per amplificare gli effetti positivi del blogging scientifico, già menzionati più volte in questo post, e vogliamo capire come fare per attuare un progetto che abbia buone possibilità di successo. Come cantavano i Judas Priest negli anni 80: United we stand, united we never shall fall . \n \n Oppure, scritto in altri termini: \n Our mission is to build a community of like-minded individuals who are passionate about science and its place in our culture, and give them a place to meet \n(dal sito di ScienceBlogs via Eva Amsen ) \n \n(1) Jill Walker. Blogging From Inside the Ivory Tower , pages 127–138. Peter Lang, 2006. \n(2) Alison Ashlin, Richard J. Ladle (2006). Environmental Science Adrift in the Blogosphere Science, 312 (5771) DOI: 10.1126/science.1124197 \n(3) Kjellberg, Sara. “ I am a blogging researcher: Motivations for blogging in a scholarly context ” First Monday [Online], Volume 15 Number 8 (14 July 2010) \n(4) Eva Amsen (2008). Who Benefits From Science Blogging? Hypothesis, 4 (2), 10-14 DOI: 10.5779/hypothesis.v4i2.56 \n(5) Alice Bell, Has blogging changed science writing? . Journal of Science Communication, vol.11, n.1 (2012) \n(6) María José Luzón (2009). Scholarly hyperwriting: The function of links in academic weblogs Journal of the American Society for Information Science and Technology, 60 (1), 75-89 DOI: 10.1002/asi.20937 \n(7) Groth, Paul and Gurney, Thomas (2010) Studying Scientific Discourse on the Web using Bibliometrics: A Chemistry Blogging Case Study . In: Proceedings of the WebSci10: Extending the Frontiers of Society On-Line, April 26-27th, 2010, Raleigh, NC: US. \n(8) Hadas Shema, Judit Bar-Ilan, Mike Thelwall (2012). Research Blogs and the Discussion of Scholarly Information PLoS ONE, 7 (5), 1-8 DOI: 10.1371/journal.pone.0035869 \n(9) Laura Bonetta (2007). Scientists Enter the Blogosphere Cell, 129 (3), 443-445 DOI: 10.1016/j.cell.2007.04.032 \n(10) Melissa Terras, The Impact of Social Media on the Dissemination of Research: Results of an Experiment . Journal of Digital Humanities, vol.1, n.3, (2012) \n(11) Torill Mortensen, Jill Walker. Blogging thoughts: personal publication as an online research tool in Researching ICTs in Context , University of Oslo (2002)"], "link": "http://mygenomix.wordpress.com/2012/10/11/united-we-stand-siamo-pronti-per-fare-network/", "bloglinks": {}, "links": {"http://blogs.scientificamerican.com/": 1, "http://scienceseeker.org/": 1, "https://bora.uib.no/": 1, "http://xmau.com/": 1, "http://seedmediagroup.com/": 1, "http://hyperlink.egloos.com/": 1, "http://www.carnevaledellachimica.it/": 1, "http://www.scienzaexpress.it/": 1, "http://citeseerx.psu.edu/": 1, "http://www.interlae.com/": 1, "http://carnevaledellafisica.blogspot.com/": 1, "http://blog.nielsen.com/": 1, "http://jcom.sissa.it/": 1, "http://researchblogging.org/": 1, "http://dropseaofulaula.blogspot.it/": 1, "http://blog.focus.it/": 1, "http://journalofdigitalhumanities.org/": 1, "http://agenda.infn.it/": 1, "http://journal.webscience.org/": 1, "http://firstmonday.org/": 1, "http://mygenomix.wordpress.com/": 1, "http://dx.doi.org/": 5}, "blogtitle": "my GenomiX"}]