[{"blogurl": "http://mysliceofpizza.blogspot.com\n", "blogroll": [], "title": "my slice of pizza"}, {"content": ["Simons related announcements: The Simons Institute for the Theory of Computing has a webpage . Lot of good information here from upcoming programs to call for Research Fellows which looks very interesting. Simons Science Serie s of talks continues with Ingrid Daubechies on Oct 24. NY Area CS and Economics Day ( NYCE ) continues for the 5th year. The early meetings were hosted by the NY academy of sciences in downtown NY, but Simons foundations will host the upcoming edition on Dec 3."], "link": "http://mysliceofpizza.blogspot.com/feeds/2141116226983206386/comments/default", "bloglinks": {}, "links": {"http://simonsfoundation.org/": 1, "http://simons.berkeley.edu/": 1, "https://sites.google.com/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["When airplanes work, they are great, getting us from A to B in a swish, with many channels of entertainment (forget the food, I am surprised someone hasn't worked out a business model where I can order great food online and they will deliver it to me fresh and hot, past the security just before I board, sorta like Mumbai Dabbawalas ). When they dont: I was stuck on the tarmac with an engine problem and the pilot says, \"Electrons are running around in the computer not listening to us. We are trying to talk to them.\" The other day, the pilot starts the engines, they shut down for some reason, and he announces on the PA, \"We will try to switch the engines on in the reverse order and see if that works.\" Recently heard (due to United/Continental merger, the staff are not crosstrained on others' equipments and there is chaos on board during most flights): \"We seemed to have keyed in the wrong entertainment code, we have to wait for this movie to finish and start with the new program in your entertainment guide.\" Finally, no matter the circumstances, airports are very badly designed. Hub-and-spoke model sucks, transfers take far too long, instead of bringing airplanes to people, people walk along many spokes, spines, and multiple security lines. Try Frankfurt transfer! Amsterdam has accepted the horror and has a tiny Rijksmuseum in the airport to distract you."], "link": "http://mysliceofpizza.blogspot.com/feeds/7011103756995107237/comments/default", "bloglinks": {}, "links": {"http://en.wikipedia.org/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["I spent the weekend in NY. In NY, everything changes between any two visits, places you know will die, from that debris will rise new stories. My days intersected --- sometimes obliquely --- with time in MSR NYC office, wedding in Musician John Popper 's family, Usher's party at Casa La Femme , new Michelin 3 star Atera by Mike Lightner, Shaineal Shah's Xocolatti , and I had comfort food (matzo ball soup and kasha). I had a conversation about Tucker cars and the business of cinematography (\"business of rejections\" claims Ivan ) that cheered me. Note to the world: real estate is back beyond the 1%."], "link": "http://mysliceofpizza.blogspot.com/feeds/4852821650567389684/comments/default", "bloglinks": {}, "links": {"http://ateranyc.com/": 1, "http://www.casalafemmeny.com/": 1, "http://ivanabel.com/": 1, "http://en.wikipedia.org/": 2, "http://xocolatti.com/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["On the flight back from India, I watched Thermae Romae , a two-period piece in which an architect who designs baths in ancient, royal Rome time-travels back and forth to the baths of modern middleclass Japan. It is a great premise to tie these two baths-immersed cultures together across time and space, and a casting challenge to have grand Roman scenes with Japanese actors in them. The film is comic with a Roberto Benigni like Banana, a toga that becomes the Samurai garb, the line by a Japanese traveler to ancient Rome, \"That Marcus?\" and others. This is not the top example of Japanese filmmaking, but it occurs to me that Bollywood that \"draws\" from the west should turn to Japan too. I was told, I should address this tip to SRK. In addition, I watched Kitsutsuki to Ame about a woodsman in a remote town who gets drawn into the making of a Zombie movie by a visiting film crew. One learns \"Zombies cant run\" and there is a fun finale when humans and Zombies wait for a break in the rain for the shooting to begin. I also watched a couple of other HK/China flicks like Dai Chui Bo. Time traveling to present times. Like last year, I had passes to the Palo Alto International Film Festival ( PAIFF ) that just concluded. Last year I used it for VIP parties and lounges, panel discussion with filmmakers and other things, but this year I mainly used it to watch childrens movies. Palo Alto has an interesting place in film making history, and their promo has the sprinting horse , a reminder of the first killer-app for making moving pictures.     This is Palo Alto, no event is complete without local entrepreneurs and new startup technologies. Before the films, you could use theater wifi to access voteiff.com and play trivia, and results appeared real time on the screen! Also, the FF showcased some nice animation technology, melding handdrawn animations into disney-esque and 3D."], "link": "http://mysliceofpizza.blogspot.com/feeds/1608187650991847347/comments/default", "bloglinks": {}, "links": {"http://www.imdb.com/": 1, "http://www.co.jp/": 1, "http://www.youtube.com/": 1, "http://4.blogspot.com/": 1, "http://2.blogspot.com/": 1, "http://paiff.net/": 2}, "blogtitle": "my slice of pizza"}, {"content": ["Here people use run length compression: the telephone number 9220008211 becomes 9, double 2, triple 0, 82 double 1. The govt has interesting ways to \"distort\" the market. In one of the states, every working person is guaranteed -- by govt -- like 150 days of work per year at say 100 Rupees/day. This means even half-working person turns up to do the govt sponsored work (carry construction materials), does some fraction of work, and the businesses go along since they would rather get a fraction than none, and this alternate source of income means labor costs have gone up tremendously for comparable or lesser valued work at homes, businesses etc. I also heard the govt gives free laptops to high school kids in govt schools. No network connection. On education: I spoke to a school teacher and they said one of their biggest challenges was optimizing which subsystems to run using an inverter of limited capacity during the electric power cuts that occur throughout the day (senior students with approaching exams get to keep their fans working, students in grades 1--3 get A/C, etc ). Finally, people speak in analogies. \"What you propose is like in that movie..\" This kills me. All analogies are wrong, some more than others. Analogies are correct only at the high level."], "link": "http://mysliceofpizza.blogspot.com/feeds/3256622965036797704/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "my slice of pizza"}, {"content": ["I am in a hotel in India, lobby and pool teeming with Cricket stars of India and New Zealand who are facing off on the field nearby. Here is a colorful website of IncredibleIndia --- you may have seen their ads in US --- and a website of Indian govt which provides a lot of info. From a conversation: Buddha understood the Universe. Not just our world, but the entire Universe. I imagine one who understands the Universe becomes really quiet. A conversation triggered the following analogy: Famous sports players (eg., Basketball) have a few opportunities when they near retirement such as becoming a coach (tell others what to do) or a TV commentator (discuss what others do). Michael Jordan --- not of Machine Learning fame --- did something new in his third act. He became a player for Wizards, inspiring the young players by being in the court with them, and willing them to become better by his workout regime, play on the court, and his overall mental posture. I really like this model that transends mentoring from sidelines, but see very little of it."], "link": "http://mysliceofpizza.blogspot.com/feeds/4155025388541079635/comments/default", "bloglinks": {}, "links": {"http://www.incredibleindia.org/": 1, "http://www.espncricinfo.com/": 1, "http://www.gov.in/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["I needed a break and managed to sneak into Italy briefly. I was lucky. I met Tara Gandhi , the great granddaughter of Mahatma Gandhi. She spoke to me in Tamil and Bengali, and to the others in what appeared to be flawless Italian! She was really inspiring, both in her graceful demeanor, and in her words, bringing message of friendship, beauty and strength through non-violence.    I also got to see part of the Ms Italy beauty contest at the stunning Montecatini Terme . What can I say about the contestants: gods or genes give us our eyes (all sparkling), humans give us the hair (all flawless) and the rest of the attitude is all ours. A psychologist who spoke to the contestants reported several said the person they admired was Steve Jobs. Hard to escape computers (science)."], "link": "http://mysliceofpizza.blogspot.com/feeds/2397320027640603147/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://2.blogspot.com/": 1, "http://www.flickr.com/": 1, "http://www.taragandhi.com/": 1, "http://www.termemontecatini.it/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["Bruce Maggs jokes that he used to know me when I was Indian. :) I, of course, am an Indian, was always an Indian, as Frost would have said. For personal and family reasons, I am going to be India-focused for the next few years, spending time between US and Bangalore. I will insure this does not change anything work/social for most of my contacts, so let me go past this announcement and say something potentially more interesting: I had a Web -1.0 homepage from 2002. Thanks to Sandy (Technicolor), I now have an updated homepage, check it out . It should render nicely on tablet and phone, laptop and desktop. Bruce Maggs stumped me with this frustrating challenge: Name an Indian, living now in India and known to many people in US."], "link": "http://mysliceofpizza.blogspot.com/feeds/6375309810036863684/comments/default", "bloglinks": {}, "links": {"http://paloalto.thlab.net/": 1, "http://www.rutgers.edu/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["I am not an expert, but people ask me to talk about Facebook's business. Here is a silly answer. Say Facebook has 1B users and each is able and inclined to buy a single share of Facebook for USD 40, a onetime transaction, no annual fees. That is 40B dollars that Facebook can invest, and using what private hedge funds \"guarantee\" --- 3% of free spending money after maintaining capital, adjusted for inflation --- have 1.2B dollars of spending money per year, for perpetuity! You can maintain a decent Engineering and Infrastructure operation for that budget. Make those shares non-voting."], "link": "http://mysliceofpizza.blogspot.com/feeds/7855360138186172414/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "my slice of pizza"}, {"content": ["I often have a question in mind, a question for which it is not important what is my answer, but I need to know the answers of the human diaspora, not an unique answer but the variations. More than a decade ago, I asked people, \"What does the phrase Safe Love mean to you?\" and the experience filled a short story I didn't get to publish yet. These days I ask transplants to the Bay Area (not the natives), \"What do you like about the Bay area?\", and the answers worth remembering have been: Fresh fruits Humming birds Near-zero humidity"], "link": "http://mysliceofpizza.blogspot.com/feeds/6664895403771205117/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "my slice of pizza"}, {"content": ["I had a conversation with someone who reminded me there were oneliners, before there were tweets; the oneliners didnt need hyperlinks, only a lot of thought from the audience to find the hidden links. What any research area needs: A Howard Roark. The reason I hate Apple: The Genius Bar.  Terence Tao is the Kevin Bacon of Google+ What I look for in the Bay area: NY expats."], "link": "http://mysliceofpizza.blogspot.com/feeds/8329765555234940891/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "my slice of pizza"}, {"content": ["Summer schools, like the one on Market Design at Trento , are mental islands: you get out of your context of every day, meet new people, in particular students, you learn about some topic and world seems full of possibilities. The summer school was run by Dan Friedman and David Parkes, who make a powerful Venn Diagram covering CS and Econ among their research interests, with help from Axel Leijonhufvud and Enrico Zaninotto. The Trento schools have a dagstuhlesque history . There were 20+ students from Econ -- CS -- Applied Math spectrum. They formed groups, did research projects during the week, and presented their work on the last day. Example projects included improved matching markets and auction design with information revelation costs. I didnt get as much time as I wanted to interact with the students on specific research projects, but enjoyed talking to several. It was two weeks long, but I missed much of the first week due to travel to Edinburgh for ICML, so my notes are spotty. Lectures: Dan F and David P anchored the lectures, providing intro and glue lectures to solder together the lectures of guest lecturers. Peter Cramton spoke about electricity markets. It is reassuring to have bona fide economists so deeply embedded. Estille Cantillon spoke about mechanisms for matching students to schools in Belgium, this was a great example of Economist in the Field! Tuomas Sandholm spoke about kidney exchanges and expressive auctions. I lectured on problems in Ad Exchanges. I liked Dan's definition of recommendation in a utility (and hence, for me, repeated games framework); David's lecture on combinatorial exchanges in which he posed many open problems; and, a talk with Peter Cramton on what were the a handful of fundamental concepts of Economics. Thinking about the marginal effects emerged as a central tenet, and it came up again in a conversation with Zhenyu Lai when he proposed a target for carbon trading that all countries could adopt.  It is so difficult to travel within Europe by air. There are few direct flights and when they are by EasyJet/RyanAir, they run in the middle of the day and the entire day is consumed traveling. My proposal to EU: start a pan-EU airline or two, kill off the struggling ones supported by individual countries that are flailing. The summer school had sparse Internet access. As a result, no, I didnt get more done, I spent more time fretting there was no Internet access."], "link": "http://mysliceofpizza.blogspot.com/feeds/5923946335699520031/comments/default", "bloglinks": {}, "links": {"http://www-ceel.unitn.it/": 2}, "blogtitle": "my slice of pizza"}, {"content": ["The other day someone asked, paraphrased, \"when you write a blog entry, what do you optimize for the audience\"? Google and other search engines optimize so its visitors who pose a query get quickly or instantly to what they want. Yahoo and other portals optimize so visitors instantly view all they care about on a single page. I have a vision I optimize for: I wish the visitors will scan my blog entry coarsely, get a nugget or two of interest, chuckle or frown or perk up, maybe retrace over a portion of the entry to resolve the nugget better, and soon pivot, go on with their every day lives. But the nugget should linger beyond those few seconds they spend at the blog entry, should resurface later in their psyche, and have some long term utility.  ps: I couldnt think of a metaphor for this effect I want to induce --- slingshot, catapult, pivot --- nothing captures the whirr."], "link": "http://mysliceofpizza.blogspot.com/feeds/7623569168645802834/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "my slice of pizza"}, {"content": ["When I gave a plenary talk at SODA in 03, I had to give the talk a day earlier because the slotted speaker could not make it to the time slot. At ICML, where I was slotted to give the plenary talk at 8:40AM on the first day, I could not make it to the location and the hosts (Andrew McCallum and Joelle Pineau and Charles Sutton), very graciously, scheduled me at 7 PM the same day by carving out a new slot. This tale of two slots worked out well for many: the North Americans who had flown in and had sheepishly slept thru my early AM slot could make it to my evening slot; the attendees had the poster session just before my talk and had a chance to grab some beer and snacks; and, I could go over the standard 50 min --1 hour slot because I was *only* standing between the audience and their dinner. I spoke about streaming, summarizing the by-now standard material on sketches, l_0 samples and their applications, in particular to compressed sensing and graph algorithms resp. For the latter, I highlighted the work of Ahn, Guha and McGregor on graph connectivity problems using l_0 sketches. Then I discussed new directions: (1) new models of learning algorithms in distributed world where the goal is to minimize the communication (I highlighted recent work by Daume+Phillips+Venkatsubramanian, Blum+Balcan+Fine+Mansour, see here ). (2) Continual distributed streaming (highlighted Cormode+M+Yi) and (3) Pan-privacy (I highlighted this work of Dwork, Naor, Pitassi, Rothblum, and Yekhanin). Besides gratuituous jokes, puzzles and comments on recommendations, that was the talk. From the questions afterwards, it seemed like the audience took in the hashing part of it and discussed ways to use it, I hope the other parts will percolate in later. Over dinner: Some in ML learn about developments in TCS world (solely?) by reading Michael Mitzenmacher's blog. Michael: you are carrying us, mate! Like all communities, ICML is tinkering with the conf. One of the suggestions concerned making reviews (think reviewoverflow) public. A central suggestion will be to separate/delink the identities of authors from reviewers (which you can do on the web) but make identity persistent. Someone asked me how many pairs of shoes (2) and glasses (6) I had while traveling. I said only 2 shoes because very few extroverted mathematicians at ICML to look at my shoes, the ref to the joke was lost in some cases. Finally, I saw printed NY Times in French."], "link": "http://mysliceofpizza.blogspot.com/feeds/7005862718589471165/comments/default", "bloglinks": {}, "links": {"http://geomblog.blogspot.it/": 1, "http://[pdf]%20%20pan-private%20streaming%20algorithms%20www.wisdom.weizmann.ac.il/~naor/PAPERS/pan_private.pdf": 1}, "blogtitle": "my slice of pizza"}, {"content": ["I am a huge fan of collages. Romare Baerden is collages then, pieces of debris creating incredible 3D worlds of neighborhoods, music bands and reality; Collages now is Mark Bradford, an incredibly talented artists who works with wax paper used in hair salons and layered posters and claws out deep, nuanced scapes. Thanks to Whitney for helping world discover Mark."], "link": "http://mysliceofpizza.blogspot.com/feeds/7527489377752980328/comments/default", "bloglinks": {}, "links": {"http://1.blogspot.com/": 2}, "blogtitle": "my slice of pizza"}, {"content": ["I have decided to go new. Shoes, only cydwoq . Buy them at Bulo in San Francisco and say hi to Enrico. Glasses, J. F. Rey, Paolo Seminara and Jonathan Cate. Buy them at Next Eyewear at Oakland."], "link": "http://mysliceofpizza.blogspot.com/feeds/1462511913386731812/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 1, "http://3.blogspot.com/": 1, "http://cydwoq.com/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["Two upcoming meetings are interesting (anything in B and I?): The 7th Intl CS Symposium in Russia , July3--7. Opening lecture by Vijay Vazirani and Piotr Indyk is an invited speaker China theory week at Aarhus, Aug 13--17. Invited talks by Christos Papadimitriou, Vijay Vazirani and Eric Allender."], "link": "http://mysliceofpizza.blogspot.com/feeds/7052671651957813109/comments/default", "bloglinks": {}, "links": {"http://agora.guru.ru/": 1, "http://conference.edu.cn/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["Graph lab workshop July 9, SF. Massive data sets MMDS . July 11--13, Stanford. Algorithmic game theory summer school , July 14--21, Greece. v2.0 of sparsity workshop"], "link": "http://mysliceofpizza.blogspot.com/feeds/8778739639795743023/comments/default", "bloglinks": {}, "links": {"http://www.stanford.edu/": 1, "http://graphlab.org/": 1, "http://agt2012samos.wordpress.com/": 1, "https://sites.google.com/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["On scale: Rakesh Agarwal and I spoke recently. A goal would be 10 Million sized online class room! On NY: It survived the assault, going from \"WALK/DONT WALK\" to nonverbal \"red hand/white silhouette\". Folks still read on subways, and the city remains a readers town. On puzzle: A long time ago, I had a function calculator and a lot of time. So, I worked on the puzzle of starting from a 0 in the display and generating any arbitrary integer, only using function keys (arithmetic operators, sin/inv sin, log/exp, etc, all unary operations). Any pointers to this puzzle or its variants welcome. On lingo: I heard of SoLoMo, and it is not about real estate. Social/Local/Mobile. Advertising."], "link": "http://mysliceofpizza.blogspot.com/feeds/9130276148237159158/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "my slice of pizza"}, {"content": ["Google NY folks organized an Algorithms Research day following STOC and invited a bunch of STOC attendees. Vahab orchestrated the day, and from what I could see, the team of Nitish, MohammadHossein, Silvio and Jon helped out, may be others too, behind the scenes where I couldnt see. The team did a great job! Eva Tardos, our newest Godel winner, started the day and talked about sequential auction. Bidders know order of auctions. v_i(A_i) for items A_i for i. n bidders, m items. Goal: social welfare. Agents strategic. Solution concept: subgame perfect eq (for each subgame history). They looked at PoA of complete as well as incomplete information case. The talk had an interesting example (Dining Bidders) that showed some of the nuances, and had one nontrivial bidding strategy (and its variant for analysis): each player draws a random sample of value from others values and uses that to strategize. Costas and Moses asked what value distributions challenge the analysis and how the PoA of 3 is affected by the distribution. I asked, if the order of auctions can be determined and how that affects PoA. Eyal Manor, the Engg Director for Ad Exchange (AdX), spoke next. Q & A was the key, this was clearly an opportunity for researchers to get answers from a key person in AdX. Bobby asked, why push bids for each impression sold, why not let ad networks push bids in a flexible way in small bulks. Eyal's answer was, real time strategies seem important to AdX players. Someone asked, there is information asymmetry, can AdX equalize the information available to all parties. Eyal answered that AdX did not own all the information in the ecosystem, publishers and other players do, and their data is private or secret. Eva asked, is BlueKai a pain in AdX operations? Eyal said they were good partners. Eva pointed out that Economics says what data should be shared: platforms should share, buyers should not have to share. Again, the issue is data is owned by many parties. Moses asked, what data are not shared. Eyal gave the example of someone day bought a ticket, bank login etc. Alfred, VP of Google Research, spoke via video. He used the occasion to let folks know that Google was providing some space for Cornell's operations in NY, which is good news for Academia. Alfred couldnt resist posing some technical challenges: we dont understand fairness of auctions to individual users; we have complex auctioning systems and very sophisticated distributed systems, how do we quantity and control risk? There were several other talks during the day (bobby, gagan, mohammad, andrew mcgregor, et al) which I am unable to summarize here. Vahab gave an excellent overview of research in Google NY and provided pointers to folks who were experts in different projects. Towards the end, Mukund spoke about some interesting problems with interpreting sales data, and our other new Godel Prize winner Tim spoke about simple and optimal auctions. Prabhakar called me an old timer, and I felt like one, slightly out of touch with it all. I ran the first of such meetings in 2009 after SODA, and it is great to see the continuing tradition. It was also good to catch up with Sanjeev, Stefano, Sampath, Seffi and others, that is just the S's."], "link": "http://mysliceofpizza.blogspot.com/feeds/8119089468755378355/comments/default", "bloglinks": {}, "links": {"http://googleresearch.blogspot.com/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["My dad worked in a coal mine for some time. He took me to work one day when I was a boy. I passed massive stalks billowing smoke, periodic loud noise from thumping machines, whirring conveyor belts carrying coal chunks, dust, stink and debris everywhere. I probably walked out with a piece of coal in my pocket and dirty hands. Now when I take my daughter to work, I show her grey floors, neutral color walls, copier machines, and flat screens. The only thing that sputters, spits out hot water and steam, and makes noise is the Cappucino machine. She leaves clutching markers. I hope in 20+ years she can find poetic words to think of her visit to her dad's office."], "link": "http://mysliceofpizza.blogspot.com/feeds/5074230386181682984/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "my slice of pizza"}, {"content": ["Recently, as part of a Berkeley meeting, I had outdoors dinner with a group that comprised Astronomers. There was a serious side to the conversation, but I am going to focus on the friv:  Breaking off from a conversating group, holding a drink, one of them said, \"Excuse me, I have to go start a telescope.\" Talking about the impact of research, one of them said, \"I mean, it is NOT earth-shattering\". It occurred to me that Astronomers should not aim for earth-shattering research. Finally, one of said, \"We have astronomical data\". To a half spaced-out Computer Scientist, it sounded like data Beyond Big. The astronomers convinced me that their work is difficult, because they can ONLY observe and study the data: all mining and no experimentation, but still fun. Outdoors dinner meant mosquitos, but as someone pointed out, even mosquitos are laid back in Berkeley."], "link": "http://mysliceofpizza.blogspot.com/feeds/329948651701924052/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "my slice of pizza"}, {"content": ["I had lunch with several educators and the conversation started with the observation that many of the modern Internet companies treat their employees very nicely with great, free food, time to develop their own projects, and contribution to their volunteering activities away from work. Why do they do it? Answer is, they want their employees be creative: you dont want your software engineer to come to work in the morning at 9 AM and ask, \"What do you want me to code?\", but you want them to be at work and ask, \"What can I do to make things newer, better, slam dunker, .?\". Now, the question is, why dont universities do the same to their employees, say faculty members? Dont universities want professors to be creative? ps: The conversation later turned to, \"Are we -- professors -- asking our students to be creative?\" Not one educator at the table thought we make our students creative. I need a more optimistic answer from the World."], "link": "http://mysliceofpizza.blogspot.com/feeds/1372032472879880601/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "my slice of pizza"}, {"content": ["Here are my two recently released papers on ad exchange research: Doubleclick ad exchange auction . Y. Mansour, S. Muthukrishnan and N. Nisan. ArXivs.  Strictly-Black-Box Zero-Knowledge and efficient validation of financial transactions. M. Rabin, Y. Mansour, S. Muthukrishnan and M. Yung. ICALP 2012. In the first paper, we present a simple auction called the Optional Second Price (OSP) auction that is currently used in Doubleclick Ad Exchange. In the second paper, we present an efficient protocol for running OSPs in a provably trust worthy way."], "link": "http://mysliceofpizza.blogspot.com/feeds/3368337638290046793/comments/default", "bloglinks": {}, "links": {"http://arxiv.org/": 1, "https://sites.google.com/": 1}, "blogtitle": "my slice of pizza"}, {"content": ["Sculpture Then: the Terra Cota soldiers in Emperor's Tomb in China from 3rd century BC has great scale and scope. I have always assumed the soldiers were for the protection of the Emperor in after life. But the tombs reveal more of course: eg., the organization structure of their society (as discussed here ). But I loved the recent take by NY Times that he needed the army for this ultimate ambition of (having conquered China and History) conquering the heavens. Now the whole tomb makes sense!    Sculpure Now: Anish Kapoor is the 21st Century maestro. I managed to see his two exhibits at Chelsea Galleries recently: saw his concrete pourings for the first time and was awed. I was also with a friend in kurta with long hair, and the audience walked around us peering curiously at him, mentally calling him Anish. Salman Rushdie was in the audience too, undisturbed in NY audience. ps: Sneaked into Kitano Jazz and heard Toshiko Akiyoshi."], "link": "http://mysliceofpizza.blogspot.com/feeds/872583587526189098/comments/default", "bloglinks": {}, "links": {"http://www.gladstonegallery.com/": 2, "http://www.nytimes.com/": 1, "http://media.smithsonianmag.com/": 1, "http://en.wikipedia.org/": 1, "http://www.smithsonianmag.com/": 1}, "blogtitle": "my slice of pizza"}]