[{"blogurl": "http://neomam.com\n", "blogroll": [], "title": "Neo Mam Infographic Agency"}, {"content": ["There is no excerpt because this is a protected post."], "link": "http://neomam.com/uncategorized/the-moustache-style-guide-movember/", "bloglinks": {}, "links": {}, "blogtitle": "Neo Mam Infographic Agency"}, {"content": ["Creative “Save the Date” announcements are a great way to help wedding guests plan ahead for the big day, and set expectations for the style and tone of the upcoming event. Inspired by the Gangnam Style pop music phenomenon highlighted in one of our recent designs, happy couple Edward and Eunice asked Neomammalian Studios for [...]"], "link": "http://neomam.com/fun-infographics/save-the-date-infographic/", "bloglinks": {}, "links": {}, "blogtitle": "Neo Mam Infographic Agency"}, {"content": ["The movie Inception by Chris Nolan is a very complex movie to understand. So some people created infographics to help untangle the tangled mind of many. Because of that, we collected the ten mind blowing Inception infographics below:   1. Inception Timeline The infographic tries to describe the dreams chronology of inception.     2. [...]"], "link": "http://neomam.com/industry/10-mind-blowing-inception-infographics/", "bloglinks": {}, "links": {}, "blogtitle": "Neo Mam Infographic Agency"}, {"content": ["As part of our “Creative Thursday” (every Thursday Neo Mam staff can work on their own project), Lizzie pulled together this awesome infographic that details the Anatomy of a hangover. Add this Infographic to Your Website: Simply copy the code below and paste it into the HTML of your blog, website, or Static FBML box [...]"], "link": "http://neomam.com/infographics/anatomy-of-a-hangover-infographic/", "bloglinks": {}, "links": {}, "blogtitle": "Neo Mam Infographic Agency"}, {"content": ["Dark Knight is among the top heroes of DC comics, possibly the only hero (Batman) that can compete with all the recent Marvel movie hits. Because of its influence, we compiled 12 amazing infographics for you to enjoy.   1. The Cost of Being Batman Batman is a superhero in the DC and Marvel comics [...]"], "link": "http://neomam.com/industry/12-amazing-dark-knight-infographics/", "bloglinks": {}, "links": {}, "blogtitle": "Neo Mam Infographic Agency"}, {"content": ["Developed for SEO resource site SEOoutsourcingcompany.co.uk, this infographic aimed to raise the company’s profile online and educate the target audience about issues and risks related to outsourcing SEO efforts. Featured on: seooutsourcingcompany.co.uk"], "link": "http://neomam.com/infographics/infographic-how-to-outsource-and-win/", "bloglinks": {}, "links": {}, "blogtitle": "Neo Mam Infographic Agency"}, {"content": ["In our everyday life, we always seek or expect for convenience everywhere we go and in whatever we do. There are businesses that provide convenience like the convenience stores, drive-thru services, Wikipedia and Google that make our lives easier. Since content marketing is also a business, Eric Wittlake, a marketer from B2B Digital Marketing published [...]"], "link": "http://neomam.com/content-marketing-news/your-content-marketing-must-become-convenient/", "bloglinks": {}, "links": {}, "blogtitle": "Neo Mam Infographic Agency"}, {"content": ["If you are a newbie blogger, creating a highly valuable blog content is easier said than done. You will soon encounter difficulties in developing ideas for your blog content. You may wonder why your blog get considerably less engagement and just a small number of views even if you have created a ton of blog [...]"], "link": "http://neomam.com/content-marketing-news/3-ways-to-create-highly-valuable-blog-content/", "bloglinks": {}, "links": {}, "blogtitle": "Neo Mam Infographic Agency"}, {"content": ["Writing a blog post is a good way to grow, build or advertise your business. Ali Luke published an article in copyblogger.com about improving your blog post to get the results you want of getting readers in. Articles that make the readers heading back for more. He also linked an article from copyblogger about articles [...]"], "link": "http://neomam.com/content-marketing-news/a-5-step-plan-to-improve-every-blog-post-you-write/", "bloglinks": {}, "links": {}, "blogtitle": "Neo Mam Infographic Agency"}, {"content": ["Last month we came across an awesome music video called Gangnam Style by PSY. We love creating infographics so we thought why don’t we just put something together to celebrate when his video hits a 100 million views on Youtube? Yesterday Gangnam Style hit 100 million views and Mashable were kind enough to post our [...]"], "link": "http://neomam.com/infographics/gangnam-style-infographicmashable/", "bloglinks": {}, "links": {}, "blogtitle": "Neo Mam Infographic Agency"}]