[{"blogurl": "http://www.neurevolution.net\n", "blogroll": [], "title": "Neurevolution"}, {"content": ["As a cognitive neuroscientist I’m familiar with neuroscience and psychology experiments, and the many ways to improve these experiments for the benefit of science. Yet there’s another, unappreciated kind of experiment we’re all intimately familiar with, but don’t necessarily know how to improve: living experiments. A “living experiment” is a strategy you try out to [...]"], "link": "http://www.neurevolution.net/2012/08/04/introducing-living-experiments/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["A new study – titled “Global Connectivity of Prefrontal Cortex Predicts Cognitive Control and Intelligence” – was published just last week. In it, my co-authors and I describe our research showing that connectivity with a particular part of the prefrontal cortex can predict how intelligent someone is. We measured intelligence using “fluid intelligence” tests, which measure [...]"], "link": "http://www.neurevolution.net/2012/07/06/having-more-global-brain-connectivity-with-some-regions-enhances-intelligence/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["We are rarely alone when learning something for the first time. We are social creatures, and whether it’s a new technology or an ancient tradition, we typically benefit from instruction when learning new tasks. This form of learning–in which a task is rapidly (within seconds) learned from instruction–can be referred to as rapid instructed task [...]"], "link": "http://www.neurevolution.net/2011/01/23/the-evolutionary-importance-of-rapid-instructed-task-learning-ritl/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["When you type a search into Google it figures out the most important websites based in part on how many links each has from other websites. Taking up precious website space with a link is costly, making each additional link to a page a good indicator of importance. We thought the same logic might apply [...]"], "link": "http://www.neurevolution.net/2010/06/29/finding-the-most-important-brain-regions/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Figuring out how the brain decides between two options is difficult. This is especially true for the human brain, whose activity is typically accessible only via the small and occasionally distorted window provided by new imaging technologies (such as functional MRI (fMRI)). In contrast, it is typically more accurate to observe monkey brains since the [...]"], "link": "http://www.neurevolution.net/2009/11/12/cingulate-cortex-and-the-evolution-of-human-uniqueness/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Thousands of brain imaging studies are published each year. A subset of these studies are replications, or slight variations, of previous studies. Attempting to come to a solid conclusion based on the complex brain activity patterns reported by all these replications can be daunting. Meta-analysis is one tool that has been used to make sense [...]"], "link": "http://www.neurevolution.net/2008/10/17/a-meta-meta-analysis-of-brain-functions/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Keeping up with new findings is constantly becoming more difficult with the rate of publication in just cognitive neuroscience increasing by over 200 per year, with an overall increase of 2333 over the last ten years  (see figure below). I will briefly describe some methods I’ve recently discovered to help deal with this onslaught of [...]"], "link": "http://www.neurevolution.net/2008/08/04/keeping-up-tips-for-managing-science-reading/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Topic 6: Causal Understanding Causal understanding is an important part of human cognition.  How do we understand that a particular event or force has caused another event?  How do realize that inserting coins into a soda machine results in a cool beverage appearing below?  And ultimately, how do we understand people’s reactions to events? The [...]"], "link": "http://www.neurevolution.net/2008/07/21/grand-challenges-of-neuroscience-day-6/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Computational models that are implemented, i.e., written out as equations or software, are an increasingly important tool for the cognitive neuroscientist.  This is because implemented models are, effectively, hypotheses that have been worked out to the point where they make quantitative predictions about behavior and/or neural activity. In earlier posts, we outlined two computational models [...]"], "link": "http://www.neurevolution.net/2008/06/02/reinforcement-learning/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Cognitive neuroscience constantly works to find the appropriate level of description (or, in the case of computational modeling, implementation) for the topic being studied.  The goal of this post is to elaborate on this point a bit and then illustrate it with an interesting recent example from neurophysiology. As neuroscientists, we can often  choose to [...]"], "link": "http://www.neurevolution.net/2008/05/30/levels-of-analysis-and-emergence-the-neural-basis-of-memory/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["I just got back from CNS a few days ago. I thought I’d write a quick summary of one of the more interesting symposia at the conference. Taking place Monday (4/14) afternoon, The rise and fall of cognitive control: Lifespan development covered how executive brain functions develop and peak in the 20s and 30s, falling [...]"], "link": "http://www.neurevolution.net/2008/04/19/cns-meeting-2008-development-of-cognitive-control/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["I recently watched this talk (below) by Joaquin Fuster. His theories provide a good integration of cortical functions and distributed processing in working and long-term memory. He also has some cool videos of likely network interactions across cortex (in real time) in his talk. Here is a diagram of Dr. Fuster’s view of cortical hierarchies: [...]"], "link": "http://www.neurevolution.net/2008/04/05/joaquin-fuster-on-cortical-dynamics/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Modern technologies allow eye movements to be used as a tool for studying language processing during tasks such as natural reading. Saccadic eye movements during reading turn out to be highly sensitive to a number of linguistic variables. A number of computational models of eye movement control have been developed to explain how these variables [...]"], "link": "http://www.neurevolution.net/2008/04/05/simple-recurrent-network-and-eye-movements-used-to-study-real-time-language-processing/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Functional magnetic resonance imaging (fMRI), a method for safely measuring brain activity, has been around for about 15 years. Within the last 10 of those years a revolutionary, if mysterious, method has been developing using the technology. This method, resting state functional connectivity (rs-fcMRI), has recently gained popularity for its putative ability to measure how [...]"], "link": "http://www.neurevolution.net/2008/03/29/measuring-innate-functional-brain-connectivity/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Several months ago I posted The Will to be Free, Part I. In that post I explained that memory is the key to free will. However, this insight isn’t quite satisfactory. We need three additional things to complete the picture: the ability to choose based on predictions, internal desires, and self-awareness. (A quick disclaimer: These [...]"], "link": "http://www.neurevolution.net/2007/11/06/the-will-to-be-free-part-ii/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["I recently published my first primary-author research study (Cole & Schneider, 2007). The study used functional MRI to discover a network of brain regions responsible for conscious will (i.e., cognitive control). It also revealed the network’s specialized parts, which each uniquely contribute to creating the emergent property of conscious will. I believe this research contributes [...]"], "link": "http://www.neurevolution.net/2007/10/07/the-cognitive-control-network/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Here’s an exchange of emails between PL and MC on a recently published paper (Balleine et al., 2007). Email 1 (from PL): Have a look at this introductory paragraph from a recent (Aug 2007) J Neurosci article by Balleine, Delgado and Hikosaka. What do they mean by “cognition” here? The Role of the Dorsal Striatum [...]"], "link": "http://www.neurevolution.net/2007/09/24/the-role-of-reward-and-cognitive-control-in-decision-making/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["In the dark confines behind our eyes lies flesh full of mysterious patterns, constituting our hopes, desires, knowledge, and everything else fundamental to who we are. Since at least the time of Hippocrates we have wondered about the nature of this flesh and its functions. Finally, after thousands of years of wondering we are now [...]"], "link": "http://www.neurevolution.net/2007/08/20/magnetoencephalography/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["In 1992 Rizzolatti and his colleagues found a special kind of neuron in the premotor cortex of monkeys (Di Pellegrino et al., 1992). These neurons, which respond to perceiving an action whether it's performed by the observed monkey or a different monkey (or person) it's watching, are called mirror neurons. Many neuroscientists, such as V. [...]"], "link": "http://www.neurevolution.net/2007/07/17/redefining-mirror-neurons/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}, {"content": ["Topic: Language Everyday (spoken) language use involves the production and perception of sounds at a very fast rate. One of my favorite quotes on this subject is in \"The Language Instict\" by Steven Pinker, on page 157.  \"Even with heroic training [on a task], people could not recognize the sounds at a rate faster than [...]"], "link": "http://www.neurevolution.net/2007/07/13/grand-challenges-of-neuroscience-day-5/", "bloglinks": {}, "links": {}, "blogtitle": "Neurevolution"}]