[{"blogurl": "http://newsaesthetics.tumblr.com\n", "blogroll": [], "title": "News Aesthetics"}, {"content": ["Here is a quick Q & A with Paolo Ciuccarelli, an associate professor who runs the DensityDesign research lab at the Politecnico di Milano . \n How did DensityDesign come about? \n DensityDesign was born in 2004 as a design studio course at the Faculty of Design, Politecnico di Milano. Nowadays, DensityDesign is a research lab in the Design Department (INDACO) of the Politecnico di Milano. It focuses on the visual representation of complex social, organizational and urban phenomena. We do research with companies, public and private organizations and other research groups. \n How important are infographics? \n I see data and information visualization, which infographics are a subset, as a growing phenomena - the more data that is available and open, the more people need a way to access and make sense of it. Availability doesn’t necessarily mean accessibility but infographics have the power to explain or in some cases to motivate people to go through the data. \n Do you think infographics make information easier to digest?  \n Sometimes yes, it really depends on the way they are designed. It’s easy to make mistakes, to produce a misleading visualization, to lie, and not all the infographics are easy to digest. But this is not necessarily bad - we think that the primary goal is to communicate the very nature of the observed phenomenon, and often - especially in the case of social phenomena - it’s a complex one. \n Do you think infographics should be used more often in the academic world? \n In terms of education, I think that in Italy, and generally in Europe, there’s a lack of education in this area, especially for students in Communication Design degrees. It’s a gap that we’re trying to fill here at the Politecnico di Milano. We’re also trying to bring our competences into other fields of education, for example, journalism. \n Do you collaborate with any other organisations? \n Most of the projects we’re working on cannot be done by a team of designers alone. In general the domain of visualization, in my perspective, is necessarily a multidisciplinary one. We usually work with people from statistics and computer science, semiotics, sociology and their respective research organizations, mostly public and private research centres based in other universities or schools. For example, we’re currently working with a NGO in the US for our Dust project. \n Posted by Emine"], "link": "http://newsaesthetics.tumblr.com/post/4255816785", "bloglinks": {}, "links": {"http://www.polimi.it/": 1, "http://www.densitydesign.org/": 2}, "blogtitle": "News Aesthetics"}, {"content": ["Via: Medical Insurance \n In an attempt to surpass the number of hits that Dave’s post on penis size may generate, here is one on 20 strange sex laws by the Medical Insurance Blog . \n Who knew that it was illegal for a man in Santa Cruz, Bolivia, to have sex with a woman and her daughter at the same time or that in Cali, Columbia, the first time a woman has sex with her husband, her mother must be present to witness the act.  \n N.B. In Minnesota, it is illegal for a man to have sex with a live fish. For women it’s OK. \n Posted by Emine"], "link": "http://newsaesthetics.tumblr.com/post/4232843646", "bloglinks": {}, "links": {"http://www.medicalinsurance.org/": 2, "http://www.medicalinsurance.org": 1, "http://newsaesthetics.tumblr.com/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["After creating a word cloud of our blog, I thought it would be interesting to see what word clouds of some national newspaper websites would look like. \n The Daily Mail \n \n No words particularly stand out but ‘Prince’ and ‘Middleton’ are undoubtedly references to the royal wedding, which the Mail have devoted a section of their website to.  \n The Guardian \n It’s interesting to see that some words definitely stick out and there is no direct reference to the upcoming royal wedding. \n Here are two more Wordle creations: \n The Times \n  \n The Independent \n  What do you make of them? \n Posted by Emine"], "link": "http://newsaesthetics.tumblr.com/post/4231971934", "bloglinks": {}, "links": {"http://www.wordle.net/": 1, "http://www.co.uk/": 3, "http://www.co.uk": 1}, "blogtitle": "News Aesthetics"}, {"content": ["I wanted to create a word cloud using our blog so I inserted our URL into Wordle  and this is what it came up with. \n The clouds give greater prominence to words that appear more frequently in the source so it’s no surprise that the word ‘infographics’ dominates the image. Perhaps we should start using some synonyms…? \n Posted by Emine"], "link": "http://newsaesthetics.tumblr.com/post/4231441867", "bloglinks": {}, "links": {"http://www.wordle.net/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["This interactive published in February sought to illustrate the growing unrest in the Arab world. What it now demonstrates, however, is the transience of news story infographics. \n When I first saw this graphic, I was impressed with how effective it was in informing the reader of the goings-on in the Arab world.  \n You could scroll over each country to read a short paragraph explaining its political climate at the time. “Libya has so far escaped any large-scale unrest,” and, “Assad [Syria’s president] said circumstances in his country would not stir the rage of the masses,” it informed us. \n Two months down the line and things have changed dramatically. The Wall Street Journal  reports today that at least 60 people have been killed in the Syrian uprisings and Human Rights Watch reported yesterday that at least 370 Libyans have been reported missing in the eastern part of the country since mid-February – just two weeks after the Guardian’s graphic was published. Needless to say, a similar interactive would look very different now. \n Posted by Emine"], "link": "http://newsaesthetics.tumblr.com/post/4230931925", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://online.wsj.com/": 1, "http://www.hrw.org/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["Newsaesthetics do visualisations (poorly) \n After many, many aborted attempts at conjuring up a visualisation, I was gifted a data set about arts council funding this morning via the Guardian’s datastore and managed to piece together this little bubble chart on Many Eyes . It works a bit like a pie chart, only prettier and more flexible. Basically each individual bubble represents an institution (e.g. The Royal Opera House). The size of the bubble represents the % change in funding from the previous year. The colour of the bubbles corresponds to the art form - a forest green for theatre, sea blue for music. Lovely isn’t it. \n Is it useful? \n Well, yes and no. The main problem is that it doesn’t represent cuts in funding very well - the negative percentages are just smaller bubbles. I’m not sure if it illustrates the number of institutions that have received cuts either, because all the bubbles are different sizes. Don’t think David McCandless is going to come knocking any time soon, although it is a lot more interesting than staring at a spreadsheet… \n Posted by Ben"], "link": "http://newsaesthetics.tumblr.com/post/4208993961", "bloglinks": {}, "links": {"http://www.davidmccandless.com/": 1, "http://www-958.ibm.com/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["One last bit of infographic experimentation - a map to show the average male life expectancy of UK males. \n I got the idea after reading this BBC report  stating that the borough I live in, Islington, has the lowest life expectancy in London. I then got the data for the whole UK from this set of ONS figures . \n The original, interactive map, which I made using Target Map , can be found here . \n Overall, I think it is the best graphic I have made so far. The legend could be a bit clearer, and the blue spots (which you can roll over for more information on the original) make it look a bit messy, but I think other than that it looks attractive and professional. \n This is mainly down to the Target Map system, which, aside from a few formatting problems with the data, I found to both be user friendly and produce good results - a combination lacking from the other online tools I have used. \n As ever, comments would be welcomed. \n Posted by Dave"], "link": "http://newsaesthetics.tumblr.com/post/4208328021", "bloglinks": {}, "links": {"http://www.gov.uk/": 1, "http://www.co.uk/": 1, "http://www.targetmap.com/": 2}, "blogtitle": "News Aesthetics"}, {"content": ["Here is a quick Q and A with Diego Martinez-Moncada, Director of Digital Content at the Daily Infographic . \n The Daily Infographic, as the name suggests, is a site which searches the internet for the most interesting, visually stimulating infographics and post one every day. \n What prompted you to set up the site? \n The site was actually set up by (colleagues) Jay and Tim. They set the site up as a project and found infographics to be a cool topic to base it around. I joined the site because the project sounded great and it was a way for me to get into the internet world. \n What would you estimate your daily/weekly readership is? \n I would say we are getting between 10,000 and 11,000 viewers a week and is consistently increasing from month to month. \n Which newspaper/website do you think produces the best infographics? \n It’s hard to say which one produces the best infographic, there are so many different companies making so many different types of infographics. Although the best type of infographic is an interactive one as well as most involving technology, especially apple. \n What do you see the role of infographics as in the modern media? \n I see infographics becoming a great method for marketing. They’re the perfect medium, they’re pictures, but they allow you to say so much. I’d say infographics are the internet’s elevator pitch. I foresee them becoming a great way to deliver news. It is rather difficult to find infographics for current events, I want to see more of them on the internet and hopefully that is something that can come true soon. \n What do you see as the future of infographics? \n There are so many ways to use an infographic whether it be for random facts, news, how-tos, as long as the content is relevant infographics will be around for a long time. It is a matter of making them “cooler” and more interactive, there are so many uses for the infographic that have yet to be tapped. \n Posted by Dave"], "link": "http://newsaesthetics.tumblr.com/post/4206419470", "bloglinks": {}, "links": {"http://www.dailyinfographic.com": 1}, "blogtitle": "News Aesthetics"}, {"content": ["A little bit meta maybe, but here are two infographics showing the most commonly used sources and tags for visualisations on Many Eyes , as featured on the Guardian Data Blog . \n Both graphics reveal that people are most interested in visualising data about people, or as the blog points out, “we are interested in statistics that tell us something about ourselves.” \n This shows that, while the pretty graphics about climate change, war and politics we have featured on News Aesthetics may be visually stunning, what people actually want to see visualised is information about themselves - about the census, education and, yes Ben, perhaps even penis size. \n It seems then, in infographics as in wider journalism, it is people, not events, which should be the driving force. \n Posted by Dave"], "link": "http://newsaesthetics.tumblr.com/post/4187695448", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://www-958.ibm.com/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["As the news coverage of Japan’s nuclear plant crisis has shown, whenever radiation is mentioned, people tend to panic. Infographics help to put the threat levels in perspective by providing context, but it’s curious to see just how diverse the approaches to this have been. \n The Guardian’s Infographic is very economical and fairly useful but it is essentially just a bunch of numbers on different coloured bars. Information Is Beautiful have come up with an attractive cone that is has plenty of finesse but lacks the concise presentation of the Guardian’s. The xkcd blog made a much-hyped dosage chart . It’s heavy on detail but not particularly attractive and requires quite a lot of attention before it starts to make sense. \n\n Posted by Ben"], "link": "http://newsaesthetics.tumblr.com/post/4184972038", "bloglinks": {}, "links": {"http://www.informationisbeautiful.net/": 1, "http://www.co.uk/": 1, "http://xkcd.com/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["An infographic to celebrate LinkedIn’s 100 million members. It shows how a well presented infographic can mask the fact that it’s actually pretty scant on interesting detail - a case of style over substance, I think. An infographic like this works as a kind of snapshot of the country at a given time, and it’s a collage of lots of different bits of data rather than one cohesive presentation. \n Posted by Ben"], "link": "http://newsaesthetics.tumblr.com/post/4183155301", "bloglinks": {}, "links": {}, "blogtitle": "News Aesthetics"}, {"content": ["… And here’s the post that will earn this blog more hits than all the other posts combined. Some genius has created a data map that compares the average penis size around the globe. Britain, rejoice in your mediocrity. China, seek solace in the fact that the source for this data set is not identified and as such is highly questionable. Still lulz though… \n Posted by Ben"], "link": "http://newsaesthetics.tumblr.com/post/4186267192", "bloglinks": {}, "links": {}, "blogtitle": "News Aesthetics"}, {"content": ["Absolutely gorgeous interactive visualisation from the Guardian that marks a turning point in the way newspapers tell stories. There are two important points to take in here.  \n 1. The longer narrative of the Middle East protests comprises of a series of short stories that are difficult to segue without this kind of visualisation. The infographic part of this timeline makes the whole story much easier to understand. \n 2. The interactive bit of the timeline provides a way to digest the most important moments of the Middle East protests, and doubles as a means of seeing how actions snowball over time. It also allows you to compare countries and see the overlap of actions as revolution spreads through the Middle East. \n This is an insight into a new way of delivering news that takes the principles of tagging and transposes them into a visual, much more user-friendly interface. An intelligent, attractive insight into how the media are using infographics to change the way we digest stories. \n\n Posted by Ben"], "link": "http://newsaesthetics.tumblr.com/post/4183707305", "bloglinks": {}, "links": {}, "blogtitle": "News Aesthetics"}, {"content": ["Here is a very basic  infographic  I made for   Islington Now , one of the weekly newspaper we produce at City. \n The chart shows statistics from the Barcelona v Arsenal game a few weeks ago. Once it was on the page I overlayed the numbers onto it. \n Although it looks very simple, it actually took me quite a while to make, because I had to make sure all the stats were inputted as proportions, not raw figures. \n I think that the amount of work it took, considering that the end product actually ended up a very little space on the pa g e ﻿, was not really worth it, but it underlined to me the amount of time it must take people to produce visualisations commercially. \n (This was actually similar to the way I felt about a piece of live blogging I did for the site, doing text commentary for the same Barcelona v Arsenal  game using a combination of my blackberry, cover it live, and twitter. While I was pleased with my end product from this experience, I feel that, once again, the amount of work and effort it took was disproportionate its impact on the site.) \n Also, the system I used to produce the graphic, the Google Chart API  was pretty unhelpful and unintuitive, and definitely not as user friendly as Many Eyes or Wordle . However, it seems as though the Google system allowed users to produce more complex graphics, so it might be worth investing some time in it. \n As ever, comments would be appreciated. \n Posted by Dave ﻿"], "link": "http://newsaesthetics.tumblr.com/post/3939117702", "bloglinks": {}, "links": {"http://islingtonnow.co.uk/": 1, "http://www.wordle.net/": 1, "http://code.google.com/": 1, "http://www.coveritlive.com/": 1, "http://www-958.ibm.com/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["While trying to get to grips with infographics, I researched meta-infographics. Here are the ones that caught my eye:  \n \n This mocking graphic by  Phil Gyford  (via Laughing Squid ) points to the flaws in some infographics - the fact that some of them are only graphics for graphics’ sake - and ends with the disclaimer, “just because it’s graphical, it doesn’t mean it’s useful”.  \n A meta-graphic that that embraces its form is this one I found via Absurd Intellectual : \n \n I enjoyed the self-consciousness of this graphic and the fact that it didn’t take itself too seriously. \n Which one do you agree with and find most effective? \n Posted by Emine"], "link": "http://newsaesthetics.tumblr.com/post/4237583415", "bloglinks": {}, "links": {"http://www.gyford.com/": 1, "http://www.absurdintellectual.com/": 1, "http://laughingsquid.com/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["JESS3 designed and animated this video illustrating the growth of the internet for the JESS3 lecture at Stevenson University for AIGA Baltimore in Feb 2010. Check it out. \n Posted by Emine"], "link": "http://newsaesthetics.tumblr.com/post/4210074628", "bloglinks": {}, "links": {"http://www.stevenson.edu/": 1, "http://jess3.com/": 1, "http://baltimore.aiga.org/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["Today I came across an interesting blog post by Jim Plush  about the future of CVs: Infographics. \n He praises infographic based CVs because “at a glance I get exactly the information I need to make a well informed decision about the person”. \n If we read “person” as “story” we get a pretty good definition as to why infographics are so good in online (or offline) journalism. \n Plus, it doesn’t half look pretty… \n Posted by Dave"], "link": "http://newsaesthetics.tumblr.com/post/3197986869", "bloglinks": {}, "links": {"http://jimplush.com/blog": 1}, "blogtitle": "News Aesthetics"}, {"content": ["Jez Burrows is a marvellous graphic designer from Edinburgh who has quite a talent for making words beautiful. This is his take on the ‘disparate worlds of indie rock and infographics’. \n Posted by Ben"], "link": "http://newsaesthetics.tumblr.com/post/4183878150", "bloglinks": {}, "links": {"http://www.jezburrows.com/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["A few posts on my favourite illustrators-who-do-infographics today. First up here’s a piece from Stefanie Posavec ’s stunnning Writing Without Words series. This is Literary Organism, a graphic of Kerouac’s On The Road. I’m tempted to call it a visualisation, but it doesn’t really fit into any bracket. It is an infographic of sorts though, since it changes the way a story is told and provides a way of visually digesting a dense data set - in this case the entire text of a novel. \n Posted by Ben"], "link": "http://newsaesthetics.tumblr.com/post/4183854617", "bloglinks": {}, "links": {"http://www.co.uk/": 1}, "blogtitle": "News Aesthetics"}, {"content": ["Following Dave’s post on the BBC’s 7/7 graphic , I wanted to write about my involvement in creating one. During my work experience at the Guardian , I was asked to work on their illustration of the July 7 bombings . This entailed writing a profile on each of the survivors of the King’s Cross blast, by condensing their testimonies from the coroner’s inquests into 75 words. \n In the profiles, I was instructed to include quotes, background information, the victim’s connection to other passengers and finally, any points about emergency services, as they had been criticised for not responding quickly enough. \n Extracting the information that I thought would be most interesting for the Guardian’s readership was a difficult task, not only because there were thousands of words to trawl through, but because of the harrowing nature of the victims’ accounts. The attempt to reduce the survivors’ near-death experiences into digestible sound-bites, which illustrated the nature of their involvement, was tough, to say the least. As was trying to visualise the positions of the victims, which could only really be discerned after all the accounts were digested.   \n What I found the most remarkable was the number of passengers who recounted the same details, the same snippets of conversation and the same recollections of people, their clothing, manner and positions in the carriage. The personal accounts of narrowly escaping death and, for example, clinging to shattered glass to stay alive, were shocking and moving. \n The final product shows the probable positions of the passengers when Germaine Lindsay’s bomb exploded at 8.50am on July 7 2005. The interactive allows the reader to scroll over the figures and read about the survivors and the people who were tragically killed. The figures are colour-coded; the figures in pale red are the survivors; the figures in red, however, signify those who died and they remind the reader that 26 lives were lost during this blast. \n Posted by Emine"], "link": "http://newsaesthetics.tumblr.com/post/4209412294", "bloglinks": {}, "links": {"http://7julyinquests.gov.uk/": 1, "http://www.co.uk/": 2, "http://newsaesthetics.tumblr.com/": 1}, "blogtitle": "News Aesthetics"}]