[{"blogurl": "http://newswithnumbers.com\n", "blogroll": [], "title": "News With Numbers"}, {"content": ["In the words of Stephen Colbert “I Called It”. \n A few years ago I wrote about using a bloom box to power your car . Now there’s apparently a company who’s doing just that . \n I called it!"], "link": "http://newswithnumbers.com/2011/12/06/a-bloombox-for-your-car-part-2/", "bloglinks": {}, "links": {"http://newswithnumbers.com/": 1, "http://www.addtoany.com/": 15, "http://www.technologyreview.com/": 2}, "blogtitle": "News With Numbers"}, {"content": ["Radiolab and Wired magazine each ran a story recently about a computer program they called a “robot scientist”. Its actual name is Eureqa . The Radio Lab story gave a compelling portrait of Eureqa’s capabilities. Just by looking at how a double pendulum moves Eureqa was able to deduce Newton’s famous law of motion “ F=ma “. Even more amazingly, when Eureqa was told to watch biological cells eat, breathe, and grow it was able to deduce the underlying mechanics of that too. Eureqa was able to determine an equation that remained constant throughout the cellular processes and provided the scientists with this equation. Not only did this equation explain the data the biologists gave to Eureqa, but it was also able to predict some new behaviors that Eureqa had never before seen. A stellar accomplishment. Unfortunately Eureqa’s equation was just a string of symbols to the biologists. They had no idea how that equation related to any real-world quantities inside the cell. They got an answer, but couldn’t understand it. \n \n Amazing as Eureqa is, its application may go far beyond science. It may even extend into the realm of news reporting. The first news story to fall to a Eureqa reporter might be climate change. Imagine feeding all the data we have about the Earth’s climate over the past 600,000 years into Eureqa. It could very well create an equation that relates all those variables into a planetary temperature model. All the issues skeptics complain about: sunspots , methane concentrations , increased albedo from deforestation, decreased albedo from polar ice melting, urban heat islands , etc, could be analyzed by Eureqa. Being a computer program we’d expect it would analyze the data without any bias or prejudice. And like the biology example above, it will produce an answer, perhaps one we won’t understand, but one that we can still use for predictive capabilities. We could feed it data indicating how we’d like to change our behavior to mitigate or even reverse global warming * and Eureqa would tell us if our hypothetical new behavior would help or not. \n In the old days of news reporting some reporters were valued for their honesty and ethical integrity. If such a reporter said something was true the public would largely believe it. No reporter today understands climate change, they are all reporting what the scientists say and some are relying on old investigative reporting techniques to dig up dirt that appears significant but is essentially meaningless ** . In other words instead of fact checking they’re merely questioning the motivation of the scientists and not digging into the science. However, if a result came from Eureqa it would be impossible to question its motives. The only thing to question would be the science. \n Climate change with the data collected on that topic may be a field that’s within Eureqa’s grasp to analyze. However, future versions of Eureqa or programs like it may be able to answer other types of questions: \n \n How do taxes affect economic growth? \n Do generous social welfare programs decrease national productivity? \n Do gun control laws reduce gun deaths? \n If we legalized certain drugs how many more drug addicts would we have? \n \n These questions may not seem like they easily lend themselves to numerical analysis, but we are a nation of fifty states, a world of many nations and we’ve been collecting data for a long time. Across our nation, across the globe and for the last several decades we have taken many different stances on these issues with many different results. A program like Eureqa one day may very well be able to analyze this information and determine the ideal tax rate for a country or what drugs can be safely decriminalized, or what level of social welfare minimizes the number of the poor while maximizing productivity. \n The benefit of having a computer program report these results is that it’s immune to the motivational inquisition that passes for investigative journalism these days. You can’t question a computer’s motivation, but you can question the underlying data and the assumptions that go into its analysis. Somewhere along the line we’ve lost the ability to trust someone who doesn’t share our world view. Skepticism has devolved into merely ascertaining whether someone shares our world view and if not we stop listening. When computers are able to give answers to meaningful questions ascertaining whether the computer shares our world view will be a meaningless exercise. We’ll have to resort to verifying its conclusions the old fashioned way, questioning the data or verifying the results on a small scale. That’s the sort of reporting we’re aiming for here at News With Numbers. I’ve downloaded my copy of Eureqa , have you got yours? \n * Assuming Eureqa agrees global warming is an issue. \n ** I’m thinking of climate-gate here."], "link": "http://newswithnumbers.com/2010/04/21/a-robot-reporter/", "bloglinks": {}, "links": {"http://www.wired.com/": 1, "http://www.addtoany.com/": 15, "http://www.skepticalscience.com/": 3, "http://newswithnumbers.com/": 3, "http://www.wnyc.org/": 1, "http://ccsl.cornell.edu/": 1, "http://en.wikipedia.org/": 2, "http://www.epa.gov/": 1}, "blogtitle": "News With Numbers"}, {"content": ["Now that health care has passed with no Republican support it’s natural to ask whether this represents a Democratic takeover of government. Fortunately we don’t have to rely on the word of our elected legislators to shed light on this issue, there is another way. This is the last of the 5 Stories articles.  Like many of the graphics in the 5 Stories series, this one uses fictitious or lightly researched data to illustrate the point. Some names have been obfuscated where the data is based in real-world examples. This helps underscore that the article is for illustrative purposes. \n There were many alternative health care proposals circulating before the passage of Obama’s Health Care Bill. The Republicans said none of their ideas were included and the Democrats said that some of the Republican ideas were included. If only there was an easy way to tell who’s right. Turns out there is. Many journalists are turning to Natural Language Processing (NLP) to aid in understanding political issues. Mostly these techniques are used to learn about individual bills, but another use could be used to compare documents to each other. And in particular to compare the final ObamaCare Bill to every other health care proposal that had been in discussion leading up to ObamaCare. Three real proposals come to mind. The Wyden-Bennett bill, the Massachusetts plan , and the short GOP plan . To round out our mock analysis I also included Obama’s stated goals from the outset and 2 fictitious bills, one from a fake Democratic Senator and one from a fake Republican one. \n Each of these plans discuss a variety of proposals and the degree to which their take on these proposals matches what was included in the final version of ObamaCare is illustrated by that proposal’s tag cloud, the more prominent the tag the more it agrees with the same issue in ObamaCare. For example, ObamaCare and the Massachusetts health care plan share many common features, most prominently the Universal Coverage clause. Additionally since this was passed while that state had a Republican governor we’re counting it as a Republican plan. \n  Click for larger image \n The easiest way to get datagraphics into the newsroom might be through NLP techniques and tag-cloud graphics like the proposed chart here. Word-oriented data graphics might be more approachable by traditional news media while also providing the deep content at-a-glance that all data graphics share. Only time will tell. \n Resources for this article \n \n Free tag-cloud generator. Just randomize a supplied set of words. http://www.tagcloudgenerator.com/ \n Analysis of several alternate health care proposals. http://www.newsweek.com/id/234174/page/1 \n Image for the Capitol building came from here: http://commons.wikimedia.org/wiki/File:Capitol_Building_Full_View.jpg"], "link": "http://newswithnumbers.com/2010/04/16/5-stories-bipartsian-obamacare-support/", "bloglinks": {}, "links": {"http://commons.wikimedia.org/": 1, "http://www.cbpp.org/": 1, "http://www.tagcloudgenerator.com/": 1, "http://www.newsweek.com/": 1, "http://www.addtoany.com/": 15, "http://newswithnumbers.com/": 1, "http://en.wikipedia.org/": 2, "http://www.gop.gov/": 1}, "blogtitle": "News With Numbers"}, {"content": ["When the current recession started back in late 2008 many economists, bankers and politicians described the situation in very vivid language. “The economy is going over a cliff” many of them said, yet no visual image accompanied those words. In a world where newsrooms are comfortable with infographics quotes from experts like “The economy is going over a cliff” would be followed up with questions asking to see the data supporting that phrase. Those questions may even be asked with an eye toward creating an infographic that would evoke that phrase in the minds of the readers. However, we’re not there yet; reporters, numbers and graphics aren’t mixing as well as I’d like but that shouldn’t stop us from trying to visualize what that graphic could look like. \n Another phrase that accompanied these early stories of the recession was “the credit markets are seizing up”. These two phrases may be related. Normally lending occurs  between banks and also from banks to businesses. Some of these loans are short term loans, sometimes paid back in a matter of days, sometimes within a few months. Companies that rely on these short term loans could be forced out of business if they can’t get them. Think of a small retail clothing store. If they don’t have the money on hand to buy their Spring inventory they’ll need to borrow it from a bank. This would normally be a safe bet for the bank if the store had several years worth of sales history from previous Spring sales. The fact that the retail price of the inventory is about double the wholesale doesn’t hurt either. After all, the store wouldn’t need to sell all of their inventory to pay back the loan. So the store buys the clothes on credit and pays the bank off during the sales season as customers buy the clothes. But if the bank is suddenly unwilling to lend the money the store can’t buy as much inventory. Their sales season may end early for lack of inventory and the store may need to lay off staff or even temporarily close after their inventory runs out. Sales at this store would have dramatically dropped from the same period last year. Multiply this across many other businesses in the region and suddenly it’s not just the credit markets that are seizing up, it’s the whole local economy. Or in other words, the economy is going over a cliff. \n The question is, is there a way to visualize this? Adding up sales volume of every business in a region (or the nation) is a difficult task. Yet the example above relied on only one business, the banks. If the credit markets did seize up one way to track that would be to track the growth (or shrinkage) of business loans, which is just what the Economist did in a recent graphic . This graph shows business loans for the US, parts of Europe and the UK. The US portion of the curve almost looks like the phrase “going over a cliff”, with the only caveat being the rapid rise just before the rapid plunge. If you ignore that rise, US bank loans dropped by 40% * between mid-2008 and early 2009. However, even if you were to discount the rise before the fall, the fall would still be a 20% fall and furthermore, the fall would end below the no growth line, end in a 10% reduction in loans. \n The phrase “falling over a cliff” evokes an image of a long plateau suddenly falling away and so the above graph, with that peak before the fall, fails in conveying that sense. But that peak may be a distraction. The far left side of the graph appears to have a relatively stable 20% growth in business loans before falling away in early 2008. This story reminds us that Bear Stearns collapsed around this time and that undoubtedly put a chill in banks’ willingness to lend money. However within a few months Bear Stearns was forgotten and lending resumed, perhaps even making up for lost ground, hence the spike ** . \n Banks like to have a certain amount of assets on hand before they lend. If their assets fall below their threshold, they stop lending until those assets rise above above that threshold. With the decline in asset values of the sub-prime mortgages the banks suddenly found themselves with much fewer assets than they thought they had. To remedy this situation the US government came in and provided nearly $1.5 trillion dollars through TARP and reduced Federal interest rates. These funds went to the banks to increase their asset level so they’d start lending again. Where did all that money go? It’s still in the banks. This chart shows the total money available for use in the US monetary system. \n  \n As planned, this money did go to increase the banks’ assets so they’d feel more comfortable lending. This graph (also from the Economist) shows us that their asset ratio is crazy high, yet apparently many banks are still not lending. \n We still haven’t found (or even simulated) a graphic that would qualify as a smoking gun for the phrase “economy is going over a cliff” yet we’ve come close. The reduction in business loans starting in the latter part of 2009 and continuing through today certainly is unprecedented during the 2 year range of that graph and may be unprecedented for an even longer period of time. Indeed Bernake and Paulson may have had a mental image of a similar graph extending further back in time when they were urging congressional action on the TARP program.  A slightly different perspective, perhaps dollar flows, interbank lending volumes or  total loans (and not loan growth) may yield a more evocative picture. But our hats are off to the Economist for creating these graphs even if they were done 18 months after the start of the recession. \n * The graph is in percent, but percent of what is not mentioned. One presumes it’s in a dollar amount but it could be merely in the number of loans. \n ** Astute readers may note that the loan growth chart is a derivative chart (in the calculus sense). “Loan growth” being flat at 20% means that total loans are growing at 20%. Loan growth of 0% means you’ve reached a plateau. It takes a negative loan growth before the total quantity of loans drops or falls over a cliff."], "link": "http://newswithnumbers.com/2010/04/07/5-stories-economic-cliff/", "bloglinks": {}, "links": {"http://viewswire.eiu.com/": 2, "http://www.addtoany.com/": 15, "http://newswithnumbers.com/": 3, "http://research.stlouisfed.org/": 1, "http://www.reuters.com/": 1, "http://www.cbsnews.com/": 1}, "blogtitle": "News With Numbers"}, {"content": ["The hardest “easy” story around probably is “where does the US spend its health care money?” Easy because the US has by far the most expensive health care system in the world. One would expect that finding the areas where our spending is significantly higher than other countries would be easy. Easier than finding those areas if we were only 10% more expensive or 20% more expensive. We’re a lot more expensive!!! How hard can it be to find where we’re more expensive? Hardest because, when you drill down into the issue it becomes complicated and difficult to describe. But let’s start with the simple part first. \n \n \n \nA key component of good infographic design is choosing what to graph. Edward Tufte’s great example of the Challenger explosion shows the power of simply asking the key unspoken question. In this case, “ do cold temperatures lead to booster rocket damage “. Similarly the health care expense question is NOT how much we’re spending, but is instead where are we spending that’s higher than the norm? \n \nConsider, for example two categories of health care, cancer related spending and other non-cancer disease spending. At first blush since the cancer spending is so much higher than the non-cancer spending, it appears that should be the focus of our attention. If we could bring that cost down then we’d be saving a bunch of money. But suppose we also had access to similar data for England, Germany, Switzerland, or a European average (for example), and we then compared their spending on these areas with the US’s spending. \n \n \n \nNow, suddenly we see a different story. Since the US is spending about the same amount per-capita on cancer treatments as the European average we should be skeptical that the US will be able to achieve significant cost reduction in cancer treatment. Furthermore while non-cancer disease treatment has a lower total expense, the US is spending more than the European average and realizing cost savings here should be easier. \n \n \n \nThis is why total spending is a red-herring. The items to focus on, the easiest savings to realize, are those where the US is spending more than the international average. Additionally, reader confidence in the numbers is enhanced if the charts cover the entire discrepancy. For example, as mentioned before the US spends $6096 per capita on health care while the European average is approximately $2723. If an analysis of European vs US spending were to sum up to something close to the total discrepancy ($3373) then there’d be increased confidence that the study was comprehensive and accurate. \n However, the reality may not be so easily analyzed. Health care has many overlapping facets. One way to slice the data is like we’ve shown above, by the type of “ailment” the patient is having treated. But an equally valid slice is to follow the money and analyze where the patients dollars go. These items may include doctors’ fees, diagnostic procedures, drug costs, and etc. Some additional insights may be gleaned by looking at the health care data from that perspective. But telling the story from both perspectives would be tricky because of the overlapping nature of these expenses. For example, the full savings from a reduction in doctors’ fees and cancer treatments cannot be realized because some of those doctors fees are already counted toward treating cancer. \n And this is why health care expense is one of the hardest infographic stories around. The data is vast, multi-faceted and interacts with itself in ways that are difficult to unravel. This isn’t to say that developing such a story is impossible. Indeed parts may have already been done by the Congressional Budget Office and by the staff of many members of the US House and Senate. But it’s also possible that in the rush to get that bill analyzed mistakes like the double counting example above may have crept into several analyses. \n Unlike the other articles in this series I’m stopping short of suggesting a particular infographic that could have been used to tell the story. I do believe that an infographic can tell it, but without digging into the data the exact nature of that infographic is hard to predict. It could be similar to the 4th image above ( Health Costs by Ailment ) or it could be something more visually complex. But this story is different from the other stories in this series in another way, specifically, it hasn’t been told at all . What’s surprising is given the magnitude of this bill and the billions of dollars it will cost over the next several years and the dire need we are in of fixing our health care system that a comprehensive and simple-to-understand study has not been completed at all, either as an infographic or in text. It’s hard but possible, and more importantly necessary. Proceeding to overhaul health care without it is like planning an expedition without ever looking at a map. \n * This is an actual average for high HCI European countries. Detail is available here"], "link": "http://newswithnumbers.com/2010/04/01/5-stories-health-expense/", "bloglinks": {}, "links": {"http://newswithnumbers.com/": 6, "http://www.addtoany.com/": 15}, "blogtitle": "News With Numbers"}, {"content": ["Recently ABC News (and others) ran a story about how doctors in Sweden discovered an increase in heart attacks every year when the clocks spring forward and similarly a decrease in heart attacks when the clocks fall back. What’s surprising about ABC’s coverage is that the graphics they ran with the story were completely irrelevant to the issue. \n  \nThis story is a natural for a data graphic. Indeed most folks probably drew a mental picture similar to the one below, clearly showing an increase in heart attacks the week after the switch to daylight savings time and clearly showing a decrease the week after the switch back. (Many might have thought the pop was bigger, but the image below is scaled to represent a 5% increase over the average trend.) \n \nAny single year may not have been so clear cut. The story said that the change in heart attacks was about 5%, but did not mention what the normal variation from day to day was. The sample above reflects a 1% daily variation with a 5% variation on the daylight savings time change. The difference is easy to see. \n It could be that the daily variation was also on the order of 5% making the annual DST change harder to see in any given year. See for example the image below. \n \nHowever given a choice between informative but idealized graphic (the first chart above) or useless and irrelevant graphic (what ABC ran with), which would you use? Which would you rather see? \n Finally even if the daily variation was the same as the annual DST variation, a simple and accurate graphic could have been made. If every year the switch to DST increases heart attacks by 5% then over a period of several years the trend should become clear. Imagine, for example, that every day you flip a coin, but that each March 31st that coin lands heads up. On any given year it is impossible to detect this effect, but after 10 years, you should notice that it lands heads up 5 times on March 30, 5 times on April 1, and all 10 times on March 31; a bizarre but detectable pattern. Similarly the simulation below shows this same averaging effect over a 10 year period. (Click on the image to be taken to the simulation .) \n \nThe top part of the simulation is a typical year’s data, the bottom part is the average of all the years so far. Let the simulation run for a few simulated years and the change in behavior across daylight saving times boundaries is easy to see. \n Note that after a few simulated years of running the average graphic matches up well with the original “minds eye” version above. ABC news could have ran an actual 1-year graphic if that looked like chart #1 above or it could have run a several year average graphic if the 1-year looked like chart #2. Either way, they could have ran a graphic that conveyed information instead of eye-candy to accompany the spoken words."], "link": "http://newswithnumbers.com/2010/03/22/5-stories-heart-and-sleep/", "bloglinks": {}, "links": {"http://newswithnumbers.com/": 2, "http://abcnews.go.com/": 1, "http://www.addtoany.com/": 15}, "blogtitle": "News With Numbers"}, {"content": ["Late last year the U.S. Preventive Services Task Force released a report that significantly changed the breast cancer screening guidelines for women. They raised the age where mammograms are recommended from 40 to 50. This set off a firestorm in the country and perhaps rightly so as a significant number of cancers are found via mammograms in women between 40 and 50. The report remained in the national spotlight for several weeks and the task force was brought before Congress to testify as to what the report really meant. Furthermore, since this recommendation was published in the middle of the health care debate, many wondered if the motivation was a cost saving move, implying the science was not as conclusive as the financing. Finally amid all this controversy the task force revised its recommendation to more clearly state that women should consult with their doctors and follow their doctor’s guidelines. \n This article is one in a series of articles that asks whether a data graphic would have altered the course of a recent news story. Actual data was not collected for this particular article (though a future article may show actual data) in part to allow us to focus on the issue of how the story would have changed with a good data graphic. Indeed without a data graphic many woman and insurance companies may have thought the recommendations meant that mammograms were 0% effective for women under 50 and 100% effective for women over 50. Subsequent interviews with the task force members made it clear that’s not what they meant, but words alone are weak tools at conveying the proper meaning here. \n The graph above charts a hypothetical “effectiveness” factor for mammograms by age. Effectiveness is intentionally vague here, a real chart would undoubtedly blend many complicated factors together to get a single “effectiveness” number. Those factors might include the rate of false positives, risks and inconvenience from unnecessary biopsies, risks from unnecessary x-ray exposure and etc. But let’s assume the task force could have created a graphic like the one above as part of their recommendation. The task force might also have agreed to a “cut-off” value ahead of time, e.g. an effectiveness of greater than 50% would be recommended and one of less than 50% would not be recommended. This isn’t unusual, doctors have similar guidelines for other tests. Amniocentesis testing for example. The risk of miscarriage from an amniocentesis test is between 1 in 200 and 1 in 400, similarly for mothers between the ages of 34 and 36 the risk of having a downs syndrome child is between 1 in 200 and 1 in 400. Consequently the guidelines are for women to be tested when they’re 35, approximately where these 2 risk factors are equal. Similarly drawing a mammography effectiveness line at 50% is entirely plausible. \n The hypothetical chart above shows that mammograms are clearly not the optimal screening method for women under 40. The ‘effectiveness’ ranking is below 50. Similarly it clearly shows that for women over 50 mammograms clearly are effective. But this middle ground between 40 and 50 is tricky to describe. Technically it too falls under the threshold, but only just. If you were on the task force and saw this graph in your mind’s eye and were forced to explain your recommendation in words alone, how would you do it? \n Once you include a graph the question naturally turns to other graphs. The graph above is for the “average” woman. How would the graph look for women with a family history of breast cancer? How would it look for women with no risk factors? The graph below shows these possibilities. In this case women over 40 with a family history are shown above the 50% line and women over 40 with no risk factors are clearly below the 50% line. \n If the Task Force’s report were issued with (actual versions of) these graphs (and if the news media carried them) the weeks long national firestorm that accompanied the announcement could have been minimized."], "link": "http://newswithnumbers.com/2010/03/18/5-stories-breast-cancer-screening/", "bloglinks": {}, "links": {"http://www.gynob.com/": 1, "http://www.addtoany.com/": 15, "http://www.americanpregnancy.org/": 1}, "blogtitle": "News With Numbers"}, {"content": ["I recently attended the CAR2010 conference and at one panel posed the following question: \n Why isn’t there more, much more, data graphics in the news? \n By way of example I listed 5 recent news stories that could have been significantly improved if the right data graphic accompanied the story. The goal was to get a sense from news industry insiders what the barriers were to using more data graphics when reporting stories. To pose this question it wasn’t necessary to show the actual data graphics, the mind’s eye version would work just as well (if not better). \n I’d like to bring the discussion started there to this forum and to kick that off the next several articles will present these 5 news stories along with hypothetical data graphics. Again, the focus of this series of articles is to spark discussion about the effectiveness of using data graphics in news stories and to that end a large number of sample stories (even with mocked up graphics) is better than fewer stories with real graphics. Real data may also be distracting as it would spur discussion on the actual story. In general this would be a good thing, and so the graphics may be updated with real data later, but for now to be both speedy and focused we’ll be using mocked up data. \n The recent news stories in question will be: \n \n The change in breast cancer screening guidelines \n The court ruling that autism is not caused by vaccines \n The European study that showed increased heart attacks shortly after the switch to daylight savings time \n The Sunlight Foundation’s story on Reconciliation (this will include a mock graphic as distinct from the recent article ) \n Economists and bankers statement in late 2008 that the economy was “going over a cliff”. \n \n More may be added before this series concludes. \n Tell your friends, tell your neighbors, come join the fun!"], "link": "http://newswithnumbers.com/2010/03/17/5-stories-made-better/", "bloglinks": {}, "links": {"http://www.addtoany.com/": 15, "http://abcnews.go.com/": 1, "http://blog.sunlightfoundation.com/": 1, "http://newswithnumbers.com/": 1, "http://data.nicar.org/": 1, "http://www.cnn.com/": 1, "http://www.sltrib.com/": 1}, "blogtitle": "News With Numbers"}, {"content": ["Datagraphics can be used to inject civility into public debates. Senate Republican leader Mitch McConnell (and others) has been quoted as saying that reconciliation has never been used to pass something like health care before. And people who are  pre-disposed to believe what the right says believe him without checking further. And people pre-disposed to disbelieve what the right says ignore him. And in the middle the debate is stuck in limbo, tempers rising on both sides but no new information is forthcoming. \n Now they are suggesting they might use a device which has never been used the for this kind of major systemic reform. We know it would be — the only thing bipartisan about it would be the opposition to it, because a number of Democrats have said, “Don’t do this. This is not the way to go. ” — Senator McConnell on FoxNews \n Recently the Sunlight Foundation ran an infographic examining the past 20 years of Senate Reconciliation bills. At a glance you can see which bills had bipartsian support and which didn’t, and the list is relatively small (13 bills) so deeper inspection can be had relatively easily. However, what’s not immediately obvious is an indication of what Senator McConnell alleges, namely the “magnitude” of these bills. Most bills seem on their face to be simple budgetary adjustments. The “Balanced Budget Act of 1997″ had wide bipartsian support and a relatively simple title. However the “Jobs and Growth Tax Relief Reconciliation Act of 2001″ had hardly any bipartsian support, perhaps more tax cuts were added in reconciliation than in the original bill? If the graph could be altered to show some sort of significance factor then that would be an infographic! \n This significance factor or magnitude could be quantified by providing some sort of comparison of the changes against the original bill. By way of example, there are well established computerized ways to compare documents and a significance factor could be calculated by comparing the size of these changes. Bills with bigger “change files” could show up with fatter lines in the graphic above. Of course this technique would have some problems.  It could give false positives if there were a lot of words to describe a relatively minor change and it could give false negatives if a massive portion of the original bill was removed (describing a removal is a fairly easy task, essentially “delete lines 1-1000″). But even a flawed mechanism in the hands of knowledgable people can be a useful tool as knowledgable people can quickly weed out the false positives, reinstate the false negatives and focus the viewers’ attention on the issues that matter. \n Such a tool could be useful here if we were looking at hundreds of bills, but we’re only looking at 13. A responsible journalist would have prepared for an interview with Senator McConnell by digging into these 13 other bills and asked McConnell to choose which of them would take 2nd place behind health care for “significant bills passed through reconciliation”. McConnell could then use that as a spring board to describe how much more of a change health care is from that previous “high water mark” or the question could reveal how hollow McConnell’s talking point was. Instead, we, as consumers of news, get neither."], "link": "http://newswithnumbers.com/2010/03/09/abusing-reconciliation/", "bloglinks": {}, "links": {"http://www.foxnews.com/": 1, "http://www.sunlightfoundation.com/": 1, "http://www.addtoany.com/": 15, "http://blog.sunlightfoundation.com/": 1, "http://sunlightfoundation.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "News With Numbers"}, {"content": ["Recently the New York Times ran an infographic on the proposed 2011 Federal Budget.  It’s a nearly perfect use of the treemap capability in data visualization where the size of the boxes is proportional to the amount of spending. If you click on a region it zooms in revealing a bit more information than is visible at the high level. As you mouse over various regions you get even more detail. You can also elect to see only the discretionary spending, though in this view it would be nice if the total budget changed to reflect the sum total discretionary part. It’s even color coded to reflect increases and decreases over the previous year’s budget. \n  \nAs informative as this chart is and as powerful as the treemap technique is, the information content in this graphic is about as much as a tabular listing of the various departments and the budget each of those departments is receiving. Yes, the relative sizes of the boxes allow us to quickly see which departments are receiving the most amount of money, but as a news item I’m left a little cold. There’s not enough context to this graphic to make me care beyond the “tinker with the pretty buttons” stage. \n One way to increase that context would be to add an input box where I could enter my 2010 tax bill. The infographic then could shift the dollar amounts and turn it into how much of my tax dollars are being spent on various programs. Seeing how much I’m paying for interest on the national debt or National Defense may make me wonder if my money really is being spent wisely. \n But while that simple technique provides some context and heightens my interest, it is just as transitory as the original. Shortly after tax season I doubt I’ll care and again I’ll get wrapped up in the headline news cycle of congressmen complaining about various parts of the budget, defecit and debt. But this is our national budget, we should look at it periodically just as we would our household budget. The NYTimes should trot out this graphic every time they run a story on a federal budget item. \n Indeed it could prove useful as an index page into budget related stories. I’ve created a mock-up of what I’m envisioning. Click on the image below to be taken to an interactive version . The idea here is that as you mouse over various budget items you’ll be presented with the latest news article about that budget item. Frequently we’ve heard exchanges where one congressman complains about excessive spending in one area while another congressman points out that the amount of excess in that area is a drop in the bucket compared so the spending in another area. Reporting on those news stories while simultaneously referencing this graphic would be an inspired use of the treemap technique."], "link": "http://newswithnumbers.com/2010/03/03/reviewing-an-nytimes-infographic/", "bloglinks": {}, "links": {"http://newswithnumbers.com/": 2, "http://www.nytimes.com/": 2, "http://en.wikipedia.org/": 1, "http://www.addtoany.com/": 15}, "blogtitle": "News With Numbers"}]