[{"blogurl": "http://ngs-expert.com\n", "blogroll": [], "title": "NGS Expert Blog"}, {"content": ["While I was browsing the internet for news on NGS and cancer sequencing, I came across the YouTube link below.  The famous oncologist Bert Vogelstein gave this amazing talk about genetics of cancer over a year ago. To my opinion he outlines very nicely the concepts of oncological marker discovery and how we could/should make use of the next generation sequencing technology. Although it’s a long talk, it is worth while watching at least the first part of the talk."], "link": "http://ngs-expert.com/2012/10/29/genetics-of-cancer/", "bloglinks": {}, "links": {}, "blogtitle": "NGS Expert Blog"}, {"content": ["At the end of August, Mr. Hosono, the Japanese minister for the environment, announced , that the ministry aims to perform whole genome sequencing (WGS) of people who live around the disabled “Fukushima Daiichi Nuclear Power Station”. He said that the WGS project will not be able to relieve concerns immediately, but it will make an important provision for the future. According to Mr. Hosono the main target group for WGS will be children. \n These genomic analyses face many problems including the aspect of experiments with humans, maintaining confidentiality, discovery of information according to need, and others. This story reminds me once more that NGS technologies start to have social impacts."], "link": "http://ngs-expert.com/2012/10/22/whole-genome-sequencing-of-fukushimas-people/", "bloglinks": {}, "links": {"http://sankei.msn.com/": 1}, "blogtitle": "NGS Expert Blog"}, {"content": ["The markets for DNA sequencing and analysis products are charaterised by rapidly advancing technology and a distinct trend toward consolidation of suppliers. The worldwide market for next generation sequencing platforms is currently estimated by $1.5 Billion (~€1.2 Milliard). The U.S. and Europe exhibit the highest market penetration for next generation sequencing. Oher parts of the world are projected to see higher compound annual growth rates of up to 13%. As next generation DNA sequencing platforms become increasingly affordable, the cost of sequencing a human genome will soon fall below the $1,000 (~€800) price point. \n TriMark predicts that as the costs of acquiring and operating sequencing machines continue to drop, the markets for DNA sequencing will continue to grow in size and scope. Read more in its newly published “ DNA Sequencing and PCR Markets ” report. Find the free executive summary in the sample copy ."], "link": "http://ngs-expert.com/2012/10/15/next-generation-sequencing-platforms-market-to-more-than-double-by-2017/", "bloglinks": {}, "links": {"http://www.trimarkpublications.com/": 2}, "blogtitle": "NGS Expert Blog"}, {"content": ["In our latest poll we asked you about your knowledge and experiences with whole genome mapping. \n As you can see in the pie chart there is no clear answer to that question. But most of you have heard about it and like the technology behind. For all of you who haven’t heard about it I can recommend you our recent blog posts about whole genome mapping using the OpGen technology: \n \n What is optical mapping? \n Creating the perfect genome assembly \n \n For our next survey we would like to know your opinion about comparing different NGS technologies. I look forward to your answers."], "link": "http://ngs-expert.com/2012/10/11/survey-result-have-you-heard-about-whole-genome-mapping/", "bloglinks": {}, "links": {"http://ngs-expert.com/": 2}, "blogtitle": "NGS Expert Blog"}, {"content": ["In 2011, University of Münster researchers reported their sequencing of an Escherichia coli strain behind an outbreak in Germany, showing that real-time sequencing was feasible. Then they characterized a K. pneumoniae strain that infected patients in a Dutch hospital. This information was used to develop a multiplex PCR-based assay for the disease. \n For the K. pneumoniae outbreak at the US National Institutes of Health’s Clinical Center, Julie Segre and her colleagues sequenced isolates from the 18 infected patients using a 454/Roche machine. From their Newbler assembly and subsequent analysis, they found that isolates from patient 1 and patient 2 differed by two SNPs out of the 6 megabase K. pneumoniae genome, indicating they were infected with the same strain. … \n As the cost of sequencing is dropping, major medical centers could soon implement whole genome sequencing to monitor disease exposure of patients. “If the analysis is that you are spending $100,000 to have an organ transplant or go through some very intensive cancer treatment that involves a few nights’ stay in the ICU,” Segre says, “at that point, putting up $500 to sequence an organism that may be affecting another patient in the ICU. … I could imagine in the future that that becomes part of the economic model.” \n Read the whole GenomeWeb article at http://bit.ly/Qu3tRX"], "link": "http://ngs-expert.com/2012/10/05/whole-genome-sequencing-to-track-an-outbreak/", "bloglinks": {}, "links": {"http://bit.ly/": 1}, "blogtitle": "NGS Expert Blog"}, {"content": ["Recently , we have reported on the Studies of the Broad Institute , showing that the PacBio RS system was able to outdo MiSeq sequencing regarding validation of SNP analysis. Now Pacific Biosciences have taken another important step to further improve their product. \n Pacific Biosciences have now launched a new Sample Loading Device for the PacBio RS, called MagBead Station.  As  Michael Hunkapiller, Ph.D. President and Chief Executive Officer of Pacific Biosciences told in their press release , they expect that with the new device, customers will  “be able to generate 10 kilobase-sized libraries using as little as one microgram of sample, a five to 10-fold improvement from where we were just a few months ago”. Also, because the new process is more robust, they expect that sequencing results will have higher overall consistency, allowing to run experiments also on challenging samples. \n First experiences of early-access-customers seem to underline these expections: \n As Patrick Hurban of Expression Analysis told InSequence , the new loading device allowed them to recover sequences also for “difficult” samples: “we’re much more confident on a sample-by-sample basis that we will be able to get good sequence”, he said. Also, they could confirm that the amount of library that needs to be loaded is now significantly lower. The new loading process also seems to favor longer DNA fragments over shorter ones, excluding short contaminating DNA fragments. This results in a greater percentage of long reads in a run. Also, the loading process now seems to work as efficiently for the large insert libraries as it does for the smaller insert libraries. \n With the new loading device, about 50-60 % of the ZMWs are now active after loading. This is a great improvement compared to 30-45 % of active ZMWs before the upgrade. \n When PacBio started on the market, I was impressed by the sophisticated new technology. However, the results of the first projects were rather disappointing. The new loading device now seems to greatly improve the sample loading step. However, the high error rates still remain a challenge, with about 15% for the time being. Pac Bio will need to solve those issues if they want to be successful on the market in the long run. However, it seems that by and by, PacBio is overcoming  its “childhood diseases”."], "link": "http://ngs-expert.com/2012/10/01/further-improvements-of-pacbio-technology/", "bloglinks": {}, "links": {"http://ngs-expert.com/": 1, "http://www.marketwatch.com/": 1, "http://www.genomeweb.com/": 1, "http://www.biomedcentral.com/": 1}, "blogtitle": "NGS Expert Blog"}, {"content": ["Six floors for Next Generation Sequencing in the middle of Manhatten – this is going to be exiting. Listen to the interview from Bio-IT World with Nancy Kelly, founding executive director of the New York Genome Center."], "link": "http://ngs-expert.com/2012/09/27/ngs-comes-to-the-big-apple/", "bloglinks": {}, "links": {}, "blogtitle": "NGS Expert Blog"}, {"content": ["Is sequencing your personal genome a curse or a blessing? A recent radio broadcast from NPR news summarises two scientist’s opinions and their practical experiences with genome sequencing  (listen to the radio broadcast below). \n World renowned scientist James Watson, from the famous Watson & Crick team that discovered the DNA structure, recently sequenced his own genome. His discovery didn’t earn him the next Nobel prize for science, but he found out that he belongs to the elite few people whose body is more sensitive to ß-blockers. Now James Watson finally realized why it was so difficult for him to balance his blood pressure. It definitely paid off for Watson to sequence his own genome since he could significantly reduce his weekly ß -blocker intake. But despite this “health-changing” experience, he forbid his colleagues to reveal any information about his likelihood to develop Alzheimer. He said, “since you cannot cure it why would you like to know about it?” \n The second candidate to share his experience after he personally sequenced his genome is Stanford geneticist Michale Snyder . His genome sequencing revealed that he was at high risk to develop Type 2 diabetes. A few months after his discovery, Synder got the disease that his genome anticipated. Was this a coincidence or fate? For Snyder, knowledge about his genome gave him a head start against the disease.  By completely transforming his diet and participating in various sport activities,  he overcame his Type 2 diabetes. \n From my perspective, both examples show that knowledge about our genetic information can be useful in preventing and treating diseases. It boils down to how much experience exist to reliably interpret the data."], "link": "http://ngs-expert.com/2012/09/21/genomics-a-curse-or-a-blessing/", "bloglinks": {}, "links": {"http://scopeblog.stanford.edu/": 1}, "blogtitle": "NGS Expert Blog"}, {"content": ["BGI announced the acquistion of Complete Genomics this week. According to the press release and the  statement from BGI’s CEO Wang Jun, Ph.D.  one of the reasons for the acquistion was that “Complete has developed a proprietary whole genome sequencing technology … (that) fit well with our research and business requirements …”. It is important to note that although the Complete Genomics technology shows a slower performance than the Illumina technology it appears to be more accurate (Georg Church, Advisor of BGI & CG) . \n But what are the market/industry responses to the new acquisition? \n \n BGI gets “an immediate infrastructure and service offering that will complement the facilities in China” ( Isaac Ro, Goldman Sachs ) \n \n \n “Now BGI gets their US front… And CG is sparred a slow and painful demise…” ( Seqanswers ) \n \n I would really like to read an interview in 6 months from employee’s of both parties to learn who is the actual “winner” of this deal? Is it BGI since they now have access to the US market or Complete Genomics whose questionable financial situation gained a significant boost from the acquistion. Will Complete Genomics still be an independent operating company? We will find out."], "link": "http://ngs-expert.com/2012/09/19/bgi-acquired-complete-genomics/", "bloglinks": {}, "links": {"http://www.genengnews.com/": 1, "http://www.fiercebiotech.com/": 2, "http://seqanswers.com/": 1, "http://www.genomeweb.com/": 1, "http://www.businessweek.com/": 1}, "blogtitle": "NGS Expert Blog"}, {"content": ["Just some days ago we discussed the dynamics in NGS and here we are with some news. Life Technologies Corporation announced that the new software v3.0 for the IonTorrent PGM consistently delivers 99.9% consensus accuracy for both short and long homopolymer regions and increases the frequency of correctly called insertions, deletions and homopolymer sequences by two-fold ( Press Release LIFE ). \n In addition to the read accuracy also the read length increased with the launch of the new kit to 400 bp. The aim of the company is to improve their system further for microbial applications ( PR LIFE ). \n But not only improvements in bacterial identification is on the priority list for LIFE’s RnD team but also more innovations in the area of diagnostics. A new AmpliSeq(TM) sample ID panel will increase the confidence during data analysis and a new kit is soon to be launched ( PR LIFE ). \n I think from a customer’s perspective it is a good idea to further improve the technology in several areas since there could be some cross-linking innovations. But it also bears the risk that some competitors, focussing on a specific application, will adapt their system more quickly. But of course these are only speculations. So what is your opinion?"], "link": "http://ngs-expert.com/2012/09/13/iontorrent-upgrade/", "bloglinks": {}, "links": {"http://ngs-expert.com/": 1, "http://ir.lifetechnologies.com/": 3}, "blogtitle": "NGS Expert Blog"}]