[{"blogurl": "http://nicolasrapp.com\n", "blogroll": [], "title": "nicolasrapp.com"}, {"content": ["CLICK FOR FULL GRAPHIC \n LinkedIn recently asked more than 7,000 members of its professional network in 18 countries about which office supplies they see going the way of the dodo in the next five years. Topping the list was the tape recorder. Here are seven other habits and tools destined for extinction. In the latest issue of Fortune."], "link": "http://nicolasrapp.com/?p=1263&utm_source=rss&utm_medium=rss&utm_campaign=the-disappearing-desktop", "bloglinks": {}, "links": {"http://nicolasrapp.com/": 1}, "blogtitle": "nicolasrapp.com"}, {"content": ["CLICK TO SEE FULL GRAPHIC \n If you’re the world’s largest company—with nearly $600 billion in market value—getting bigger is a tough challenge. But if Apple can learn how to charm the world’s largest population, the possibilities are limitless. \n Apple’s presence is stronger in the u.s. than china—for now. In the latest issue of Fortune Magazine."], "link": "http://nicolasrapp.com/?p=1254&utm_source=rss&utm_medium=rss&utm_campaign=can-apple-win-over-china", "bloglinks": {}, "links": {"http://nicolasrapp.com/": 1}, "blogtitle": "nicolasrapp.com"}, {"content": ["CLICK TO SEE FULL PAGE \n How long is too long (or too short) for a CEO to lead a company? A survey of CEO departures  from 100 public companies locates the C-suite sweet spot."], "link": "http://nicolasrapp.com/?p=1245&utm_source=rss&utm_medium=rss&utm_campaign=tenure-at-the-top", "bloglinks": {}, "links": {"http://nicolasrapp.com/": 1}, "blogtitle": "nicolasrapp.com"}, {"content": ["CLICK FOR LARGER VERSION \n Fair pay and employment for women are not feminist issues; they’re economic ones. Data from a recent World Economic Forum report displays just how essential equal wages can be. A nation’s competitiveness is determined by its talent pool; ignore half the pool and the economy suffers. In the latest issue of Fortune."], "link": "http://nicolasrapp.com/?p=1241&utm_source=rss&utm_medium=rss&utm_campaign=a-look-at-the-global-gender-pay-gap", "bloglinks": {}, "links": {"http://nicolasrapp.com/": 1}, "blogtitle": "nicolasrapp.com"}, {"content": ["CLICK FOR LARGER VERSION \n In 2007 the 1% took 23.5% of the national wealth, the highest level since 1928. (The wealth gap has narrowed a bit since the financial crisis.) The past few decades have also been good  to the top 10% of earners."], "link": "http://nicolasrapp.com/?p=1237&utm_source=rss&utm_medium=rss&utm_campaign=the-rich-are-getting-richer", "bloglinks": {}, "links": {"http://nicolasrapp.com/": 1}, "blogtitle": "nicolasrapp.com"}, {"content": ["CLICK TO SEE LARGER VERSION \n In a good year the U.S. corn crop comes in at 13 billion bushels, accounts for 55% of the world’s corn exports, and is worth about $60 billion. But 2012 is not a good year. As drought ravages the farm belt, production is forecast at 10.8 billion bushels, and corn has hit a historic high of $8.29 a bushel. A look at the industries that suffer from corn’s high cost. In the latest issue of Fortune Magazine."], "link": "http://nicolasrapp.com/?p=1232&utm_source=rss&utm_medium=rss&utm_campaign=the-corn-complex", "bloglinks": {}, "links": {"http://nicolasrapp.com/": 1}, "blogtitle": "nicolasrapp.com"}, {"content": ["CLICK FOR LARGER VERSION \n Nearly two dozen luminaries from the worlds of finance, government, and academe make up the governor’s recently assembled Economic Policy Steering Group. In the latest issue of Fortune Magazine."], "link": "http://nicolasrapp.com/?p=1227&utm_source=rss&utm_medium=rss&utm_campaign=mitt-romneys-all-star-team-of-advisers", "bloglinks": {}, "links": {"http://nicolasrapp.com/": 1}, "blogtitle": "nicolasrapp.com"}, {"content": ["CLICK TO ENLARGE \n Companies will soon be spending upwards of $1.3 trillion annually to equip employees with mobile devices and apps. By 2016 an estimated 350 million smartphones will be brought to the office; overall tablet shipments are expected to outpace those of notebooks that year as well."], "link": "http://nicolasrapp.com/?p=1220&utm_source=rss&utm_medium=rss&utm_campaign=tablets-invade-corporate-america", "bloglinks": {}, "links": {"http://nicolasrapp.com/": 1}, "blogtitle": "nicolasrapp.com"}, {"content": ["CLICK TO SEE WORLD MAP OF GLOBAL 500 COMPANIES \n Despite financial turmoil in Europe and disasters in Japan, the world’s largest corporations had record profits and revenue in 2011. Where on earth will the growth come from next? \nThe fortune global 500 used to be a scorecard by which Western companies measured their dominance. Today the list is more diverse than ever. Our map shows the headquarters cities of the list companies, layered over data showing each country’s gains in gross national income from 2000 to 2010. This suggests that the Global 500 isn’t just a way to measure corporate muscle—in some cases it is an indicator of prosperity too."], "link": "http://nicolasrapp.com/?p=1209&utm_source=rss&utm_medium=rss&utm_campaign=world-largest-corporations-mapped", "bloglinks": {}, "links": {"http://nicolasrapp.com/": 1}, "blogtitle": "nicolasrapp.com"}, {"content": ["Click to see internet map of the world \n If the internet is a global phenomenon, it’s because there are fiber-optic cables underneath the ocean. Light goes in on one shore and comes out the other, making these tubes the fundamental conduit of information throughout the global village. To make the light travel enormous distances, thousands of volts of electricity are sent through the cable’s copper sleeve to power repeaters, each the size and roughly the shape of a 600-pound bluefin tuna.Once a cable reaches a coast, it enters a building known as a “landing station” that receives and transmits the flashes of light sent across the water. The fiber-optic lines then connect to key hubs, known as “Internet exchange points,” which, for the most part, follow geography and population. \n  Click to enlarge \n The majority of transatlantic undersea cables land in downtown Manhattan where the result has been the creation of a parallel Wall Street geography, based not on the location of bustling trading floors but on proximity to the darkened buildings that house today’s automated trading platforms. The surrounding space is at a premium, as companies strive to literally shorten the wire that connects them to the hubs. \n In the latest issue of Fortune Magazine, with Andrew Blum’s text. Many thanks to Dave Drazen from GeoTel LLC for providing the data sets. \n  Click to enlarge"], "link": "http://nicolasrapp.com/?p=1180&utm_source=rss&utm_medium=rss&utm_campaign=mapping-the-internet", "bloglinks": {}, "links": {"http://nicolasrapp.com/": 4}, "blogtitle": "nicolasrapp.com"}]