[{"blogurl": "http://nowsourcing.com\n", "blogroll": [], "title": "NowSourcing.Com"}, {"content": ["Courtesy of Bestmastersinpsychology.com"], "link": "http://nowsourcing.com/2012/10/31/facebook-psychology-is-addiction-affecting-our-minds/", "bloglinks": {}, "links": {"http://www.bestmastersinpsychology.com": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["This week we start off with technology, more specifically digital signage. You typically see digital signage in shopping malls and fast food restaurants, however college campuses are starting to use it as well. Digital signage is a great way to convey information quickly and in an eye catching manner. This infographic highlights how colleges are integrating digital signage into their campuses. \n Next up, we take a look at the logistics of voting. Most of us think of voting as a simple task, you go to your designated voting place, cast your vote and you’re done. However, there is more that goes into election day than you see. This infographic takes you behind the scenes of election day and what really goes on after the last vote has been cast. \n Then we look at a guide to patient loyalty. We all have to go to the Doctor or hospital from time to time, and yes, it is a usually an unsettling experience. However, sometimes the worst part can be the billing process. Statistics show that patients that were satisfied with the billing process are twice as likely to return to that hospital than patients who were less than satisfied. So hospitals need to make sure their billing department is taking care of their patients as best as possible or their patients might not come back or refer new patients. This infographic highlights the importance of patient loyalty in growing your healthcare business. \n Next we will look at counseling careers. If you are considering a career in counseling then you know there are multiple fields that you can work in, it all really depends on the type of people you want to help, as well as work environment, job outlook and salary. This infographic highlights the four main fields of counseling. \n Lastly, we get to party. Okay, not really. We are going to look at how to party. You think you’ve got it down pat but you could be wrong. This infographic will tell you all you need to know about how to party the right way. \n 1 – The Big Screen on Campus \n  \n Digital Signage Big Screen on Campus [Infographic] \nCompliments of Digital Signage Today \n 2 – The Logistics of Voting \n  \nCourtesy of Click Software \n 3 – A Guide to Patient Loyalty \n  \nCourtesy of: Connance \n 4 – Which Counseling Career Path if Best for You? \n  \nImage compliments of Best Masters in Counseling \n 5 – How to Party \n  \nCourtesy of bestcollegesonline.org"], "link": "http://nowsourcing.com/2012/10/25/this-week-in-infographics-lets-vote-then-party/", "bloglinks": {}, "links": {"http://info.connance.com/": 2, "http://www.clicksoftware.com": 1, "http://www.digitalsignagetoday.com": 1, "http://www.bestmastersincounseling.com/": 1, "http://nowsourcing.com/blog": 1, "http://www.bestcollegesonline.org/": 2, "http://www.digitalsignagetoday.com/blog": 2, "http://www.bestmastersincounseling.com": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of WordStream"], "link": "http://nowsourcing.com/2012/10/25/24-hours-in-the-google-economy/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1, "http://www.wordstream.com/": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["I’m sure you all know about Mildred, we’ve talked about her before. She is our receptionist and her name is actually Louise, but we only recently learned that one year ago and had already gotten used to calling her Mildred. Our building is advertised to have a “friendly greeter” (this point was later removed) just to screw with the minds of visitors. She is, in fact,  not friendly and extremely judgmental. She sits in her reception area guarding the three elevators that are mirrored, so even when your back is to her, you can still see her frowning at you between cryptoquotes. And don’t even think about asking where a specific office is, you can just check the chart for yourself,   it’s *point* right there. \n Seriously, we don’t know what her problem is."], "link": "http://nowsourcing.com/2012/10/24/oh-mildred-comic/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of DigitalSignageToday.com"], "link": "http://nowsourcing.com/2012/10/23/big-screen-on-campus/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1, "http://www.digitalsignagetoday.com": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of Click Software"], "link": "http://nowsourcing.com/2012/10/23/the-logistics-of-voting/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1, "http://www.clicksoftware.com": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of Connance.com"], "link": "http://nowsourcing.com/2012/10/23/a-guide-to-patience-loyalty/", "bloglinks": {}, "links": {"http://info.connance.com/": 1, "http://nowsourcing.com/blog": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of bestmastersincounseling.com"], "link": "http://nowsourcing.com/2012/10/22/which-counseling-career-path-is-best-for-you/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1, "http://www.bestmastersincounseling.com": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["This week we start off with politics once again. I know, I know, but with the election just around the corner it only makes sense. This first infographic is about cybersecurity and how both candidates, Obama and Romney, feel about it. \n Next up, have you ever had a midlife crisis or witness someone else having one? They are pretty bad, but sometimes they are warranted. This infographic highlights how your career may be the culprit and how changing careers or getting a master’s degree might be the answer to your midlife crisis. \n Then, we take a little journey called the social discovery. Social discovery is about creating serendipitous experiences, aided by science, to help us find people, products, and places to enjoy. \n Next, we jump back into politics, but focus on green energy. This infographic highlights two types of green energy; wind and solar, as well as the political views on both. \n Last, but not least, we look at an infographic that shows you how to know when to go to the ER. I know this seems like something everyone should know, but believe it or not, many people don’t know what kind of ailment or injury really require emergency care. If you are one of those people, this infographic will help you greatly. \n 1 – Obama vs Romney on Cybersecurity \n  \n Infographic by Veracode Application Security \n 2 – Midlife Crisis & Worst College Degrees \n  \n Courtesy of: Graduate Degree Program \n 3 – Social Discovery \n  \n Created by Glimpse – Social Discovery Conference \n 4 – Green Energy and Politics in 2012 \n  \nSource: Green Energy and Politics in 2012 \n 5 – How to Know When to Go to the ER \n  \nSource: Top Nursing Programs"], "link": "http://nowsourcing.com/2012/10/18/this-week-in-infographics-more-politics-and-some-other-stuff/", "bloglinks": {}, "links": {"http://glimpseconf.com/": 1, "http://www.veracode.com/blog": 1, "http://glimpseconf.com": 1, "http://www.veracode.com/": 1, "http://graduatedegreeprogram.net/": 1, "http://www.top-nursing-programs.com/": 2, "http://www.greencareers.biz/": 2, "http://graduatedegreeprogram.net": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of graduatedegreeprogram.net"], "link": "http://nowsourcing.com/2012/10/18/midlife-crisis-and-worst-college-degrees/", "bloglinks": {}, "links": {"http://graduatedegreeprogram.net/": 1, "http://nowsourcing.com/blog": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of Veracode"], "link": "http://nowsourcing.com/2012/10/17/obama-vs-romney-on-cybersecurity/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1, "http://www.veracode.com/blog": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["This week we start off with politics. Now, now, don’t stop reading just yet. This first infographic compares how Obama and Romney financed their education. With the 2012 Presidential election just weeks away, everyone is trying to learn as much as they can about both candidates, and this infographic will give you some insight into where they both went to school as well as how they paid for their education. \n Next up, we look at another comparative infographic. This one compares how social Android and iOS users are. If you own a smartphone, chances are you are privy to the popular social apps, but believe it or not, depending on your operating system, you might be part of a more social group. \n Then we take a look at an infographic that has a more serious tone. There is nothing shameful if you are suffering from a form of depression, in fact many people are, with close to 20 million being diagnosed on a yearly basis in the United States alone. Your mental health needs to be taken seriously and learning what you can about  depression facts, symptoms and myths  will help you understand that it can hit you at any age, no matter the gender or race, depression affects us all whether it is directly or indirectly. In this infographic you will see what you can do to help yourself and those around you who are suffering from depression. \n Lastly, we jump back into politics (I know, don’t shoot me). This last infographic focuses more on religion in politics, particularly Mormonism, but also the faiths of other US Presidents. \n 1 – The Cost to Educate a President \n  \n By Degreejungle.com The Cost to Educate a President \n 2 – Who is More Social? Android or iOS Users? \n  \nCourtesy of StartApp \n 3 – Getting an In-Depth Look at Depression \n  \n Source: MilitaryMentalHealth.org \n 4 – Mormonism and the Faiths of US Presidents \n  \nSource: Online Christian Colleges"], "link": "http://nowsourcing.com/2012/10/11/this-week-in-infographics-depression-and-politics/", "bloglinks": {}, "links": {"http://www.militarymentalhealth.org/": 3, "http://www.onlinechristiancolleges.com": 1, "http://www.degreejungle.com/": 2, "http://www.startapp.com/": 2, "http://www.onlinechristiancolleges.com/": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Presented by Startapp"], "link": "http://nowsourcing.com/2012/10/10/who-is-more-social-android-of-ios/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1, "http://www.Startapp.com": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of Degree Jungle"], "link": "http://nowsourcing.com/2012/10/10/the-cost-to-educate-a-president/", "bloglinks": {}, "links": {"http://www.degreejungle.com": 1, "http://nowsourcing.com/blog": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["This week we start off by taking a look at nine musicians who lost it all. When you think of celebrities you usually think of money, lots of it. However, just like us normal folk, celebs aren’t always smart with their money. And sometimes an ex-wife or not paying taxes can really take a chunk out of their hard earned millions. This infographic highlights the bankruptcy stories of nine famous musicians. \n Next up, we take a look at a comparison of a green lifestyle and a typical one. It seems like everyone is wanting to go “green” these days, but many are skeptical because of the cost. However, it turns out that going green is not as expensive as everyone thinks, and is actually cheaper than living a typical lifestyle. \n Lastly, we venture into the cloud. Cloud applications are becoming more and more popular, especially among businesses. They are convenient and a great way to store data without worrying about losing it, but before you go buying a cloud app, it’s important to know what you are getting into. This infographic is a buyers guide to cloud applications, and can help you to understand what aspects you need to pay attention to when purchasing a cloud app for your business. \n 1 – From Riches to Rags \n  \n Courtesy of paydayloan.co.uk \n 2 – Is it Green to be Green? \n  \n Courtesy of paydayloan.co.uk \n 3 – A Buyers Guide to Cloud Apps \n  \n Courtesy of Veracode"], "link": "http://nowsourcing.com/2012/10/04/this-week-in-infographics-losing-green-and-saving-green/", "bloglinks": {}, "links": {"http://www.veracode.com": 1, "http://nowsourcing.com/blog": 3, "http://www.co.uk": 2}, "blogtitle": "NowSourcing.Com"}, {"content": ["It’s a common misconception that octopuses (pi?) are more productive than their two armed cousins to the north, humans. Even since colonial times, blacksmiths have held the octopus in the highest esteem as effective workers because of their multitasking abilities. However as time went on, scientists found that there was no direct correlation between productivity and eightleggedness, and studies have shown that the octopus is extremely lazy, hence why none are seen in the workplace anymore."], "link": "http://nowsourcing.com/2012/10/04/decipus-comic/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of Veracode"], "link": "http://nowsourcing.com/2012/10/03/a-buyers-guide-to-cloud-apps/", "bloglinks": {}, "links": {"http://www.veracode.com": 1, "http://nowsourcing.com/blog": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of paydayloan.co.uk"], "link": "http://nowsourcing.com/2012/10/03/from-riches-to-rags/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1, "http://www.co.uk": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Occasionally the office with splurge on some of that expensive fair trade coffee for the simple reason that it is delicious. It is coffee in its finest form. However there is one poor sucker who didn’t get the memo and makes the crap coffee anyway, tricking others into thinking that this is the only coffee available today. So when someone shows up with the good stuff, us suckers are stuck with a mediocre cup of coffee. now, we could always dump it out and start over, but really, that is beside the point."], "link": "http://nowsourcing.com/2012/09/28/fancy-coffee-comic/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1}, "blogtitle": "NowSourcing.Com"}, {"content": ["Courtesy of Paydayloan.co.uk"], "link": "http://nowsourcing.com/2012/09/28/is-it-green-to-be-green/", "bloglinks": {}, "links": {"http://nowsourcing.com/blog": 1, "http://www.co.uk": 1}, "blogtitle": "NowSourcing.Com"}]