[{"blogurl": "http://junkcharts.typepad.com/numbersruleyourworld\n", "blogroll": ["http://thestatsblog.wordpress.com"], "title": "Numbers Rule Your World"}, {"content": ["Love this xkcd comic ( link ). Would have been even better cut to the final third. Great food for thought for predictive modelers. \n \n \n A few years ago, some economists wanted to change their last name because economists with last names beginning close to the front of the alphabet have greater chance of winning the Nobel (according to their research). ( link to PDF )"], "link": "http://junkcharts.typepad.com/numbersruleyourworld/2012/10/predictive-modeling.html", "bloglinks": {}, "links": {"http://junkcharts.typepad.com/": 1, "http://www.xkcd.com/": 1, "http://www.google.com/": 1}, "blogtitle": "Numbers Rule Your World"}, {"content": ["Readers of Chapter 4 of Numbers Rule Your World would not be surprised about the fall of Lance Armstrong. The big theme of the chapter is that any screening tests has to balance between false positives and false negatives. The anti-doping agencies are so concerned about not falsely accusing anyone that they leave a gigantic hole for dopers to walk through. Strings of negative tests, therefore, do not prove one innocent; however, even a single positive test could be quite telling. \n While we think about Armstrong's plight, let's not forget about this fact: every one of those who now confessed  passed hundreds of tests in their careers, just like Armstrong did. In fact, fallen stars like Tyler Hamilton and Floyd Landis also passed lots of tests before they got caught. In effect, dopers face a lottery with high odds of winning and low odds of losing. \n Sadly, the media covering this issue continues to ignore false negative errors in testing. I have yet to find one article covering the current situation that acknowledges that dopers pass tests all the time! This over-confidence in scientific models is a disease, not just in drug testing. \n *** \n In the book, I also discussed why we need a lie detector test in athletics. So, we arrive now at a day when a good handful of big-name cyclists decided to shed their lies and open up to us. \n *** \n Another myth shattered by this scandal is the idea that stars don't need to cheat. It is most likely the opposite. At the very top of any sport, especially a sport that pays, the difference between the number 1 and the number 2 is vast in terms of financial reward but infinitestimal in terms of physics. Every little advantage counts. Placebos count. \n It's hard to imagine why someone who has no chance of winning anything would take drugs that might kill them. So, when they say everyone was cheating, I wonder if they meant everyone who was competitive was cheating. \n *** \n Here're my previous articles calling for \"more false positives\" in drug testing ( link , link ). \n There are many stories because so many cyclists are named. Some are already selling their stories. Here are some links: \n New York Times on the big report ( link ) \n Tyler Hamilton already has a book ( link ) \n George Hincapie testified ( link ) \n Levi Leipheimer statement ( link ) \n Glossary of secret codewords ( link ) \n Former Irish massage therapist told her story ( link ) \n Former coach continues to deny, deny ( link ) \n Tour de France organizers silent. Imagine not having anything to say about a 7-time champion. ( link ) \n Also silent are his sponsors. Nike? ( link )"], "link": "http://junkcharts.typepad.com/numbersruleyourworld/2012/10/lance-armstrong-beat-statistical-odds-but-its-not-enough.html", "bloglinks": {}, "links": {"http://www.nydailynews.com/": 1, "http://www.csmonitor.com/": 1, "http://www.irishcentral.com/": 1, "http://www.com.au/": 1, "http://online.wsj.com/": 1, "http://www.businessweek.com/": 1, "http://keepingscore.time.com/": 1, "http://www.latimes.com/": 1, "http://junkcharts.typepad.com/": 4, "http://www.nytimes.com/": 1}, "blogtitle": "Numbers Rule Your World"}, {"content": ["This Wall Street Journal article about predictive modeling in the workplace is well worth reading. Your reaction may vary from excitement to stomach churning. ( link ) \n As with most reporting on analytics, the author never addresses the issue of model errors . For example, this article started out with: \n When looking for workers to staff its call centers, Xerox Corp. used to pay lots of attention to applicants who had done the job before.\n Then, a computer program told the printer and outsourcing company that \nexperience doesn't matter. \n The fun may be squeezed out if we want a more balanced story. I get that. But surely, someone should ask if this \"computer program\" makes no errors. Because if you read this style of reporting, you would think every prediction is correct. \n The reporter does get into the creepiness and the legal murkiness of using such models but those discussions hover over the unspoken assumption that the predictions issued by these computer algorithms using \"big data\" are infallible. It's one thing if the model excludes, say, women from being hired because well, every woman fails in that particular job; it's another thing if the model excludes women erroneously! (I can already see the \"I took steroids but look, it didn't help.\" excuse.) Later in the article, we are told that a startup company has created the model of \"an ideal call-center worker\". The fact that there could be an \"ideal\" reflects a level of over-confidence in models that bothers on insanity. (And I'm someone who builds models for a living.) \n As you read the article, bear these points in mind: \n \n In Chapter 2 of Numbers Rule Your World , I talk about models of correlations versus models of causation. In my view, when people's livelihood is at stake, a correlational model is not good enough. All these models described in the article are correlation based. The factors they use are things like commuting distance, and social networks. There is a serious danger of \" causation creep \" here.  \n An analogy: if you look at crime statistics, it is certainly true that African Americans are more likely to be criminals. If you build a crime prediction model, race will be a strong predictor even if it's not the only predictor. A lot of us are uncomfortable with this kind of racial profiling. \n A technical note: this type of models suffers from \"rejection inference\" (terminology from the credit scoring world). I didn't find space to talk about rejection inference in Chapter 2 but I might as well say something here. The output of such predictive models is used to make a hiring decision. The candidate can either be hired or rejected. If the candidate is hired, the company can track his or her performance and make a determination as to whether, ex-post, the hiring decision was good or bad. If the candidate is rejected, the company has no way of knowing whether the rejection was just or not. So when any company collects data to build a predictive hiring model, the dataset is already biased, as it does not contain candidates who would have been rejected."], "link": "http://junkcharts.typepad.com/numbersruleyourworld/2012/10/predictive-hiring-models-and-chapter-2.html", "bloglinks": {}, "links": {"http://junkcharts.typepad.com/": 3, "http://online.wsj.com/": 1}, "blogtitle": "Numbers Rule Your World"}, {"content": ["BBC News, reporting on the results of a study of Vitamin D supplements, inserted a curious sentence: \"The study, carried out in New Zealand, which gets more sunshine annually\n than the UK , found the vitamin D supplements increased blood levels of \nthe vitamin. But this had no significant impact on the rate or severity of colds.\" (my italics) \n This is yet another study that shows supplements/drugs that succeed in making some metric look better but fail to deliver any true health benefits. \n The New Zealand sun is the alibi used by advocates of Vitamin D supplements to discredit this randomized trial. They argue that because the sun delivers Vitamin D, someone who lives under the sun would be less likely to be deficient in Vitamin D. And the supplements only help those who are deficient. \n Unfortuately, this elaborate story has no collaborative evidence. Instead, we have an expert who said this is so (\"a leading UK cold expert said vitamin D is useful\"), bringing his own anecdote (\"He said he takes [vitamin D supplement] every year as a precaution\"). \n Test result from randomized controlled experiment versus expert opinion based on anecdotes. That's not a fair match, and yet the BBC seems to prefer the latter, and thus serves us the NZ Sun alibi."], "link": "http://junkcharts.typepad.com/numbersruleyourworld/2012/10/the-new-zealand-sun-is-to-blame-for-unwelcome-test-result.html", "bloglinks": {}, "links": {"http://www.co.uk/": 1}, "blogtitle": "Numbers Rule Your World"}]