[{"blogurl": "http://radar.oreilly.com\n", "blogroll": [], "title": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Since the advent of Twitter I’ve often found myself laughing at funerals, crying at parties, and generally failing time and again to say the right thing. Twitter is so immediate, so of the moment, but it connects people across the globe who may be experiencing very different moments. \n This first struck me during the Arab Spring. Maybe I was just finishing a nice dinner in Philadelphia and was lingering over a drink, tweeting the usual crap, while a world away Egyptians (and later Libyans and Syrians) were out by the thousands throwing themselves into mortal danger. Of course, they weren’t paying attention to my banalities while they filled Tahir Square and defended Aleppo, but I still floated by. And in any case, my tweet stream was full of their moment, raging past me. Once I noticed the dichotomy, my political witticisms and flippant comments on the news of the day tossed out between bites of my dessert seemed ridiculous as they bobbed downstream amidst all that anger, action, and danger. It just felt so, … inappropriate. I couldn’t help but go silent. A more primitive sense of decorum, evolved while our voices shared common place and time, welled up and shut me up. \n I thought of this again the other night but in reverse. I was very fortunate and came through Sandy basically unscathed. But in the late afternoon of the storm I was out in the wind and rain for about an hour and a half trying to stop a water leak that was flowing through my foundation into the basement, while the whole time I had one eye on a 100-foot pine tree that was swaying threateningly over me. When I came back in, soaked through, and with my mind 100% on Sandy and my immediate safety, I checked Twitter out of habit. Naturally, the first tweet I saw was from Darrell Issa, snug in California, tweeting about the latest non-hurricane-related thing he wanted us to rage about. Dammit Darrell, we’re in the middle of a hurricane, we’ll get pissed about Benghazi next week ok? \n During Sandy most of us east coasters had just one thing on our minds while our west coast friends’ normal lives continued unabated. We were tweeting about threatening trees, power outages, and 14th street fire balls while they were tweeting about Windows 8, a Yammer user conference, and whatnot. Lots of people on both coasts, who didn’t feel immediately threatened, were making light and telling jokes. In response I saw more than a few tweets along the lines of “not really appreciating the jokes while I watch the water rise.” \n When I went about my business during the Arab Spring I used to feel weird, like they might read my tweets and think “Don’t you know we’re dying out here? There you are just living your life. What’s wrong with you?” The other night I had to remind myself that 2,500 miles and the continental divide separated my moment from those of my friends in California. Two streams, naturally bifurcated by geography and current experience, flowed together to mix awkwardly on my phone. \n And it continues now. For many of us even here in the East, Sandy is basically over. We are fortunate. We have power, food in the refrigerator, and a place to brew our coffee. But all over New Jersey and New York this remains far from true . The storm will be millions of people’s primary context for weeks to come. I can’t help but wonder what it must be like to risk a bit of carefully hoarded smart phone battery, while separated from the flood-ravaged street by flight after flight of dark staircase, to take a quick glance at Twitter only to see “OMFG, will Disney put mouse ears on Darth Vader?” That’s #dissonance. \n In the immediacy of the moment, this isn’t context collapse, where we self-consciously present ourselves to the context multi-verse in some subconsciously bland and universally appropriate way. Nope, this is a massive context collision because Twitter is so here and now. Here we are just jotting down our immediate thoughts, cozy in our moment, and firing them off to ricochet around everyone else’s. \n And what else should we expect? I saw a tweet the other day admonishing all of us for not having paid attention to Sandy when she was still ravaging the Caribbean on her way here. I wasn’t there. It wasn’t my experience. I’m not sure what to do with that. \n I think one of the things that made things particularly jarring during Sandy is that usually my tweet stream is the exposed consciousness of a single tribe. Left coast or right, the technologists I follow are approximately alike on both coasts. Conversations coalesce around similar memes and you’d have a hard time pulling an individual’s geography out of their topic and focus. But not today, and certainly not in the last two days. Our lives will be filled with very different experiences for a while. I’m at a funeral, you’re at a party, and we’re talking on the phone. \n In any case, don’t read this as a scold. It’s not. I’m just reflecting on my own disquiet. My sense of social norms developed in a face-to-face world and I can’t help but feel an unease, an idea that I’m behaving inappropriately, when my tweets are out of synch with the mass of experience that is flowing past me."], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/Kj9RDxBy2UY/sorry-i-was-laughing-during-your-funeral.html", "bloglinks": {}, "links": {"http://gothamist.com/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Turing Complete User — General Purpose Users can write an article in their e-mail client, layout their business card in Excel and shave in front of a web cam. They can also find a way to publish photos online without flickr, tweet without twitter, like without facebook, make a black frame around pictures without instagram, remove a black frame from an instagram picture and even wake up at 7:00 without a “wake up at 7:00” app. [... They are] users who have the ability to achieve their goals regardless of the primary purpose of an application or device. (via BoingBoing ) \n Bootstrap Live Editor — a WYSIWYG HTML5 Editor built for Bootstrap. It offers a nice and elegant way to edit and beautify html content with Bootstrap-ready UI elements. I love how Bootstrap has become this framework for simpler website creation. I’m just disappointed they’re all startups chasing $ instead of being open source infrastructure. \n DCMA Exemption Recommended for Remix — recommended expanding the noncommercial remix exemption to cover both DVDs and online services. The reference to “motion pictures” covers “movies, television shows, commercials, news, DVD extras, etc.” \n New Tool Gives Structural Strength to 3-D Printed Works (Science Daily) — Findings were detailed in a paper presented during the SIGGRAPH 2012 conference in August. Former Purdue doctoral student Ondrej Stava created the software application, which automatically strengthens objects either by increasing the thickness of key structural elements or by adding struts. The tool also uses a third option, reducing the stress on structural elements by hollowing out overweight elements. (via BoingBoing )"], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/tCUeXVIalGg/four-short-links-31-october-2012.html", "bloglinks": {}, "links": {"https://wrapbootstrap.com/": 1, "http://boingboing.net/": 2, "http://www.sciencedaily.com/": 1, "http://tushnet.com.au/": 1, "http://contemporary-home-computing.org/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Starting at around 8:36 PM ET last night, as Hurricane Sandy began to flood the streets of lower Manhattan, many New Yorkers began to receive an unexpected message: a text alert on their mobile phones that strongly urged them to seek shelter. It showed up on iPhones: \n This Emergency Alert just popped up on my phone. Ten seconds later, the TV went out. Here we go. #sandy #ny1sandy twitter.com/mbchp/status/2… \n — Mike Beauchamp (@mbchp) October 30, 2012 \n …and upon Android devices: \n Emergency alert on my phone. instagr.am/p/RYvlmJxJec/ \n — Heidi N. Moore (@moorehn) October 30, 2012 \n While the message was clear enough, the way that these messages ended up on the screens may not have been clear to recipients or observers . And still other New Yorkers were left wondering why emergency alerts weren’t on their phones. \n Here’s the explanation: the emergency alerts that went out last night came from New York’s Personal Localized Alerting Network, the “ PLAN ” the Big Apple launched in late 2011. \n NYC chief digital officer Rachel Haot confirmed that the messages New Yorkers received last night were the result of a public-private partnership between the Federal Communications Commission , the Federal Emergency Management Agency , the New York City Office of Emergency Management (OEM), the CTIA and wireless carriers. \n While the alerts may look quite similar to text messages, the messages themselves run in parallel, enabling them to get through txt traffic congestion. NYC’s PLAN is the local version of the Commercial Mobile Alert System (CMAS) that has been rolling out nation-wide over the last year. \n “This new technology could make a tremendous difference during disasters like the recent tornadoes in Alabama where minutes – or even seconds – of extra warning could make the difference between life and death,” said FCC chairman Julius Genachowski, speaking last May in New York City. “And we saw the difference alerting systems can make in Japan, where they have an earthquake early warning system that issued alerts that saved lives.” \n NYC was the first city to have it up and running, last December, and less than a year later, the alerts showed up where and when they mattered. \n \n The first such message I saw shared by a New Yorker actually came on October 28th, when the chief digital officer of the Columbia Journalism School, Sree Sreenivasan, tweeted about receiving the alert: \n [photo] Nice to get alert from NYC.gov about evacuation (also nice it’s not about our area). #sandy twitter.com/sree/status/26… \n — Sree Sreenivasan (@sree) October 28, 2012 \n He tweeted out the second alert he received, on the night of the 29th, as well: \n [photo] COOL TECH: Loud alarm and screen alert about #sandy making landfall in NYC. (cc @ digiphile ) twitter.com/sree/status/26… \n — Sree Sreenivasan (@sree) October 30, 2012 \n These PLAN alerts go out to everyone in a targeted geographic area with enabled mobile devices, enabling emergency management officials at the state and local level to get an alert to the right people at the right time. And in an emergency like a hurricane, earthquake or fire, connecting affected residents to critical information at the right time and place are essential. \n While the government texting him gave national security writer Marc Ambinder some qualms about privacy, the way the data is handled looks much less disconcerting than, say, needing to opt-out of sharing location data or wireless wiretapping . \n PLAN alerts are free and automatic, unlike opt-in messages from Notify NYC or signing up for email alerts from OEM . \n Not all New Yorkers received an emergency alert during Sandy because not all mobile devices have the necessary hardware installed or have updated relevant software. In May 2011, new iPhones and Android devices already had the chip. (Most older phones, not so much.) \n These alerts don’t go out for minor issues, either: the system is only used by authorized state, local or national officials during public safety emergencies. They send the alert to CMAS, it’s authenticated, and then the system pushes it out to all enabled devices in a geographic area. \n Emergency alert message on my phone: “Take shelter now!” #eastvillage #sandy instagr.am/p/RYza7_gzGZ/ \n — Ola Forsstrom-Olsson (@olaforsstrom) October 30, 2012 \n Consumers receive only three types of messages: alerts issued by the President, Amber Alerts , and alerts involving “imminent threats to safety or life.” The last category covers the ones that went out about Hurricane Sandy in NYC last night. \n According to the FCC, participating mobile carriers can allow their subscribers to block all but Presidential alerts, although it may be a little complicated to navigate a website or call center to do so. By 2014, every mobile phone sold in the United States must be CMAS-capable. (You can learn more about CMAS in this PDF ). Whether such mobile phones should be subsidized for the poor is a larger question that will be left to the next administration. \n Take shelter #emergencyalert twitter.com/CJP_/status/26… \n — Cristina(@CJP_) October 30, 2012 \n As more consumers replace their devices in the years ahead, more people around the United States will also be able to receive these messages, benefiting from a public-private partnership that actually worked to deliver on improved public safety. \n At least one New Yorker got the message and listened to it: \n “If ‘act’ means stay put, then why yes I did,” tweeted Noreen Whysel, operations manager Information Architecture Institute. “It was enough to convince my husband from going out….” \n Here’s hoping New York City doesn’t have to use this PLAN to tell her and others about impending disaster again soon."], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/VnRaBoPGQn4/hurricane-sandy-mobile-text-alert-plan.html", "bloglinks": {}, "links": {"http://www.amberalert.gov/": 1, "https://twitter.com/": 19, "http://www.techdirt.com/": 1, "http://www.wired.com/": 1, "https://a858-nycnotify.nyc.gov/": 1, "http://www.nyc.gov/": 1, "http://t.co/": 7, "http://www.fema.gov/": 1, "http://fcc.gov": 1, "http://www.theatlantic.com/": 1, "http://transition.fcc.gov/": 1, "http://www.fcc.gov/": 2, "http://thenextweb.com/": 1, "https://www.nyc.gov/": 1, "http://theweek.com/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Fastly’s S3 Latency Monitor — The graph represents real-time response latency for Amazon S3 as seen by Fastly’s Ashburn, VA edge server. I’ve been watching #sandy’s effect on the Internet in real-time, while listening to its effect on people in real-time . Amazing. \n Button Upgrade (Gizmodo) — elegant piece of button design, for sale on Shapeways . \n Inside a Dozen USB Chargers — amazing differences in such seemingly identical products. I love the comparison between genuine and counterfeit Apple chargers. (via Hacker News ) \n Why Products Fail (Wired) — researcher scours the stock market filings of publicly-listed companies to extract information about warranties. Before, even information like the size of the market—how much gets paid out each year in warranty claims—was a mystery. Nobody, not analysts, not the government, not the companies themselves, knew what it was. Now Arnum can tell you. In 2011, for example, basic warranties cost US manufacturers $24.7 billion. Because of the slow economy, this is actually down, Arnum says; in 2007 it was around $28 billion. Extended warranties—warranties that customers purchase from a manufacturer or a retailer like Best Buy—account for an estimated $30.2 billion in additional claims payments. Before Arnum, this $60 billion-a-year industry was virtually invisible. Another hidden economy revealed. (via BoingBoing )"], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/XLkA-6ETK1M/four-short-links-30-october-2012.html", "bloglinks": {}, "links": {"http://boingboing.net/": 1, "http://www.wired.com/": 1, "http://www.com.au/": 1, "http://news.ycombinator.com": 1, "http://www.youtube.com/": 1, "http://www.radioreference.com/": 1, "https://app.fastly.com/": 1, "http://www.arcfn.com/": 1, "http://www.shapeways.com/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Inside BJ Fogg’s Behavior Design Bootcamp — see also Day 2 and Day 3 . \n Recollect — archive your social media existence. Very easy to use and I wish I’d been using it longer. (via Tom Cotes ) \n Duplicating House Keys on a 3D Printer — never did a title say so precisely what the post was about. (via Jim Stogdill ) \n Teleduplication via Optical Decoding (PDF) — duplicating a key via a photograph."], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/I1PW1Ch3neA/four-short-links-29-october-2012.html", "bloglinks": {}, "links": {"http://twitter.com/": 2, "http://vision.ucsd.edu/": 1, "http://eclecti.cc/": 1, "http://recollect.com": 1, "http://technori.com/": 3}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Software is making its way into places where it hasn’t usually been before, like the cutting surfaces of very fast, ultra-precise machine tools. \n A high-speed milling machine can run at 42,000 RPM as it fabricates high-quality machine components within tolerances of a few microns. Excessive wear in that environment can lead to a failure that ruins an expensive part, but it’s difficult to use physical means to detect wear on cutting surfaces: human operators can’t see it and detailed microscopic inspections are costly. The result is that many operators simply replace parts on a pre-determined schedule — every two months, perhaps — that ends up being overly conservative. \n  The researchers’ milling machine, shown with sensors near the cutting device. (Source: X. Li, M.J. Er, H. Ge, O. P. Gan, S. Huang, L.Y. Zhai, S. Linn, Amin J. Torabi, “Adaptive Network Fuzzy Inference System and Support Vector Machine Learning for Tool Wear Estimation in High Speed Milling Processes,” Proceedings of the 38th Annual Conference of the IEEE Industrial Electronics Society, pp. 2809-2814, 2012.) \n Enter software: in a paper delivered to the IEEE’s Industrial Electronics Society in Montreal last Thursday*, a group of researchers from Singapore propose a way to use low-cost sensors along with machine learning algorithms to accurately predict wear on machine parts — a technique that could cut costs for manufacturers by lengthening the lifespan of machine parts while avoiding failures. \n The group’s demonstration is a promising illustration of the industrial Internet , which promises to bring more intelligence to machines by linking them to networks and integrating them with sophisticated software. Techniques from areas like machine learning, which can be computationally intensive, can thus be available in monitoring parts as small and common as cutting surfaces in milling machines. \n \n “This is a simple optimization problem,” says Meng Joo Er , a professor at the Nanyang Technological University and an author of the paper. “But you’re talking about a very expensive piece of equipment working on a very expensive product. We have to be very careful.” \n  The cutting tool, enlarged under a microscope, after four cuts (Source: ibid.) \n Er and his colleagues outfitted a high-speed computer-controlled milling machine with a handful of common sensors: accelerometers to measure vibrations, an acoustic emission sensor to measure stress waves and a dynamometer to measure cutting forces. The researchers then used data from these sensors along with measurements of wear taken through a microscope as a training set for two machine-learning algorithms (one ANFIS model and one SVM model). The researchers managed to predict wear at above 90% by the ANFIS method and 85% by the SVM method. \n  The same surface showing wear (Source: ibid.) \n That’s accurate enough to find its way into application although, Er notes, industrial users will likely combine this sort of method with conventional fallbacks, and it will take longer to make its way into very-high-stakes fields like aviation. Computation time for running the trained model — now on the order of 25 seconds for the more accurate model and half a second for the less accurate — will also need to come down, and engineers will need to find ways to integrate these types of models into the industrial control systems that are ubiquitous in automated manufacturing. \n Nevertheless, this is a good lens for peering into the future of connected machines: generate lots of data, let software swallow it up, and optimize away. \n *Available for a fee from IEEE : X. Li, M.J. Er, H. Ge, O. P. Gan, S. Huang, L.Y. Zhai, S. Linn, Amin J. Torabi, “Adaptive Network Fuzzy Inference System and Support Vector Machine Learning for Tool Wear Estimation in High Speed Milling Processes,” Proceedings of the 38th Annual Conference of the IEEE Industrial Electronics Society , pp. 2809-2814, 2012. \n \n This is a post in our industrial Internet series , an ongoing exploration of big machines and big data. The series is produced as part of a collaboration between O’Reilly and GE."], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/nEAbKs0znXw/listening-for-tired-machinery.html", "bloglinks": {}, "links": {"http://www.ieee.org/": 1, "http://radar.oreilly.com/": 5, "http://en.wikipedia.org/": 2, "http://research.edu.sg/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["BootMetro (github) — website templates with a Metro (Windows 8) look. (via Hacker News ) \n Kenya’s Treasury to tax M-Pesa — 10% tax on mobile money-transfer systems. M-Pesa is the largest mobile money transfer service provider in Kenya, with more than 14 million subscribers. [...] It is estimated that M-Pesa reports some 2 million transactions per day. [...] the value of money transferred through mobile platforms jumped by 41 per cent in the first six months of 2012. Neer mind fighting you, you know you’re winning when they tax you! (via Evgeny Mozorov ) \n Digital Divide and Fibre Rollout — As the group of non-users gets smaller, they are likely to become more seriously disadvantaged. The NBN – and high-speed broadband more generally – will drive a wave of new applications across most areas of life, transforming Australia’s service economy in fundamental ways. Those who are not connected in 2015 may be fewer, but they will be missing out on far more – in education, health, government, commerce, communication and entertainment. The costs will also fall on service providers forced to keep supplying expensive physical and face-to-face services to this declining number of people. This will be particularly significant in remote communities, where health consultations and evacuations by flying doctors, nurses and allied health professionals could potentially be reduced through e-health diagnostics, and where Centrelink still regularly sends teams out to communities. As gov2 expands and services move online, connectivity disadvantages are compounded. (via Ellen Strickland ) \n Smart Body Smart World (Forrester) — take note of these two consequences of Internet of Things and Quantified Self: Verticals fuse: “Health and wellness” is not its own silo, but is connected to our finances, our shopping habits, our relationships. As bodies get connected, everyone is in the body business. Retail disperses: All retailers become computing retailers, and computing-specific retailers like Best Buy go the way of Blockbuster. You wouldn’t buy a smart toothbrush at a specialty CE store; you’d be more likely to buy it in the channel that solves the rest of your hygiene needs. (via Internet of Things )"], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/q5RqNNrs7s0/four-short-links-26-october-2012.html", "bloglinks": {}, "links": {"https://twitter.com/": 3, "http://blogs.forrester.com/": 1, "http://news.ycombinator.com": 1, "http://www.humanipo.com/blog": 1, "http://aozora.github.com/": 1, "http://inside.org.au/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Here are a few stories that caught my attention in the commerce space this week. \n Square gets international, plans major growth; PayPal Here hits retail \n  Square made a couple of big move announcements this week. First, the company literally will move to a new office space in the Central Market area of San Francisco by mid-2013, according to a report by Leena Rao at TechCrunch. Rao notes that the company has grown to more than 400 employees and reports Square plans to expand its staff to almost 1,000 people before the end of 2013. \n Square also announced this week that its service is now available in Canada, at the same 2.75% rate it charges in the U.S., according to a report by Ingrid Lunden at TechCrunch. Lunden reports one of the obstacles for Square in Canadian as well as European markets is that its dongle depends on the magnetic stripe on the backs of credit cards; many credit card processes in these markets use a chip-and-pin system instead. \n The obstacle isn’t insurmountable, however, as Lunden notes, Square’s partnership with Starbucks to incorporate its Pay With Square app service as a mode of payment might pave the way forward with retailers in other markets, making the card processing format irrelevant. \n Square competitor PayPal Here was on the move this week as well — into retail shopping. Rao reports in a separate post at TechCrunch that PayPal CEO John Donahoe announced a U.S. retail deal with AT&T during eBay’s earning call this week. PayPal Here previously had a retail presence only in Japan with Softbank. Rao reports that Here will retail for $15, with the purchaser receiving a $15 discount upon signing up; Square is sold in 20,000 outlets in the U.S. and sells for $10, with a $10 purchaser sign-up discount, Rao reports. \n \n Let the mobile payment testing begin \n The long-awaited Isis mobile wallet began testing this week in Austin and Salt Lake City markets. Stephanie Mlot reports at PC Magazine that compatible phones at launch include Samsung Galaxy S III, Galaxy S Relay 4G, and Galaxy S II on T-Mobile; the HTC Droid Incredible 4G LTE on Verizon, with Motorola Droid Razr HD and Droid Razr Maxx HD support coming yet this week; and the Samsung Galaxy S III, the HTC One X, the Samsung Exhilarate, the LG Escape, and the Samsung Galaxy Rugby Pro on AT&T. \n Mlot also reports that T-Mobile customers can get $10 in Isis eCash if they visit a brick-and-mortar location and activate the application. At launch, Isis works with Chase, Capitol One, Barclaycard, American Express, Visa, Mastercard and Discover credit cards. \n As to Isis’ success, a report at Consumer Reports says services like Isis are solving “a non-existent problem” and concludes: “Isis, like Google Wallet, still seems to require a lot of work and needless complexity for the questionable convenience of paying by cell phone.” \n Apple also announced this week that it too soon would be testing a mobile payment solution in a limited market — its own retail stores. Mark Gurman reports at 9to5Mac that Apple is preparing to update its point of sale system to scan Apple Store payment card codes through Passbook. The payment system update could be ready as early as the end of this month. Jordan Golson writes at MacRumors that though it’s not confirmed, it’s possible in-store customers also will be able to pay for any merchandise using their iTunes account information; thus far, only select accessories have been available for purchase through Apple’s EasyPay self-checkout system. \n Google Wallet on the iPhone? \n Business Insider’s Owen Thomas was paying close attention this week, noting the “The next version of Google Wallet, coming soon” statement at the top of Google’s Wallet homepage , with an option for visitors to request an invite. Thomas reports that when he requested the invite, he was prompted to select the type of device he uses: iPhone, Android, or “other.” \n Ryan Kim at GigaOm agrees with Thomas’ assertion that this likely suggests Google is looking to expand its purview beyond Android phones and into iPhones and “others,” but notes it really could mean anything. Kim writes : \n “It could mean that Google may be pursuing a more cloud-based approach to payments that doesn’t require NFC for transactions. Or Google Wallet could integrate with Apple’s Passbook or evolve to support QR codes or 2D barcodes, which is how Starbucks and Dunkin Donuts handle mobile payments. Or it could just mean Google wants to know how many iPhone users are interested in Google Wallet.” \n \n You can sign up for an invite here . \n Tip us off \n News tips and suggestions are always welcome, so please send them along . \n Related: \n \n Google Wallet vs Isis is coming soon \n Google Wallet vs Apple Passbook \n The competitive push toward mobile payment \n Mainstream mobile payment a decade out? \n More Commerce Weekly coverage"], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/a8PgWX7VE0A/square-expands-isis-apple-testing-google-wallet-update.html", "bloglinks": {}, "links": {"http://www.businessinsider.com/": 1, "http://techcrunch.com/": 5, "http://gigaom.com/": 2, "https://squareup.com/": 1, "http://radar.oreilly.com/": 8, "http://www.macrumors.com/": 1, "http://9to5mac.com/": 1, "http://www.pcmag.com/": 2, "http://news.consumerreports.org/": 1, "http://www.google.com/": 2}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Big Data: the Big Picture (Vimeo) — Jim Stogdill’s excellent talk: although Big Data is presented as part of the Gartner Hype Cycle, it’s an epoch of the Information Age which will have significant effects on the structure of corporations and the economy. \n Impala (github) — Cloudera’s open source (Apache) implementation of Google’s F1 (PDF), for realtime queries across clusters. Impala is different from Hive and Pig because it uses its own daemons that are spread across the cluster for queries. Furthermore, Impala does not leverage MapReduce, allowing Impala to return result in real-time. (via Wired ) \n druid (github) — open source (GPLv2) a distributed, column-oriented analytical datastore. It was originally created to resolve query latency issues seen with trying to use Hadoop to power an interactive service. See also the announcement of its open-sourcing . \n Supersonic (Google Code) — an ultra-fast, column oriented query engine library written in C++. It provides a set of data transformation primitives which make heavy use of cache-aware algorithms, SIMD instructions and vectorised execution, allowing it to exploit the capabilities and resources of modern, hyper pipelined CPUs. It is designed to work in a single process. Apache-licensed."], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/-S5IMyoh2hw/four-short-links-25-october-2012.html", "bloglinks": {}, "links": {"http://metamarkets.com/": 1, "https://github.com/": 2, "http://www.wired.com/": 1, "http://www.stanford.edu/": 1, "http://vimeo.com/": 1, "https://code.google.com/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Eric Meyer , the author of CSS: The Definitive Guide (and much more ) has taught thousands of people CSS through his books, his talks, and his articles. I’ve always enjoyed hearing his take on the state of CSS, as he manages to find combinations of capabilities that make CSS more powerful than I thought it was when I first looked. \n We sat down last week to discuss the many huge changes CSS3 is bringing, from improvements to old capabilities to completely new tools for animations, transforms, and layout. The continuous rate of change and the size of the specification are driving him to serialize the next edition of the Definitive Guide , releasing it in pieces. Developers can work from familiar foundations, but reach new destinations. The declarative strength of CSS3 lets you create presentation by describing it, and that style keeps proving more powerful. \n Highlights of the interview include: \n \n CSS3 brings big changes in font capabilities, letting you send fonts to users [discussed at the 2:30 mark ] and sites putting those improvements to work [ 15:50 ]. \n The many options can make choosing a set of parts seem difficult [discussed at the 4:21 mark ], but JavaScript shims that add support for CSS properties can make it easier to use properties even if browsers haven’t come around to them [ 6:08 ] \n Which of your features are like rounded corners? Will progressive enhancement let you worry less about those? [Discussed at the 6:55 mark .] \n More and more CSS modules apply its declarative approach to behavior, and changes over time. [Discussed at the 8:28 mark .] \n The new stuff that really has Eric excited? Layout improvements, using pieces designed for explicit layout rather than turning floats into a layout system. [Discussed at the 12:36 mark .] \n \n You can view the entire conversation in the following video: \n \n Related: \n \n Subscribe to the free Code podcast through iTunes"], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/WVFitDjYjXk/css-keeps-growing.html", "bloglinks": {}, "links": {"http://itunes.apple.com/": 1, "http://toc.oreilly.com/": 1, "http://www.youtube.com/": 8, "http://meyerweb.com/": 1, "http://meyerweb.com": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["By mayoral proclamation this is NYC Data Week , featuring lots of events that bring together innovators who work with data in any capacity. To see the industrial Internet as it’s being approached by entrepreneurs and hackers, be sure to stop by the free Data Sensing Lab in the Rhinelander North room at the Hilton hotel at 6th Avenue and 53rd Street. Participants in the lab work on networked devices–some of which they’re using to measure the environment at the O’Reilly Strata Conference + Hadoop World . They’ll report on what their sensors discovered at the end of the week. \n The Internet of Things Moving Us Forward (Digi) — The transportation sector is where just about every American interacts with big machines, whether by driving a car, riding on an airplane or waiting safely at a grade crossing while a train passes by. And it’s in transportation that the typical consumer will feel the first benefits of the industrial Internet. Digi, which provides a pay-per-transaction cloud platform for controlling devices, here takes a look at a handful of ways that connected vehicles are starting to improve the way we get around. \n Kaspersky Lab developing its own operating system? (Eugene Kaspersky) — Networked industrial devices have become common enough to get the attention of Kaspersky Lab, Russia’s security giant, which confirmed last week that it’s developing an operating system for industrial control systems. The system is still under development and, as Kaspersky himself notes, will only take final form after it goes through lots of application-specific development. Kaspersky will have plenty of competition from established producers of industrial-control software with large installation bases, so his move seems to anticipate lots of total retrofits of industrial systems in the next several years. \n \n Natural Fuse — Carbon sequestration usually works at a very large scale: you pay for an acre of forest to be planted in Hungary in order to offset your airplane trip. This social experiment renders it small and immediate through a network of plants that absorb CO2 and appliances–lamps, fans and radios–whose usage produces CO2. Natural Fuse members can use their plant’s carbon allowance directly or give it to others in the network in real-time. Run your appliance too much without offsetting its emissions, and you could kill someone else’s plant. The system runs on Cosm , a platform for linking networked devices. \n The industrial Internet series is produced as part of a collaboration between O’Reilly and GE."], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/rxYB76_XJnE/industrial-internet-links-2.html", "bloglinks": {}, "links": {"http://www.naturalfuse.org/": 1, "http://www.idigi.com/blog": 1, "https://cosm.com/": 1, "http://strataconf.com/": 2, "http://eugene.kaspersky.com/": 1, "http://oreilly.com/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Restoration of Defocused and Blurry Images — impressive demos, and open source (GPLv3) code. All those blurred faces and documents no longer seem so safe. \n Peter Molyneux Profile in Wired — worth reading for: (a) Molyneux’s contribution to the genre; (b) the inspiration he drew from his satirical Twitter mirror ( @PeterMolydeux ) is lovely, and (c) the game jams to build the fake Molyneux games, where satire becomes reality. (via Andy Baio ) \n Trusted Computing for Industrial Control Systems — Kaspersky reveals plans for an open source O/S for industrial control systems, so reactors and power stations and traffic systems aren’t vulnerable to StuxNet-type attacks. (via Jim Stogdill ) \n Android Virtual Machines — faster emulation for testing than the traditional simulators."], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/lADsT1o-djQ/four-short-links-24-october-2012.html", "bloglinks": {}, "links": {"http://www.securelist.com/": 1, "http://androvm.org/blog": 1, "http://www.wired.com/": 1, "http://yuzhikov.com/": 1, "http://eugene.kaspersky.com/": 1, "http://twitter.com/": 2, "http://waxy.org/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Getting Started with Software-Defined Radio (ThePowerBase) — Now, anyone with about $20 USD to spare can tune into everything from police and fire transmissions to the International Space Station. We were talking about this on the Radar mailing list, and Mike Loukides offered these pithy words of wisdom: antennas only get complicated if you’re transmitting. If you’re transmitting, you run a real possibility of letting the magic smoke out if something’s wrong with the antenna. But with receivers, there’s very little that more wire won’t fix. And at TV frequencies, you don’t even need that much wire. (via Jim Stogdill ) \n How Google Builds Its Maps (The Atlantic) — fascinating look into Google’s project Ground Truth. [T]he maps team, largely driven by Street View, is publishing more imagery data every two weeks than Google possessed total in 2006. The analysis of human-powered software is great: Google’s map offerings build in the human intelligence on the front end, and that’s what allows its computers to tell you the best route from San Francisco to Boston. \n USB Stick of Death — very detailed internals walkthrough of how to simply insert a USB stick, have it automatically mounted by the operating system and immediately compromise it by triggering a vulnerability in ntfs.sys. \n Basecamp — A Firesheep Moment for PLCs . I love the idea of Firesheep moments: when the obscurity is removed by making the flaw so easy to exploit that nobody can deny the problem exists. (via Jim Stogdill )"], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/fcCUnQ6itzI/four-short-links-23-october-2012.html", "bloglinks": {}, "links": {"http://twitter.com/": 2, "http://www.thepowerbase.com/": 1, "http://m.theatlantic.com/": 1, "http://j00ru.vexillium.org/": 1, "http://www.digitalbond.com/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["Earlier this month, when I was asked by Al Jazeera English if I’d like to be go on live television to analyze the online side of the presidential debates, I didn’t immediately accept. I’d be facing a live international audience at a moment of intense political interest, without a great wealth of on-air training. That said, I felt honored to be asked by Al Jazeera. I’ve been following the network’s steady evolution over the past two decades, building from early beginnings during the first Gulf War to its current position as one of the best sources of live coverage and hard news from the Middle East. When Tahrir Square was at the height of its foment during the Arab Spring, Al Jazeera was livestreaming it online to the rest of the world. \n I’ve been showing a slide in a presentation for months now that features Al Jazeera’s “The Stream” as a notable combination of social media, online video and broadcast journalism since its inception. \n So, by and large, the choice was clear: say “yes,” and then figure out how to do a good job. \n \n As is ever the case with new assignments, what would follow from that choice wasn’t as easy as it might have seemed. Some of the nuts and bolts of appearing were quite straightforward: Do a long pre-interview with the producer about my work and my perspective on how the Internet and social media were changing the dynamics of a live political event like the debate. (I captured much of that thinking here at Radar, in a post on digital feedback loops and the debate .) Go through makeup each time. Get wired up with a mic and an earpiece that connected me to the control room. Review each show’s outline, script and online engagement channels, from Twitter to YouTube to Google+ to Reddit . \n I was also afforded a few luxuries that bordered on the surreal: a driver that picked me up and took me home from the studio. Bottled spring water. A modest honorarium to hang out in a television studio for a couple of hours and talk for a few intense minutes about what moments from the debates resonated online and why. The realization that my perspective could be seen by millions in Al Jazeera English’s international audience . People would be watching. I’d need to deliver something worth their time. \n Entering The Stream \n Live television doesn’t give anyone much room for error. On this particular show, The Stream, there was no room for a deep dive into analysis. We had time to answer a couple of questions of what happened on social media during the debates. Some spots were 30 seconds. Adding context in that context is a huge challenge. How much do you assume the people viewing know? What moments do you highlight? For this debate show, I had to assume that they watched the two candidates spar — but were they following the firehouse of commentary on Twitter? Even if they did, given how personalized social media has become, it was inevitable that what viewers saw online would be different than what we did in the studio. \n When we saw the campaigns focus on Twitter during the debates, I saw that as news, and said as much. While the campaigns were also on Facebook, Google+, Tumblr, YouTube and blogs, along with the people formerly known as the audience, the forum for real-time social politics in the fall of 2012 remained Twitter, in all its character-limited glory. \n Once the debates ended each night, campaigns and voters turned to the new watercoolers of the moment — blogs and article comment sections — to discuss what they’d seen. They went to Facebook and Google+ to share their reactions. To their credit, the Stream producers used Google+ Hangouts to immediately ask undecided voters what they thought and bring in political journalists to share their impressions. It’s a great use of the platform to involve more people in a show using the tools of the moment. \n I’ve embedded each of the debate videos below, along with the full length episode of The Stream on data mining in the 2012 election. (I think I delivered, based upon the feedback I’ve received since in person and online, but I’m quite open to feedback if you’d like to comment.) \n The Stream: Presidential Debates [10/3/2012] \n \n \n The Stream: Vice Presidential Debate [10/11/2012] \n \n The Stream: Presidential debates pre-show [10/16/2012] \n \n \n On memes, social journalism and listening \n The first two presidential debates and the vice-presidential debate spawned online memes. Given the issues before the country and the world, reducing these debates to those rapid expressions and the other moments that catalyzed strong online reactions was inherently self-limiting. The role of The Stream during the debates, however, was to look at these political events through the prism of social media to explain quickly and precisely what popped online. At this point, if you’re following the election, you’ve probably heard of at least two of them: Big Bird and “binders full of women.” (I explain both in the videos embedded above.) We also saw acmes of attention and debate conflict reflected online, from Vice President Biden’s use of “malarkey” to reaction to CNN chief political correspondent Candy Crowley’s real-time correction of former Massachusetts Governor Mitt Romney’s challenge to President Obama regarding his use of “act of terror” on the day after the United States Embassy to Libya was attacked. \n There are limits to what you can discern through highlighting memes. While it might be easy to dismiss memes as silly or out-of-context moments, I think they serve a symbolic, even totemic role for people who share them online. There’s also a simple historic parallel: animated GIFs are the political cartoons of the present. \n Reducing the role of social media in networked political debates to just Twitter, GIFs and status updates, however, would be a mistake. The combination of embeddable online video, blogs and wikis are all part of a blueprint for democratic participation that enables people to explore the issues debated in depth, which is particularly relevant if cable news shows fail to do so. \n There’s also a risk of distracting from what we can learn about how the candidates would make policy or leadership decisions. I participated in a Google+ Hangout hosted by Storify last week about social media and elections. The panel of “social journalists” shared their perspectives on how the #debates are being covered in this hyper-connected moment — and whether social media is playing a positive role or not. \n \n Personally, I see the role of social media in the current election as a mixed bag. Networked fact checking is a positive development. The campaigns and media alike can find interesting trends in real-time sentiment analysis, if they dive into the social data. I also see an important role for the broader Internet in providing as much analysis on policy or context as people are willing to search for, on social media or off. \n There’s a risk, however, that public opinion or impressions of the debates are being prematurely shaped by the campaigns and their proxies, or that confirmation bias is being reaffirmed through homophilic relationships that are not representative of the electorate as whole. \n All that being said, after these three shows, I plan to watch the last presidential debate, on foreign policy, differently. I’m going to pocket my smartphone, sleeve my iPad and keep my laptop closed. Instead of tracking the real-time feedback during the debates and participating in the ebb and flow of the conversation, I’m just going to actively listen and take notes. There are many foreign policy questions that will confront the 45th President of the United States. Tonight, I want to hear the responses of the candidates, unadorned by real-time spin, fact checking, debate bingo or instant reaction. \n Afterwards, I’ll go back online to read liveblogs , see where the candidates may have gone awry, and look abroad to see how the world is reacting to a debate on foreign policy that stands to directly affect billions of people who will never vote in a U.S. election. First, however, I’ll form my own impressions, supported by the virtues of solitude , not the clamor of social media."], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/5sd00htIbwQ/debates-social-media-pundit-al-jazeera-english.html", "bloglinks": {}, "links": {"http://thecaucus.nytimes.com/": 1, "http://www.nytimes.com/": 1, "http://www.wnyc.org/": 1, "http://sunlightlive.com": 1, "http://www.foreignpolicy.com/": 1, "http://radar.oreilly.com/": 1, "http://www.opencongress.org/": 1, "http://www.co.uk/": 1, "http://practiceofzen.com/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}, {"content": ["jq — command-line tool for JSON data. \n GAFFTA — Gray Area Foundation For The Arts. Non-profit running workshops and building projects around technology-driven arts. (via Roger Dennis ) \n Power Pwn — looks like a power strip, is actually chock-full of pen-testing tools, WiFi, bluetooth, and GSM. Beautifully evil. (via Jim Stogdill ) \n Open Access Week — this week is Open Access week, raising awareness of the value of ubiquitous access to scientific publishing. (via Fabiana Kubke )"], "link": "http://feedproxy.google.com/~r/oreilly/radar/atom/~3/fSci4hO48cs/four-short-links-22-october-2012.html", "bloglinks": {}, "links": {"http://www.openaccessweek.org/": 1, "http://sciblogs.co.nz/": 1, "http://www.gaffta.org/": 1, "http://pwnieexpress.com/": 1, "http://www.rogerdennis.com/": 1, "http://stedolan.github.com/": 1, "http://twitter.com/": 1}, "blogtitle": "O'Reilly Radar - Insight, analysis, and research about emerging technologies"}]