[{"blogurl": "http://observationalepidemiology.blogspot.com\n", "blogroll": [], "title": "Observational Epidemiology"}, {"content": ["While the quote below seems political but I actually want to use it to make an epidemiological point rather than discussing politics: The most important intellectual pathology to afflict conservatism during the Obama era is its embrace of Ayn Rand’s moral philosophy of capitalism. Rand considered the free market a perfect arbiter of a person’s worth; their market earnings reflect their contribution to society, and their right to keep those earnings was absolute. Politics, as she saw it, was essentially a struggle of the market’s virtuous winners to protect their wealth from confiscation by the hordes of inferiors who could outnumber them. One issue that I see over and over again is mistaking the measure for the outcome. So people will fixate on body mass index as a measure of adiposity. But doing so classifies Brad Pitt (famous for his muscles) as being either overweight or obese . It is tempting to use an easy to measure correlated variable in place of the actual measure. For two people in the same position, there is a correlation between earnings and work (notice that I did not say a strong correlation). It is tempting to assume, based on this micro-ordering, that the macro ordering of income is also related to the amount of work done or value created. But it's obvious that this measure fails or else we would praise unions for working harder than regular workers rather than worrying that they were over-paid. I think that this problem is a consequence of us (as a society) wanting to assume clean values to soft and complex constructs. We will all be better off if we resist this impulse."], "link": "http://observationalepidemiology.blogspot.com/feeds/8371348394026380792/comments/default", "bloglinks": {}, "links": {"http://www.consumerfreedom.com/": 1, "http://nymag.com/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["I was a big fan of flexible hours for staff, when positions needed work done on a non-critical time scale. But this new trend twards scheduling hours at the last minute and a new focus on part time work seems deeply sub-optimal. Even the case the article cites as wanting to have part time work: To be sure, many people prefer to work part time — for instance, college students eager for extra spending money and older people earning money for presents during the holiday season. Having been a working student, let me assure you that a time schedule that changes every week (when my class schedule is fixed) is not an advantage. Not in the least. But the other interesting piece is this: The widening use of part-timers has been a bane to many workers, pushing many into poverty and forcing some onto food stamps and Medicaid. And with work schedules that change week to week, workers can find it hard to arrange child care, attend college or hold a second job, according to interviews with more than 40 part-time workers. Two very interesting pieces here. One, the use of Medicaid to cover heatlth care expenses really does suggest that it might actually be pro-worker to have universal, basic health insurance. Whether it is practical or not, that seems to be what employers are pushing for with their actions. Two, a world where one part time job makes it impossible to hold a second (as schedules shift at the last minute) is deeply worker unfriendly. I think that full employment would seem to be the solution to this dilemma, as workers could quit jobs that were too inconsistent on a week to week basis."], "link": "http://observationalepidemiology.blogspot.com/feeds/5586293505167091623/comments/default", "bloglinks": {}, "links": {"http://www.nytimes.com/": 1, "http://www.slate.com/blog": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["Paul Krugman discusses the success story of MedicAid : So Medicaid does a vast amount of good. But at what cost? There’s a widespread perception, gleefully fed by right-wing politicians and propagandists, that Medicaid has “runaway” costs. But the truth is just the opposite. While costs grew rapidly in 2009-10, as a depressed economy made more Americans eligible for the program, the longer-term reality is that Medicaid is significantly better at controlling costs than the rest of our health care system.  How much better? According to the best available estimates, the average cost of health care for adult Medicaid recipients is about 20 percent less than it would be if they had private insurance. The gap for children is even larger.  And the gap has been widening over time: Medicaid costs have consistently risen a bit less rapidly than Medicare costs, and much less rapidly than premiums on private insurance.  How does Medicaid achieve these lower costs? Partly by having much lower administrative costs than private insurers. It’s always worth remembering that when it comes to health care, it’s the private sector, not government programs, that suffers from stifling, costly bureaucracy.  Also, Medicaid is much more effective at bargaining with the medical-industrial complex. I often wonder if the hatred towards programs like MedicAid and Social Security is that they exist as counter-examples to current ideology that the free market is always the best solution. If so, I think that would be a massive mistake. The traditional of American Pragmatism has been to do what works regardless of the source and that has been a huge relative advantage. If anything, we should be expanding MedicAid, not shrinking it."], "link": "http://observationalepidemiology.blogspot.com/feeds/6333157889931825877/comments/default", "bloglinks": {}, "links": {"http://www.nytimes.com/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["Andrew Gelman spends some time on this latest quote from Steven Levitt on the rationality of voting: DUBNER: So Levitt, how can you in your life, when you wander around, tell the difference between a smart person and a not-so-smart person? LEVITT: Well, one good indicator of a person who’s not so smart is if they vote in a presidential election because they think their vote might actually decide which candidate wins. . . . there has never been and there never will be a vote cast in a presidential election that could possibly be decisive. Gelman has been riding this beat for a long time, repeatedly pointing out the flaws in this strangely persistent argument. He makes a good case (part of which I basically paraphrase in point one), but there are other problems with Levitt's claims. Here's a brief and certainly incomplete list of objections. 1. Every vote affects the probability distribution of a race, and since the difference in outcomes is so large, even a tiny change in probabilities can conceivably create a detectable change in expected value 2. Every vote in every race. Except for undervoting, we're talking about the combined impact for the entire ballot. 3. This isn't binary. The margin of a win can affect: Perceived mandate and political capital;  Officials' decisions (particularly in non-term-limited positions). Congressmen who win by large margins are less likely to feel constrained about unpopular votes; Funding. A lopsided defeat can make it harder for a candidate or a state party to raise money; Party strategy. How much effort do you expend finding a challenger against an official who beat you by more than ten points last time?; Media narrative.It's possible to come back after press corp has labeled you a loser, but it isn't easy. and finally 4. The system works better with higher response rates. It's more stable and harder to game. Perhaps even more important, it does a better job representing the will of the governed. That's the top of my head list. Undoubted, I missed some. Gelman goes on: I would not conclude from the above discussion that Levitt is not so smart. Of course he’s very smart, he just happens to be misinformed on this issue. I applaud Levitt’s willingness to go out on a limb and say controversial things in a podcast, to get people thinking. I just wish he’d be a bit less sure of himself and not go around saying that he thinks that Aaron, Noah, Nate and I are not so smart. He's being overly diplomatic. Levitt isn't just misinformed; he's willfully misinformed. In issue after issue (drunk driving, car seats, solar energy) he has used sloppy reasoning to reach a controversial position, then has done his best to turn a deaf ear to those who pointed out his errors. We did get a partial retraction of his claims on driving*, but on others he has doubled down and occasionally resorted to cheap shots at those who disagreed with him. Levitt is very smart. That's what makes this sort off thing so difficult to overlook.  * Though still leaving potential errors unacknowledged, such as the likely possibility that drivers in accidents are more likely to be checked for intoxication than pedestrians, that a stricter standard might be used, that many of the most intoxicated are prevented from driving and that intoxication is more likely to be noted in official records for drivers"], "link": "http://observationalepidemiology.blogspot.com/feeds/4090405387872399647/comments/default", "bloglinks": {}, "links": {"http://observationalepidemiology.blogspot.com/": 1, "http://themonkeycage.org/blog": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["A stirring defense of the welfare state . In particular, notice the questions about libertarian consistency that are asked."], "link": "http://observationalepidemiology.blogspot.com/feeds/1590828471274376329/comments/default", "bloglinks": {}, "links": {"http://stumblingandmumbling.typepad.com/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["Felix Salmon is strident : But when they try to get to the specifics of tax reform, they start falling into blather, asking that it be “pro-growth” (an utterly meaningless phrase), and asking too that it include lower rates and higher revenues.  Maybe they should have just asked for a pony for everybody instead: that would be easier. You can’t have lower rates and higher revenues — not without eviscerating pretty much all of the tax deductions which much of the middle class has learned to rely upon. Mortgage-interest tax relief, the charitable deduction, even the deduction for state and local taxes: pretty much all of them would have to go. That wouldn’t just get blocked by Democrats: it would get blocked by Republicans, too. And because most of these tax expenditures go to the middle class, broadly defined, the one group which would see most of the benefits while bearing very little of the costs would be the top 1%: the very CEOs who signed this letter.  In other words, the letter basically just says “please cut our taxes, raise taxes on everybody else, and cut the benefits they get from Medicare, Medicaid, and Social Security, which are programs we individually don’t rely upon”. It’s gross self-interest masquerading as public statesmanship. Okay, I think that here is a place where some degree of common sense really needs to return to the debate. The idea that cutting tax rates improves growth has very little empircal evidence. The strongest countries around are not necessarily ones with the lowest effective tax rates. It is true that (in extreme circumstances) these rates can cause troubles, but very little evidence that the United States (or any other first world country) is near this threshold. But the idea that I find the most difficult is the idea that lower tax rates could lead to more revenue. Seriously. Outside of extreme cases, why would governments ever have taxes if this were true? People dislike paying taxes. Governments like to have money. If not collecting taxes led everyone to have more money at the same time then it is hard to imagine nobody would have hit on this magic formula. Surely there has to be at least one autocrat who was pro-growth in the past 5,000 years or so? Now you can argue that taxes may decrease the overall rate of economic growth. I am skeptical about this claim, but it is at least not utterly absurd. But to reduce taxes to increase growth presumes that either growth will be so rapid that these losses will be more than made up for in increased revenue (seems hard to credit as we'd notice gigantic effects like this) or that taxes will later be raised to make up the difference. I really wish more readers were as critical of these ideas as Felix is."], "link": "http://observationalepidemiology.blogspot.com/feeds/533472718944161254/comments/default", "bloglinks": {}, "links": {"http://blogs.reuters.com/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["That's not really true. Every group has norms. Some just aren't as pretty as others. Case in point, Jon Stewart recounts the furor that started when Stewart suggested that the handling of the embassy attack was not \"optimal\" to which Obama replied that a situation that led to the deaths of four Americans was never optimal. The whole thing is worth watching but the most important part comes at the end of the second half when Stewart shows how respectable journalists use Fox News as an excuse to cover flashy stories of no merit.   The Daily Show with Jon Stewart Get More: Daily Show Full Episodes , Political Humor & Satire Blog , The Daily Show on Facebook    The Daily Show with Jon Stewart Get More: Daily Show Full Episodes , Political Humor & Satire Blog , The Daily Show on Facebook"], "link": "http://observationalepidemiology.blogspot.com/feeds/3825394275294442719/comments/default", "bloglinks": {}, "links": {"http://www.indecisionforever.com/": 2, "http://www.thedailyshow.com/": 4, "http://www.facebook.com/": 2}, "blogtitle": "Observational Epidemiology"}, {"content": ["It is very difficult to figure out the proper fundementals when decisions are mixed with real outcomes for the individuals involved. A case in point is the argument about whether the current trend for government bonds to yield \"zero\" is a problem. On the face of it, this should encourage governments to borrow. Instead we see a lot of arguments for austerity because, sooner or later, these yeilds have to go up. But, as has been pointed out , these are extremely liquid and efficient markets. So it is hard to completely avoid this type of cyncism:  This is, I think, coherent. But there is, nevertheless, an inconsistency here. Mr Halligan wants the government to do something about the (possible) failure in bond markets - cut spending. But he - and more significantly those who think like him - seem relaxed about the failures in goods and labour markets that cause at least 2.5 million people to be out of work. It's strange how some market failures demand action and some don't, isn't it? If I didn't know better I'd suspect the right of merely pursuing class interest without regard to intellectual consistency. This sort of intellectual consistency is something that seems to be sadly absent in a lot of the current thinking about financial issues. Being out of work is a serious harm to the people involved, even mroe so in the United States (where even more of one's benefits are linked to employment), but I am sure it is no picnic in the United Kingdom, either. Now, I dislike the Ad Hominen argument because it could be made about any argument, no matter how valid it was should it happen to have the potential to benefit the speaker. But I do think that we need to have a much cleaner conversation on what we think markets are able to do. If we think \"bubbles\" and \"irrational e xuberance\" can occur in financial markets then we really don't believe in the strong form of efficient market theory.  Now when you project this to areas with information asymmetry (think health care, where prices are opaque, or casualty insurance, where you have to trust the insurer to pay if the adverse event occurs) then it becomes even more silly. This problem is even more severe once you realize that trust is occasionally broken. I am sad Karl Smith doesn't really blog any more because he cut to the heart of the matter with this post .  The assumptions required for markets to simply manage themselves are pretty extreme. Why does Ragnar Danneskjöld become a pirate on the high seas instead of looting the (much closer) wealth of John Galt? Does he give the money back if he discovers his victim happened to be a \"maker\"? And how would he know?   So it is worth keeping in mind that this stuff is a) very hard and b) nobody seems to really hold the extreme versions of these views."], "link": "http://observationalepidemiology.blogspot.com/feeds/1703679948531773026/comments/default", "bloglinks": {}, "links": {"http://stumblingandmumbling.typepad.com/": 1, "http://modeledbehavior.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["Worth remembering : Norms matter. People work for money. But people also work for status, and people work because they take pride in a job well done. Ideas about what kinds of financial success merit high status and what kinds of jobs constitute a job well done are important. A doctor who bragged to you at a party about scoring a great deal on season tickets is doing something very different from a doctor who brags to you at a party about scoring season tickets after swindling a woman out of a bunch of money for unnecessary medical treatments. A doctor isn't supposed to be hustling patients. Everybody knows that. I think that this tendency to neglect the focus on norms has been the major cost of having a very legalistic culture. I remember this point being brought up in terms of the ability to \"discover money\" by acquiring a firm and then abandoning all of the previous cultural norms. If it isn't written down then it doesn't count. You might have joined ABC chemicals because they had a culture of being understanding when your children were sick. But the new owners don't care that you took a lower salary because of this -- they ask if you have anything in writing. So we now need everything in writing. But how do you run a culture with such low levels of trust? At a higher level, this is also a problem with the Randianism that has infiltrated our culture. If you use money as a marker of worth, the doctor who swindled a patient (in the exmaple above) is actually morally superior . . . so long as they can't be sued. How can this be a good way to govern interpersonal interactions?"], "link": "http://observationalepidemiology.blogspot.com/feeds/2190811843219183756/comments/default", "bloglinks": {}, "links": {"http://www.slate.com/blog": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["From Mippyville : Editorial advisory boards were an early attempt to stave off the disreputable reputation off comics. The best known of these was Fawcett's which included Admiral Byrd and Elanor B. Roosevelt (the daughter-in-law of Teddy, not the wife of Franklin), but True Comics also managed some notable names including George Gallup."], "link": "http://observationalepidemiology.blogspot.com/feeds/3546232384266404031/comments/default", "bloglinks": {}, "links": {"http://mippyville.blogspot.com/": 1, "http://1.blogspot.com/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["When I heard the intro to this story I was expecting the standard wisdom-of-crowds rehash. Instead I got a new take on political prediction markets: Koleman Strumpf, an economics professor at the University of Kansas, says these markets have been around since the beginning of our democracy and were especially popular in the late 19th and early 20th centuries. \"There was a period in the early part of the 20th century when this market literally existed right outside Wall Street,\" Strumpf says. It was outdoors, right on the curb, so it became known as the \"curb market.\" \"People would actively bet on all sorts of elections,\" he says. \"And for sure, in the period right about now in October, there [were] huge amounts of betting activity.\" Political betting was also an important tool for newspapers before the era of public opinion polling. Outlets would report on the action to get a sense of which candidate was winning. A journalist reporting on the market \"would list not only what the prices were, to give you an idea who was leading,\" Strumpf says, but \"would also list who was making these investments or bets.\" That meant that readers would know if the bets were being placed by specific traders — or by politicos from the New York Democratic political machine Tammany Hall, Strumpf says. I wonder if this was an international phenomena."], "link": "http://observationalepidemiology.blogspot.com/feeds/6258036363288193947/comments/default", "bloglinks": {}, "links": {"http://www.npr.org/blog": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["I just posted this cartoon then immediately removed it. The viewing options for the image on blogger were completely unacceptable. Really annoying. If you click on the picture before I pulled it down, I apologize, but make sure to check out the original. If you have any interest in politics and statistics, it's well worth your time."], "link": "http://observationalepidemiology.blogspot.com/feeds/2465065247235164938/comments/default", "bloglinks": {}, "links": {"http://xkcd.com/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["Canada is still a really suboptimal comparison to the United States in terms of how one might improve health care cost-effectiveness. Consider : As I have outlined over my last two OECD health data spending posts, Canada is one of the world’s biggest per capita spenders when it comes to total health spending – the sum of both public and private. Indeed, both public and private health spending have grown in tandem over the last few decades. In US PPP$ in 2010 for the 34 OECD countries, Canada ranks seventh in terms of total health spending per person. Yet, it comes to physicians per capita, it ranks 26 th . We rank 25 th in the number of total hospital beds per capita, 25 th in the number of nurses per capita, 21 st for CT scanners and 20 th for MRI units. While we are in the top ten per capita spenders , we are never in the top ten for any of these five health care resource indicators . While I am not sure I completely accept the idea of Iceland as a great comparator, either, it is pretty clear that the Canadian approach is still pretty expensive relative to the other first world countries. What Canada is, instead, is an existence proof for the possibility of a universal care system in a highly diverse population that costs less. But why don't we consider a country like France as a health care model. Or, for that matter, at least look at what is working so well in reducing costs in Iceland."], "link": "http://observationalepidemiology.blogspot.com/feeds/6675683846258786228/comments/default", "bloglinks": {}, "links": {"http://worthwhile.typepad.com/": 3}, "blogtitle": "Observational Epidemiology"}, {"content": ["This comment from Dana Goldstein is directly on point : I'm often asked what one education reform I think would make the biggest impact on American students' achievement. I don't like this question. The real answer--vastly decrease poverty--isn't going to happen anytime soon It may not be in the cards, but poverty and the knock-on effects of poverty are hard to ignore in the context of United States education policy. It simply connects to too many different pieces. Neighborhood funding models for schools mean poor neighborhoods end up with under-resourced schools. High rates of incarceration increase issues like single parent families and foster care families. Lack of trust in social institutions makes short term planning much more rational. All of these things end up impacting the overall quality of education. Any inefficiencies due to a teacher's union preventing teacher recruitment are likely to be a rounding error compared to the main effects that we are estimating here. After all, when there are enough problems with home life (stress, food insufficency, lack of child care, etc . . .) there is only so much that a teacher can do for the 30 students in his/her class."], "link": "http://observationalepidemiology.blogspot.com/feeds/6013148861680081352/comments/default", "bloglinks": {}, "links": {"http://www.danagoldstein.net/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["But other than that, Helaine Olen pretty much nails it . Robert Kiyosaki, author of the bestselling Rich, Dad, Poor Dad series of financial advice books, is offering his fans yet another lesson in how the rich are different than you and me: they file for bankruptcy not because of ill health or unemployment related issues, but instead as a strategic business move. Rich Global LLC, one of the corporate arms Kiyosaki has done business under, filed for bankruptcy protection in August, after it was ordered to pay just under $24 million to the Learning Annex and its chairman Bill Zanker. Kiyosaki was one of the small-time wealth guru mountebanks who made it to the big-time in the aughts by telling his forever falling behind audience that they could get ahead, they just had not learned how. The shtick behind the Rich Dad books was that Kiyosaki was sharing secret money-making strategies of the wealthy with his wage slave readers. The tips ran the gamut from ridiculous to illegal and downright hurtful and included advocating for insider trading, arguing for the purchase of multiple real estate properties with little or no money down and telling followers they could purchase stocks on margin via unfunded brokerage accounts. Kiyosaki is among the worst but he's not all that unrepresentative. If you feel up to it, the next time you're in a big bookstore take some time to browse the business section. Here and there, you'll find something interesting and intelligent or at least, helpful, but for the most part you'll encounter three profoundly embarrassing genres: 1. The you-too-can-be-rich books like Rich Dad, which tend to target the financially vulnerable and deliver, more often than not, ruinous advice; 2. The guru books. These are predominantly buzzword-rich seminar fodder in the Tom Peters mode with the occasional pseudo-profound business fable thrown in (and no, I didn't make up the term ' business fable '). These are less sleazy than the first category (they primarily target people who are already in business rather than the desperate and dunemployed), but the advice is not that much better and their cost to society may be greater. Directly and indirectly, American business wastes a tremendous amount of money and what might otherwise be productive man-hours on these bozos. 3. The be-like-me books, where someone with a completely inapplicable success story tries to convince you that you can somehow get similar results by following his or her lead. These are probably the least harmful of the bunch. They can also provide some of the most amusing examples ."], "link": "http://observationalepidemiology.blogspot.com/feeds/2536908166004335705/comments/default", "bloglinks": {}, "links": {"http://finance.yahoo.com/": 1, "http://observationalepidemiology.blogspot.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["Check out the Google home page today (October 15th)"], "link": "http://observationalepidemiology.blogspot.com/feeds/2789847109732393723/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Observational Epidemiology"}, {"content": ["Continuing the thread of Joseph's recent post on the Marshmallow game ... Everybody reading this has probably run across the persistent (and well-subsidized) narrative that goes something like this: virtually all of the variability we see in wealth can be explained by intelligence, talent and character with luck and inequality of opportunity playing little role in a person's success. In this narrative the labor market is now strongly efficient and the decrease in social mobility is simply the consequence of that current level of efficiency and a very large genetic component associated with those traits needed for success. There are entirely reasonable parts to this narrative (I don't know of anyone arguing that being smart and hard-working won't won't help you get ahead), but if you try to take that case to the extreme and argue that money, social position and connections don't factor in, you have to start explaining away a large number of counterexamples and potential problems with the narrative. The new findings in the marshmallow game are one example, showing that deprivation can cause people to be less likely to delay gratification rather than the causality necessarily running the other way. \"Being able to delay gratification—in this case to wait 15 difficult minutes to earn a second marshmallow—not only reflects a child's capacity for self-control, it also reflects their belief about the practicality of waiting,\" says [researcher Celeste] Kidd. \"Delaying gratification is only the rational choice if the child believes a second marshmallow is likely to be delivered after a reasonably short delay.\" How about the poor irresponsible spenders who are hopelessly bad with money? According to Sendhil Mullainathan of Harvard that's not the case. Mullainathan claims that although planning is a central part of poverty, poor people are better at making financial decisions than the rich and middle class. “If you go and stop people at a supermarket and ask them for their receipt and say, ‘Hey how much did you just spend,' middle class shoppers have no idea. The poor know what they just spent,\" he said. What about on the other side? Are the well off and educated consistently better with their finances? Perhaps not : (via Thoma ) But college-educated people were more likely than those with high school or less education to be above this 40 percent threshold - considered to be a risky amount of debt for most households. Another, more amusing example, comes from some of the same think tanks and pundits who promote the inequality-reflects-ability narrative. It's the idea that a small increase in the top marginal rate would create a large hardship on those close to the cutoff. As discussed before, if the cutoff is 250K of taxable income, a family would have to be making in the neighborhood of 300K gross to pay any of the higher tax. To see an increase of three or four thousand in its tax bill, the family would have to be bringing in something like 350K. If someone, even with a family, is making more than a third of a million a year and is so financially shaky that additional expenses of four thousand will cause financial hardship, that person has to be at least one of the following to an extreme degree: 1. Unlucky 2. Undisciplined with limited capacity for delayed gratification 3. Bad with money So one of the main conservative attacks on increasing the tax rate presupposes that either luck plays a large role in economic outcomes or a significant number of the well-to-do lack the very traits that Charles Murray and company use to explain the success of the upper classes. As mentioned at the beginning, conservative think tanks and pundits have expended a great deal of money, time and energy promoting the idea that wealth and poverty simply reflect relative contributions to society, that the rich deserve to be rich and the poor deserve to be poor. Perhaps those proponents are right, but you have to wonder what would happen if they trusted the marketplace of ideas enough to let this idea stand or fall on its own merits."], "link": "http://observationalepidemiology.blogspot.com/feeds/5218897042034848420/comments/default", "bloglinks": {}, "links": {"http://www.eurekalert.org/": 1, "http://economistsview.typepad.com/": 1, "http://www.marketplace.org/": 1, "http://observationalepidemiology.blogspot.com/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["Even have one of those paradigm changing moments? When things that you beleived are completely altered by new evidence. Mark Thoma links to a new version of the Marshmallow game . Consider, especially, this piece : But as she observed the children week after week, she began to question the task as a marker of innate ability alone. \"If you are used to getting things taken away from you, not waiting is the rational choice. Then it occurred to me that the marshmallow task might be correlated with something else that the child already knows—like having a stable environment.\" This is a massive finding for two reasons. One, it gets at the issue of trust and how important it is t be able to trust your fellows in order for society to function. In a low trust environment, there is a serious risk of perverse incentives (and it is easy to forget this). This may be especially true of issues like employment contracts -- if you can't trust employers to keep their part of the implicit social contract then it is hard to defer gratification. Two, all of this talk of impulse control leading to poverty is deeply misguided. Framing it as impulse control makes it seem like a feature of the person and not the environment. But it appears that it is also deeply related to how much you trust the systems in place. So perhaps the issue is growing up in unstable environments or in how much we can depend on people to be reliable. That makes the whole issue seem both a lot clearer and a lot more complex."], "link": "http://observationalepidemiology.blogspot.com/feeds/2240165395449669852/comments/default", "bloglinks": {}, "links": {"http://www.eurekalert.org/": 1, "http://economistsview.typepad.com/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["I thought of this* a while back as a possible classroom game but as I was working on another post it came to mind again, this time for its metaphorical possibilities.  The object of the game is to get from a word to to its antonym through a chain of roughly synonymous pairs in the fewest number of steps. For example, small and large. Small can mean fine Fine can mean excellent Excellent can mean great Great can mean large Admittedly, some of these pairs stretch the relationship a bit but you get the general idea. (I'm tempted to segue into a discussion of Janus words here, but that's off the main topic and really ought to wait for another post). I'm not sure how well it would actually work as a word game but at least it makes a useful metaphor when discussing contrarian journalism.  The objective of contrarian journalism is analogous, describing something with an antonym of the word you'd normally associate with the thing. Like the game, this linking of antonyms is normally done through a series of steps that seem that seem more or less reasonable when viewed individually even though, taken together, they lead to an absurd conclusion.  More importantly, this kind of journalism is, at heart, also a game, a demonstration of cleverness, no more intended to produce meaningful insights than a game of Scrabble is intended to produce elegant verse. This isn't to say that counter-intuitive conclusions are bad. If a line of reasoning leads to somewhere surprising, somewhere conventional wisdom would never point to, that can be a very good thing (assuming you didn't reach that conclusion via a stupid mistake in your reasoning -- counter-intuitive often means wrong).  But if you start out with a counter-intuitive position and set out to find a just-good-enough argument to prop it up, then the whole exercise is no more productive than misusing the transitive property to claim that small means large.  *I'm pretty sure someone else thought of it first."], "link": "http://observationalepidemiology.blogspot.com/feeds/4190015853718731750/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Observational Epidemiology"}, {"content": ["Matt Yglesias : Summers mentioned that for all the valid complaints that one hears about the state of American college education, there's a clear demand for it on the international stage so we must be doing something right. Many more foreign students come here to study than we send abroad, notwithstanding the generally higher cost structure of the American higher education sector.  I actually think that this can be one of the weaknesses of market signals. Reputation persists even after fundementals have changed. The classic example of this, in my view, is the American Car Industry. If one were to go to Detroit in 1968 and talk about how bad decisions might eventually catch up with them, they would look silly. But when these decisions actually did catch up with them the damage was very hard to reverse. Another example was deforestation on Easter island . Over the short term, each tree that was harvested was an economically sound decision. It had an immediate and positive payoff. But when all of the trees were gone, things definitely were not improved. So just because an industry looks strong (now) doesn't mean that there are not rising challenges in the future."], "link": "http://observationalepidemiology.blogspot.com/feeds/3334050489276506602/comments/default", "bloglinks": {}, "links": {"http://www.mongabay.com/": 1, "http://www.slate.com/blog": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["Promoting his new book The Signal and the Noise. The part I caught was excellent and I've got the rest downloaded for tomorrow. You can catch it here ."], "link": "http://observationalepidemiology.blogspot.com/feeds/8510949846611758761/comments/default", "bloglinks": {}, "links": {"http://www.npr.org/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["and he's also kinda picky about decimal places.   The Daily Show with Jon Stewart Get More: Daily Show Full Episodes , Political Humor & Satire Blog , The Daily Show on Facebook  Better yet, it was a satirical math twofer.  The Daily Show with Jon Stewart Get More: Daily Show Full Episodes , Political Humor & Satire Blog , The Daily Show on Facebook"], "link": "http://observationalepidemiology.blogspot.com/feeds/5662002149208097786/comments/default", "bloglinks": {}, "links": {"http://www.indecisionforever.com/": 2, "http://www.thedailyshow.com/": 4, "http://www.facebook.com/": 2}, "blogtitle": "Observational Epidemiology"}, {"content": ["The problem with trying to harness market forces to provide less expensive health care for older adults is the lack of an open price system. Matthew Yglesias critiques David Brook's alternative to the current proposal of using a panel of experts to try and set costs : Brooks says Obama's plan to do this with price controls is doomed for political economy reasons. A politically powerful coalition of elderly people and health care providers will block it. That's certainly plausible. But what's the alternative? Brooks says the alternative is to insert an additional layer of rent-seekers into the dynamic by contracting Medicare services out to private health insurance companies. This approach always assumes two things: 1) that there is a functional market that can set prices independent of the insurance system. How many elderly patients pay out of pocket for major medical services in the United States and then brag about the transparent pricing? 2) that there are real efficiencies to be gained by a private firm that could not be availed by the government. Notice that the insurers are not the providers, we already have private hospitals. So the efficiency would have to come from somewhere else. For example, that the firm could simply billing procedures to reduce administrative overhead. But medical billing tends to be complicated and needing to interface with a lot of different systems/reporting structures reduces efficiency. Or they could set prices more saccurately, but then they are just another panel of experts that is not accountable to the electorate. We have the same issues with defense contractors. It is very hard to set market prices for items that can only be sold to the United States government (think nuclear weapons or aircraft carriers). So we rely on expert judgement (on the part of the government) as to what costs should be for these items. Would we really expect to see costs drop if we inserted another layer of \"bargainers\" who acted on behalf of the government to set prices and then got to have a percentage of expenditures? How could such incentives ever work out?"], "link": "http://observationalepidemiology.blogspot.com/feeds/2974680126520109340/comments/default", "bloglinks": {}, "links": {"http://www.slate.com/blog": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["Noah Smith has a dynamite post on a recent economics paper. It puts forth the idea that \"cuddly\" countries (i.e. Sweden) are parasitizing off of \"cut-throat\" countries (i.e. the United States). The problem is the modeling assumptions. In one especially problematic passage of the Daron Acemoglu and James Robinson paper is: We assume that workers can simultaneously work as entrepreneurs (so that there is no occupational choice). This implies that each individual receives wage income in addition to income from entrepreneurship[.] This basically, all by itself, destroys the link between their model and real world experience. How many people do you know are able to do these two things at the same time? How can the time spent in your garage inventing Apple computers not reduce your ability to work at a demanding corporate job? How many people can draw a full wage and benefits while working for themselves on a small start-up? Can we really believe that there is no financial sacrifice at all? Then I think about things like Health Insurance. When reading about a small retail businesses (see this comment thread ), one thing that was clear was how useful it is to have a spouse with a good job (i.e. one that gives out health insurance). How can the need to construct these elaborate safety net plans possible improve the success rate of small business? Another assumption that seems implausible: Also, the authors assume that entrepreneurs do not put up any of their own wealth as startup capital for their ventures, and they assume no heterogeneity between worker/entrepreneurs. This means that it is just as easy - and no more risky - for a poor person to start a successful company as for a rich person to do so. I am reminded of the founder of Jimmy Johns who started a business with a $25,000 loan from his father (in 1982 dollars). It's an inspirational story, but what about people who did not have parents with that level of capital to just give to their children? Would he have been as successful if he stopped by a bank and asked for a loan? Instead I want to think about whether you see the reverse in terms of entrepreneurship . Look at Sweden versus the United States -- why do they have more entrepreneurs? Which brings us to the final problem -- innovation being measured by patents. Are we really excited to see Apple and Google spending more on patents than research? After all, patents prevent emulation of good ideas and slow innovation. In theory the patent process is intended to reward innovators, but are we positive its real effect isn't to enrich lawyers?"], "link": "http://observationalepidemiology.blogspot.com/feeds/6997828953291220423/comments/default", "bloglinks": {}, "links": {"http://www.motherjones.com/": 1, "http://blackdiamondgames.blogspot.com/": 1, "http://en.wikipedia.org/": 1, "http://noahpinionblog.blogspot.com/": 1, "http://www.theatlantic.com/": 1}, "blogtitle": "Observational Epidemiology"}, {"content": ["Marketplace Money devoted an excellent episode to poverty this week. You should check the whole thing out if you can, but if you're pressed for time make sure to listen to this interview with Harvard economist Sendhil Mullainathan."], "link": "http://observationalepidemiology.blogspot.com/feeds/4005854645863777364/comments/default", "bloglinks": {}, "links": {"http://www.marketplace.org/": 2}, "blogtitle": "Observational Epidemiology"}]