[{"blogurl": "http://blog.oddhead.com\n", "blogroll": [], "title": "Oddhead Blog"}, {"content": ["One of the few aspects of my job I enjoy more than designing a new market is actually building it. Turning some wild concept that sprung from the minds of a bunch of scientists into a working artifact is a huge rush, and I can only smile as people from around the world commence tinkering with the thing, often in ways I never expected. The “build it” phase of a research project, besides being a ton of fun, inevitably sheds important light back on the original design in a virtuous cycle. \n In that vein, I am thrilled to announce the beta launch of PredictWiseQ , a fully operational example of our latest combinatorial prediction market design : “A tractable combinatorial market maker using constraint generation” , published in the 2012 ACM Conference on Electronic Commerce . \n You read the paper. 1  Now play the game. 2 Help us close the loop. \n  \n PredictWiseQ is our greedy attempt to scarf up as much information as is humanly possible and use it, wisely, to forecast nearly every possible detail about the upcoming US presidential election. For example, we can project how likely it is that Romney will win Colorado but lose the election (6.2%), or that the same party will win both Ohio and Pennsylvania (77.6%), or that Obama will paint a path of blue from Canada to Mexico (99.5%). But don’t just window shop, go ahead and customize and buy a prediction or ten for yourself. Your actions help inform the odds of your own predictions and, crucially, thousands of other related predictions at the same time. \n For example, a bet on Obama to win both Ohio and Florida can automatically raise his odds of winning Ohio alone. That’s because our market maker knows and enforces the fact that Obama winning OH and FL can never be more likely than him winning OH. After every trade, we find and fix thousands of these logical inconsistencies. In other words, our market maker identifies and cleans up arbitrage wherever it finds it. But there’s a limit to how fastidious our market maker can be. It’s effectively impossible to rid the system of all arbitrage: doing so is NP-hard, or computationally intractable. So we clean up a good bit of arbitrage, but there should be plenty left. \n So here’s a reader’s challenge: try to identify arbitrage on PredictWiseQ that we did not . Go ahead and profit from it and, when you’re ready, please let me and others know about it in the comments. I’ll award kudos to the reader who finds the simplest arbitrage. \n Why not leave all  of the arbitrage for our traders to profit from themselves? That’s what nearly every other market does, from Ireland-based Intrade , to Las Vegas bookmakers, to the Chicago Board Options Exchange. The reason is, we’re operating a prediction market. Our goal is to elicit information. Even a completely uninformed trader can profit from arbitrage via a mechanical plug-and-chug process. We should reserve the spoils for people who provide good information, not those armed (solely) with fast or clever algorithms. Moreover, we want every little crumb of information that we get, in whatever form we get it, to immediately impact as many of the thousands or millions of predictions that it relates to as possible. We don’t want to wait around for traders to perform this propagation on their own and, besides, it’s a waste of their brain cells : it’s a job much better suited for a computer anyway. \n Intrade offers an impressive array of predictions about the election, including who will win in all fifty states . In a sense, PredictWiseQ is Intrade to the 57th power . In a combinatorial market , a prediction can be any (Boolean) function of the state outcomes, an ungodly degree of flexibility. Let’s do some counting. In the election, there are actually 57 “states”: 48 winner-takes-all states, Washington DC, and two proportional states — Nebraska and Maine — that can split their electoral votes in 5 and 3 unique ways, respectively. Ignoring independent candidates, all 57 base “states” can end up colored Democratic blue or Republican Red. So that’s 2 to the power 57, or 144 quadrillion possible maps that newscasters might show us after the votes are tallied on November 6th. A prediction, like “Romney wins Ohio”, is the set of all outcomes where the prediction is true, in this case all 72 quadrillion maps where Ohio is red. The number of possible predictions is the number of sets of outcomes, or 2 to the power 144 quadrillion. That’s more than a googol , though less than a googolplex (maybe next year). To get a sense of how big that is, if today’s fastest supercomputer starting counting at the instant of the big bang, it still wouldn’t be anywhere close reaching a googol yet . \n Create your own league to compare your political WiseQ among friends. If you tell us how much each player is in for, we’ll tell you how to divvy things up at the end. Or join the “Friends Of Dave” (FOD) league . If you finish ahead of me in my league, I’ll buy you a beer (or beverage of your choice) the next time I see you, or I’ll paypal you $5 if we don’t cross paths. \n PredictWiseQ is part of PredictWise , a fascinating startup of its own. Founded by my colleague David Rothschild , PredictWise is the place to go for thousands of accurate, real-time predictions on politics, sports, finance, and entertainment, aggregated and curated from around the web. The PredictWiseQ Game is a joint effort among David , Miro , Sebastien , Clinton , and myself . \n The academic paper that PredictWiseQ is based on is one of my favorites — owed in large part to my coauthors Miro and Sebastien , two incredible sciengineers. As is often the case, the theory looks bulletproof on paper. But I’ve learned the hard way many times that you don’t really know if a design is good until you try it. Or more accurately, until you build it and let a crowd of other people try it. \n So, dear crowd, please try it! Bang on it. Break it. (Though please tell me how you did, so we might fix it.) Tell me what you like and what is horribly wrong. Mostly, have fun playing a market that I believe represents the future of markets in the post-CDA era , a.k.a the digital age. \n __________ \n 1 Or not. \n 2 Or not."], "link": "http://blog.oddhead.com/2012/10/06/predictwiseq/", "bloglinks": {}, "links": {"http://www.sigecom.org/": 1, "http://www.linkedin.com/": 1, "http://intrade.com": 2, "http://www.harvard.edu/": 1, "http://www.predictwise.com/": 1, "http://PredictWise.com": 1, "http://bit.ly/": 1, "http://www.princeton.edu/": 4, "http://research.microsoft.com/": 2, "http://wiseq.predictwise.com/": 1, "http://dpennock.com/": 2, "http://researchdmr.com/": 2, "http://www.halfbakedlunatic.com/": 1, "http://blog.oddhead.com/": 4, "http://predictwiseq.com": 3}, "blogtitle": "Oddhead Blog"}, {"content": ["My blog has been hacked yet again . For those keeping track, that’s infection number three. This latest exploit is very similar to the previous one . To humans arriving via browser (e.g., me), the site appears perfectly normal and healthy. Even upon clicking ‘view source’, nothing untoward is revealed. The <title> of my blog is, as always, Oddhead Blog . \n However, when Google’s or Bing’s crawlers arrive to index my corner of the web, they see a different <title> altogether — Buy Cheap Cialis Online  — and immediately roll their eyes. (Actually even if you run 'curl http://blog.oddhead.com' , you’ll see the spam keywords.) The effect of the attack is a kind of reverse cloaking . Cloaking is the black-hat SEO practice of serving legitimate content to crawlers and spam content to people. Here, the spam content is shown to the crawlers and the legitimate content to the people. \n Once the crawlers report this appalling information back to their respective mother ships, the search engines have no choice but to delist and demote my blog in their pagerankings. Right now, if you search for or within Oddhead Blog on Google, you’ll see how poorly the bots in Mountain View think of me: \n \n You can hardly find any deep links into my blog by searching Google. For example, try searching for Bem+Wom , my invented term for “BEtter Mousetrap, Word of Mouth” . Even try “Bem+Wom oddhead blog” . You”ll find aggregators republishing my content, but no links to the original source, my blog, anywhere in sight. (Note to self: the Bing results for Bem+Wom are awful.) \n Once again I am at a loss to understand my attacker’s motivation. Clearly it’s not to sell Cialis to my users, as they remain blissfully ignorant of any changes. The only benefit to anyone is to remove one relatively obscure blog from the search engine rankings and thus to move the attacker one slot up. Having a blog tangentially about gambling probably puts me into a shady neighborhood of the web, yet reverse-cloaking your competition (even if it can be somewhat automated and strike more than one competitor) seems like an awfully indirect way to improve one’s standing in Google. It’s also possible this is an act of pure vandalism. \n So what should I do? Although I partly blame WordPress for writing insecure software, I may end up paying WordPress protection money to make this problem go away. I am seriously considering giving up on self hosting and moving my whole operation to worpress.com’s hosted service , where presumably security is tighter, or at least it’s not my responsibility any more. My web hosting service, DreamHost, may also be partly to blame , yet I like the company and have been quite happy with them in many respects. Any advice, dear reader? WordPress.com? Blogger? Try again and hope the fourth time is the charm? Should I be looking to ditch DreamHost as well?"], "link": "http://blog.oddhead.com/2012/05/06/oddhead-blog-hacked-third-time/", "bloglinks": {}, "links": {"http://www.bing.com/": 1, "http://www.dreamhoststatus.com/": 1, "http://en.wordpress.com/": 1, "http://en.wikipedia.org/": 1, "http://blog.oddhead.com/": 4, "http://www.google.com/": 2}, "blogtitle": "Oddhead Blog"}, {"content": ["Now that I’ve said my goodbyes , I’m thrilled to announce that I’ve joined Microsoft Research, an organization with going-on twenty-one years of commitment to basic and applied research, employing 850 Ph.D. scientists around the globe including Turing Award winners, Fields Medalists , and many long-time colleagues that I hugely respect. If that were all, I would be over-the-top happy right now. \n But that’s not all. Together with fourteen other founding members (seven of whom I can name: Duncan Watts , John Langford , David Rothschild , Sharad Goel , Dan Goldstein , Jake Hofman , and Sid Suri ), we are cutting the ribbon on a new outpost for Microsoft Research in New York City. We will report to Jennifer Chayes, the founder and director of Microsoft Research New England in Cambridge, MA. It’s been amazing to watch her up close pursue a goal relentlessly with boundless positive energy. I get the feeling it’s how she approaches everything she does, a realization that played no small part in my decision. The New England Lab, like us, is an interdisciplinary research group that blends computer science, social science, and machine learning, yet from different enough perspectives to make this an almost perfect marriage. It’s no exaggeration to say that helping to found and lead a new research group amid the bursting tech scene in New York City, with the resources of Microsoft behind us, is — as Duncan says — a once-in-a-career opportunity. \n The press coverage Thursday was gratifying, including nice pieces in PCMag (source of the sweet logo above), NYTimes.com , AllThingsD , and dozens more . Here is the official press release . For science perspectives, see John Langford’s , Lance Fortnow’s , Dan Goldstein’s , and Jennifer Chayes’s blog posts. One of the coolest moments came when New York Mayor Michael Bloomberg tweeted about us . \n Note that, despite the attrition , Yahoo! Labs lives on, probably more applied but not solely so. Ron Brachman , the new head of Yahoo! Labs, is terrific and may be able to do something special there. The Barcelona group remains largely intact and just got 7 (!) papers into SIGIR. Other groups remain intact as well. \n The reception within Microsoft research and product orgs has been swift and very warm. The breadth and scope of the place can be daunting at first but invigorating. The ability to impact products that touch hundreds of millions of people’s lives is, as always, a rewarding draw of corporate research. Yet one of the deciding factors for many of us in joining Microsoft is the freedom to interact with universities in research, service, teaching, hosting visitors, hiring interns and postdocs, etc. In addition, we’d like to play our part in the New York City tech scene, including the startup, venture-capitalist, and hack/make communities, plus the new Cornell-Technion campus, contributing to Mayor Bloomberg’s vision of New York City as a tech hub. \n An interesting side note that bodes well for my two daughters ages 7 and 4 is that my primary decision boiled down to working for one of two brilliant and accomplished women: Jennifer Chayes at Microsoft, or Corinna Cortes at Google, who is absolutely terrific. Google is a incredible place, a model of efficiency, innovation, and ambition, with an impressive roster of people, and the company is in a very strong position. But this opportunity at Microsoft simply proved to be too good to pass up. I can’t believe how perfectly everything fell into place. I’m beyond thrilled at the outcome and excited to begin this next chapter of my career."], "link": "http://blog.oddhead.com/2012/05/05/microsoft-research-nyc/", "bloglinks": {}, "links": {"http://jakehofman.com/": 1, "http://www.microsoft.com/": 1, "https://twitter.com/": 1, "http://messymatters.com/": 1, "http://brachman.org/": 1, "http://hunch.net/": 2, "http://mcafee.cc/": 1, "http://bits.nytimes.com/": 1, "http://www.delicious.com/": 1, "http://everythingisobvious.com/": 1, "http://blog.computationalcomplexity.org/": 1, "http://www.dangoldstein.com/": 1, "http://blogs.technet.com/": 1, "http://www.pcmag.com/": 1, "http://researchdmr.com/": 1, "http://allthingsd.com/": 3, "http://research.microsoft.com/": 1, "http://sidsuri.com/": 1, "http://www.linkedin.com/": 1, "http://blog.oddhead.com/": 1, "http://www.decisionsciencenews.com/": 1}, "blogtitle": "Oddhead Blog"}, {"content": ["On Thursday April 26, 2012, I resigned from Yahoo! after nearly 10 without actively changing jobs. Here is the full text of the goodbye letter(s) I sent. It’s the kind of long-winded last salvo that few people actually read, and now I’m foisting it upon you, dear reader, but I can’t help myself. Writing it brought back many wonderful memories and a tinge of sadness at the end of a truly amazing work environment for me, but I found the exercise rewarding. I really appreciate the many kind words and well wishes: some were poignant and immensely gratifying. The feeling is mutual. If nothing else, throughout my career I have had the great fortune of working with amazing people who are equal parts brilliant, effective, and nice, including my bosses, peers, reports, and students. \n \n \n——– Original Message ——– \nSubject: last Yodle (and last corny Yodle joke) \nDate: Wed, 25 Apr 2012 16:44:31 -0400 \nFrom: David Pennock \n After 8 wonderful years (almost 10 if you include Overture), it is with \nvery mixed emotions that I leave Yahoo!. My last day is tomorrow, \nThursday April 25 26. You can reach me in plenty of ways and I hope you do: \n [my email address] \n+1-732-XXX-XXXX \nY!IM pennockd | facebook pennockd | twitter pennockd | linkedin \nhttp://dpennock.com | http://blog.oddhead.com \n I’ve grown to love this company (purple blood, yada yada) and one of the \ndeep ironies is that I have a feeling Scott Thompson may actually know \nwhat he is doing and that maybe just maybe Yahoo!’s return to revenue \ngrowth and good public perception will finally come (note I didn’t say \nreturn to profitability — a steady $1 billion in cashmoney profit in \nour pocket every year is very far from shabby). I plan to hold on to \nsome of my stock. \n In the early 2000s Google was an amazing Bem+Wom story yet almost no one \n(me included) had a clue how they would make money. In 2002, Gary Flake \nintroduced me to Overture, a company already making hundreds of millions \non search, and suddenly it was clear. I joined Gary in what became \nOverture Research and later, under Usama Fayyad’s protective wing, the \ninception of “Yahoo! Research Labs”. When Gary left, we hired Prabhakar \nand Ron. The rest is history. Andrei, Andrew, Raghu, Ravi, Ricardo, \nPreston, Duncan. An absolutely amazing place that was my pleasure to \nwatch grow and mature. I still remember the excitement of our first \noffsite at Half Moon Bay to map out the future of the place.* I remember \na fateful week when Preston, Duncan, and David Reiley simultaneously \ngave up their tenure to stay at Yahoo!. \n From the beginning Prabhakar saw the importance of including social \nscience research in the mix for online media. In my little corner, where \nwe mixed computer science and economics (“algorithmic economics” we \ncalled it), I believe we had enormous effect both internally and \nexternally. In 2007, Jeff MacKie-Mason, one of our Big Thinker lecturers \nand now Dean of the School of Information at the University of Michigan, \nwrote (ok, informally to me in email) that our group was “the most \nexciting and successful group I’ve seen crossing the CS/Econ boundary”. \nIf imitation is the sincerest form of flattery, I believe we had a \nsignificant positive impact on the growth in hiring in the social \nsciences and in algorithmic economics at both Google and Microsoft. In \nour group alone, we published more than 70 papers including at least two \naward winners (Arpita just this year). We literally wrote the book \n(chapters) on sponsored search and prediction markets. We co-founded the \nAd Auctions Workshop and NYCE Day. People who left often did \nfantastically well, including Yiling Chen to Harvard, Mohammad Mahdian \nto Google, and Dan Reeves to found his own successful startup Beeminder. \nWe filed dozens of patents (take that fb!). Former intern Nicolas \nLambert who is now a Stanford professor once told me he hoped to one day \nsay “it all started at Yahoo!”. I just left a Ph.D. student’s defense \nwhose three (!) weeks at Yahoo! were good for two chapters in his \nthesis. We’ve had academic visitors leave after a week here and follow \nup that they wanted to apply for a job — the environment was that great. \n Inside Yahoo!, we worked on sponsored search (“squashing” and so much \nmore by the incomparable Sebastien Lahaie, who we recently discovered is \nthe central hub of research in New York), display ads, and UGC among \nmany topics. My passion has been in prediction (markets), and some of my \nbest memories have been trying to play product manager for a day (or a \ncouple months) for Predictalot and The Signal. Often it felt more like \noperating a startup but with incredible advantages in resources, people, \nand of course access to that monster traffic firehose. This was Yahoo! \nat it’s best — marshaling talent from all over the globe in many \ndivisions and specialties to produce a product that no one had ever seen \nbefore, and that no one including us even knew would work. One of the \nsaddest parts of departing now is leaving The Signal behind, an \nincredible effort and in many ways our biggest and best, led by David \n“force-of-nature” Rothschild and so many people behind it. Sadly, some \nwere let go and others are leaving on the own accord, and we’ll never \nknow what could have been in a counterfactual universe. Yet I believe \nThe Signal will live on in the good hands of those who remain, including \nChris Wilson, Alex, Ingemar, and the absolutely phenomenal Bangalore team. \n By far the best part of working at Yahoo! was the people. It’s been my \npleasure to work with so many fantastic colleagues in Labs and \nthroughout the company. In the recent turmoil many in Labs have been, as \nPreston said, “evaluated by the market”, and came out looking pretty \ndarn good, with calls, interviews, and offers from the best companies \n(Facebook, Google, Microsoft) and universities. Early on we set a goal \nto always hire above the mean, and I truly believe we did that. (Having \nbeen here from the beginning, you can see where that leaves me in this \nincredible crowd.) It’s a cliche but a true one: I am only as good as \nthe people working with me, and I’ve truly been blessed with amazing \ncolleagues, bosses, employees, postdocs, and interns. To Sebastien, \nArpita, Giro, and David Rothschild, plus Mridul, Navneet, Sudar, Arun, \nShrikant, Kim, Chris, Janet, Ron, Michael and dozens more and everyone \nwho has come before, from Preston & Prabhakar on down, I can’t thank you \nenough and I owe you almost everything. \n Goodbye for now, \nDave \n * For history buffs, these were the people at the initial Yahoo! \nResearch offsite: Prabhakar Raghavan, Dennis DeCoste, David Pennock, \nOmid Madani, Shyam Kapur, Andrew Tomkins, Winton Davies, Ravi Kumar, \nBernard Mangold, Ron Brachman, Marc Davis, Michael Mahoney, Kevin Lang, \nSeung-Taek Park, and Dan Fain. \n ** I also remember the first few days of Yahoo! Research New York in \n2005, with just Ron, John, and I. It’s amazing to see what we have \nbecome since. \n *** An even more arcane note of history: the Overture control room made \na cameo as NASA Mission Control in James Cameron’s 2003 movie Ghosts of \nthe Abyss. I am on somewhere on the cutting room floor trying to muster \nthat awestruck look one gets upon seeing alien life for the first time.\n \n \n ——– Original Message ——– \nSubject: one more thing \nDate: Thu, 26 Apr 2012 11:20:01 -0400 \nFrom: David Pennock \n I’ll abuse my final act of spam to add one more thing. For those of you \nremaining, you’re in good hands with Ron. I believe he can do something \nspecial with Labs. In case you’re not familiar with his background, Ron \nis frighteningly smart (Princeton undergrad, Harvard Ph.D.), was a \npioneer in artificial intelligence, wrote a seminal book on Knowledge \nRepresentation, served as President of AAAI, the main AI society, ran \nresearch groups at Bell Labs & AT&T, and is a highly organized, fair, \ndiligent manager who listens actively, gets things done, and, in \naddition is a genuinely nice person. Best of luck to everyone.\n \n Next post: A dream job come true."], "link": "http://blog.oddhead.com/2012/05/05/goodbye-yahoo/", "bloglinks": {}, "links": {"http://blog.oddhead.com/": 1}, "blogtitle": "Oddhead Blog"}, {"content": ["Congratulations to my academic sibling, friend, and Detroit Red Wings fan Pete Wurman , whose company Kiva Systems just became Amazon’s second largest acquisition ever . \n In short, Kiva Systems designs, builds, and operates intelligent autonomous robots to pick and stow products in giant distribution centers for companies like Toys R Us, Walgreens, and Zappos. (The latter is an Amazon subsidiary.) The best way to understand Kiva Systems is to watch their robots in action: an amazing sight to see. Here is a clip from IEEE Spectrum : \n \n In 2003, I remember sitting in the back seat of a car with Pete, him excitedly demo-ing the concept to me via an animated simulation on his laptop, little dots representing robots weaving in and out of each on the screen. (Pete’s laptop was a mac. In grad school, Pete was every bit the Apple fan  I was  and more. He and I programmed HyperCard and Newton together. Pete advocated for simplicity in design before it was cool. When I briefly switched to Windows, he never wavered.) \n By 2006, the robots were real. Pete took me and our shared academic parent, Mike Wellman (who I believe also played an early role in the company), on a tour. Dots on a laptop had become squat orange robots receiving orders, fetching products, avoiding each other, seeking power, and otherwise navigating around a complex environment with computational minds of their own. The designs were inspired: for example, to lift a box, the robot spun underneath it to extend a corkscrew so that the product wouldn’t get jarred. They even added noise in the robots’ paths, so their wheels wouldn’t wear grooves in the floor (call it a floorsaver algorithm). \n By coincidence, a few weeks ago, I was speaking to someone from Amazon who works on optimizing the way people (ha!) retrieve, store, and pack items in their distribution centers and I mentioned Pete’s company. He said “until that happens” he would focus on optimizing their current systems. Little did we (or at least I) know how quickly “until” would come. \n Kiva Systems isn’t just an incredibly cool company run by amazing people. It’s a harbinger of things to come as the world moves inexorably toward an Automated Economy . \n By the way, if you’re worried that robots will take jobs away from people , don’t. The world is a better place with mechanical devices doing mechanical tasks, leaving people to do more interesting and creative things, for example turning crazy ideas into companies. Remember that the purpose of jobs is to produce valuable things and improve the world. Despite political rhetoric, jobs are not an end to themselves. Otherwise, we should all be happy digging ditches and filling them back up, or pumping gas for people who would rather do it themselves . Think about where society should go in fifty or a hundred years when automation can handle more and more tasks. It would be a real shame if at that time people were still “working for a living” in jobs they don’t enjoy simply for the sake of keeping them occupied."], "link": "http://blog.oddhead.com/2012/03/22/congrats-pete-wurman-kiva-systems/", "bloglinks": {}, "links": {"http://bostonherald.com/": 1, "http://marshallbrain.com/": 1, "http://online.wsj.com/": 1, "http://www.kivasystems.com/": 1, "http://www.youtube.com/": 1, "http://ai.umich.edu/": 1, "http://blog.oddhead.com/": 2}, "blogtitle": "Oddhead Blog"}, {"content": ["I am incredibly lucky. Last August, I spent three days straight thinking almost exclusively about one topic: prediction markets, mostly algorithms. Even better, I was in great company: eleven incredible visitors from across the country took time out of their busy schedules to join me at Yahoo! Research NYC in an impromptu “prediction market powwow”: Yiling Chen, Sanmay Das, Lance Fortnow, Nicolas Lambert, Abe Othman, Mike Ruberry, Rahul Sami, Florian Teschner, Jenn Wortman Vaughn, Christof Weinhardt, and Lirong Xia. (Plus fellow Yahoos Miro Dudik, Sebastien Lahaie, and David Rothschild.) It’s amazing to have a job that allows this kind of time for research and blue-sky thinking: thanks Yahoo!. It’s humbling to have such stellar colleagues to work with: thanks everyone who came. It’s also wonderful to see “the kids” (former interns and postdocs) doing so well: Rahul now has tenure at U Michigan, Yiling is a professor at Harvard, Jenn is a professor at UCLA, and Nicolas is a professor at Stanford. (Lirong: You’re next!) \n Here are our notes and here is a photo:"], "link": "http://blog.oddhead.com/2012/03/09/prediction-market-powwow-at-yahoo-research-new-york-august-2011/", "bloglinks": {}, "links": {"http://pad.beeminder.com/": 1, "http://www.flickr.com/": 1}, "blogtitle": "Oddhead Blog"}, {"content": ["In late 2010, I began talking to a very early-stage startup named Slipjockey , based in Salt Lake City. When we first started corresponding, Slipjockey was little more than a good idea coupled with some very basic technology and passionate co-founders. In the time since, Slipjockey has taken appropriate steps to bring their concept to market, including securing a favorable legal opinion and filing a patent for their technology. \n The core concept of Slipjockey is ingenious. It’s a marketplace for buying and selling Las Vegas bet slips. The process starts when someone makes a bet at a licensed Nevada race and sports book. If he or she wants to sell the bet slip for whatever reason — suppose the predicted team is winning in a landslide at halftime and the slip has doubled in value — they can log onto Slipjockey and list it for sale. Another Slipjockey user may agree to buy it. The buyer takes ownership of the bet slip and he or she can keep it or resell it again to another Slipjockey user, etc. The final owner of any bet slip is paid in full directly from the sports book that originally issued the ticket. \n \n Real-time trading on Slipjockey is similar to the action on betting exchanges like Betfair. The key difference is that all wagers must originate from a licensed Nevada race and sports book where gambling is legal. \n The Slipjockey business concept grew from the notion that handicappers should have an option other that win, lose, or push. Slipjockey provides that fourth option by enabling handicappers to terminate their outcome risk, locking in a gain or avoiding a total loss prior to the end of the event. With the growth in live betting (aka “in-running betting”) around the world, and in Las Vegas courtesy of Cantor Fitzgerald , it’s clearly an option that people want. \n Initially, Slipjockey is focused on launching with coverage of US football, tennis, and golf before expanding into other sports. \n I’ve spoken mainly with Ryan Eads and his brother Rory, two of the co-founders. They are smart, well spoken, and tireless entrepreneurs. I have every expectation that, to the extent this idea has wings — and I believe it does — they will make it fly. \n The first question you’re likely to ask is: is this legal? Indeed, that’s the first question I asked Ryan. As a pre-condition to launching, he secured a legal opinion from a former Nevada Gaming Control Board attorney that says, in effect, that because bets originate in Las Vegas and are ultimately paid out in Las Vegas, the Slipjockey exchange is legal. The attorney’s opinion is just that: an opinion, and not a guarantee. But it is convincing and credible. Certainly Slipjockey users are safe. \n Currently, Slipjockey is inviting users to participate in a soft launch for trading National Football League games. To participate, create a profile at www.slipjockey.com and send an email to info@slipjockey.com . Mention that you read my blog post and I’m sure they’ll send you an invitation containing all the details if they have spots remaining."], "link": "http://blog.oddhead.com/2011/10/24/slipjockey/", "bloglinks": {}, "links": {"http://blog.oddhead.com/": 1, "http://slipjockey.com/": 2}, "blogtitle": "Oddhead Blog"}, {"content": ["10 Print \"Hello\" \n That line typed on an Apple II computer in my Dad’s office in the fourth grade got me hooked on computer programming, an addiction I never outgrew. \n Over the years, I’ve had the pleasure of owning, using, or programming on many of Steve Jobs’s creations, including Apple II+, Macintosh IIcx, Power Mac 7100, Newton, NeXT, Powerbook, Macbook Pro, and iPhone. I’ve been a consistent Mac in the Mac-vs-PC battle since 1984 (though I admit to a brief affair in 1998: it didn’t mean anything, Steve, I swear!). Jobs himself ignited an us-versus-them fire, which smolders on today in Apple’s John Hodgman -as-PC ads, back in 1985 with one of his best quotes : \n Playboy: Are you saying that the people who made PCjr don’t have … pride in [their] product? \n [Jobs:] “If they did, they wouldn’t have made the PCjr.” [Playboy, Feb. 1, 1985]\n \n Around that time, my friends and I had a running joke: “I got a PCjr,” one of us would say; “you’re going straight to hell, kid,” the other would shoot back. \n  \n Buried treasure: Old Apple II and Power Macintosh computers, waiting to be dusted off… someday \n My wife and kids (ages 7 and 4) are more recent converts, owning a Duo, an iPhone, an iPad, and two iPod Touches among them. \n I’ve owned Apple stock since about 1997, my single best investment, increasing 4,460 percent. (Priceline is my second best, gaining 3,990%.) \n Like Lance , I’ll never forget where I was when I learned that Steve Jobs had died. Steven Colbert told me. Live. After a hilarious taping of the Colbert Report and four performances by the artist formerly known as Mos Def (apparently a perfectionist: who knew?), Colbert ended by balancing his iPhone on his desk, letting it fall over, then telling us, “Steve Jobs died. Sorry to be the one to tell you.” To say the mood of the audience changed instantly would be an understatement. Smiling faces turned down. Cries of anguish and “oh no!” rang out from nearly everyone in the audience, a mark of how Jobs’s influence and name recognition has grown from tech hero to global cultural icon . (Colbert gave Jobs a proper tribute the next day.) \n There’s a thread in our office about the extent to which perceived success or failure at the CEO level is a fooled-by-randomness trick of the mind. But there are some examples where even the strongest skeptic must admit that an organization’s success is almost surely owed to the exceptional greatness of a single individual. Warren Buffet and Coach K come to (my) mind. But Steve Jobs must be the prime example. As if ushering in the era of personal computing and computer-animated movies was not enough, Jobs continued to outdo himself year after year, with iPod, iTunes, iPhone, and, barely a year ago, iPad. Sadly, or maybe purposefully, Jobs seemed to hit his stride just as he died. As a long-time disciple of Jobs, I’m amazed at the amount of focus in his obituaries spent on gadgets he created in the last ten years. \n Jobs famously advised not to spend too much time celebrating success. \n I think if you do something and it turns out pretty good, then you should go do something else wonderful, not dwell on it for too long. Just figure out what’s next. \n—NBC Nightly News, 2006 \n Those were not empty words for Jobs: it’s how he lived his own life and how he squeezed so much out of the 56 short years he was given. The early storyline of Apple pegged Steve Wozniak as the brains and Jobs as the lucky business-minded sidekick. It turns out that Jobs was way more exceptional than the 1990s nerderati — who like me relate more to Woz — gave him credit for. Jobs had the brains, the vision, and the charisma in a combination so rare I’m not the only one who can’t think of another human alive who compares. To get a taste, read or watch Jobs’s Stanford commencement speech : it’s truly brilliant, inspiring, and one of the best ways you can spend the next few minutes of your time. \n To the ultimate hacker painter , the first last analog , the nerdiest salesman, the studliest genius, the most productive perfectionist, the most detail-oriented visionary, and a personal hero : \n 20 Print \"Goodbye\""], "link": "http://blog.oddhead.com/2011/10/13/goodbye-steve-jobs/", "bloglinks": {}, "links": {"http://www.nytimes.com/": 1, "http://online.wsj.com/": 1, "http://www.flickr.com/": 1, "http://techcrunch.com/": 2, "http://www.npr.org/": 3, "http://news.yahoo.com/blog": 1, "http://news.stanford.edu/": 1, "http://blog.computationalcomplexity.org/": 1, "http://www.paulgraham.com/": 1, "http://blogs.wsj.com/": 1, "http://www.youtube.com/": 1, "http://ezstreetshow.com/": 1, "http://www.thedailybeast.com/": 1, "http://www.amazon.com/": 1, "http://gawker.com/": 1, "http://blog.oddhead.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Oddhead Blog"}, {"content": ["My geek CEO was fired. If you’re wondering whether she deserved it, or Yahoo! is better off for it, or Roy Bostock is a doofus or dorfus , I don’t really know.* But I do have a personal story about Carol Bartz that’s indicative of the kind of CEO she was and the kind of person she is, perfect for Ada Lovelace day , a day to blog about women in science and technology who inspire you. \n In May 2010, my wife Lauren was diagnosed with breast cancer. On Sunday, May 9, 2010—Mother’s Day no less—I received a phone call. “Hello?,” I said. “Hi, this is Carol Bartz,” she said. “Wow!,” I couldn’t help saying. I had never spoken to her before. She proceeded to say how sorry she was for me and Lauren, to reassure us, to ask me questions, and to answer mine. \n More than a year, multiple surgeries, and six chemo sessions later, I’m happy to say that Lauren is past the worst part of the treatment and, to the best of anyone’s knowledge, cancer free. At the time, we were frightened, bewildered, and angry. To me, the most overwhelming feeling was disbelief. Was this really happening to us? It was surreal. Lauren’s strength and sheer will to keep our home life as normal as possible, and her ability to turn the ordeal into a positive is amazing and helped me cope. That my mom and Lauren’s mom went through the same thing also helped. The more we looked into it the more we realized breast cancer was everywhere—shockingly common even at Lauren’s age. (Especially in New Jersey, one of only five states in the top tier for both incidence of and mortality from breast cancer.) The calls to increase the age of first mammogram border on criminal. One silver lining for Lauren has been meeting the amazing support community of breast cancer sufferers, survivors, and their friends. They have inspired her to give back in many ways . My mom, a radiologist and ACR fellow , was herself inspired to specialize in mammography and pursue breast cancer research . \n It turns out, Carol Bartz is a survivor herself and, in addition to being one of the fifty most powerful women in business, is just another member of the breast cancer support community who cares deeply. Carol had over twelve thousand employees. To take the time to call one of them on a holiday weekend to address personal problems and pain shows the kind of leader she is. (And shows the kind of bosses Preston and Prabhakar are, who thought enough to bring it to her attention.) It’s a “Yahoo! moment” and a Carol moment that I remember vividly and continues to stick out in my mind. I suspect most stereotypes of corporate and public leaders as conniving powermad ladder climbers are just that: stereotypes. But still, I’m convinced that not all—probably few—CEOs would do what Carol Bartz did. Goodbye, good luck, and, most of all: Thanks, Carol. \n \n * I will say that I respect Carol’s willingness give her blunt assessment of the board, possibly risking $10 million to do so, and to come right out and say “I was fired” rather than hide behind “more time with family” cliches. I’m not surprised that the board gave their full confidence to her in public just two months before firing her—of course a board always has to say that they have confidence in their current CEO. I am surprised and dismayed that, at least judging by her reaction, it seems the board was also giving their confidence to her in private. That’s HR 101: No one who’s fired should be surprised."], "link": "http://blog.oddhead.com/2011/10/07/thanks-carol-bartz/", "bloglinks": {}, "links": {"http://www.savelady.com/": 1, "http://www.komencsnj.org/": 1, "http://www.mcafee.cc/": 1, "http://money.cnn.com/": 1, "http://postcards.cnn.com/": 2, "http://scholar.google.com/": 1, "http://finance.cnn.com/": 1, "http://findingada.com/": 1, "http://blogs.wsj.com/": 1, "http://www.acr.org/": 1, "http://research.yahoo.com/": 1, "http://www.nytimes.com/": 1, "http://blog.oddhead.com/": 1, "http://www.urbandictionary.com/": 1, "http://www.cdc.gov/": 1}, "blogtitle": "Oddhead Blog"}, {"content": ["The Second Conference on Auctions, Market Mechanisms and Their Applications (AMMA) is next Monday and Tuesday August 22-23, 2011, at CUNY in midtown manhattan. The program, including contributed talks on school choice, prediction markets, advertising, and market design, and invited talks by market designer extraordinaire Peter Cramton and private company stock exchange SecondMarket (where millionaires buy Facebook), look to be excellent. Hope to see you there!\n \n \nThe fourth annual New York Computer Science and Economics Day (NYCE Day) is Friday, September 16, 2011, at NYU. You have until next Friday August 26 to submit a short talk or poster. The goal of the meeting is to bring together researchers in the larger New York metropolitan area (read: DC-Boston-Chicago) with interests in computer science, economics, marketing, and business, and a common focus in understanding and developing the economics of Internet activity."], "link": "http://blog.oddhead.com/2011/08/18/nyc-cs-econ-events-amma-nyce/", "bloglinks": {}, "links": {"http://ammaconference.org/": 1, "http://www.nyas.org/": 1, "http://www.umd.edu/": 1, "https://www.secondmarket.com/": 1}, "blogtitle": "Oddhead Blog"}]