[{"blogurl": "http://omicsomics.blogspot.com\n", "blogroll": [], "title": "Omics! Omics!"}, {"content": ["It's fall, and the foliage in New England is putting on its usual spectacular show.  What isn't showing is any of the progress in nanopore sequencing that I got caught up in last February.  Oxford Nanopore made quite a splash, and I wrote a quite breathless account based on a phone conversation with them.  Since then, other than raising some serious cash , Oxford has been quite quiet, and has neither released any data the community (or at least this blogger !) is clamoring for nor is there any sign that alpha units have been placed.  Genia was another nanopore company making noises about unveiling this year, but now they have l icensed a new nanopore-based sequencing chemistry and promised boxes in 2014.   When will nanopores actually hit the market? Read more »"], "link": "http://omicsomics.blogspot.com/feeds/144878118846811364/comments/default", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://www.prnewswire.com/": 1, "http://omicsomics.blogspot.com/": 3}, "blogtitle": "Omics! Omics!"}, {"content": ["Roughly speaking, NGS sample preparation workflows can be split into two basic classes of workflows.  Complete molecule workflows are currently suitable for microRNAs and other small fragments at the moment, but attempt to capture the entire molecule.  With luck, long read technologies will someday make these the standard.  Fragment workflows are the workhorse, and take input material (RNA, DNA) and convert them into a library of fragments representing (or directly from) the original material.  Read more »"], "link": "http://omicsomics.blogspot.com/feeds/1120752861734374883/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["An email this morning alerted me that BGI Shenzhen is acquiring Complete Genomics.  I hadn't been following Complete's business very carefully and had missed (or forgotten about) their quarterly report in August warning that they were dangerously low on cash and had engaged a firm to look at strategic alternatives.  If you are holding Complete Shares (with the wonderful ticker symbol GNOM), you'll get $3.15 cash for each for them.  If you were unfortunate enough to buy them at the top , that's over $11 a share in capital loss to put on next year's tax returns.  I'm not one to watch stock prices closely.  Buy-and-hold an index fund is my primary investment strategy;  A Random Walk on Wall Street  is the best route to sound sleeping and good returns.  I've never held any GNOM stock. Read more »"], "link": "http://omicsomics.blogspot.com/feeds/2004394994869849338/comments/default", "bloglinks": {}, "links": {"http://finance.yahoo.com/": 1, "http://omicsomics.blogspot.com/": 1, "http://biz.yahoo.com/": 1, "http://www.amazon.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["A news item meant to shock its readers caught my eye, but in the end I was shocked and sickened in a way that I think lay far beyond the writer's intent.  The writer's tale is of a desperate family of a cancer-stricken teenager being taken advantage of by a fame-seeking hoaxer; the tale I read is of a desperate family of a cancer-stricken teenager being fleeced by cancer quacks. Read more »"], "link": "http://omicsomics.blogspot.com/feeds/1308367036749562832/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["If you tour around the extended Kendall Square area of Cambridge, you'll find a number of large construction sites.  Various projects for Pfizer, Biogen, Novartis and more speculative projects are consuming most of the large surface parking lots in the area, and many that are yet untouched (such as the one next to Starbase Athenaeum)  are marked out for development.  There are a number of single story buildings, such as the bank by the Kendall T-stop, which seem likely to also become such sites.  However, on the outskirts of Cambridge just such a proposal has kicked up a serious hornet's nest, and one that suggests that the biotech (and tech) real estate boom here may soon hit a serious wall. Read more »"], "link": "http://omicsomics.blogspot.com/feeds/3209817497907568109/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["When I was a boy, a nearly annual occurrence was a trip to Kentucky to my maternal grandparents' house.  My biological grandmother died when I was quite young, but there would be many visits to see my grandfather.  I enjoyed them greatly, but of course he is now long gone.  So I have a few regrets, and mostly I wish I had thought to ask him a few questions. Read more »"], "link": "http://omicsomics.blogspot.com/feeds/986590183979510311/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["Besides the l ittle cancer genomics piece yesterday, another genomics paper getting quite a bit of popular press attention is the nice work from the NIH tracking down a deadly outbreak of drug-resistant Klebsiella pneumoniae, with 11 of 18 infected patients dying.  Rapid genome sequencing provided a much higher level of detail for tracing the outbreak than older methods, even distinguishing isolates taken from different sites on the same patient. Read more »"], "link": "http://omicsomics.blogspot.com/feeds/5219709237082977722/comments/default", "bloglinks": {}, "links": {"http://stm.sciencemag.org/": 1, "http://omicsomics.blogspot.com/": 2}, "blogtitle": "Omics! Omics!"}, {"content": ["The newswires are alive with summaries of an item in Science Express which, discounting the supplementary material, isn't much bigger than the news articles describing it. It's a nice piece showing the relevance of cancer genomics, but there's also a backstory fleshed out in the news items which is interesting. The gist of the paper is this: a trial of everolimus, an MTOR inhibitor, in bladder cancer did not go well; very few patients showed benefit. But, one patient did spectacularly well. So the researchers performed whole genome sequencing and found inactivating mutations in the well-studied tumor suppressors TSC1 and NF2. Screening 13 more bladder tumors with a panel of cancer-specific genes found 3 more cases of inactivating mutations in TSC1, plus one patient with a missense mutation of unknown significance. In the trial, patients with TSC1 mutations stayed on trial longer than patients without the mutations.  My first reaction was \"this all makes sense\" -- TSC1 and NF2 are genes which immediately suggested themselves as TOR-related.  What's interesting from the news items is a suggestion that the original patient had been sequenced for a limited number of genes around mTOR, and that this did not include TSC1 or NF2. Of course, the problem when doing a limited screen is picking who to include, and from my 2 second analysis on the train I would have included TSC1 and NF2. But, that could be much easier said than done. They are attractive, since they are tumor suppressors known to be mutated in cancer, but so are other genes in the neighborhood (such as TSC2 or PTEN). There are activating mutations known in the neighborhood as well, such as PI3K or various AKT family members. Presumably it was a PCR-based (quite likely Sanger) method, in which case it can be challenging to target every exon both because you may have an \"exon budget\" (number of exons to be amplified) and some exons are nightmarish to amplify.  I think the case illustrates one reason whole genome or whole exome sequence are by far the best strategies in a case such as this. The potential payoff in understanding is huge, as you have one strong outlier patient. The number of patients are small (though, admittedly, this is probably one success pulled from many dry holes). Plus, these days the cost of WGS/WES is probably not much more than targeted PCR, given the costs of developing good PCR assays.  The other potential advantage of WGS/WES, over even broad cancer-specific gene panels, for a case such as this, is that the field can change. New oncogenes and tumor suppressors are identified periodically, perhaps even in the time period between when a panel is designed and it is used. In a research setting to understand the basis of a clinical trial anomaly, it's particularly valuable to explore all corners, because what might not make sense today might become clear tomorrow."], "link": "http://omicsomics.blogspot.com/feeds/5159998050598176569/comments/default", "bloglinks": {}, "links": {"http://www.sciencemag.org/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["Recently, the topic of jackalopes showed up at work.  Anyone who has toured the American West has probably come across postcards of these curious beasts, with the bodies of jackrabbits but antelope-like horns.  Even out East, at some frequency reports of these creatures appear stochastically. Read more »"], "link": "http://omicsomics.blogspot.com/feeds/2961416249515249206/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["I had a bit of a long commute yesterday, driving from south-central New Jersey up to Starbase Cambridge.  In general it's a dull ride, having been done too often.  Still, it was the perfect time to absorb the magnificence of a George Washington Bridge crossing, followed by a great sunrise-lit view  from the loop ramp onto the Henry Hudson Parkway, and similar snippets of the Palisades also glowing in the early sun.  But, much of the time I was flipping through radio stations.  Due to this, I caught the tail end of a NPR interview with Andrew Hacker, who wrote a recent NY Times opinion piece calling for algebra to be removed from the required high school curriculum in the U.S., which has garnered letters both for and against . Read more »"], "link": "http://omicsomics.blogspot.com/feeds/7071337214884588430/comments/default", "bloglinks": {}, "links": {"http://www.nytimes.com/": 2, "http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["In Nature this week (as an open access article!) is a report from Complete Genomics and collaborators describing CG's new \"Long Fragment Read\" (LFR) technology for generating long range sequence information and haplotypes.  Technically, there is a lot of cool stuff -- but excitement for many (such as myself) must be balanced against CG's business model of sequencing only human genomes Read more »"], "link": "http://omicsomics.blogspot.com/feeds/9205751958331921474/comments/default", "bloglinks": {}, "links": {"http://www.nature.com/": 1, "http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["Today's news (take your pick of Bio-IT or GenomeWeb  for original stories) is that Qiagen has bought out Intelligent Biosystems (IBS), the company in nearby Waltham developing a platform using sequencing-by-synthesis chemistry licensed from Columbia University Read more »"], "link": "http://omicsomics.blogspot.com/feeds/7665785818638512434/comments/default", "bloglinks": {}, "links": {"http://www.genomeweb.com/": 1, "http://www.bio-itworld.com/": 1, "http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["A piece of advice for anyone in the bioinformatics world: get working knowledge of the Amazon EC2 cloud computing system. Now, there is a lot of controversy over whether EC2 (or other cloud services) eliminate the need for a mongo local compute resource, but even if you like doing things at home there are multiple niches that Amazon can fill. It can be your experiment sandbox, which can be quickly shut down if something goes haywire. It can be overflow capacity, dealing with a sudden surge of comp Location ute need. It can also be a reserve for if your main system is experiencing hardware issues. Or it can be a neutral zone for collaborating with someone outside your organization's walls. Or it can be where you do your consulting work (approved, of course!) that is independent of your organization (or between organizations). Or anything else; it's there and it's likely at some point you could use it, if not now then in the future. Better yet, you can get your feet wet with their Free Tier of services, which of course is a hook to try to get you to consume more. Don't be scared off by the wide array of different services Amazon offers. You certainly need to understand only a few to get started, and many are really intended for e-commerce sites and the like. I've probably used less than half a dozen services from the menu, though I'm sure there are a few more I could use profitably.  One catch with EC2 is that you are going to do a lot of low level UNIX systems administration, something I've generally avoided in my career. I've been able to because I usually have a few UNIX gurus close enough by to do all that, and besides it's been in their job description and not mine! The few times I have dabbled have been mixed. At Harvard I once burned a day getting a printer back on the network, but was compensated by that lab's PI with a gift certificate for yummy bread. On the other hand, at one of my employers I succeeded in disabling my server, which could only be restore by re-installing the OS. Again, one reason to consider Amazon for a sandbox!  What do I mean by low level? Well, with the nice web GUI you fire up a machine. Note that any disk attached to that machine by default is (a) too tiny for real work and (b) will go away when you kill the machine. If you want big, persistent storage you need to create an \"EBS Volume\". With the GUI you create the volume and then attach it to the machine, but at that point it is useless. Using low level UNIX commands you need to now format the drive, create an attach point, mount the drive and set the permissions. If you want password-less SSH between nodes, that's a few more configuration file tweaks. Not rocket science, but tedious to do time after time.  A past colleague and friend of mine recently let me know about STAR::Cluster , and this free software is amazing. It automates not only the UNIX toil and trouble I found tedious, but other low level stuff I hadn't gotten around to yet. For example, every EBS volume in the cluster is NFS-mounted to all the nodes, which is critical for some operations (though other tools, such as MIRA , are positively allergic to such setups, as the extra IO traffic kills performance). Plus, your cluster comes loaded with useful cluster tools such as OpenMPI and the Sun Grid Engine job queuing system.  Each of these is useful for bioinformatics. For example, OpenMPI is the framework for the nifty Ray assembler. Ray can handle your really big de novo assembly jobs, as it allows you to spread the job out across multiple nodes. In contrast, on Amazon you are very limited by tools such as Velvet because they can work in the memory of only a single machine, and the biggest machines at Amazon aren't very big (about 68Gb). Celera Assembler can use the Grid Engine, which is pretty much essential with that assembler. Furthermore, under Amazon's pricing model to get big memory you must rent a lot of cores, and for a single core tool that's a bit of a waste.  So for now, I'm loving STAR::Cluster but forsaking spot clusters. That is, until I figure out a way to divine the correct bidding strategy, which may require the services of a cauldron and some eye of newt .  STAR::Cluster has mostly behaved for me, but I have had a few hiccups in which nodes didn't quite come up as planned. I don't know why, and in one case I reverted to doing the low level work to fix it (indeed, I finally learned how to NFS mount a volume). In the other case, I couldn't figure out a solution and had to kill the damaged nodes. Still, most times everything has gone as planned.  However, STAR::Cluster also tempts you with spot instances, which have not been productive for me. Amazon's pricing is a 3-dimensional grid: where is the machine, what is its capability and which pricing scheme. On the where side, most times you probably just want cheap, which tends to mean one of the US sites (their Asian sites are definitely about 10% more expensive to use). It is useful to stay in one location, as only when EBS volumes are in the same zone as a compute instance can you attach (and then mount) that volume on that machine.  As noted above, capability spans a number of machine classes. I tend to go for two of them. The 32-bit instances are cheap (about the cost of a newspaper per day) and useful for maintaining a permanent presence for uploading & downloading files, but are under-powered for much else. At the other end, I tend to use the premium-priced high-memory quadruple extra large instance, because this gets the most compute power and memory for the standard instances, which tends to be needed for the projects I'm offloading to Amazon like huge short read assembly or mapping efforts. I haven't tried out the cluster compute instances yet, which are even pricier but may yield higher performance (faster networking and power) nor have I tried the GPU instances; both are likely in my future.  After these, Amazon offers three pricing schemes. On demand instances are simple to use: you fire one up and pay for each hour you use it; make it go away and the meter stops turning (rounding up to the next hour, of course). If you are using the system heavily, then a reserved instance involves an upfront payment but a lower per-hour cost. Catch is, for each instance you want simultaneously you'll need to reserve another one. The third scheme is interesting but can easily scorch your fingers: spot instances .  A spot instance is charged the current market rate for an instance of that type. Much of the time, it's half the cost of an on demand instance, and when you have a cluster of big instances running at $45/day per node, that's not trivial. However, you put in a bid for the maximum price you are willing to pay. Should the spot price exceed that price, your instance can die instantly with no warning. You can browse the prior history of a spot instance in your selected zone and get some idea, but so far I've been very unlucky. Despite putting in spot prices well above the apparent previous price spike, new price spikes have bumped off my instances.  The big problem for me is that none of my applications can tolerate croaking in mid-operation. Apparently there is a way to do this with Grid Engine, and apparently Ray can work off Grid Engine and probably Celera Assembler can be restarted automatically, but I'm not yet to the point of understanding how to do these. So, having a cluster die late in a process is an expensive disaster, with the clock completely reset. So, after multiple misadventures I've sworn off spot instances for now, which is probably costing the company significant dollars but now I'm not losing sleep -- and those aborted runs weren't free.  So STAR::Cluster lets you boil your data without a lot of toil and trouble"], "link": "http://omicsomics.blogspot.com/feeds/538977302856297302/comments/default", "bloglinks": {}, "links": {"http://sourceforge.net/": 2, "http://aws.amazon.com/": 4, "http://www.potw.org/": 1, "http://www.ac.uk/": 1, "http://www.open-mpi.org/": 1, "http://www.blogger.com/blog": 1, "http://en.wikipedia.org/": 1, "http://web.mit.edu/": 1, "http://mira-assembler.sourceforge.net/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["The annual BIO meeting will be in Boston next week, so the media is looking a little bit more at our sector. Today's Globe has an Op-Ed from Geoff MacKay, the CEO of Organogenesis, titled \"Keeping Mass in biotech race\" (or, online, \" Fueling the next wave of biotech growth \" . Reading it, I've been kicked out of my posting inertia, as it touts exactly the sort of strategies which I believe are mistakes, with recent events nearby providing evidence. MacKay's lead-in is that Massachusetts has a thriving biotech industry and that this contributes in important ways to the economy of the state. No argument there. He goes on to describe how other states and countries are eagerly trying to lure companies away, which is certainly true. When BIO Nebraska offers convention-goers Omaha steak tips at the end of a long day, or when BIOTECanada supplies Tim Horton’s doughnuts and coffee for thousands at breakfast, they are not just showcasing their hospitality. They are firing the opening salvo in an aggressive marketing campaign that may include strong financial incentives, tax breaks, lower labor costs, and, in some cases, a fairly convincing argument about quality of life benefits outside of our state. MacKay knows this well, because as he continues his own company was heavily recruited a number of years ago, and only when Massachusetts laid out a package of financial incentives did Organogenesis commit to stay. Now, I do not believe I'm a Mass biotech snob, and there are certainly many companies that do very well outside hub areas such as Boston, the Bay Area or the D.C. Metro area. But, my suspicion is that many of those companies do well because they grew organically in their location, and I also believe there are many real costs to a business in operating outside of the hubs. For some companies, the benefits outweigh the negatives, but that is even less likely if you move to such an environment. A key advantage of being in a hub is a supply of experienced staff. Biotech has its ups-and-downs, but because there are so many companies in the Boston area there are lots of folks who are looking for positions. When you are the hiring manager, that means you can look carefully for the right fit yet find someone relatively quickly. Big tech hubs like Boston also mean that there are more opportunities for spouses and life partners who are technically oriented, and while that doesn't describe my situation it does seem that an awful lot of senior biotech folks share their lives with other senior biotech folks. I'm also suspicious that many CEO's know all this, and simply rationally play states against each other to their company's benefit. However, there are plenty of examples of CEO's who aren't so sophisticated, with the former management of BiogenIdec serving as one data point. A few years ago someone had the brilliant idea of moving the non-R&D folks outside the Cambridge headquarters to the tony town of Weston, which happened to be where the then-CEO lived. Those who had to live with this decision rapidly discovered the sheer inefficiency of it, as while the organization chart might have shown a clean split the reality is that communication must flow throughout an organization, and communication is often most effective face-to-face. As far as incentives, there is a danger that Massachusetts politicians will soon forget the recent blow-up of 38 Studios (indeed, I thought about titling this \"38 Reasons States Shouldn't Bribe Companies to Stay\", but who's going to read something that threatens you with 38 bullet points?). Curt Schilling started and ended his major league baseball career in Boston, and played a key role in the 2004 drive to a World Series victory, most memorably while playing with a jury-rigged ankle repair that visibly bled during the playoffs. At the tail end of his career, he became known both for loudly espousing a free-market approach to the economy (he was even mentioned as a possible candidate for political office) and for a deep interest in sophisticated video games. Schilling founded a company which ended up being named for his uniform number, 38 Studios . The goal was to produce a new generation of online multi-person video games. After starting in Massachusetts, he successfully wangled a $75M loan guarantee from Rhode Island on the condition that the company move there and create a set number of jobs. Amazingly, Massachusetts officials refused to make a sweeter offer. 38 Studios' first game arrived this past winter and was greeted with critical praise but relatively modest sales. More importantly, in the meantime the governor's chair in Rhode Island switched from someone who had spearheaded the deal to someone who publicly opposed it. This spring, it all blew up rather spectacularly. Rhode Island realized that 38 Studios was in serious trouble, and was asking for an advance on some additional tax credits (which it could in turn sell). Governor Lincoln Chafee, was clearly not in favor of further aid, though did consider it. 38 was also due to make a payment on one of the loans, and looked like it might miss and default on the loan. To much fanfare, the company delivered a check for the amount -- but it soon came out that they had tried to quietly tell RI not to cash it immediately, because it would bounce! Later, it would come out that the company hadn't been making payroll for several weeks. The whole incident underscored multiple points of why governments should not be directly funding businesses. Schilling had a passion for the business, but no experience. A good VC (I'm not claiming these are universal or common, but this is my experience) would help guide the company; politicians are completely wrong in this goal. Schilling would later complain that Chafee's dire pronouncements on the company had killed a potential financing deal, but one of the Business 101 lessons apparently never taught to #38 by his agent is that if you don't have contractual control over who says what, then anybody can say anything. In any case, if public money is at risk then the governor is ethically obligated to speak up. The state also had no business investing so much in a single risky company. Just the financials looked ugly; 38's next game was at least a year from delivery and they were carrying hundreds of employees. Given media reports, it seems not unlikely that 38 Studios was going to go $150M-$200M in the hole to develop the game, which could only be justified by absolutely chart-topping game sales. RI was effectively also help fund economic activity in other states, as 38 Studios had acquired other companies along the way. Massachusetts can't be smug about 38 Studios, as it bet a similar outsized amount in a green energy company called Evergreen Solar, which also went bust. Solyndra in California has been a national example. If the pols really feel they must spend, there are good ways to spend that money. Unfortunately, that spending is much more spread out and doesn't quickly generate a bunch of jobs which can be claimed to be the direct result of the legislation. Of course, many such jobs really aren't -- many would have been created already. One core area in need of investment is transportation. The MBTA system is creaking along due to deferred maintenance and delayed rolling stock replacement, and probably needs billions of dollars. A recent Globe front page graph showed clearly that MBTA ridership growth continues at a steady clip, but there hasn't been service growth to match. Indeed, due to equipment shortages that spacing of trains on several lines is growing. After the T, there is the expansion of the Hubway bicycle system beyond the small core region served now. If you never use the T or Hubway, just remember that riders on these systems would probably be in cars competing with you on the roads. Housing continues to be expensive in the Boston area for a variety of reasons. While some of this is deliberate and chosen (such as towns wanting to manage their population densities), there are many opportunities for government to foster housing development in ways that will encounter little resistance. Cleaning up brownfields and streamlining permitting processes are obvious ones. There's also the local environment. Workplaces are more appealing when they are near parks, restaurants and other amenities. The Globe today also had an item on the conversion of individual parking spots to miniature parks, and idea that has a lot of merit as long as it isn't overdone. Exploring ways to add more food and entertaining options, ranging from expanded night hours, additional liquor licenses for very small trendy bars and food truck zones, these are all the obvious purview of government. Finally, there is that issue of training. The area's premier universities and colleges play a key role in providing scientists, and many of the existing companies groom new executives. Where the state should play a role is fostering training programs at the high school and community college level to prepare a healthy cadre of research technicians, which during the boom years at the end of the last century were in short supply. Many of the skills that go into such training, such as keeping meticulous records, following procedures to the letter and learning how to capture and report data, all are valuable in non-biotech fields. Perhaps that is my overall theme. If government wishes to enhance the biotech industry, or the robotics industry, or the computer services industry or the myriad of other exciting sectors in the local economy, the wrong way is to try to throw money at individual industries or companies. Targeted tax breaks and loan guarantees are rarely deployed well, are often timed badly, and benefit few outside those targeted. Broad improvements to the transportation, park and educational infrastructures will pay dividends for every industry and all of the citizenry. Let gullible states throw their money away luring a few gullible companies; invest instead in across-the-board improvements which will both boost the current crop of companies as well as enable new exciting industries that don't even exist yet."], "link": "http://omicsomics.blogspot.com/feeds/5626665142045596596/comments/default", "bloglinks": {}, "links": {"http://www.bostonglobe.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["I've slipped back into a lack of posting again.  Some of it is a residual from my recovery this spring from surgery (physical therapy can really be draining), and a lot is due to being really busy in the day job (finding highly rare substances like dilithium is not easy), but in the end those are incomplete explanations.  What should be really embarrassing is that I got access to Nick Loman and colleagues' comparison of benchtop sequencers several days before it published, and here it is weeks later and I'm finally getting around to covering it. Read more »"], "link": "http://omicsomics.blogspot.com/feeds/764794115862932017/comments/default", "bloglinks": {}, "links": {"http://www.nature.com/": 1, "http://en.wikipedia.org/": 1, "http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["Tonight I will continue the recent trend of punching these out on some magical date.  Now, I usually have some sorry excuses for my erratic writing, but for once I actually have something bordering on reasonable.  Just after writing about Oxford Nanopore , my confidence in my skiing skills exceeded my actual skills, resulting in my femur taking on my tibia.  Here for sure, size matters, and the tibia lost horribly..  Read more »"], "link": "http://omicsomics.blogspot.com/feeds/6212522758914409059/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 2}, "blogtitle": "Omics! Omics!"}, {"content": ["A serious issue which has been raised often both by myself and commenters is the challenge of properly evaluating sequencer performance prior to widespread commercial availability of a platform.  A number of roads have been frequently taken, but each have their issues.  Data generated by a company is always met with suspicion.  Alpha releases are often to academics connected to a company, which has the advantage that they are likely the most passionate about proving its worth, but the downside these users may not be viewed as fully objective.  Beta (or early release) sites are often less connected to a company, but by the time they publish their results through peer-reviewed journals it is long since commercial launch.  Conferences such as Marco Island help shorten the cycle time, but not entirely.  Early users are sometimes also suspected of having agreements which give the platform makers the power to squash bad data.   So how can a manufacturer gain \"street cred\" for their instrument Read more »"], "link": "http://omicsomics.blogspot.com/feeds/8547819147768741855/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["I've tried pretty hard to keep this blog focused on all the omics, but occasionally take the license to stray to my other interests, primarily one of them.  Tonight is the Oscars, and I have a plea for the movie industry.  Now, I realize the overlap between readership of this space and the big wigs in Hollywood is tiny, but perhaps a friend-of-a-cousin-of-a-spouse-of-a-sibling of a reader can make a difference.  It is this simple: you have less than two years to get off your rears and launch a Blu-Ray 30th anniversary edition of an Oscar-winning picture. Read more »"], "link": "http://omicsomics.blogspot.com/feeds/901050959840258459/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["Last week's piece on Oxford Nanopore got a lot of attention and a lot of comments, which to me is the true mark of success in this space (discounting the higher than normal spam attempts).  A couple of folks were kind enough to tweet a link (now captured in Nick Loman's wonderful tweet archives for AGBT 2012), and it was also picked up by Matthew Herper at Forbes, Dan Kobolt at MassGenomics  and others (apologies for all I haven't shouted out).  It also can't be denied that some of those comments felt I had been too generous / gullible with Oxford Nanopore Read more »"], "link": "http://omicsomics.blogspot.com/feeds/422511129807184951/comments/default", "bloglinks": {}, "links": {"http://www.forbes.com/": 1, "http://pathogenomics.ac.uk/blog": 1, "http://www.massgenomics.org/": 1, "http://omicsomics.blogspot.com/": 2}, "blogtitle": "Omics! Omics!"}, {"content": ["Oxford Nanopore's AGBT presentation should have just finished up, so the embargo is off.  Oxford was kind enough to chat with me last night and to share their press release in advance; on the call were CTO Clive Brown, SAB member Ewan Birney and Director of Communications Zoe McDougall.  A real challenge posed by Oxford's news is trying to write about it without slipping into   clichéd  t echspeak about what they will be releasing later this year (\"second half\"). Read more »"], "link": "http://omicsomics.blogspot.com/feeds/6936082116358130964/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["This summer will make it twenty years since I first heard of the concept of nanopore sequencing.  A very affable post-doc in George Church's lab was starting some experiments in the concept.  Unbeknownst to any of us, another group at Harvard in the Biolabs (Dan Branton's) was also working on a nanopore sequencing technology.  In the time since then, the field has generated many papers and much speculation, but no workable sequencer.  I had started joking a few years ago that nanopores were the monorails of sequencing: always the technology of the future.  To be a bit more fair, nanopores had started to resemble nuclear fusion, a tantalizing vision always just out of technological reach.  Read more »"], "link": "http://omicsomics.blogspot.com/feeds/127740096145957603/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["One of the most widely-publicized error modes with Ion Torrent and 454 sequencing has been the challenge of correctly counting the number of bases in homopolymer runs.  Because these chemistries use non-terminating nucleotides, polymerase is free to add as many as possible.  Unfortunately, the signal linearity breaks down, making it difficult to correctly count.  Ion Torrent today released a note on homopolymers, but rather than plowing this well-trod ground it goes for a less publicized problem: Illumina having a more specific challenge in this department.  The note is available on the Ion Community , free registration required. Read more »"], "link": "http://omicsomics.blogspot.com/feeds/3523891109914791283/comments/default", "bloglinks": {}, "links": {"http://lifetech-it.jivesoftware.com/": 1, "http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["Due to a business dinner & general exhaustion, I turned in early last night & was caught unaware this morning of the big news: Roche is making a hostile takeover bid for Illumina.  Ugh! Read more »"], "link": "http://omicsomics.blogspot.com/feeds/2085184113321386031/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["I actually awoke today expecting an exciting press release , but I sure wasn't prepared for the big announcements from Ion and Illumina.  Not that they were totally unexpected, but there's a huge difference between speculation and announced products (which, of course, are hugely different from ones you can actually buy!) Read more »"], "link": "http://omicsomics.blogspot.com/feeds/6744384556288991894/comments/default", "bloglinks": {}, "links": {"http://www.xconomy.com/": 1, "http://omicsomics.blogspot.com/": 1}, "blogtitle": "Omics! Omics!"}, {"content": ["Ion Torrent quietly released a set of paired end datasets over the holiday break.  This is a bit embarassing for me, as in my last post on Ion I stated the platform \"will probably never have paired ends\" and in fact Ion had already announced the protocol.  Oy!  I also missed their mate pair protocol being released, though the document itself is another victim of Ion's incredibly counterproductive security policy.  If you don't own a PGM, you can't access the document -- never mind if you are trying to plan for a potential buy or are preparing a library for a friend/collaborator to run.   Read more »"], "link": "http://omicsomics.blogspot.com/feeds/1233022699318084035/comments/default", "bloglinks": {}, "links": {"http://omicsomics.blogspot.com/": 2}, "blogtitle": "Omics! Omics!"}]