[{"blogurl": "http://malkarouri.wordpress.com\n", "blogroll": [], "title": "On Another Dimension"}, {"content": ["This is a simple story. The first aim is to test wordpress publishing to facebook. The story uses the well known Blind Men and an Elephant . \n   \n Once upon a time, a number of blind men came to an elephant. Everyone of them touches a part of the elephant and describes it according to what they felt. “It’s like a tree branch” says one. “It is like a wall” says the other. “No, no. It’s like a rope, a smooth rope. How can you get it so wrong?”. “Rope, really? More like a pillar. It is strong, round and seems to be built of a single stone.”. \n How the story continues is different in the different versions. How the story continues here is up to you: they may collaborate to give a complete description of the elephant. They might clash. A passer by may see the elephant and explain the situation to them. They may agree to disagree. It’s up to you, really. \n   \n The Sudanese version: a lot of people see different institutions not fit for purpose. The Ministry of Finance is not working right. The telecom industry is broken. Of course the National Electricity Corporation is mismanaged. Ditto for Sudatel. Central Bank of Sudan is not efficient as a central bank should be. Civil Aviation Administration is responsible for accidents. University of Khartoum is malfunctioning. Khartoum Teaching Hospital is disgusting. Grid computing is in the hands of amateurs. Major waste of money in construction projects. \n How the story continues is, again, up to you. But, please, remember one thing. Prolonging the breakdown of Sudan is not in the interest of any of you. But that is the subject of the next post. Titled: “the Ongoing Somalification of Sudan”. \n   \n Have a nice day."], "link": "http://malkarouri.wordpress.com/2012/08/31/the-sudanese-elephant-and-the-blind-men/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "On Another Dimension"}, {"content": ["This is a learning principle that may or may not turn out equivalent to the principle of indifference , depending on how it fleshes out .."], "link": "http://malkarouri.wordpress.com/2012/03/17/the-principle-of-least-identity/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "On Another Dimension"}, {"content": ["In response to http://www.cicfcinc.com/uofk/html/response_01.html \n Thanks Omer Elsayed for your responses. I will try to show my point of view in each according to your numbering: \n \n I actually like the fact that you are doing the impartial analysis, which nobody else is doing (at least publicly). This is a good starting point. My point is that you lack some of the pertinent facts, which ties with point 3 in the sense that I should give examples I guess. \n “ It makes no difference if you are a member of the National Congress Party or the Communist Party! Members of the current Parliament are due for an election at some point of time .” I have actually been vague (as you said) on many points precisely because saying my opinions about somethings would carry the risk of torture up to (and including) death as far as the history of the current government is concerned. I have studied in Her Majesty’s Kingdom, and have voted there for the past two elections. Fair elections needs the existence of certain rights including free press and the rule of law: I won’t try to campaign for a change of law in the UK if I know that I can be punished extra-judicially by, say, the MI5 breaking in my house at the middle of the night and carrying me off to God knows where. As for the democratic process you know, if it exists here I would be in total support of your whole agenda. \n As an example, do you believe that closing the university was actually necessary according to the laws, or could the administration have taken some other path forward? (I am afraid I cannot give a better example without rubbing someone with power the wrong way) \n Totally agree. I just meant that the 1995 document might not reveal the whole picture to you. Example is the next point. \n The deans are recognised individually. The Council of Deans is created by the Vice-Chancellor who invests some of his powers in it as explained by Prof. Sami Sharif in many posts here. In particular, closing of the university is taken by the council under these invested powers, not under those of the individual deans. \n In short, many Sudanese including those in power lack the ability to manage. This has reflected in the tendency for micromanagement and dictatorship among Sudanese as evidenced by its modern history. In fact, I perceive the fact that none of the people in Sudan is willing to carry out the exercise you are doing as a small example of the lack of understanding of the concept of building concensus. See also the Sudanese government negotiations with internal and external and internal groups. (If people like General Lazarus Simboyo wrote books about Sudanese negotiations I would certainly buy them) \n I would agree with that, though work on a larger scale may be necessary. Thanks for the flattery! \n May be I am a bit frustrated, but bear in mind that my relationship with the university extends back to when I was born to a university PhD student in a scholarship paid by the U of K. He still works at the university, and I did work a few years here as well. I believe I am in a situation to compare a few successive generations of administration under various governments. Anyway, what I did mean is not the lack of theoretical knowledge or ability to master whatever skill they have the inclination to have. I meant a certain fact (which you may add to your collection) that the university has lost a large number of senior staff over the last few decades. For example, according to Prof. Sami Sharif, the university has only 35 full professors under the age of sixty. According to the web site (http://www.uofk.edu/en/slide/facts-and-figures.uofk) the university has 119 professors. We have lost organisational knowledge including experience in dealing with past crises. Just think what does that mean in terms of the senate and the governance of this institution. I can count 14 vice-chancellors since 1989, think how much experience is lost. \n The background given might not relate directly to the reopening of the university, but it should give you an idea why your suggestions to that end might not work. You seem to be assuming that the administration and the students can overcome their differences by trusting various governmental apparatus, from the judiciary to the ministry to the electoral commision probably. While I fully support building concensus to work towards a solution the way you are working towards, I believe that a number of tools that should be available to you actually are not. For example, you can’t assume that the Magna Carta or habeas corpus or its equivalent holds. As for the two points: in the first point I did not crucify the staff, just stated that they lack experience. I do agree with the writer that the university has a high quality of graduates in terms of academic distinction. As for the second point: Dr. Mamoun Humaida was the vice chancellor until 1994, so you need to check the act before the 1995 act. (My guess is that one of the reasons the law was changed was because of the well-known conflict between Mamoun and the then Minister Ibrahim Ahmed Omer, but I digress). Also note from the article that the university has no legal recourse to recover assets it lost to governmental agencies. I would add here that the last vice-chancellor did try to recover some of these, but governmental agencies by and large cannot be subjected to the law unless an internal political conflict in the governing party facilitates so. I alluded to this is my point about the rule of law. \n I never claimed your conflict of interest, and I have no reason to. I would tell you one thing: I would support your mission as you define it if you can guarantee my personal safety if I try the “legal” channels including a media campaign and electioneering to advocate changes to government and/or university laws. As it is, I have almost gone too far but it is less likely to be punished for writing in English. Also, my belief that I can flee the country (I have dual nationality) is the main reason I feel I can speak this much. In support of such a statement, I draw your attention to the two students currently under extra-judicial arrest. \n Related to the above point: if you can guarantee that the rule of law will be upheld by the government apparatus, and that the students can get their due rights by pursuing legal action, I believe that you will find them more amenable to negotiations. \n \n My personal belief is that the current U of K problem can be solved partly or wholly by building confidence, and I have mentioned the importance of confidence building measures. If you still want to pursue this issue, I suggest you work it taking into account that Sudan is effectively a failed state. That is not to say that the problem can’t be solved, but that building confidence needs a different route than relying on a sham democracy, the type of “democracy” prevailing in Egypt in the Mubarak era. \n In short, equality before the law is a precondition to democracy."], "link": "http://malkarouri.wordpress.com/2012/02/08/democracy-needs-democracy/", "bloglinks": {}, "links": {"http://www.cicfcinc.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "On Another Dimension"}, {"content": ["Python: \n \ndef greet():\n name = raw_input('Name:')\n print \"Hello, %s\" % name\n return name"], "link": "http://malkarouri.wordpress.com/2011/10/21/testing-source-code-highlighting/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1}, "blogtitle": "On Another Dimension"}, {"content": ["Given vectors and , the three quantities , and are very interesting indeed. \n In fact, the concept of inner product vector space revolves largely around those quantities. The underlying mathematical fact is the Cauchy-Schwarz inequality , which is a corollary of the axioms of an inner product vector space."], "link": "http://malkarouri.wordpress.com/2010/10/29/the-three-musketeers/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1}, "blogtitle": "On Another Dimension"}, {"content": ["Looks like I could use some order. \n Having to juggle many balls, I decided that some streamlining is needed. My first approach is to try some variation of the Getting Things Done approach, using Things . \n Easing myself into this. I will start by using it as a glorified to-do list. I hope to be able to report progress here (I guess this is the first to-do:). \n I am also looking at other software to simplify software development workflow. I will start by using the Mercurial version control system."], "link": "http://malkarouri.wordpress.com/2010/02/07/personal-workflow/", "bloglinks": {}, "links": {"http://mercurial.selenic.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.davidco.com/": 1, "http://culturedcode.com/": 1}, "blogtitle": "On Another Dimension"}, {"content": ["The concept of Concentration of Measure (CoM) quantifies the tendency of an -dimensional probability distribution to “lump” or concentrate around an -dimensional submanifold. The phenomenon is that this tendency is especially large in high dimensions. Viewed another way, this is about the interaction between probability and distance in high dimensions. \n This is (hopefully) the start of a series of posts that will explain this concept. I would like to review a few concepts and definitions first though. \n We denote by a metric measure space of metric and probability measure . A probability measure is in effect a normalised measure, such that the measure of the whole space is 1. In such a space, the -extension of a set is denoted by and is defined as . Of course, the -extension of includes all of . What it does more than that is that it fattens by width . Among other things, this means that is a shell enveloping , and that for small values of , this volume (measure if you want to be pedantic) is approximately the surface area (surface measure) of the set multiplied by . \n Now we can define the concentration rate of a space. The basic idea is: of all the sets that span half of the total volume of the space, find the one whose -extension spans the smallest volume. We then declare the concentration rate of the space to be the volume outside that extension. In math terms: . \n A few points can be made here. First, one would expect the set whose extension spans the smallest volume to be the one which has the smallest surface area, by virture of the relation between them. And in fact, one would be right, and this is the subject of the Isoperimetric Inequalities . Second, the concentration rate is the maximum volume outside an extended half-volume space possible, so using this property amounts to utilizing certain inequalities to limit, say, the volume of error. This is useful, for example, in the analysis of randomized algorithms. Third, the current definition yields one sided inequalities, but it is very easy to see that two sided algorithms can be derived which limit the volume outside a shell of width around the surface of any set of half volume. \n The more the measure is concentrated around a half-space, the smaller the concentration rate is. What we really want, and what CoM is about, is a very quick decay of the concentration rate as increases. This will be useful for us to decide in a learning algorithm which value of to cut off learning at with small probable error. But that is for another day. \n And yes, it would be good if Posterous supported Latex.."], "link": "http://malkarouri.wordpress.com/2009/05/27/concentration-of-measure-i-3/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 2}, "blogtitle": "On Another Dimension"}, {"content": ["This Posterous service looks like a great thing. \nThe picture attached is the ratio of the volume of a hyperball to its \ncircumscribing hypercube in N dimensions. \nThe mathematical relation is actually . \nI need to review both the relation and the latex text as I am writing \nfrom memory, but this should be good enough for a test post."], "link": "http://malkarouri.wordpress.com/2009/05/09/testing-posterous-and-the-ratio-of-the-volumes-of-hyperballs-and-hypercubes-in-high-dimensions/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://posterous.com/": 1}, "blogtitle": "On Another Dimension"}, {"content": ["This is simply brilliant. Humans have always been good at visualisation, and puzzles always generate more interest in study than dry math symbols. I was just going to comment on it there, but there is more to this than meets the eye, so I will have to expand this entry. Stay tuned!"], "link": "http://malkarouri.wordpress.com/2009/01/19/factoring-by-stealth/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://numberwarrior.wordpress.com/": 1}, "blogtitle": "On Another Dimension"}, {"content": ["There should really be a sarcasm tag in HTML. \n Hyperspaces look to be a hugely advanced method for Multidimensional Separation of Concerns. Unfortunately, separation of concerns is one of the most slippery concepts in computer science. I will certainly remember the day when somebody actually explains what a concern is. And no, vacuous definitions don’t count. \n Interestingly, the concept in Dijkstra’s “ On the role of scientific thought ” makes a lot of sense. The words aspect and concern are used in their natural English meaning, and the whole piece is essentially a call for divide and rule which is essential in all science, to use Ceteris Paribus assumptions. Else, can someone explain Dijkstra’s “It is being one- and multiple-track minded simultaneously.” in a computer science perspective? \n Best worded definition so far is this : “So what is a cross-cutting concern? A concern is a particular concept or area of interest. For example, in an ordering system the core concerns could be order processing and manufacturing, while the system concerns could be transaction handling and security management. A cross-cutting concern is a concern that affects several classes or modules, a concern that is not well localized and modularized.”. At least, when a concept is not directly well defined, examples give you something to go by."], "link": "http://malkarouri.wordpress.com/2008/12/03/multidimensional-separation-of-concerns-bad-command-or-file-name/", "bloglinks": {}, "links": {"http://www.ibm.com/": 1, "http://www.utexas.edu/": 1, "http://jonasboner.com/": 1, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 2}, "blogtitle": "On Another Dimension"}]