[{"blogurl": "http://orgtheory.wordpress.com\n", "blogroll": [], "title": "orgtheory.net"}, {"content": ["After a rough evening with Hurricane Sandy, daybreak has revealed that some of us have fared better than others. Lower Manhattan and parts of the outer boroughs, Long Island, and NJ are currently without power . The MTA subways are down because of extensive flooding , although MTA bus service started tonight on several routes . Limited MTA subway service is anticipated to start Thur., Nov. 1. \n Many in the local area need help or want to help. If you have friends, family, or colleagues in the NYC area, please let them know about the following resources and volunteer opportunities: \n Volunteer opportunities for those who want to help \nIf you are local, you can volunteer – try here or here . Alternatively, e-mail your name and borough to nycservice@cityhall.nyc.gov \n The Food Bank for NYC is looking for volunteers . \n The Red Cross is also coordinating volunteers at shelters . \n Resources for those who need help \nTo report storm damage to residences or businesses, which will help NYC document need for federal relief, please go here . \n  Federal Emergency Management Agency Resources for Disaster Survivors \n NYS Department of Homeland Security & Emergency Services One-Stop Information Page \n Hurricane Sandy Helpline for New York State Residents: 1-888-769-7243 / 1-518-485-1159 \n  NYC List of Emergency Shelters for Hurricane Sandy \n  Red Cross help in your area \n Updates on NY state are available on governor Cuomo’s website . \nUpdates on NJ state are available on governor Christie’s website . \n If you have useful links, please add them to the comments. Thank you."], "link": "http://orgtheory.wordpress.com/2012/10/31/how-to-get-help-or-offer-help-in-the-nyc-area/", "bloglinks": {}, "links": {"http://www.coned.com/": 1, "http://www.nyredcross.org/": 1, "http://feeds.wordpress.com/": 1, "http://www.redcross.org/": 1, "https://www.facebook.com/": 1, "http://foodbanknyc.wufoo.com/": 1, "http://www.nyc.gov/": 2, "http://www.mta.info/": 1, "http://www.nj.us/": 1, "http://www.ny.gov/": 3, "http://www.nycservice.org/": 1, "http://www.foodbanknyc.org/": 1, "https://www.youtube.com/": 1, "http://www.fema.gov/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["If you would like to help out hurricane victims, you can donate to groups like the Red Cross, which provide help for displaced people. The link takes you to Amazon’s link to the Red Cross Hurricane Sandy relief fund. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/30/new-york-relief/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 2, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["There’s a  statistical (!) twitter fight this evening – Jennifer Rubin tweets “ when do we break it to them that averaging polls is junk? ” Hilarity ensues. There are actually some important subtle points about averaging poll data: \n \n Averaging bad data doesn’t make it better. On this broad point, Rubin is correct. \n Averaging good data does help. The purpose is to not be swayed by outliers that are produced by sampling. If you want to know the average family income in the US, you should average things so you won’t be swayed by the time Bill Gates appeared in the sample. If you believe that the typical polling firm is doing a decent job, it’s actually intuitive to average multiple polls. \n There’s actually research showing that poll averages close to the election aren’t terribly far off from the actual final numbers. See Nate Silver’s review on the subject . \n \n Score:  Central Limit Theorem  1, Jennifer Rubin  0. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/29/republicans-reject-the-central-limit-theorem/", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.smashwords.com/": 1, "http://en.wikipedia.org/": 2, "http://fivethirtyeight.nytimes.com/": 1, "http://www.amazon.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Movement gurus: Best research on how movements demobilize after a policy victory? I knew we have some on civil rights post-1964. Other good articles/books? My own work focuses on electoral victories (e.g., antiwarriors demobilized after Obama won ). How about policy victories? \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/29/social-movement-research-bleg/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1, "http://www-personal.umich.edu/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["A little while ago, I wrote a post comparing academia to other types of graduate education. My argument was fairly straightforward. Academia is worse than the other major alternatives in every major measure – time to graduation, % of people who complete the program, getting a job after graduation, and income. I think I am right about the comparison overall. Medical school graduates have a 90%+ graduate rate after 5 years and almost always land jobs or internships. \n However, I have revised my assessment of law school. It is much, much worse than I knew about. I still don’t think it’s quite as bad as academia. For example, the typical law school student will actually get the degree, while most PhD students never finish up – and they waste many years trying. And, there is actually an extremely well paid elite law track, which doesn’t exist in academia, except in the medical schools. But still, the legal market is now starting to resemble academia in that those at the top have many good career opportunities, while the rest have poor opportunities, unemployment, and ever increasing debt. \n If you want a good summary of the issue, read the blog “ Inside the Law School Scam ” by law professor Paul Campos . It boils down to the following: \n \n The recession contracted the entire legal services market. \n A lot of work previously done by young lawyers is now done by computers, paralegals, English speakers in India, and other non-JDs. \n Corporate clients are not willing to pay top dollar for on the job training for young associates. \n \n As a consequence of these trends, law firms, corporate legal counsel offices, and other employers have reduced their positions or cut salaries. Also, the rate at which people make “partner,” has gone down since firms can’t take on so many senior associates. \n We now have an emerging two-tier structure in the law market that resembles academia. Graduates of the top 20 or so programs still have great opportunities – prestigious clerkships, fast tracks in New York or DC firms, and teaching gigs at law schools. But one you get past this tier, it gets brutal, really brutal. People working for $15/hour doing “document review,” which is like being a grad school research assistant. Many graduates spend years finding a job requiring a JD. To add insult to injury, law schools, even those in lower tiers whose graduates almost never make big salaries, are increasing their tuition and saddling alumni with debt. And don’t get me started on how law schools inflate, or even fabricate, employment rates for graduate s… \n Law students, you have earned my pity. \n A dverts: From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/29/i-was-wrong-law-school-is-much-suckier-than-i-thought-but-not-as-sucky-as-academi/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://insidethelawschoolscam.blogspot.com/": 2, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["A few days ago, I noted that Obama is slightly behind in the polls mainly because of the South . If it weren’t for the South, Obama would easily have about 51% of the vote in rest of the country. Kieran went back and compared the October Gallup polls in 2008 and 2012 to produce this picture: \n  \n You’ll hear all kinds of post-hoc explanations of the election outcome in November. But they’re probably wrong unless they start with the fact that the South really, really, really hates Obama more than the rest of the country for some inexplicable reason. \n You need these great, but affordable, books:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/28/why-obama-may-lose-the-popular-vote-in-one-simple-picture/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://orgtheory.wordpress.com/": 2, "http://feeds.wordpress.com/": 1, "http://www.amazon.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Next summer, I will revise the best PhD advice book you can get: Grad Skool Rulz: Everything You Need to Know about Academia from Admissions to Tenure . One topic that will be revised is the section on liberal arts colleges. I’ll probably add something more on grants for faculty. \n But I am still puzzled about one topic – advice for European academics. Consistently, I’ve been told that the Rulz aren’t very relevant to European academia. So I asked for advice . I got some good feedback on the differences between the US and Europe, but the comments didn’t provide  concrete strategies of the type that make up the Rulz. If you are a successful European academic, I’d love to hear about your experiences. \n Awesome ebooks:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/27/working-on-grad-skool-rulz-2-0/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 2, "http://orgtheory.wordpress.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.amazon.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["For those of you doing research on worker cooperatives, I ran across a relevant call for papers in Organization . One of the special issue co-editors is George Cheney , who published Values at Work (Cornell University Press) about how the Mondragon cooperatives in Basque, Spain have dealt with global competition. \n The submission deadlines is Feb. 23, 2013. (Other calls for papers in Organization are here .) \n “Call for Papers – Special Issue of Organization \n \n Worker cooperatives as an organizational alternative: \nChallenges, achievements and promise in organizational governance and ownership \n Deadline 28th February 2013 \nGuest Editors \n Iñaki Santa Cruz. Professor. Faculty of Economics and Business Studies. Autonomous University of Barcelona. (Spain) \n Elías Nazareno. Professor. Faculty of History. Universidade Federal de Goiás. (Brazil) \n George Cheney. Professor, School of Communication Studies, Associate Investigator, Ohio Employee Ownership Center, Kent State University (United States) \n Ana Maria Peredo. Professor, Centre for Co-operative and Community Based Economy and Gustavson School of Business, University of Victoria (Canada) \n The current financial crisis has revealed structural problems as well as perturbations in the global financial and market systems. Within the context of crisis, there is great interest in experimentation with alternative organizational forms that can both respond to the challenges of today’s economy and restore equilibrium through a renewed emphasis on social values. In particular, worker ownership and governance are gaining attention in a variety of forms and regions. Worker-owned-and-governed cooperatives typically pursue both economic viability and strong forms of participation; further, they are closely tied to community economic and social development. Seeing these multiple objectives as intertwined and in fact necessary is central to the call for the 2012 United Nations’ International Year of the Cooperative, which seeks to highlight the contribution of cooperatives to social and economic development through generating employment, reducing poverty, and fostering social integration. \n Perhaps the most famous contemporary case of worker cooperative organization that achieves the multiple goals described above is the Mondragon Cooperative Group (MCG), one of the largest, long-lived, and successful examples of workers’ owned organizations in the entire world. Mondragon has a remarkable record of financial success and the provision of sound and stable labour conditions. Founded in 1956, the Basque cooperatives now employ almost 100,000 members, are represented in more than a dozen countries, and are the focus of ongoing scrutiny, praise, and critique. While the well-known wage differential has grown somewhat over the years within the system, it remains quite narrow by almost any comparison, even when a number of top-level salaries that are pegged to the market are taken into account. Amidst the current economic downturn that began in 2007 that has resulted in over 20% unemployment in Spain and approximately half that in the Basque Country, the Mondragon co-ops have relied on their historic principles of democracy, equality, solidarity, and participation as fundamental parts of their management strategy. While 24% of Spanish companies have closed down during this recession, the MCG only had to close down one of the 120 cooperatives that form the group, and relocate the 35 workers into other companies. In fact, there is significant evidence of increased democratization in the FAGOR Group, the original industrial cooperatives and the heart of the system. For all these reasons, now is an important moment for attention to the distinctive characteristics of these cooperatives as well as their lessons for other socially inspired management, organizational, and market models. The MCG represents but one case; however, given its rich history, diverse characteristics, encounters with globalization, and experimentation in new forms of participation now underway, it provides an extremely important point of reference in any comprehensive or forward-looking examination of worker cooperatives today. \n This call for papers is open to research contributions and critical-theoretical analyses of alternative organizations and especially worker cooperatives. We are especially interested in nuanced assessments of the methodological, philosophical, socio-political and organizational principles and challenges of workers cooperatives within the broader context of so-called alternative organizations. This means that sound empirical and interpretive investigations in the pursuit of important critical questions are encouraged. Such assessments may include attention to the activities, performance, and extensions of this kind of alternative organizations. We welcome multidisciplinary contributions and those that take on different perspectives that seek to bridge case-level detail with broader socio-economic trends. In addition, papers presenting theoretical reflections and analyses of specific worker owned cooperatives worldwide (such as Mondragon) should manifest a comparative perspective even if they do not fully examine each of two or multiple cases. Analyses that seek to apply recent developments in democratic theory and in alternative economics are certainly appropriate. Overall, the set of papers in the special issue will illuminate the complexities and changes in worker cooperatives, as they weather an extremely challenging period yet one ripe with opportunity. \n The special issue will reflect the international scope of Organization, advancing its mission as an open, reflective, imaginative, and critical journal about what is happening worldwide that contributes to these reflections. Further, we aim to help to expand the field of organization studies by interrogating the diversity and comparative viability and authenticity of organizational forms and practices, including those grounded in deep forms of democracy and solidarity. By closely examining cooperative organizations, and comparing them with other forms of worker ownership and governance, the special issue will encourage further exploration of diverse forms of organization, managerial practice, and the social economy from all around the globe, widening research on the Mondragon Cooperative Experience (MCE) and other significant examples. Therefore, the call welcomes international collaborations, be they ongoing or ad hoc. \n Examples of key themes for investigation allowing for further international comparisons include: \n 1. The organizational resources, structures, and dynamics allowing for social as well as economic resilience in worker cooperatives; \n 2. The changing roles of leadership in worker cooperatives: considering for example the interplay of various forms of leadership from charismatic to collaborative or group-based; \n 3. The capacity of and obstacles to the reinvention of democracy within cooperatives, including means to manage and solve conflicts between different goals, sectors, and constituencies (for example, concerning the relationship between worker-member-owners and temporary workers); \n 4. The relationships between cooperatives and organized labour, the state, the community, and the larger financial system; \n 5. Maintaining cooperative values while facing crises of participation, identity, and shared ownership and decision making within a system undergoing international expansion. \n Submission: Papers must be submitted electronically by 28th February 2013 to SAGETrack at http://mc.manuscriptcentral.com/organization \n Papers should be no more than 8,000 words, excluding references, and will be blind reviewed following the journal’s standard procedures. Manuscripts should be prepared according to the guidelines published in Organization and on the journal’s website: \n http://www.sagepub.com/journalsProdDesc.nav?level1=600&currTree=Subjects&catLevel1=&prodId=Journal200981 \n For further information, please contact one of the guest editors: \n Iñaki Santa Cruz inaki.santacruz  [at] uab.cat \nElias Nazareno eliasna [at]  hotmail.com \nGeorge Cheney gcheney [at]  kent.edu \nAna Maria Peredo aperedo [at] uvic.ca”"], "link": "http://orgtheory.wordpress.com/2012/10/26/call-fo-papers-on-worker-cooperatives-in-organization-journal/", "bloglinks": {}, "links": {"http://www.sagepub.com/": 1, "http://www.mondragon-corporation.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.kent.edu/": 1, "http://www.cornell.edu/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Adverts: From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/26/one-man-metal/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Garrett Jones has a post defending the electoral college on typical grounds . If you can’t win by jacking up the vote in California or Texas, you have to win votes in other regions. Given that so much political conflict revolves around regionalism, the electoral college is a good thing. \n US history provides evidence against this claim. Exhibit #1: We had a devastating regional war – the Civil War. I haven’t seen much evidence that the electoral college made a difference. At best, you might argue that the war was delayed a little when pro-Southern politicians were elected in the 1850s. That’s little consolation for the hundreds of thousands murdered in that war, not to mention the extension of slavery for years. \n Also, the minority vote/Electoral college (MV/EC) winner presidents haven’t been exactly poster-children for the system. John Quincy Adams was elected when Andrew Jackson failed to get 50% of the Electoral College and the House voted for Adams. His biggest accomplishment was paying off much of the government’s debt, which isn’t so bad. After that, MV/EC winners have a bad track record. Rutherford Hayes pulled Federal troops out of the South and allowed the creation of Jim Crow. Benjamin Harrison isn’t known much these days, except for raising tarriffs. George W. Bush started two wars and ballooned the national debt. \n If that’s the legacy of the Electoral College, then I can live without it. \n Adverts: From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/25/the-electoral-college-is-lame/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://econlog.econlib.org/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Remember a few months ago when a Romney staffer compared election campaigns to an Etch-a-Sketch? Each time, you shake things up and start over. People were appalled, but Romney’s staffer was correct. The reason is that elections are not driven by high information voters with strong opinions. They are driven by low information voters with no opinions. The reason is that people who know politics tend to know what they want. To get 50%, you need to focus on the weakly committed, low information voter. The person who still isn’t sure what they think of an incumbent – after four years! \n The result? Once you win the party’s nomination, you can say more or less anything you want. The people who actually remember what you said won’t change their vote, unless you say something that directly and violently attacks a core belief of your base. The people who can be influenced don’t remember much and have a relatively limited knowledge of politics. Say what you want. They won’t remember. \n While people may view politicians as evil, I say they are responding to the incentives given to them. If your job depended on pandering to amnesiacs, wouldn’t you keep fishing until you found something they liked? \n A dverts: From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/24/rational-romney/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["The polls are ambiguous these day s. First, after trailing by about 2-3% during the entire election cycle, Mitt Romney has now gained a consistent 1/2% to 1% lead in the polls. Second, the Obama campaign is still on track to win the election because he has retained leads in a lot of swing states, including Ohio. The only big swing state to switch to Romney is Florida. \n How do we reconcile this split? Here’s my theory of the 2012 election: the South hates Obama a lot, but the rest of the nation is relatively satisfied with a modest economic recovery.  Consider the following cross-tab from a recent mid-October 2012 Gallup poll : \n \n \n \n \n % Obama \n \n \n East \n 52 \n \n \n Midwest \n 52 \n \n \n South \n 39 \n \n \n West \n 53 \n \n \n \n This chart explains why Obama is trailing in the polls right now. The South really, really hates Obama and the lopsided polls cancel out modest Obama leads in the rest of the country. Also, it explains why Obama is doing well (for now) in the Electoral College. Florida is the only swing state in the South. In other words, if it weren’t for the South, Obama would be cruising to a modest, but easy, victory due to a slowly recovering economy. \n Adverts: From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/23/its-the-south-stupid-a-simple-explanation-of-the-2012-presidential-election/", "bloglinks": {}, "links": {"http://andrewsullivan.thedailybeast.com/": 1, "http://www.gallup.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.smashwords.com/": 1, "http://www.amazon.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["This blog post is the third in a blog forum about inequality and organizational theory (see parts 1 and 2 ).  Adam Cobb of Penn’s Wharton School of Management wrote the post and Leslie McCall of Northwestern University provided commentary. \n Adam Cobb \n An imbalance between rich and poor is the oldest and most fatal ailment of all republics. \n - Plutarch \n Corporations are the essence of inequality. Within them, workers are sorted into pyramid-shaped hierarchies where a privileged few at the top garner disproportionate perks from their status.  Executives benefit from skyrocketing levels of  compensation that are not tightly coupled with sustained company performance, while those at the lower rungs of the firm receive stagnant wages, declining benefits, and less security despite overall increases in labor productivity over the past 30 years.   At first glance, it’s logical to assume that the prevalence of large-scale corporate enterprises in a society would be associated with greater levels of inequality. \n One afternoon, Jerry Davis (my recovering advisor and current co-conspirator in this research) and I began thinking about this question in detail.  Jerry had recently finished his book tour for Managed by Markets , which chronicled the decline of the large corporation and concomitant rise of finance as the central institution in US society.  We discussed how income inequality rose during a period when financial markets took an increasingly large role in redefining the purpose of the firm – the corporation was no longer a stabilizing institution providing large numbers of quality jobs, retirement and health care, and opportunities for advancement and mobility.  Could rising income inequality be a consequence these changes?   Our hunch was yes. \n \n Whereas economic theory explains wage differentials to variations in labor supply and productivity, the structuralist approach in sociology argues that organizations are the central source of inequality because firms provide unequal access to remuneration, rewards and opportunities for advancement.  Organizations and their practices, therefore, have much to inform us about societal-levels of income inequality.  How corporate size relates to inequality is because large organizations are more likely to standardize their employment practices through bureaucratized procedures.  They are also more likely to utilize internal labor markets (ILMs) in which workers are buffered from the vagaries of market forces.  ILMs also provide a clear pathway for mobility – jobs are organized into promotion ladders that enable workers to move upward through the corporate ranks.  As more employees are brought within the boundaries of a single organization, their remuneration and opportunities for advancement are standardized.  Extremes at the top and bottom of a country’s income distribution are most likely to occur outside of bureaucratized corporations.  The top end consists of winner-take-all markets, investment partnerships and other boutique firms where the spoils are shared by a relatively small number.  The very bottom is characterized by low wages and economic insecurity.  Workers in large corporations are more likely to occupy the middle. \n In a recent study , Jerry and I tested this hypothesis.  We operationalized the presence of large corporations in a society by creating a measure of employment concentration – the proportion of the labor force employed by the largest 10, 25, or 50 firms – and tested whether this has any relationship with a country’s level of inequality.  The results are startling and indicate an almost mechanical relationship between inequality and employment concentration in the US over time \n Three-Year Moving Average of Income Inequality and Employment Concentration in the United States, 1950 – 2008 \n \n  \n Cross-national results, while less straightforward, are also suggestive. \n Cross-National Comparison of Income Inequality and Employment Concentration \n  \n The observed pattern indicates a ‘‘wedge’’: low employment concentration is compatible with both great inequality (Latin America) and relative equality (the former state socialist countries), but high concentration seems to drive out inequality. (Preliminary cross-national, longitudinal work suggests that this relationship is equally as strong in the  UK ( ρ = -.75) as in the US ( ρ = -.81), though much less so in Canada ( ρ = -20).) There exist a number of alternative explanations for these findings and while space constraints limit my ability to discuss those here, we do our best to account for those both empirically and conceptually in our paper. \n I do not wish to romanticize the halcyon days where large corporations dominated the societal landscape.  However, the results here suggest that a society’s level of corporate employment is negatively associated with inequality.  Future work in this area will help uncover when, where and under what conditions these relationships hold. \n [Shameless plug]  Currently, I am developing a website to serve as a portal where researchers can find, access and contribute data and research to the study of this topic.  It should be up soon, so check out http://www.worldinequality.net in the next few weeks! \n \n Discussion by Leslie McCall \n Organizational sociologists have long studied the relationship between organizations and labor market structures, including labor market inequalities and insecurities of many kinds. Until recently, however, they have been relatively absent from debates over the causes and consequences of rising economic inequality.  No doubt this reflects the difficulties of measuring corporate-level changes in a manner that isolates their unique impact on aggregate levels of economic inequality. \n In the absence of such aggregate, organization-level data, scholars interested in understanding the social dynamics of rising inequality have focused on the impact of changes in families, unions, the minimum wage, partisan shifts, tax policy, and other major social and political institutions. I come back to politics at the end, but for the moment I simply want to emphasize that economists and political scientists already recognize that institutional factors are important in shaping the rise of earnings and income inequality. Current debates revolve around which institutions matter the most, and when and why they do, as the trend in rising inequality varies considerably over time and depending on the measure of inequality (e.g., earnings inequality versus family income inequality, the 50 th /10 th ratio versus the share of income held by the top .01%). \n It is especially in this light that Davis and Cobb’s research is so welcome, given its international and historical scope. If they can help explain both the ups in the 1980s and the downs in the 1960s in the U.S., in addition to cross-national variation, that would be impressive indeed. The considerable empirical evidence they harness does suggest that employment concentration in large firms is associated with income inequality. And so this—employment concentration— might represent one of the best ways that organizational sociologists can begin to measure organizational change and its connection to aggregate inequality. \n In the spirit of furthering this broader project, I want to say a bit more about Davis and Cobb’s findings, their explanations of these findings, and how their research squares with the research of a small but hopefully growing number of other sociologists studying the impact of corporate structure on inequality (and here I focus mainly on the U.S.). \n First, in terms of the findings, the figure of trends in employment concentration and income inequality in the U.S. appears most convincing in the period from 1950 to the late 1980s (see also Figure 7 in the published paper). It is especially interesting to observe the decline in employment concentration in the 1970s prior to the steep rise in inequality in the 1980s, as one would expect this lag in cause and effect. It is also widely assumed that the 1970s were a “pivotal decade” in terms of setting the stage for rising inequality. \n But thereafter, the measure of employment concentration flattens out even though income inequality continues to rise, albeit less steeply than in the 1980s (note that the sharp increase in the early nineties is due to a change in the Census Bureau’s methods). \n This latter period coincides with evidence of the declining significance of large firms in shaping the structure of wages and inequality. Matissa Hollister shows that the well-known wage premium accruing to workers in large firms declined from the late 1980s to the 1990s. And a paper she presented at the 2012 ASA meetings gives a new clue as to why: managers as a share of employment declined in large firms but rose in small firms, adding nuance to Adam Goldstein’s recent evidence in support of David Gordon’s Fat and Mean hypothesis . \n In an earlier ASA paper , I explored the effect of establishment size on earnings inequality in a panel of urban areas from 1970 to 2000. I too found that the depressing effect of large establishments on aggregate levels of inequality ceased by 1990.  As noteworthy, average establishment size (as a measure of “downsizing”) declined in the 1980s but by just a small amount. It then increased (also by a small amount) in the 1990s. Similar evidence is provided by Baumol, Blinder, and Wolff . \n Thus the decline of the large firm, at least by these definitions, is less consequential than the decline of what the large firm once stood for in terms of equity norms enforced by struggle (i.e., unions) and reinforced by a lack of competition. (And here I agree with Shamus Kahn that changes in constraints are likely more important than changes in norms.) \n But you could argue that what we are really after are the practices of such firms, rather than their size or size distribution per se (though Jesper Sorensen and Olav Sorenson provide an elegant and persuasive theory of how the number and diversity of firms affects wage inequality). This is where Davis’ path breaking research is so crucial, and the published paper by Davis and Cobb fills in many of the blanks between Davis’s prior work on changes in corporate structure and rising economic inequality. \n The next step is to operationalize some of these changes in corporate governance in finer detail. Take mergers and acquisitions, for example. Ola Sjoberg has already shown that they are correlated with cross-national variation in earnings inequality, even relative to a number of more common explanations (e.g., globalization). As I said at the outset, so much has changed over this period that isolating exactly which changes matter the most, and when, is the biggest challenge. \n Finally, what I most look forward to reading from organizational sociologists are their ideas of how corporations can be reorganized to reduce market inequality. The prescriptive literature in economics, sociology, and political science speaks in near unison when it comes to the best and most viable solution to rising inequality in the U.S.: progressive taxes. The market is impossible to tame. \n But my forthcoming book on public opinion about income inequality shows that Americans concerned about income inequality (and, yes, they are concerned) want less market inequality and more market opportunity. And they don’t necessarily see taxes as achieving either of those goals. There is a huge vacuum in public discourse, in other words, around the question of what the market institutions of the future can and should look like. Many are working on this question, but their collective voice is weak, and new and creative ideas are still desperately needed."], "link": "http://orgtheory.wordpress.com/2012/10/22/the-corporation-and-inequality/", "bloglinks": {}, "links": {"http://orgtheory.wordpress.com/": 4, "https://mgmt.upenn.edu/": 1, "http://feeds.wordpress.com/": 1, "http://asr.sagepub.com/": 3, "http://www.northwestern.edu/": 3, "http://yalepress.yale.edu/": 1, "http://books.simonandschuster.com/": 1, "http://www.virginia.edu/": 1, "http://esr.oxfordjournals.org/": 1, "https://www.russellsage.org/": 1, "http://www.worldinequality.net": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Jesse Fagan, an orgtheory PhD student, asked that we publicize a pilot study that he’s conducting. He wants to know how orgtheory scholars percieve journals. Please use Firefox or Chrome to complete the following: http://www.jessefagan.com/pilesort/ \n Adverts: From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/22/help-an-orgtheory-student/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.jessefagan.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Nicholas Poggioli has a question about which orgtheory program he should attend: \n I’m especially interested in hearing which programs might be best suited to my own research interest, how organizations “digest” novel information.  I would like to focus my doctoral studies on how managers of organizations decide whether and how to respond to climate change, a category of information that is constantly shifting in meaning and public opinion.  Lessons learned from this could be more widely applied, I think, to how organizations respond–or don’t–to new kinds of information.  Any help on this question would be greatly appreciated. \n Any thoughts? \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/21/org-theory-phd-program-question/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["I asked my dentist: Why haven’t hospitals internalized dental surgeons? Don’t hospitalized patients need care? Inititally, she said that dentists need certain equipment. You can’t do dental work in a hospital bed. But, then, I said, “Can’t the hospital just have a wing for oral surgey?” She then went cultural and claimed that dentists had a strong preference for small group practice. Is that a correct answer? \n Adverts: From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/20/orgtheory-dentist/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["There’s a new paper by Miguel Espinosa, Carlos Rondon, and Mauricio Romero on the use of math by elite economists . They compare three groups: Nobel laureates; Other Award winners; and a sample of top 20 faculty. They examine the appearance of equations over the career. The results generally show that more rewarded economists use more equations. And: \n Furthermore, we found that the training and use of mathematics has a positive correlation with the probability of winning a Nobel Prize in certain cases. It also appears that being an empirical researcher as measured by the average number of econometrics outputs per paper has a negative correlation with someone’s academic career success. \n Ther are some other interesting bits as well, such as Nobel winners decrease the math after winning. So, in economics, math is a prestige building tool, empirics are a lower status necessary evil, but you have a lot of freedom once you reach the top. It’s a shame. I don’t think economics is alone in prefering abstraction to concrete results. While theory is valuable, science needs to explain the world, which is its primary mission. And that often requires less glamorous, but equally important empirical work. We need to reward that more. \n Adverts: From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/19/status-and-math-in-economics/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1, "http://mpra.uni-muenchen.de/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["A couple of times a year, a student walks into my office with the following story: \n Thanks for meeting with me, Professor Rojas. I need some graduate school advice. I’m majoring in economics [or soc] with a minor in math [or computer science]. But I’ve also taken some sociology [economics] courses as well. My issue is that I’m drawn to sociology – and I love social theory class – but I feel more pressure to do economics graduate school. What do you think? \n First, I give the “don’t go to graduate school speech.” I want to make sure that they understand that graduate school is a serious choice. I try to scare them away. I also insist that they buy my book , which is the best generic advice they can get on graduate school. Then, if they still want to do it, I say the following about the econ/soc choice: \n Economics and sociology are wonderful fields but they are very different. Sociology is a rich, highly diverse field. It is very eclectic and inherently interdisciplinary. Economics is, currently, a field that has many applications but a relatively narrow toolbox. The field is now a sort of engineering, where success is measured by mathematical problem solving. \n There are also very different professional rewards. Sociology is intellectually flexible, but adheres to the arts and sciences model of graduate education. It will take you about 7 years and you’ll make a modest income. The upside is that sociology isn’t as bad as other arts and sciences in that you can work in sociology, political science, anthropology, business, public health, social work or education, depending on your specialty. \n Economics is more like a well functioning professional program. A short time to degree, with a number of highly paid options upon graduation. If you are worried about math, don’t be. They only admit folks with strong math skills and many economics programs have “math camp.” With a few exceptions, like Chicago, weeding is rare compared to most arts and science doctoral programs. Also, once you get past the first year, you can choose a low math specialty. The fancy math is for professors aiming for top 20 programs and who compete for top journal space. \n Ultimately, I tell students to choose the field where they feel they can make the best impact. If you are magnetically drawn to social theory, don’t sign up for a lifetime of welfare theorems. On the other hand, if you are on the margin, the fast time to degree and the high pay-off are hard to argue with. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/18/date-sociology-marry-economics/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1, "https://www.smashwords.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Is there any relationship between accusations of corporate deviance and the diffusion of new practices? My coauthor, Ed Carberry, and I think so. In a new paper that just came out in the Journal of Management Studies we show that firms began using stock option expensing, a practice that used to be seen as quite problematic and undesirable by executives and boards, after a series of scandals rocked the corporate world in the early 2000s, causing firms to look for new ways to restore their credibility. Stock option expensing became a tool that companies could use to distance themselves from the stigma associated with corporate scandal. Our analyses show that firms facing media scrutiny around claims of corporate fraud and firms that were targets of shareholder activism around corporate governance were much more likely adopt stock option expensing. Firms that faced both intense media scrutiny and shareholder activism were especially likely to adopt the practice. We argue that in the period directly following the Enron scandal stock option expensing became seen as an impression management tactic that firms could use to restore confidence in their accountability to the public. \n The title of the paper is “Defensive Practice Adoption in the Face of Organizational Stigma: Impression Management and the Diffusion of Stock Option Expensing.” You can download the paper on my website. Here is the abstract. \n Although most diffusion research focuses on firms adopting new practices to maintain their legitimacy, this paper examines a setting in which firms adopted a controversial practice to defend themselves against relating to corporate deviance. We argue that understanding defensive adoption requires attending to both the dynamics of organizational stigma and impression management, and test our theoretical claims by  analysing the diffusion of an accounting practice, stock option expensing (SOPEX), following the Enron scandal. We first provide evidence that the media and shareholder activists transformed the practice into a  defensive device by theorizing it as a solution to problems relating to corporate fraud and corporate governance. Using event history analysis, we then show that corporations that became targets of stigma- inducing threats were more likely to adopt SOPEX and that the media were a key force channeling these threats."], "link": "http://orgtheory.wordpress.com/2012/10/17/defensive-practice-adoption-and-organizational-stigma/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://onlinelibrary.wiley.com/": 1, "http://www.google.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["This Fall’s book forum is about Andreas Glaeser’s Political Epistemics, a historical ethnography of East German socialism. This week’s installment will focus on the theoretical purpose of the book, which is to articulate and defend “the sociology of understanding.” \n What is this “sociology of understanding?” Well, it draws on a number of ideas that should be familiar to cultural sociologists. First, it’s fairly Schutz/Berger and Luckmann in nature. There is a “lifeworld” built upon a common stock of knowledge. “We all know that this is true.” Second, it’s also interactional. In Glaeser’s model, people develop their understanding of the world through affirmation/negation from other people or institutions. \n So far, I think the picture is well rooted in cultural sociology. What Glaeser adds is an argument about the institutionalization of the self. Rather than assume that people have fairly independent interests and beliefs about the world, he argues that selves are built from of affirmation and negation from the social environment. Now, Glaeser isn’t making a Foucault style argument about how we lose ourselves in a network of signifiers. Quite the contrary, he’s arguing about the rootedness of one’s understanding of the world. Historical events affirm one’s understanding of the world, while others disrupt that notion of self. \n How does this sociology of understanding (SoU) help us to do political sociology, such as analyzing the dissolution of communism? Well, if you believe SoU, the locus of attention should be on understanding how people construct their world in both abstract terms and in daily life. Abstract theories, like Marxism-Leninism, provide a basic vocabulary for people to assess their world and produce collective action. At the same time SoU theory suggests that these understandings can only sustain a type of self when reinforced by exogenous events and institutional life. A lot of daily political life is a response to the juxtaposition of these worldviews and observation, with actors often scrambling to make sense of events that would be unsurprising to others. \n The SoU theory has interesting implications. For example, SoU theory implies that Western arguments about freedom would me moot points. The ideals of individual liberty only resonates in nations with specific institutional arrangements. Instead, people in socialist nations would criticize the system from within. And there is much truth to this observation. Dissidents and reforms rarely waved their copy of Road to Serfdom in the air. Rather, they often relied on arguments articulated by dissident socialist intellectuals. Thus, the collapse of communism, in this view, is less about external pressures and more about the management or mismanagement of contradictions. \n The result of SoU theory is that one should understand how historical events, ideologies, organizational behavior, and personal biography intertwine to create the political system. Social changes happens when these factors shift, not so much when outsiders, like Reagan or Kennedy, stand by a wall and proclaim freedom. Next week, we’ll see the sociology of understanding in action, when I discuss the world of the Stasi and Berlin peace activists. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/17/glaeser-book-forum-2-understanding-the-sociology-of-understanding/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["If you look at the list of department chairs here at Indiana, you’ll notice that the first few were chairs of “economics and sociology.” I thought the old combined economics and sociology department at Indiana was some historical accident. That is, until I read The Emergence of Sociology from Political Economy in the United States: 1890 to 1940 by Cristobal Young . The article, published in the Journal of the History of the Behavioral Sciences , makes a few simple points: \n \n Economics came first and sociology was added to existing programs. Solo sociology programs, like Chicago, were in the distinct minority. \n Most sociology programs were part of economics programs until the 1920s. \n There was still much collaboration between sociology and economics until the 1940s. \n Once economic institutionalism finally faded, ties between disciplines faded. \n The separation really started when sociologists started their separate meetings. \n \n What to make of this history? A few thoughts: 1. Heterodox economists should just give up on mainstream economists and hang out with sociologists. 2. There was some sort of hybrid disciplinary action going on that got truncated in the 1940s. It probably happened on both sides. Mathematical formalism made strides in economics, while structuralism appeared in sociology at the same time. These formalizations probably created needless rifts between disciplines. It might be worth seeing if that multi-disciplinary history can be reconstructed. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/16/economics-sociology-love/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://www.stanford.edu/": 1, "http://feeds.wordpress.com/": 1, "http://cristobalyoung.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Thi s post is the second in a blog forum about inequality and organizational theory (see  part 1 ). Isabel Fernandez-Mateo of London Business School wrote the post, and Philip Cohen of the University of Maryland and the Family Inequality blog provided commentary. \n Isabel Fernandez-Mateo \n Thank you Brayden, Bruce and Jerry for inviting me to participate in this conversation on inequality – a topic which I care deeply about. I would like to post a few thoughts about a type of inequality that I think a lot of other people are also concerned with: the scarcity of women in top jobs. The problem is clear, and the list of potential solutions is long – quotas, changes in firms’ performance evaluation systems, family friendly policies, etc. One could thus easily assume that by now we have a very good understanding of why the problem exists in the first place (i.e. how and why we lose women as we go up the hierarchy). I believe, however, that we are not even close. For starters, we may be looking in the wrong places. \n For decades, our knowledge of careers and inequality has been closely linked to the study of internal labor markets: how firms allocate people to jobs. As a result, our explanations for why so few women get placed in top positions have mostly focused on the role of organizational practices, which create barriers for women in internal promotion. Roberto Fernandez makes this point in a couple of recent papers , where he reminds us that the metaphor of the “glass ceiling” is alive and well. \n And yet we have some pretty good evidence that the traditional career model, in which the best route up is to be promoted within a single firm, is losing its dominance. A number of authors have argued that relationships between firms and employees have become much more arm’s-length. This means that career advancement is now more influenced by external rather than internal labor markets. If so, getting hired into the right jobs in the right companies is becoming more important than climbing the ladder inside the firm (see Matthew Bidwell’s paper for an interesting twist on this). This has major consequences for how we think about inequality. Still, much of our research on women’s lack of access to the top remains embedded in the imagery of the internal labor market, where promotions – rather than external hiring processes – are the main focus. I of course do not mean to discard the importance of the former, but I think that it is time we pay much more attention to the latter. \n Over the past few years I have been investigating the mechanisms that may sustain gender inequality outside the firm, particularly in the context of contract employment. I have found evidence that the way women move across jobs in different firms matters for how well they do over time. Since every move involves a hiring process, in a recent paper I investigated how hiring processes contribute to sort women into lower paid jobs in the IT sector. Here the role of screeners external to the firm (i.e. staffing firms) was crucial. It was their actions – not those of female applicants or employers – that contributed most to keeping women out of higher paid temporary jobs. Could this kind of mechanism also explain why so few women get hired into top management positions? \n My next goal is precisely to examine whether it is the gatekeepers who place men and women in top jobs differently. It doesn’t take much to realize that executive search firms are the place to look. Nowadays hardly anyone gets hired in a top position without the involvement of these organizations; yet they remain a black box for researchers. When observing how few women get placed at the top, it is easy to jump to the conclusion that search firms must be contributing to make it so ( old boys’ clubs, stereotyping, you name it ). This may well be true, but we simply do not know. We are only seeing the outcome of their actions (who they place) but not the process (how they choose from the candidate pool). The only way to truly understand why women do not get into these jobs is to track them from the very beginning of the hiring pipeline, starting with the long list of candidates that are initially considered, and following them each step of the way (including whose decisions – search firm, candidates or clients – are more important at each step). This is precisely what Roberto Fernandez and I are doing in a new project, where we have got hold of full pipeline data from a big UK executive search firm. By following our favourite route of dissecting social mechanisms, we hope to provide some clear (and possibly unexpected) answers to the question of why there are still so few women at the top. Keep posted! \n Commentary by Philip Cohen \n David Brooks recently , breezily (of course) attributed the “tippy-top” glass ceiling to the supply side: “Men still dominate the tippy-top of the corporate ladder because many women take time off to raise children.” If you were going to choose a single variable to over-emphasize, motherhood is not a bad choice , but of course that’s not a simple matter of women’s choice. \n The motherhood focus is consistent with the results from applicant-pool analysis that show women absent from hiring pipelines. And I appreciate the focus by Isabel and her colleagues on hiring processes, with creative empirical analysis of applicant pools. All of us who study earnings and occupations among people who already have jobs need to be aware of this work. \n Focusing on the supply side, of course, raises the ire of anti-victim-blamers . That’s unfortunate, because if you back up from the analysis – look wider than the single-firm studies – the supply side reflects the cumulative effects of many individual and collective actors. Families, the education system, and upstream labor-market actors are the most prominent. The supply-side analysis only rankles if you constrict your view with a methodological-individualist lens and see the supply-side as synonymous with individual choice. (You can tell I just taught Durable Inequality .) \n To the extent that careers are increasingly spread across multiple firms, this point is of growing salience not just because of the larger role for external versus internal hiring processes, but because every job change is a point of leverage for all these other actors as well. Previous employers’ practices provoke job changes in the first place (after all, there is discrimination in firing , too), as do the career moves of spouses . How to handle such changes is not simply an individual victim’s personal choice for which to be blamed. \n We especially need to consider the role of state policy in shaping family-career interactions over the life course. When adequate family leave is not available, when health care is too expensive , when high-quality preschool education is inaccessible or too expensive , when the state-sanctioned workday is too damn long – all that increases the pressure that women’s family obligations place on their career trajectories. \n Rather than seeing such influences as competing for importance with hiring and promotion processes, and arguing over where researchers’ attentions should focus, we need to consider how state, family and market dynamics interact with hiring and promotion. Workers make job-search choices under understands and assumptions about firm preferences and practices, and employers (or headhunters) see – or assume – the effects of wide contextual forces on the workers they might hire. I look forward to seeing more of this research."], "link": "http://orgtheory.wordpress.com/2012/10/15/women-on-top-why-so-few/", "bloglinks": {}, "links": {"http://orgtheory.wordpress.com/": 1, "http://papers.ssrn.com/": 1, "http://feeds.wordpress.com/": 1, "http://asr.sagepub.com/": 1, "http://www.umd.edu/": 2, "http://www.neweconomics.org/": 1, "http://www.equalityhumanrights.com/": 1, "http://onlinelibrary.wiley.com/": 2, "http://www.london.edu/": 1, "http://www.tandfonline.com/": 1, "http://www.ucpress.edu/": 1, "http://gas.sagepub.com/": 1, "http://mansci.informs.org/": 1, "http://asq.sagepub.com/": 1, "http://futureofchildren.org/": 1, "http://www.jstor.org/": 1, "http://familyinequality.wordpress.com/": 2, "http://www.futureofchildren.org/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Take Our Poll \n The Wall Street Journal has an article with possible winners . A clip: \n Others continually on the short list include Yale University ’s Robert Shiller . The father of behavioral finance — a celebrated 1981 paper by Mr. Shiller struck an early blow against efficient markets hypothesis — he also sounded warnings on both the dot-com bubble and the housing bubble. \n Also mentioned in previous polls: University of Chicago Booth School of Business behaviorist Richard Thaler ; Harvard macroeconomist Robert Barro ; and University of Chicago econometrician Lars Hansen . \n Thomson Reuters has another method of coming up with Nobel predictions , based on how often an economist’s papers are cited and how “high impact” those papers are. The Thomson Reuters picks are: MIT ‘s Stephen A. Ross for his arbitrage pricing theory; Nuffield College ‘s Sir Anthony B. Atkinson and Princeton University ‘s Angus S. Deaton for research on incomes and outcomes; and Mr. Shiller of Yale. \n But there are plenty of other economists who could get the nod. Among them: Jean Tirole , of France’s Industrial Economics Institute , who’s an expert on the workings of “two-sided markets,” where different parties participation is contingent on the participation of other parties (think Google advertisers and Google users). And Yale’s William Nordhaus , best known for his work on environmental economics. \n High status economists are encouraged to comment.* \n Adverts:  From Black Power / Grad Skool Rulz  \n * But don’t write a dumb comment about how the economics prize isn’t a real Nobel, or how economics isn’t a science, or how people didn’t predict some economic crisis. That was really cool to say, like, ten years ago."], "link": "http://orgtheory.wordpress.com/2012/10/13/last-chance-to-place-bets-on-the-nobel-prize-in-economics/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.smashwords.com/": 1, "http://polldaddy.com/": 1, "http://blogs.wsj.com/": 1, "http://www.amazon.com/": 1, "http://sciencewatch.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Hi, Tom Medvetz here, checking in with my fourth OrgTheory guest post (posts  1 ,  2 , and  3  here). Today I’ll sketch a few notes about one of the big issues my book speaks to: the complex relationship between social knowledge and public action in the US. Perhaps the best-known debate on this topic is the one associated with Russell Jacoby’s 1987 book,  The Last Intellectuals , which famously lamented the disappearance of “public intellectuals” from American life. In the years since its publication, Jacoby’s book and the idea of the “public intellectual” have earned enormous attention from journalists, pundits, and scholars. \n However, reading over some of the major entries in this debate, it’s hard to shake the feeling that the “public intellectual” discussion has yielded more heat than light. In the first place, it’s striking how much disagreement still attends the central question a quarter-century later: Is public intellectualism declining or thriving in America? It depends on who you ask. Three days ago, Henry Giroux’s  Counterpunch  essay “ The Disappearance of Public Intellectuals ” seemed to take the basic truth of Jacoby’s thesis for granted. Meanwhile, many other writers have taken the opposite stance by arguing that public intellectuals are alive and well in the US. A good example is Daniel W. Drezner’s 2008 paper “ Public Intellectuals 2.0 ,” which maintained that “the growth of online publication venues has stimulated rather than retarded the quality and diversity of public intellectuals.” \n A second glance at this debate reveals a likely reason for the disagreement. Put simply, there has never been any consensus about the proper definition of the term  public intellectual . In fact, it’s fair to say that how a given writer operationalizes the term tends to determine where he or she stands on the issue. \n \n Is there a way to contribute to this debate without unwittingly producing another round in the potentially endless cycle of laments and celebrations? I think there is, but only by drawing on certain insights from the sociology of intellectuals. In my book, I make use of a conceptual framework with a long pedigree in this area (particularly the work of Weber, Bourdieu, and Gil Eyal*) to relate the rise of think tank-affiliated policy experts to the debate on “public intellectuals.” The first contribution this framework offers is to clarify the discussion’s conceptual substrate. In particular, it lets us see that the  public intellectual  concept acquires its rhetorical force from two ideas already familiar to scholars of intellectuals. The first is  cognitive autonomy , by which I mean an intellectual group’s ability to enforce positive standards of rigor and competence on its members. \n Autonomy is easy to grasp in principle. For example, we could say that doctors enjoy a certain degree of autonomy from patients in their ability to evaluate their medical needs and determine the best course of treatment independently of the patients’ opinions. Yet the operative phrase here is “a certain degree.” Once we think about real-life cases, it becomes clear that perfect autonomy is neither achievable nor desirable for an intellectual or professional group. The same doctors, for example, always face certain pressures to take into account the preferences of patients before deciding on a diagnosis or treatment. Furthermore—and this is a crucial point—how much pressure an expert group faces depends heavily on the presence or absence of rivals who are willing to tailor their services expressly to “consumer demand.” Extending the medical example, we could say that the presence of holistic and New Age healers poses a potential threat to doctors, who can no longer count on being the “only game in town” in treating illness (that is, if they ever could). Doctors might try to co-opt the knowledge of their rivals—witness mainstream medical exhortations about the value of meditation—or they may challenge its legitimacy. But the key point is that a strategy of uncompromising autonomy leaves an expert group vulnerable to competition from less autonomous rivals. \n If membership in a highly autonomous group is vital to “intellectualism,” then what could make an intellectual “public”? Here the key notion is what Gil Eyal calls “openness.” Openness is the opposite of closure (in the Weberian sense), which refers to a group’s ability to control the means of entry into its own ranks and exercise proprietary control over its knowledge through credentialing and training mechanisms. Closure also implies a certain degree of esotericism or “mystery,” as when a medical doctor uses an obscure term for an illness or a professor relies on arcane jargon to make an argument. Both acts sharpen the distinction between the doctor and the layperson. The concept  public intellectual , on the other hand, suggests a certain willingness to “give away” one’s knowledge by speaking in a language that is accessible to an educated lay public. \n Once again, though, we can see why openness is no simple matter, and why it poses a second dilemma for intellectuals. Just as too much closure leads to pure esotericism (and potentially the loss of clients), too much openness leads to the loss of proprietary control over one’s knowledge (and the material and symbolic rewards that come with it). Think, for example, of everyday folk wisdom, which is freely available to everyone and therefore “owned” by no one. \n The figure below (pasted from my book and adapted from Eyal) summarizes this framework by depicting the two oppositions I’ve described as axes in a theoretical space of relations. Bourdieu’s contribution to this discussion is to suggest that what Weber referred to as “ideal-types” are better thought of as  unstable corner locations  in a field of forces and relations. In other words, because the corners of the space are the most dangerous places for real-life intellectuals to exist, most of the “action” occurs closer to the center. As Bourdieu notes, once we’ve used the ideal-types to specify the dimensions of the space and the forces brought to bear on those who enter it, we can discard the ideal-types altogether. Eyal’s contributions are to clarify the dilemmas associated with the two axes and to emphasize the powerful allure of the field’s  center . An expert group that wants to keep its consumers, he says, must strike tactical  balances  between autonomy and heteronomy and openness and closure. \n  \n From  Think Tanks in America , p. 86 \n The model sketched here suggests why endless confusion over the status of “public intellectuals” is not surprising—and why writings on the topic often devolve into futile battles over the “true” meaning of the term. In the first place, there are no natural boundaries within this space, only degrees of autonomy and openness. Furthermore, real social agents and groups always have an interest in demarcating the boundary of categories like  public intellectual  in particular ways. When Russell Jacoby writes, for example, that public intellectualism is in decline because of the “professionalization and academization” of scholars, it’s hard to read this as merely a neutral description of the world. It is also part of an attempt to decry one kind of academic career path in relation to another. \n In my book, I use this model to describe the strategic repertoires of think tank-affiliated “policy experts,” which tend to draw them toward the field’s center. At one point, I focus on the case of AEI fellow  Charles Murray  ( Losing Ground ,  The Bell Curve ). Murray’s successful intervention in the 1980s-90s welfare debate depended not on his ability to represent a specific intellectual “type,” but on his ability to exist  in between  types by merging disparate skills and styles strategically. Murray entered the debate in the early 1980s with all the outward appearances of a “public intellectual,” or someone who could challenge the political orthodoxy of the day from a standpoint of relative autonomy while speaking in terms that were accessible to the lay public. But he also gained a degree of authority from the appearance of technical proficiency that came from his experience as a former government analyst. Once Republicans took control of Congress in 1994, however, Murray repositioned himself as a crusader and spokesman for the anti-welfare movement by testifying before Congress and serving on an official White House commission convened to move the legislation forward. There is even a hint of “ivory tower” scholasticism in Murray’s story. (As he told me in an interview, “In the think tank world . . . I have—and this is not really an exaggeration—I have essentially spent the last 21 years doing exactly as I pleased, every day and all day.”) \n  \n Public intellectual?: AEI fellow Charles Murray, described as both an “exemplary social scientist” by Christopher DeMuth (in his Irving Kristol Award presentation) and a “conservative evildoer” and producer of “racist pseudo-science” by Eric Alterman (in What Liberal Media? ) \n The key point is that the field’s center is the best position from which to fend off challenges from rivals and maintain a stable clientele. \n To move the public intellectualism debate forward, I think we should resist the impulse to treat the agent as the privileged unit of analysis. A public intellectual is not a flesh-and-blood person, nor even an ideal-type. Instead, the term is better understood as referring to an unstable corner location in a space of relations. A better approach, then, is to trace the relationships among real intellectual and professional groups within this space historically. In my next post, I’ll proceed with this task in more detail. [To be continued….] \n _________________________________________________ \n NOTE \n * See, for example, Gil Eyal. 2002. “Dangerous Liaisons between Military Intelligence and Middle Eastern Studies in Israel.” Theory and Society 31, no. 5: 653–93; Gil Eyal. 2006. The Disenchantment of the Orient: Expertise in Arab Affairs and the Israeli State. Stanford, CA: Stanford University Press; Pierre Bourdieu. 1991. “Universal Corporatism: The Role of Intellectuals in the Modern World.” Poetics Today 12, no. 4: 655–69."], "link": "http://orgtheory.wordpress.com/2012/10/12/why-the-debate-on-public-intellectuals-is-faulty-pt-1-of-2/", "bloglinks": {}, "links": {"http://orgtheory.wordpress.com/": 5, "http://feeds.wordpress.com/": 1, "http://www.aei.org/": 1, "http://drezner.foreignpolicy.com/": 1, "http://www.counterpunch.org/": 1, "http://en.wikipedia.org/": 1, "http://www.amazon.com/": 5}, "blogtitle": "orgtheory.net"}, {"content": ["Are you a senior or almost senior level race/ethnicity researcher? If you are, you might be interested in our open position. We are looking for some who can be the chair of our new Center for Research on Race and Ethnicity in Society (CRRES). Check out the listing here. Deadline October 15.  Drop me email if you have questions. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/12/get-a-job-at-indiana/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.iub.edu/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["As the first anniversary of OWS passes, we’re starting to see publications by researchers that both describe and attempt to assess the potential impact of such organizing efforts in the US and elsewhere . One is Todd Gitlin ‘s Occupy Nation: The Roots, the Spirit, and the Promise of Occupy Wall Street . Those who have kept up with OWS won’t be surprised by such nuggets as Denver OWS’s election of a border collie to meet the mayor who insisted on working with a leader from a “leaderless” movement . Nonetheless, most readers will benefit from Gitlin’s contextualization of OWS’s organizing practices. For instance, chapter 4 discusses the human microphone ‘s appearance in the antiglobalization movement, and chapter 6 covers other antecedents such as the Wobblies and SDS. \n The longterm impact of such movements may be evident in participants’ expansion of their organizing toolkits with less familiar practices. However, as I reminded my students yesterday during a discussion of Wal-Mart’s workplace practices and their own experiences in the retail work and the service sector, such moments of action are often lost from history, even from academic accounts. Given the many gloomy studies of how organizations don’t serve larger interests, the absence of alternative examples can reinforce a sense that the status quo is inevitable, that alternative paths are not possible, or that taking action is fraught with overwhelming pitfalls that disenchant participants. \n Have recommendations for readings on alternative organizing practices for change? Put them in the comments."], "link": "http://orgtheory.wordpress.com/2012/10/11/expanding-the-organizing-toolkit/", "bloglinks": {}, "links": {"http://www.barbaraehrenreich.com/": 1, "http://occupywallst.org/": 1, "http://feeds.wordpress.com/": 1, "http://www.iww.org/": 1, "http://toddgitlin.net/": 1, "http://onlinelibrary.wiley.com/": 1, "http://www.harpercollins.com/": 1, "http://www.huffingtonpost.com/": 1, "http://www.youtube.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["What is the go to source for 2008 or 2010 Congressional district demographic data?  A nice table with summary stats for each district would be great. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/11/congressional-district-data-bleg/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["This question came up on my Facebook feed, and I think it’s a rich one for organization theory: Why is baseball the only professional sport with its own development league? Football and basketball do most of their development in the colleges. Possible answers: \n \n Historical sequencing/path dependence – baseball emerged as a profession (1800s) before the rise of major collegiate athletics (early 1900s). \n Seasonality – baseball is played mainly in the summer, when colleges are out of session, relatively speaking. \n First mover advantage – basketball was invented by college folks and much of the technique and equipment for modern football was also invented by collegians (e.g., John Naismith invented the game of basketball and the first version of the football helmet) \n \n Other answers? \n Jacob Levy wondered why other sports don’t cannibalize college athletics because there’s a lot of money to be made. That question, I think, has an easy answer. Usually, development league and minor league sports bring in little money. The only reason college basketball and football do well is because of the identity of the college. Notre Dame alums are a built in audience for Notre Dame football, while non-collegiate minor leagues have very small audiences. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/11/orgtheory-question-colleges-and-professional-sports/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/10/everything-you-ever-needed-to-know-about-vice-presidential-debates/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["About two weeks ago, there was an interesting post at Econlog about the relative importance of civil rights for libertarians . The issue is that libertarians often hype other issues, like taxes, more than civil rights. Not too much discussion about discrimination, Jim Crow, and so forth. A blogger from the pro-immigration website Open Borders asked how often  libertarians argued against, for example, segregation. \n I think the commenters (myself included) got it right when we said “some, but not much.” In other words, from time to time, libertarian intellectuals did talk about the evils of segregation.  Usually, the issue is couched in terms of the use of state power to prohibit blacks from holding property and practicing certain occupations, like the law. Sometimes it was a commentary on what was good and bad in the Black freedom movement. There is the occasional talk of opposing colonialism. But overall, it was not an overwhelming response. \n The relatively weak answer to Black oppression is puzzling. Opposing Jim Crow was a no brainer from the libertarian point of view. Blacks had been slaves, which is the antithesis of personal freedom. Then, after Reconstruction, they had been subjected to humiliating and painful legal regulations in addition to extensive personal violence. While libertarians may disagree with liberals about the remedy for state violence and segregation, you would think that they would have been marching arm and arm with liberals in the 1960s. \n But that didn’t happen. Black repression takes a back burner on the libertarian shopping list. But why? I think it has to do with the sociology of elite libertarians. Roughly speaking, the people who defined the libertarian agenda in the mid to late 20th century were defined by two social processes. First, nearly all of the major libertarian intellectuals belonged to the Jewish diaspora in America. Some were refugees from East European communism, like Ayn Rand. The Austrian school of economics was lead by central European Jews like Mises and the second generation was led by New Yorker Murray Rothbard. Second generation Jews were also very prominent, like Milton Friedman and Robert Nozick, whose father, according to wiki, was from a Russian shtetl. While these writers did occasionally address Black issues, American civil rights probably did not loom in their minds as much fascism and socialism in Europe. \n Second, many, if  not most, of the leading libertarian intellectuals were strongly rooted in American and Western European academia. Specifically, they were mainly in the fields of economics and philosophy. Therefore, they were subjected to very specific professional pressures. When these intellectuals were active, economics transformed itself from a historical field into a form of highly mathematical social engineering. Academic philosophy also underwent a profound transformation. That discipline downplayed the ideas now known as “continental philosophy,” (e.g., Husserl or Heidegger) and refocused on “analytic philosophy,” which is noted for its extreme emphasis on developing clear concepts and employing ideas from linguistics, mathematics and symbolic logic. \n Thus, the social field of libertarian intellectuals is one that combines ideas derived from thinking about the European experience with the consciousness embodied by symbolic and highly mathematical academic disciplines. This isn’t to say that all of the major libertarian intellectuals accepted or praised this state of affairs. Austrian economists are noted for their rejection of mathematics in economic analysis, but they were still embedded in an economics discipline that favored certain types of intellectual problems. They were still subjected to some strong professional pressures. The end result is that the libertarian social field permits discussion of race issues, but it’s not a topic that wins the competition for attention. \n Now, it didn’t have to be that way. Imagine if some group of Black intellectuals had set out to systematically develop an anti-statist political philosophy, much as Third World intellectuals developed indigenous versions of Marxism, like liberation theology. For example, what if DuBois had an evil twin brother who looked at the post-Reconstruction South and developed a theory of the state as an illegitimate racial coalition? Or, imagine, if some people in the Harlem Renaissance had taken a sort of proto-Tyler Cowen position about how capitalism allows black cultural forms to flourish? \n If that had happened, then the libertarian social field would be different and there’d probably be a much more serious engagement with race. There would have a been stronger role in defining anti-segregation arguments in the civil rights era, a stronger resistance to a coalition with Whites who use libertarian rhetoric to justify intolerance, and a serious acceptance that racism is an ingrained feature of human life that needs to be identified, refuted, and transformed. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/09/race-and-the-sociology-of-elite-libertarian-intellectuals/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://econlog.econlib.org/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["This post is the first part of a blog forum about inequality and organizational theory. Bruce Kogut and Jerry Kim of Columbia University wrote the post, and Shamus Khan , also of Columbia, wrote the commentary. \n Bruce Kogut and Jerry Kim \n Why should we care about income inequality?  For many, an egalitarian society is a just society .  The argument for this belief ranges from  “I just think that” to sophisticated reasoning about declining marginal utilities and the distribution of natural abilities and the tradeoffs between efficiency and equity.  And for those troubled by such tradeoffs, this latter reasoning boils to the hoped-for compromise that ‘we can get a lot more equity at very little sacrifice in efficiency’.  Arguing about that claim, economics has spilled a lot of the proverbial ink. \n But why should we in management and organizational theory care about income inequality in the context of what we study and teach?   The short answer is that the primary source for the massive growth in inequality in the US is due to the greater share going to those who are the top managers of public and private firms.  The share of total income in the US earned by the top 1 percent of income earners has gone from 9 percent in 1970 to 23.5 percent in 2007.   While an increase in inequality is to be found in many rich countries, the US distribution is remarkably more skewed. \n If we take a closer look at this 1% (which was approximately for incomes greater than $400,000 in 2007), a substantial number of high-income earners are managers. In fact, according to a recent analysis of individual tax return data, close to half of the top 0.1%—those that make upwards of $2 million—can be categorized as non-finance executives, supervisors or managers.   What is it about business organizations today that are distributing such wealth to their top managers? \n An answer to this story must be consistent with an important stylized fact: the share of remuneration of top managers has increased much faster than the market value of firms. One common argument is that technological change and globalization have led to increasing returns to general managerial talent. We call this ‘the best athlete’ argument.   However, the historical evidence suggests that such change predates this recent turbo-charging of pay. \n Moreover, if an increased demand for scarce managerial talent drives salaries, then we should see a persisting inequality of pay among top executives.  After all, given all the pay for performance, shouldn’t executive pay be more unequal than the pay in the general population? Salaries in Major League Baseball (MLB)—a context that is perhaps closest to a perfect market for talent—exhibit a level of inequality that is slightly higher than what we find in the overall population, but more importantly, consistent over time.  The inequality for executive compensation, on the other hand, fluctuates a great deal, peaking at more than 15% in 2000 above of the inequality found in \nbaseball and then falling by 2009 about 15% below. \n The alternative explanation that we offer in this working paper is that social norms have shifted in the past two decades. The internet boom was an exogenous shock: high stock prices and the adoption of pay for performance knocked some salaries into the stratosphere.  Social comparisons by benchmarking kicked in and inequality fell, BUT now the proportional share of executive compensation to firm market value went dramatically up. \n Executives are surely often very hard working and markets tend to reward that.  However, there is also ambiguity that permits gaming of the system. A strike out or a single is pretty unambiguous and the market for players seems to sort into a fairly stable pay distribution.  This is not the case for executives whose performance is harder to observe.  You would think that boards would do their best to get rid of all the noise they can, such as stock market fluctuations.  But a good deal of research says this is not the case. \n That directors of boards do not try harder to purge noise suggests that the rent-seeking theory of pay can explain this explosion.  However, managerial rent seeking to rise up the income rank seem to have been around much earlier than the start of this historical trend.  And similarly, the argument that the growth in pay is due to technical progress that drives up the value of executive talent also does not explain the pattern, for technical progress has been around for some time in any event.  But the real problem with this argument is that it just not particularly clear why technical progress should cause executive pay to skyrocket in absolute terms relative to skilled labor in general. \n At all levels of society, social comparisons are bound to be made and to provide footholds into gauging self worth.  It’s not compelling that these comparisons need to require such historically astounding degrees of inequality as justified by stories of sudden technical change driving the demand for executive talent –for which there is little evidence.   And, to depart from data, one suspects that such stunning inequities have unpleasant cultural and democratic consequences that are bound to be reflected in the attitudes and behaviors of the business leaders of our age. \n Organization theorists and economic sociologists are well positioned to join other social sciences in the study of the role that social norms and peer benchmarking as well as gender and racial bias play in generating inequality.  This is a global issue that nevertheless begins in the decisions made by business organizations.   That the topic of economic inequality is also entwined in the great political and normative debates of social justice makes our collective contribution all the more desirable. \n Discussion by Shamus Khan \n Bruce and Jerry’s piece is a wonderful primer on elites and inequality. My response is simply a chronicle of my thoughts upon reading it (and their paper, which I would strongly recommend to all). \n First, I think we need to establish why we should care about inequality, particularly if it is driven by wage growth of elites rather than a lowering of the floor of wages for the poorest. Christopher Jencks has done some work arguing that greater inequality is either neutral or bad for societies (but never good) , and I’m a little more convinced by it than I am recent work by Wilkinson and Pickett , which makes the same basic argument. But the Jencks and Wilkinson and Pickett arguments are hardly definitive, and it strikes me that some of the best reasons for caring about inequality are because of the relationships between inequality and mobility. Alan Krueger has argued that there is a “Gatsby Curve” ( slides here ), drawing upon the work of Miles Corak . This has come under some criticism , but I think Corak’s counter-arguments are quite convincing here: there is a tie between rising inequality and declining mobility. \n While the rhetoric of the “1%” has recently led to an important social awakening of the findings of a 2003 study by Piketty and Saez , Kogut and Kim somewhat quietly point to an important corrective: there’s a lot of variation within this category, and perhaps we should be looking at the top 10% within it. From that Piketty and Saez and paper I would particularly point readers to Figure IV, which gets a little less attention than I think it should. One of the things it shows is that in earlier eras (1929), the very wealthy were fundamentally different from others within the rich, insofar as their income stream was from a different source (capital income rather than wage income). A quick way to think of this is that this is a Marxian condition – the super-rich were owners of capital like factories. Today it’s still the case that the very rich are more likely to have capital income than the somewhat rich. But the story is not nearly as dramatic. (Importantly, these data don’t include capital gains). And so today’s rich are more “Weberian” – their position is not as tied to capital ownership but instead tied to wage wealth (money). I point to this because Kogut and Kim argue about the importance of shifting norms, and this might help explain why such shifts have happened. That is, wages have embedded within them the idea of pay-for-performance. So if your wages are high you must be really smart and really hard working and provide lots of value, otherwise you could simply be replaced at a lower wage rate. Such arguments work better with wage income than with capital income. \n The working paper by Kim, Kogut, and Yang provides a welcome evaluation for DiPrete, Eirich, and Pittinsky’s “leapfrog” argument (particularly, why the leapfrogging happens when it does and not in other times – why pay is similar among CEOs in the 2000s rather than an arms race). This argument differs from Olivier Godechot’s work, which makes an argument for managers “holding up” their firms insofar as they have control over assets and can thereby punish firms that do not comply with their salary and bonus demands. For Godechot, this is particularly unique to finance, where such assets are easily transferable to other firms. \n For Kogut and Kim, an exogenous shock of the internet boom created inappropriately “stratospheric” salaries for some, which others started to benchmark themselves against this. This brings up some interesting implications. The first is that the financialization of the economy that has been the focus of so many might be a red herring. While Godechot’s argument is conditional upon finance (or a market sector with easily transferable assets), the mechanism that Kogut and Kim offer does not require the rise of finance. What do you need? Interconnected networks of CEOs wherein a subgroup suddenly is considerably overpaid – high pay diffuses through social networks. What matters is the network structure, not the structure of the economy. \n Yet most readers will wonder: such exogenous shocks are not uncommon within markets, and so why did the diffusion happen now and not before (and not globally – the US was not the only nation to experience a dot-com boom)? There is a hint of an answer; pointing to McCall and Percheski and Western and Rosenfeld (unions), they suggest that organizations that might have constrained this process or sanctioned those engaging in it have been weakened or disappeared. This makes me wonder if we’re really talking about new norms (which I’m defining as expectations for action). Instead, what if the norms are somewhat constant and the constraints are what vary? This is important because if the norms vary we can argue about returning to the era of a “socially responsible CEO” but if they are constant, this kind of discussion doesn’t make sense and instead we ask ourselves about how to construct constraining institutions. \n Finally, I’d point to the importance of inter-elite contention: something often ignored when thinking about constraints upon elites. And this returns us to the finance point. When constraining elites we often think in Marxian terms (even if we’re not Marxists). That means we think of elites as having fairly consistent (or shared) interests, and that to constrain elites, masses must act. But it may well be the case that inter-elite contention is far more effective than any other mechanism for constraining elites – by creating collective action problems and competing interests. Here, then, shifts in markets where certain sectors become increasingly dominant will have large negative effects. And as such, the massive transfer of wealth to the finance sector – perhaps around the order of more than 6 trillion dollars since 1980 – has created conditions wherein within-elite constraints have declined."], "link": "http://orgtheory.wordpress.com/2012/10/08/income-inequality-and-the-management-of-organizations/", "bloglinks": {}, "links": {"http://papers.ssrn.com/": 2, "http://web.williams.edu/": 1, "http://asr.sagepub.com/": 2, "http://milescorak.wordpress.com/": 2, "http://olivier.free.fr/": 1, "http://milescorak.com/": 2, "http://www4.columbia.edu/": 2, "http://www.brookings.edu/": 1, "http://www.amacad.org/": 1, "http://www.aeaweb.org/": 1, "http://sociology.columbia.edu/": 1, "http://www.justiceharvard.org/": 1, "http://www.annualreviews.org/": 2, "http://web.mit.edu/": 1, "http://www.amazon.com/": 2, "http://www.jstor.org/": 2, "http://elsa.berkeley.edu/": 1, "http://qje.oxfordjournals.org/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["A couple of months ago, Bruce Kogut approached me with an idea to do a blog forum discussing inequality and organizational theory. We jumped at the chance. Inequality, of course, is one of the major topics in sociological research, and recently it has gained a lot of attention in management scholarship as well.  Given the interest, we’re going to use our blog forum to highlight new trends in research on organizations and inequality. \n Several prominent scholars working in this area have agreed to write posts about different aspects of how organizational theory treats inequality.  Each post will be accompanied by a commentary from another scholar, which we hope generates more discussion in the comments section. Please feel free to share your thoughts!"], "link": "http://orgtheory.wordpress.com/2012/10/08/blog-forum-on-inequality-and-organizations/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Neil Gross and Ethan Fosse have a new article in Theory and Society on the topic of professorial politics . They use the GSS to answer the question of why professors are very liberal compared to the rest of the US population. They test a number of plausible hypotheses found in the literature on political attittudes of academics – maybe professors are liberal because they are more secular or they are more likely to be Protestant or Jewish. There are some differences, but not a lot variance is explained. \n Gross and Fosse offer an alternative theory – occupational typing. In other words, jobs, for whatever reasons, acquire reputations. In America, nursing is thought to be for women, not men . Then people selectively sort into jobs, independent of the job requirements. Maybe there is nothing intrinsically liberal about being a professor, but once you get a critical mass of liberals , conservatives just stay away. The conclusion of the article is nice because is raises the issue that when it comes to occupations and politics, we probably need a better understanding of reputation and the role it has in attracting people to the job. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/07/why-are-professors-so-liberal/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://www.youtube.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.springerlink.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["I’ve been very lucky. People enjoy the Grad Skool Rulz and they say it helps them. The readers have been very generous in taking a few moments to write some nice words about the book on Smashwords, the e-book website. These reviews signal to potential readers that the Rulz are worth their time. If the Rulz have helped you in your academic career, please click on the link above,  go to the website, and write a review and recommend the book to others. Thanks. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/06/review-the-grad-skool-rulz/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1, "https://www.smashwords.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/05/taiwanese-coverage-of-yesterdays-debate/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["A common problem in social research is selection bias – the people who choose to respond to your survey may be systematically different than the population. We have some methods, like the Heckman model , for adjusting your final model if you have some data that can be used to  model study participation. If you don’t have a decent selection model, you can still make some assessment using the methods suggested by Stolzenberg and Relles , which have you decompose your models and study the properties of the different parts (e.g., look at the degree of mean regression under certain conditions). \n Question for readers: What is the state of art on this issue? Is there something better than Heckman or playing games with Mills ratios? \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/05/selection-bias-in-surverys-recent-developments/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.amazon.com/": 1, "http://www.jstor.org/": 1, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["Hi, Tom Medvetz here with my third guest installment for OrgTheory.* In this little excursion, I’ll extend the “Dude, where’s my social theory?” discussion that’s been percolating on the site over the last couple of months. The main points of that conversation, which originated with Kieran Healy’s August 22 post and continued more recently in Fabio’s posts ( here and here ) were that: (1) the category “theorist” seems to be disappearing as an occupational position in American sociology, and that (2) fewer sociologists identify themselves as theorists. \n There’s no denying the basic fact underpinning the first point: namely, that the number of jobs with the label “theorist” attached to them has gone down in American sociology over the last few decades. Kieran posits that one result of this trend is growing semantic confusion over the meaning of the term theory : \n As a consequence, many people are not sure what, from a disciplinary point of view, theory in sociology is supposed to be any more, or how it should be done, or what if anything distinguishes it from intellectual history, or philosophy, or normative political theory, or humanities-style ‘Theory,’ or mathematical modeling. \n I agree—this is probably true. However, it’s worth pointing out that semantic confusion is neither a necessary nor a ubiquitous feature of the shift being discussed. Furthermore, when we start to think about what it means to “do theory,” the discussion takes on a different cast and the issue of “theory’s” status as an occupational position becomes secondary. \n I’d begin by noting a seeming exception to proposition #2 above: namely, the recent growth of a vibrant network of young sociologists who identify themselves explicitly as “theorists”—best signaled by the popularity of the ASA Theory section’s Junior Theorist Symposium. Started in 2005 by Neil Gross and Michèle Lamont and resumed in 2008 after a two-year hiatus, the event has grown steadily over the past few years. The list of past “senior theorist” discussants includes Andrew Abbott, Jeffrey Alexander, Craig Calhoun, Randall Collins, Phil Gorski, Richard Swedberg, Ann Swidler, Loïc Wacquant, Andreas Wimmer, and Viviana Zelizer.† \n Of course, the popularity of the JTS doesn’t contradict the fact that there are fewer jobs for “theory” specialists. But it does raise another question already anticipated in Kieran’s post: Who are these people, and what do they mean by “theory”? On this general topic, Kieran writes that, “Crudely, the sort of people who once would have thought of themselves. . . primarily as theorists now think of themselves as sociologists of culture instead, or (less often) as disciplinary historians of ideas.” Is this true? Certainly there’s a lot of overlap among these areas—theory, culture, and the history of ideas—in terms of ideas and personnel. Nevertheless, I think there remains, both in the JTS events and in other work done under the banner of “theory” today, a coherent mission that’s not reducible to the sociology of culture per se, or to the history of ideas. It’s also something that can’t be expressed in terms of an opposition between “theoretical” and “empirical” work. I’m referring to the specific focus on the task of analytic construction, including the work of formulating rigorous concepts, historicizing the categories of one’s research (not for its own sake, but as an ongoing feature of their implementation), and taking into account their social effects. And I’d submit that the level of appreciation for these things in American sociology is more important than the specific fate of “theory” as a subdiscipline. \n I can clarify this point by returning to the topic I’ve been discussing on this blog: think tanks. Doubtless the two most common questions I get about my research in this area are: (1) “Which think tanks did you study?” and (2) “Would you consider [ organization X ] a think tank?” These are both perfectly good questions, and they have something important in common: they’re both fundamentally about category boundaries. The first question is essentially, “What is the boundary of your study?”, and the second is, “What is the boundary of the think tank category?” The only thing I don’t like about these questions is that there’s no easy 30-second “elevator version” answer to either of them. That’s because one of the contributions of my study, as I see it, is precisely to build a rigorous analytic concept of a think tank that lays bare some of the hidden features of the reigning political folk concept . \n I say ‘build a rigorous concept,’ but I don’t mean build from scratch. In my case, this has meant applying and extending existing sociological concepts like network and field . And while space limitations prevent me from going into detail here, the conception of a think tank that I develop in the book is decidedly “practice-oriented” (to use a fashionable phrase): To be a think tank, I say, is to become ensnared in a never-ending game of separation and attachment vis-à-vis the more established institutions of academia, politics, business, and the media. Think tanks must constantly signal their “independence” from these institutions, on which they depend for resources, personnel, and legitimacy, even as they use their  associations  with each one to mark their putative separation from the other institutions. It’s from this idea that I develop a description of “policy research” as a hybrid practice of generating policy prescriptions while competing with other think tanks for donations, press coverage, and political attention. \n Why the need to be so “theoretical”? At one level, it allowed me to ask certain important but neglected questions about think tanks. By separating the analytic concept from the political folk concept, I could treat the latter’s growing use in American public and political life as something that needed to be explained. And because some of the organizations now included in the folk category predate the think tank classification by more than 60 years, the process I’m referring to isn’t reducible to a simple story of organizational creation. Instead, it was a complex process of network formation. The term think tank became meaningful only when a formerly disparate array of organizations became oriented to one another in their judgments and practices, and only when the members of this network developed novel intellectual products to separate themselves from more established institutions. \n So being “theoretical” allowed me to focus on the social relations underpinning the emergence of think tanks. At another level, it allowed me to avoid what I saw as the main pitfall in the study of think tanks: the danger of inadvertently becoming harnessed to the interests of think tanks and their affiliated “policy experts.” As I say in the book, “orphaning the think tank for operational purposes subtly harnesses the scholar to its mission because the think tank’s first goal, even prior to that of exercising political influence, is to differentiate itself from its nearest neighbors in social space.” \n *** \n What’s the connection between all this and the “Dude, where’s my theory?” discussion? Two summary points: \n (1) The status of sociological theory is different from its distinctiveness as an occupational position. \n I agree with the gist of the previous discussion as it appears in the posts I linked to above—and there’s nothing in it that contradicts this point. Nor would I deny the importance of the issue raised by Kieran and Fabio. Nevertheless, it seems to me that more relevant than whether or not “theorist” is in decline as an occupational position are some other issues anticipated in Kieran’s original post: inter alia, how strongly do American sociologists appreciate the importance of constructing rigorous analytic concepts? Do we reward those who take seriously the effects of classification systems, including the ones used by social scientists? Is it mandatory or merely optional to subject the conceptual dimension of your own work to relentless self-questioning? The presence or absence of people who specialize in these things might be indicators of theory’s health or sickness. But insofar as we’re all theorists, it’s not a perfect one. \n (2) I ♥ empirical data. \n The notion of “theory” I’m suggesting here (which is far from original) isn’t built on an opposition between “theoretical” and “empirical” work. In fact, in my own experience, being “theoretical” has meant having to gather more data, not less. Or, to be blunt, I didn’t spend two years in the swamp of Washington, DC visiting dozens of think tanks, interviewing their staff members, rooting through their archives, building a database of the educational and career backgrounds of over 1,000 think tank-affiliated policy experts, attending their public events, and even finagling my way into some of their private ones—like some kind of low-rent Irwin M. Fletcher —to be labeled “non-empirical” (if that’s what’s implied in the term “theoretical”). \n  \n The author (left, in disguise) gathering empirical data. \n Nevertheless, the theoretical component of my study, by which I mean the work of analytic construction, required its own effort. If nothing else, it should be clear by now that lurking behind questions like, “Which think tanks did you study?” is a whole series of other questions for which commonsense answers aren’t sufficient.‡ As I put it in the book, “for those involved in the world of policy research and advocacy, the practice of calling one’s organization a ‘think tank’ is rarely a neutral act of self-description. It is also a strategic move in a social game, the rules of which we should try to understand…. [T]o become a think tank is to rise above mere interest-group struggles and claim membership in the ranks of experts.”§ \n __________________________________________ \n NOTES \n * My first and second posts can be found here and here , respectively. \n † My own connection to the JTS is as follows: I presented at the event in 2008; I co-organized it with Michal Pagis in 2011; and I attended all but one of the others. \n ‡ It should also be clear why any answer I give to these questions might threaten to make my study look like some kind of exercise in “deconstruction.” On the first question, consider my two best options. Option #1: \n Questioner :      Which think tanks did you study? \n Me :                  The book is partly a study of the think tank category itself, by which I mean its emergence in public and political life, its changing boundary, and the historical conditions that made the classification possible. \n Questioner :      Come again? \n Me :                  I mean that the focus is not so much on the members of a clearly defined organizational “species” or “type,” but on the social forces and relations that made this blurry concept thinkable in the first place. Only after having examined this process historically could I identify specific org… \n Questioner :      Ah… got it. Now go back to your Parisian café, Derrida. \n But I’m no poststructuralist—far from it—and insofar as my aim was ever to “deconstruct” anything, including the think tank concept, it was only as a prologue to reconstructing it analytically, with lots of empirical data. Which helps to explain why I’ve become partial to option #2: \n Questioner :      Which think tanks did you study? \n Me :                  All of them.‡* \n § I fully grasp the key methodological question raised here: viz. If the think tank category is constitutively fuzzy and always in flux, as I say, then how does one decide which organizations to leave in or out of the study? This will/would have to be a topic for another post, but (very) briefly, the working solution in my case was to sample from various locations in the organizational network, including its center and periphery, and then to consider more broadly how this network was situated within bigger social structures. \n ‡* Plus, as a precautionary measure, I carry around with me a copy of the Empirical Loyalty Oath, which quotes liberally from the Sedition Act of 1918 and reads, in part, “I hereby declare that I am not now, nor have I ever been, a poststructuralist.”"], "link": "http://orgtheory.wordpress.com/2012/10/04/dude-heres-my-social-theory/", "bloglinks": {}, "links": {"http://orgtheory.wordpress.com/": 6, "http://www.imdb.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["From Jest.com . \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/04/grad-skool-scam/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://www.jest.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.amazon.com/": 1}, "blogtitle": "orgtheory.net"}, {"content": ["This Fall’s book forum will address Political Epistemics, a new book by Chicago sociologist Andreas Glaeser . The book investigates life in East Germany before the fall of the Berlin Wall. It’s an ambitious book that has three main aims. First, it’s a political sociology argument. Glaeser argues that social change occurs when there is a break, or shift, in how people develop their identities and have them affirmed by various people and institutions. He calls this the “sociology of understandings.” Second, Glaeser offers a historical account of two groups of people with very different understandings of East German socialism – Stasi officers and Berlin peace activists. Third, Glaeser claims that his sociology of understandings provides a better explanation of the dissolution of East German communism than other theories. \n As you might guess from this thumbnail sketch, the book is epic. It synthesizes a deep knowledge of Western cultural sociology with Glaeser’s own reading of East European history and Communist ideology. There is also a lot of thick description, where Glaeser tracks down former Stasi officers, dissident intellectuals, and works through East German archives. Yet, the book hangs together remarkably well. Though Glaeser is erudite, the text is easy to follow and rich with interesting insights. It’s a wonderful example of how a book can be very sophisticated, yet accessible to most readers. \n This book succeeds on a number of levels, though I do have some reservations, especially when Glaeser goes beyond his interview evidence and extrapolates to the broader issue of why Communism ended. We’ll discuss these strong and weak points in the coming weeks, but for now, I’ll end this introductory post with a discussion of why I chose this specific book. \n First, Political Epistemics has many sociological virtues. The topic – the fall of European Communism – is important and deserves serious attention. The transition away from Communism is a topic I wish that more graduate students would address. As late as the 1980s, much of the world’s population lived under state socialism. Even today, we have a number of nations that have traditional Leninist/Maoist states (e.g., Cuba, North Korea), have leaders who are trying to push in that direction (e.g., Venezuela), hybrid state forms, such as modern China, or nationalist-socialist systems such as the Baath regimes of Hussein era Iraq, Kaddafi’s Libya, and contemporary Syria. Another virtue is that the book is grounded in daily experience. Rather than rely on “grand history,” Glaeser takes the time to uncover the meaning of these political systems by interviewing the people who made these systems a reality. \n Second, I chose this book for personal reasons – Glaeser was an instructor of mine in graduate school. The first time I met Glaeser was when he gave a job talk at the University of Chicago, where I was a young and very annoying graduate student. I was struck by his talk (a precis for Divided in Unity ) because it combined fancy schmancy hermeneutics and ethnography. Later, I took a course in cultural sociology with him. It didn’t resemble any of the “American sociology” courses. He yelled at us once – “What? You don’t know who de Certeau is? What do they teach you around here?”* He also admitted that he doesn’t watch cable TV. But still, he was always very generous when helping students get through the rather imposing corpus of European social theory. He even indulged me in a weird argument about whether the label “critical theory” could be applied to rational choice theories.** So I was quite happy to see that his second book was out. When I read Political Epistemics, I recognize our culture theory syllabus embedded in it. It’s always a pleasure to see how the ideas of the past form the books of the present. \n Next week: How to Understand the Sociology of Understanding \n Adverts:  From Black Power / Grad Skool Rulz \n * Answer: Circa 1999, a lot of Park and Burgess, with a healthy dose of Simmel. And a lot of event history models. \n ** My view was that critical theory was not really an important theoretical distinction. Rather it’s a normative term in disguise, or simply a term for second generation Marxist theory.  I asked, “For example, couldn’t, say, bounded rationality be critical theory in some sense if it lead to some level of reflexivity (as implied by Calhoun’s definition of critical theory)?” Hilarity ensued."], "link": "http://orgtheory.wordpress.com/2012/10/03/glaeser-book-forum-1-the-order-of-battle/", "bloglinks": {}, "links": {"http://orgtheory.wordpress.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.smashwords.com/": 1, "http://sociology.uchicago.edu/": 1, "http://en.wikipedia.org/": 1, "http://books.google.com/": 1, "http://www.amazon.com/": 2}, "blogtitle": "orgtheory.net"}, {"content": ["The art website Hyperallergic has a nifty new diagram illustrating the networks of artists responsible for abstract expressionism. \n Adverts:  From Black Power / Grad Skool Rulz"], "link": "http://orgtheory.wordpress.com/2012/10/02/abstract-art-networks/", "bloglinks": {}, "links": {"http://www.smashwords.com/": 1, "http://orgtheory.wordpress.com/": 1, "http://feeds.wordpress.com/": 1, "http://hyperallergic.com/": 1, "http://www.amazon.com/": 1}, "blogtitle": "orgtheory.net"}]