[{"blogurl": "http://blog.goldenhelix.com\n", "blogroll": [], "title": "Our 2 SNPs...®"}, {"content": ["Golden Helix is proud to announce our participation in EA’s 2012 “Leave Your Fingerprint on the Cure.” This event will be taking place at ASHG 2012 in San Francisco at the Moscone Center on November 7th. The fifth annual “Leave … Continue reading →"], "link": "http://blog.goldenhelix.com/?p=1505", "bloglinks": {}, "links": {"http://blog.goldenhelix.com/": 1}, "blogtitle": "Our 2 SNPs...®"}, {"content": ["Recently, I have been spending some time analyzing real patient data. I’m preparing for a webcast I’ll be giving in which I will walk through the process of replicating the findings of Dr. Gholson Lyon‘s study on the novel disease … Continue reading →"], "link": "http://blog.goldenhelix.com/?p=1482", "bloglinks": {}, "links": {"http://blog.goldenhelix.com/": 1}, "blogtitle": "Our 2 SNPs...®"}, {"content": ["Dr. Folefac Aminkeng is a Postdoctoral Fellow at The Centre for Molecular Medicine and Therapeutics (CMMT) at the University of British Columbia in Vancouver, BC, Canada. He utilizes GWAS studies to identify single-nucleotide polymorphisms (SNPs) that might be associated with … Continue reading →"], "link": "http://blog.goldenhelix.com/?p=1473", "bloglinks": {}, "links": {"http://blog.goldenhelix.com/": 1}, "blogtitle": "Our 2 SNPs...®"}, {"content": ["Date: Wednesday, October 24th, 12:00 pm EDT | 4:00 pm UTC Presenter: Gabe Rudy, VP of Product Development Register: https://www2.gotomeeting.com/register/898569818 Abstract Next-generation sequencing of DNA has shown to be a successful tool to discover causal variants of rare, highly penetrant … Continue reading →"], "link": "http://blog.goldenhelix.com/?p=1467", "bloglinks": {}, "links": {"http://blog.goldenhelix.com/": 1}, "blogtitle": "Our 2 SNPs...®"}, {"content": ["Since Dr. Ken Kaufman gave his webcast on Identifying Candidate Functional Polymorphisms in SVS, we’ve been working  with Dr. Kaufman to simplify and automate many of the steps in his workflow.  I touched on this in my last blog post, … Continue reading →"], "link": "http://blog.goldenhelix.com/?p=1451", "bloglinks": {}, "links": {"http://blog.goldenhelix.com/": 1}, "blogtitle": "Our 2 SNPs...®"}, {"content": ["At Golden Helix, we are committed to accelerating ground-breaking research in genetics, drug discovery, and predictive analytics to dramatically improve human health while focusing on our workplace culture, personal development, and strong values.  Our business is growing, and we need … Continue reading →"], "link": "http://blog.goldenhelix.com/?p=1448", "bloglinks": {}, "links": {"http://blog.goldenhelix.com/": 1}, "blogtitle": "Our 2 SNPs...®"}, {"content": ["Editor’s Note by Gabe Rudy: I’ve had the chance to exchange thoughts, emails, and blog post comments for a while now with Jeff as he has written posts on NGS Leaders and engaged with me on 23andMe. He has also … Continue reading →"], "link": "http://blog.goldenhelix.com/?p=1434", "bloglinks": {}, "links": {"http://blog.goldenhelix.com/": 1}, "blogtitle": "Our 2 SNPs...®"}, {"content": ["It has now been about a year since Illumina and Affymetrix announced their respective exome genotyping arrays.  Both products were launched with ambitious visions of how they would enable researchers to learn significantly more about the cause of human diseases. … Continue reading →"], "link": "http://blog.goldenhelix.com/?p=1423", "bloglinks": {}, "links": {"http://blog.goldenhelix.com/": 1}, "blogtitle": "Our 2 SNPs...®"}, {"content": ["Golden Helix announced it would offer a complimentary genome browser for visualizing DNA and RNA-Seq data back in October of 2011; however no release date was disclosed at that time. Well, after much blood, sweat, and tears, we are VERY … Continue reading →"], "link": "http://blog.goldenhelix.com/?p=1414", "bloglinks": {}, "links": {"http://blog.goldenhelix.com/": 1}, "blogtitle": "Our 2 SNPs...®"}, {"content": ["Dr. Ken Kaufman’s extremely popular webinar inspired us to build new tools that would simplify the process of analyzing whole-exome DNA sequencing data even further.  First I’ll describe the tools showcased in the webcast.  Then I’ll detail the new tools … Continue reading →"], "link": "http://blog.goldenhelix.com/?p=1409", "bloglinks": {}, "links": {"http://blog.goldenhelix.com/": 1}, "blogtitle": "Our 2 SNPs...®"}]