[{"blogurl": "http://permut.wordpress.com\n", "blogroll": [], "title": "Permutations"}, {"content": ["From class to news to research question. So, this morning in class I taught  an article  using the  network scale-up method . It’s a great technique that’s been used to explore a number of interesting questions (e.g.,  war casualties , and  HIV/AIDS ). \n I came back from that class to  this article  pointing to a debate on voter ID laws, and I couldn’t help but think that there has to be a meaningful way to throw this method at this question to estimate plausible bounds for the actual potential impact of these laws. And furthermore, it seems especially important because people without IDs are likely quite hard to accurately enumerate on there own (as are those who’ve engaged in voter fraud). \n So, has this study already been published and i just missed it? Else, does someone have the data we’d need for that? I’m hoping it’s a solved question, as i assume its something it would be better to have known a few months ago than a few weeks from now. Anywho, just puzzling over a salient question that linked together some events from my day. \n (Cross-posted) \n Tagged: methodology , networks , policy , statistics"], "link": "http://permut.wordpress.com/2012/10/23/how-many-indeed/", "bloglinks": {}, "links": {"http://aje.oxfordjournals.org/": 1, "http://www.sciencedaily.com/": 1, "http://www.escholarship.org/": 1, "http://nersp.ufl.edu/": 1, "http://permut.wordpress.com/": 4, "http://www.columbia.edu/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "Permutations"}, {"content": ["Reblogged from re-musing:  \n I’ve been thinking about how to visualize a set of categorical correspondence comparisons for a while now, and haven’t really come up with a solution i’m satisfied with. So, i’m asking if someone out there can help me out. Basically what i have is 30 observations, and they are each differentially distributed over 6 groups. I want a way to (ideally visually) convey those differences. \n  Read more… 257 more words  \nI need some help visualizing quite a bit of categorical information. Any assistance welcomed."], "link": "http://permut.wordpress.com/2012/10/16/873/", "bloglinks": {}, "links": {"http://shrinkingisaac.wordpress.com/": 3}, "blogtitle": "Permutations"}, {"content": ["Reblogged from re-musing: \n Yesterday and today i’ve been at our AU faculty “retreat” in Cambridge (no, not that one , or that one , Cambridge, MD  on the Chesapeake). Yesterday’s keynote was by Scott Page , who basically worked his way through some of the main insights from his book The Difference . I really enjoyed both the book and the talk (which was really TED-like, in the good way, not the bad way*). \n  Read more… 482 more words"], "link": "http://permut.wordpress.com/2012/10/15/872/", "bloglinks": {}, "links": {"http://masi.umich.edu/": 1, "http://shrinkingisaac.wordpress.com/": 2, "http://en.wikipedia.org/": 3, "http://press.princeton.edu/": 1}, "blogtitle": "Permutations"}, {"content": ["Dan Hirschman has a great review of the new book on quantitative and qualitative methodology by Goertz and Mahoney. \n One of the things Goertz and Mahoney offer are two lists describing the different tendencies of quantitative and qualitative work.  I’d like to briefly comment on a couple of the contrasts which are accurate descriptions of common practice in quantitative methodology, but less so of best practice.  The first issue is how quants and quals think about non-linearity, the second is about their preference for within vs. across case variation. \n After describing how qual researchers account for non-linearity, Dan says: \n Of course, a quantitative model could accommodate these sorts of conceptual mass points, but it’s very much against the norms of the culture. Instead, we’d tend to load GDP/capita (or maybe log GDP/capita) into a regression equation, which thus implicitly assumes that all variation is meaningful, and that an extra $1000 is equally meaningful across the spectrum (or that a change of 10% is equally meaningful, in the log context). \n I wouldn’t say modeling non-linearity is against the norms of the culture.  In fact, a failure to do so is something quant experts consider an elementary flaw.  Its interesting that it nonetheless gets through peer review so often.  Even if modeling non-linearity is part of agreed upon best practices, it is interesting and important that, as Dan says, it often isn’t done. \n The book also observes that quants, compared to quals, are more likely to emphasize between case variation as compared to within case variation.  I think there is something to this, but one of the things that distinguishes the most rigorous quantitative research is that it often capitalizes on within case variation from panel data. \n Keep in mind that I haven’t read the book, so I’m not sure the extent to which I’m responding to Dan vs. responding to Goertz and Mahoney.  But regardless, you should go read Dan’s review… its quite interesting."], "link": "http://permut.wordpress.com/2012/10/09/dan-reviews-goertz-mahoney-on-quant-vs-qual/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://asociologist.com/": 1}, "blogtitle": "Permutations"}, {"content": ["I love blogging about blogs, so let me point you to a new working paper entitled “Do Political Blogs Matter? Corruption in State-Controlled Companies, Blog Postings, and DDoS Attacks.”  I certainly like the idea that blogs can be tools to fight corruption.  But, and I say this as someone who hasn’t read the paper, I don’t know how much should we care about the result that online criticism caused very short-term changes in stock prices.  Perhaps Brayden King, with his interest in activism directed towards private companies, would have an interesting comment. \n \n The authors are economists, Ruben Enikolopov, Maria Petrova, and Konstantin Sonin.  The paper is here  and the abstract: \n Though new media has become a popular source of information, it is less clear whether or not they have a real impact on economic activity. In authoritarian regimes, where the traditional media are not free, this potential impact might be especially important. We study consequences of blog postings of a popular Russian anti-corruption blogger and shareholder activist Alexei Navalny on the stock prices of state-controlled companies. In an event-study analysis, we find a negative effect of company-related blog postings on both daily abnormal returns and within-day 5-minute returns. To cope with identification problem, we use the incidence of distributed denial-of-services (DDoS) attacks as a variable that negatively affects blog postings, but is uncorrelated with other determinants of asset prices. There is a substantial positive effect of the DDoS attacks on abnormal returns of the companies Navalny wrote about, and this effect is increasing in amount of his attention to these companies. The effect is decreasing in attention to posts of other top bloggers, increasing in visitors’ attention to Navalny’s posts, and is consistent with more pronounced individual, in contrast to institutional, trading. Finally, there are long-term effects of certain types of posts on stock returns, trading volume, and volatility. Overall, our evidence implies that blog postings about corruption in state-controlled companies have a negative causal impact on stock performance of these companies."], "link": "http://permut.wordpress.com/2012/10/01/new-media-matters/", "bloglinks": {}, "links": {"http://papers.ssrn.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "Permutations"}, {"content": ["(cross-posted here ) \n I just completed Gabriel Rossman ‘s Climbing the Charts: What Radio Airplay Tells Us about the Diffusion of Innovation . Basically the question at the heart of the book is what makes a song (or songs in general) popular? As with Fabio Rojas’s take on it, I found the book really interesting, enjoyable to think through and useful to think with. He summarizes one aspect i especially liked about the book: \n Rossman has a simple, but powerful, idea. The different stories imply different diffusion curves (graphs that map market saturation vs. time). Each story comes with a different curve. The “lightning in a bottle” story (hot songs diffuse through market networks) has a classical S-shaped curve. Promotion by the record industry has a discontinuous step function… \n I agree that’s one of the particular strengths of the book. I also think it’s readily teachable, and will likely make an appearance in a future iteration of intro and/or my undergrad networks class. I have only a couple of minor quibbles with it, which largely stem from my not being in the sociology of culture inner-circle, and may be readily apparent to those who are. \n First, an alternative that is not really discussed much at all is the perhaps obvious (strawman?) possibility that songs simply become popular because of their quality. I know that there’s some work elsewhere (e.g., Matt Salganik’s experiments ) to address this, and it may be a “settled” enough question in the literature, but i felt some treatment of it in the book would have helped the argument to stand a little more on its own (especially as i’d like for teaching it). \n The other is even more minor, and perhaps even more about my ignorance than the book’s shortcoming(s). Late in the book (see section 7.3) Rossman mentions how (1) limited potential bandwidth and (2) how the licensing process works in practice combine to make this in essence a closed, and relatively stable system (in terms of population boundaries). Perhaps this is a (so pervasive) detail that i should have known, but to be frank, i didn’t really have an inkling of it until the closing pages of the book. This wouldn’t be that big of a deal, except that I was definitely reading this book more along the lines of the part of the title coming after the colon than the part before. That’s to say that i was thinking throughout about what this case tells us generically about patterns of diffusion. As such, that we are working with a system with these characteristics is highly influential to what cases this one can (and can’t) speak to, and how the particularities of what’s being examined here may be constrained. As such, it’s a detail i would have liked fleshed out (about as much as it was in the conclusions) a lot earlier. As it is i am left wanting to go back and rethink through some of the earlier ideas in the book with this tidbit in hand, assuming my understanding/interpretation/uses for some of the details in the previous models might be accordingly adjusted. \n Neither of these should be read as at all damning critiques of the book. Definitely recommended."], "link": "http://permut.wordpress.com/2012/09/29/diffusion-and-the-pop-song/", "bloglinks": {}, "links": {"http://orgtheory.wordpress.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.princeton.edu/": 1, "http://shrinkingisaac.wordpress.com/": 1, "http://press.princeton.edu/": 1, "http://www.ucla.edu/": 1}, "blogtitle": "Permutations"}, {"content": ["Double posted from here . \n So, i’m fiddling with some citation data for a few Demography journals,* and came up with a couple of weird data points that i can’t account for, so thought i’d see what teh intertubes could tell me about it. Basically, early in the process of working with this sort of data, I like to take a look at “Citation Age” information.** This gives a sense of how old the literature is that people are drawing on in a given time period. These often roughly follow linear increases (though the rate of “aging” differs across fields). Anyway,  this one presented a couple of pretty extreme outliers (i’ve done this more than just a couple of times, and haven’t seen others this different). I can’t account for them, so am looking for any potential explanations. \n Unfortunately the data isn’t currently in a format that would let me actually “solve” what’s accounting for this, but i should be able to soon, so it could be fun to see whose/which theories hold up. Anyway, if looking at this information by year, 1988 and 1991 are considerable outliers (see the plot after the jump). It would appear that most of the “blip” in 1988 comes from increased citations to work roughly 50 years before, while the one in 1991 comes from citations to work roughly 70 years earlier. Given that i’m not a “full fledged” demographer (training-wise), i’m guessing others of you might be able to help me out here. What happened in 1988 that led people to suddenly read/cite work from the 1930s and from 1991 to suddenly read things from the 1920s***? All potential explanations welcome. \n \n \n  \n Citation Age (in PDR, Dem, PRPR & PS) 1983-2012 \n \n \n _________ \n * This currently includes  Demography ,  Population Studies ,  PDR  and  PRPR . I’m happy to quibble with this definition of the “general” demography journals, and am definitely open to other suggestions. However, i think that’s likely a slightly separate question. I did initially aim to also include Demographic Research, but ISI (my main data source) didn’t start indexing that until 2005, so its considerable censoring made keeping it seem wonky. \n ** There are lots of different ways to compute “citation age” and after discussing this more times than those who work with me on these things would like, we’ve settled on typically using the option that basically depends on single cited-citing pairs contributing one observation (not a unique cited papers list, nor a citing paper-wise average). We think the others could be interesting, but for answering questions other than those we’re typically after. \n ***So far, we have one theory for the 1991 one which i’m looking into."], "link": "http://permut.wordpress.com/2012/09/17/calling-all-demographers/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://shrinkingisaac.wordpress.com/": 2}, "blogtitle": "Permutations"}, {"content": ["Most educated people have no idea how important the Fed is.  I’m not the best guy to explain it to you, but since not everyone reads Paul Krugman, let alone Scott Sumner, I should say something… \n These past few years we’ve really really needed a bit more inflation and its finally coming.  Ben Bernanke recently announced that the Fed will finally do more to juice the economy.  This NyTimes article about it gives too much space to the “conventional wisdom,” and pays too little attention to the economists who have been, for years now, arguing that the Fed should be more active.  While not everyone agrees about the desirability of quantitative easing, the ranks of QE3 supporters have been growing and they include a diverse bunch: conservatives and liberals, monetarists and Keynesians of various stripes: Paul Krugman and Brad Delong,  Tyler Cowen and Scott Sumner. \n Glass half-full: I think the Fed has just given us a big nudge towards better times. \n Glass half-empty: A lot of people are hurting in this economy, and its incredibly sad that the Fed didn’t do more sooner to help.  This is arguably the most under-reported story of the recession.  It didn’t have to be this bad."], "link": "http://permut.wordpress.com/2012/09/15/the-role-of-the-federal-reserve/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.nytimes.com/": 1}, "blogtitle": "Permutations"}, {"content": ["So this isn’t totally irrelevant: \n \n My brother, Matt Bishop, has started a social enterprise whose goal is to use social media, and social network analysis (aka “social analytics”) to help charitable groups raise money, and help businesses do their part as well. \n \n iGiveMore is launching tomorrow.  They already offer some services, but they need our help to raise money (and publicity) so that every month that passes they have more to offer. \n \n Check out their website , and then I hope you’ll consider donating, and emailing or posting a link to iGiveMore on facebook. \n \n Thanks, \n Mike"], "link": "http://permut.wordpress.com/2012/08/22/social-networks-for-charity/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "https://igivemore.org/": 1}, "blogtitle": "Permutations"}, {"content": ["As was announced on the website last spring: \n The fifth Joint Japan-North America Mathematical Sociology Conference will be held on Thursday, August 16, 2012 in the Colorado Convention Center, Denver, Colorado. The conference focuses on advancement of mathematical sociology worldwide and fosters friendship among those whose work is on mathematical sociology in all countries. Thus this is a wonderful opportunity to know cutting-edge topics in mathematical sociology and to meet people who share great enthusiasm for it. \n To register, please download  this form  and follow the included instructions. If you have questions please e-mail  Yoshimichi Sato . \n Unfortunately I will miss most of it, but look forward to meeting people there towards the end of the day."], "link": "http://permut.wordpress.com/2012/08/14/math-soc-pre-asa-conference-wed-aug-16/", "bloglinks": {}, "links": {"http://www.mathematicalsociology.org/": 1, "http://feeds.wordpress.com/": 1, "http://www.ucla.edu/": 1}, "blogtitle": "Permutations"}]