[{"blogurl": "http://pixel-shaker.fr\n", "blogroll": [], "title": "Pixel shaker"}, {"content": ["La semaine dernière, à l'occasion de ma participation au jury de thèse de J. Mitra ( Multimodal Image Registration Applied to Magnetic Resonance and Ultrasound Prostatic Images - bravo à la nouvelle docteure), j'ai donné un séminaire dans le cadre du master VIBOT . \n\n Le sujet du séminaire était : les similarités entre images, locales et non-métrique. J'ai tenté de faire passer le message de l'utilité de mesures locales (bien construites) et de l'intérêt d'utiliser des mesures qui ne sont pas des distances. \n\n Le diaporama est disponible sur la page ... des diaporamas . \n\n FMN"], "link": "http://pixel-shaker.fr/fr/2012/10/seminaire-vibot-local-and-non-metric-similarities-between-images/", "bloglinks": {}, "links": {"http://www.vibot.org/": 1, "http://pixel-shaker.fr/": 1}, "blogtitle": "Pixel shaker"}, {"content": ["Inauguration de billets consacrés à des nouvelles et articles du net, liés au traitement et à l'analyse d'images - Pour ce premier essai, je case un certain nombre d'entrées qui peuvent un peu dater (quelques mois). \n\n \n Why We Created Julia : une proposition d'un langage dédié au calcul numérique assez ambitieux. Je n'ai pas encore pris le temps de fouiller en détail, mais le programme est alléchant : We want the speed of C with the dynamism of Ruby. We want a language that’s homoiconic, with true macros like Lisp, but with obvious, familiar mathematical notation like Matlab. We want something as usable for general programming as Python, as easy for statistics as R, as natural for string processing as Perl, as powerful for linear algebra as Matlab, as good at gluing programs together as the shell. Something that is dirt simple to learn, yet keeps the most serious hackers happy. We want it interactive and we want it compiled. \n Livre: Programming Computer Vision with Python chez O'Reilly. J'aime Python et la vision artificielle, j'ai donc acheté ce livre (en numérique). Pas encore lu en détail, mais la table des matières et un survol des pages me laissent penser qu'il y a une bonne explication de l'utilisation de Python en analyse/traitement d'image. \n Hany Farid: Image Search for Image Forensics . J'aime beaucoup les écrits d'H. Farid, chercheur en imagerie légale ( image forensics ). Ici il explique clairement comment des systèmes de recherche d'images par le contenu peuvent être utilisés pour détecter des falsifications. En particulier, la présence d'une image (ou d'une partie de) dans d'autres contextes peut être une preuve de falsification. \n The Curiosity Super-Resolution Challenge : Igor Carron nous propose un défi lié à l'actualité. Il s'agit de fabriquer un panorama haute-résolution du cratère Gale à l'aide d'un dictionnaire construit à partir d'images et en faisant de l' inpainting de la version basse-résolution du panorama. (Note perso : comment traduire inpainting ?) \n What defines a functional programming language? Article très sympa à lire qui cherche à définir l'essence d'un langage fonctionnel. Après avoir éliminé les définitions classiques (présence de fonctions de première classe, lambdas, ...), la définition retenue (que j'apprécie) est : A functional programming language is a language that emphasises programming with pure functions and immutable data . \n \n\n C'est tout pour aujourd'hui. \n\n FMN."], "link": "http://pixel-shaker.fr/fr/2012/09/cabotages-internautes/", "bloglinks": {}, "links": {"http://clojurefun.wordpress.com/": 1, "http://julialang.org/blog": 1, "http://nuit-blanche.blogspot.fr/": 1, "http://www.fourandsix.com/blog": 1, "http://www.janeriksolem.net/": 1}, "blogtitle": "Pixel shaker"}, {"content": ["Comme je suis co-organisateur (avec C. Larabi et D. Nicholson) de cette journée, je profite de mon blog pour en faire un peu de publicité. \n\n La journée aura lieu le 20 septembre 2012 à Telecom ParisTech - Amphi Saphir. \n\n Le pitch : \n\n La mesure de la qualité des images/vidéos est une problématique de recherche à laquelle se trouvent confrontées bon nombre d’équipes à la fois académiques et industrielles. Une solution consiste à réaliser une notation subjective de la qualité d’une image (par rapport à une référence ou sans référence) par un panel d’observateurs. Or la mise en place de tels tests psychophysiques est fastidieuse et est en pratique peu appliquée, car elle doit respecter des normes clairement établies. Des solutions algorithmiques (i.e., mesures objectives) ont alors été développées afin d’éviter le recours à de tels tests. Certaines de ces mesures intègrent à divers degrés des modélisations du système visuel humain (SVH) afin de reproduire le plus fidèlement possible le comportement d’un observateur. \n\n Le programme : \n\n \n Tutorial : à confirmer (10:00-11:00) \n 11:00 - 11:30 - Détermination locale de la netteté d’un système imageur par analyse en ondelettes - Lâmân Lelégard (MATIS, IGN) \n 11:30-12:00 - Indices de netteté par mesure de cohérence de phase - Arthur Leclaire (MAP5, Université Paris Descartes) \n 12:00 - 12:30 - Image Quality Estimation based on Distortion Classification - Aladine Chetouani (L2TI, Université Paris 13) \n 14:00-14:30 - Caractérisation des distorsions par l’exploitation des points d’intérêt - Michaël Nauge (XLIM-SIC, Université de Poitiers) \n 14:30-15:00 - Mesure agnostique de la qualité des images sans référence - Christophe Charrier (GREyC, Université de Caen) \n 15:00-15:30 - Mesure sans référence de la qualité des vidéos télédiffusées à l'aide des cartes de saillance - Hugo Boujut (LABRI, Université de Bordeaux) \n 15:45-16:15 - T-V-Model, un model paramétrique standardisé pour estimer la qualité audiovisuelle des services IPTV - Marie-Neige Garcia (Telekom Innovation Laboratories & TU Berlin/AIPA, Allemagne) \n 16:15-16:45 - Repousser les limites de l’identification faciale en contexte de vidéo-surveillance - Cécile Fiche (GIPSA-lab, Grenoble) \n 16:45-17h15 - Détection automatique d’erreurs de segmentation pour la reconnaissance par l’iris - Thierry Lefevre (Thales / Télécom SudParis) \n 17:15-17:30 - Conclusion \n \n\n Plus d'informations sur le site du GDR ISIS . \n\n FMN."], "link": "http://pixel-shaker.fr/fr/2012/09/exploitation-des-metriques-a-reference-reduite-et-sans-reference-dans-les-systemes-dimagerie-journee-gdr/", "bloglinks": {}, "links": {"http://gdr-isis.fr/": 1}, "blogtitle": "Pixel shaker"}, {"content": ["Il y a quelques jours, un collègue m'a indiqué l'existence d' Halide , ce qui semble être un nouveau langage de programmation, orienté traitement d'image. Concrètement, c'est actuellement une surcouche au C++ limitée aux plateformes Mac et Linux. Un manque sérieux de documentation est également évident. \n\n Jetons un oeil à un exemple. \n\n Func blur_3x3(Func input) {\n Func tmp, blurred;\n Var x, y, xi, yi;\n\n // The algorithm - no storage or order\n tmp(x, y) = (input(x-1, y) + input(x, y) + input(x+1, y))/3;\n blurred(x, y) = (tmp(x, y-1) + tmp(x, y) + tmp(x, y+1))/3;\n\n // The schedule - defines order, locality; implies storage\n blurred.tile(x, y, xi, yi, 256, 32)\n   .vectorize(xi, 8).parallel(y);\n tmp.chunk(x).vectorize(x, 8);\n\n return blurred;\n} \n \n\n Le code de ce filtre flou séparable est très clair. On distingue bien la structure séparable. De plus, on constate que l'image d'entrée est représentée par une fonction, de même que l'image de sortie. Les méthodes tile et vectorize semblent permettre une optimisation parallèle. \n\n Ce langage est donc prometteur. Il permet la programmation fonctionnelle parallélisée, tout en proposant un code concis, clair et rapide. \n\n FMN. \n\n ps : j'ai également trouvé un fil de discussion concernant Halide sur developpez.com ."], "link": "http://pixel-shaker.fr/fr/2012/08/halide-un-nouveau-langage-dedie-au-traitement-dimage/", "bloglinks": {}, "links": {"http://www.developpez.com/": 1, "http://halide-lang.org/": 1}, "blogtitle": "Pixel shaker"}, {"content": ["Depuis ce matin, je suis à nouveau assis à mon bureau et à naviguer dans les couloirs pour saluer les collègues. \n\n Quelques nouvelles rapides, avant de publier des billets plus conséquents dans les jours qui viennent. \n\n Mon début d'année est assez chargé, mais heureusement il contient quelques activités bien intéressantes : \n\n \n deux thèses à rapporter. Ce qui signifie deux manuscrits à lire consciencieusement. L'une porte sur le recalage d'images médicales multimodales et l'autre sur l'analyse et le traitement des structures et irrégularités dans des images. Les soutenances auront lieu dans les contrées exotiques de la Saône-et-Loire pour l'une et de l'Autriche pour l'autre. \n un module à monter sur le traitement d'image, dans le master par correspondance qui se crée. Nous verrons si j'arrive à pondre un texte suffisamment motivant pour des étudiants seuls devant leur écran. \n un court module de quelques heures à préparer pour le master international VIBOT de l'université de Bourgogne. Le contenu prévu est : mesures de similarité entre images et utilisation avancée de la transformation de Fourier discrète. \n \n\n Sinon comme d'habitude, j'assurerai mon cours sur la transformée de Fourier aux étudiants de 2de année de GEII ( module MA31 ). \n\n FMN."], "link": "http://pixel-shaker.fr/fr/2012/08/en-ce-debut-dannee-2012-2013/", "bloglinks": {}, "links": {"http://www.vibot.org/": 1, "http://pixel-shaker.fr/": 1}, "blogtitle": "Pixel shaker"}, {"content": ["L'évaluation des performances des systèmes de vision est bien souvent empirique. Comme le mentionne Bernd Jähne ( 1 ), c'est une partie bien souvent négligée. Les critères utilisés pour évaluer un système sont : \n\n \n la réussite de la tâche, \n la précision, \n et la vitesse. \n \n\n Comme je l'ai indiqué précédemment , nous devrions ajouter à ses critères celui de la capacité d'une proposition à enrichir les connaissances sur l'objet étudié. \n\n Malheureusement, ces critères (réussite, précision, vitesse) sont le plus souvent définis empiriquement. C'est-à-dire que le système est confronté à un ensemble d'images qui peuvent être synthétiques ou issues du monde réel. Les performances sont alors estimées selon la réussite/précision/vitesse du traitement des images. \n\n C'est également de cette manière qu'un système est réglé. Les paramètres sont ajustés pour obtenir une bonne réussite/précision/vitesse de traitement. \n\n Pourtant, il serait bon de définir des propriétés fondamentales devant être vérifiées par un système. L'énoncé de propriétés théoriques permettrait de comparer plus aisément les systèmes et algorithmes entre eux. De plus, cela ouvrirait la voie à l'obtention de systèmes optimaux. \n\n C'est ainsi que Canny en 1986 a posé les bases d'un détecteur de contours optimal. Les propriétés fondamentales cherchées étaient : bonne détection, bonne localisation et réponse unique. Le filtre de Canny ainsi obtenu garantit une réponse optimale à ces critères, quelle que soit l'image traitée. \n\n Il me semble que les domaines ayant bénéficié d'avancées sont ceux dont les objectifs et les propriétés recherchées ont été formalisés. Par exemple : les détecteurs de contours ou la classification. \n\n Il reste des domaines où l'empirisme règne en maître. Il serait bon d'apporter des réponses à des questions telles que : \n\n \n Quelles sont les propriétés fondamentales d'un système de reconnaissance d'objets ? \n Quelles sont celles d'un système d'indexation d'images ou d'un algorithme de segmentation ? \n \n\n FMN. \n\n \n \n \n\n \n B. Jähne et H. Haussecker, « Computer Vision and Applications - A Guide for Students and Practionners », Academic Press, 2000.  ↩"], "link": "http://pixel-shaker.fr/fr/2012/03/comment-eviter-lempirisme-pour-evaluer-ou-regler-un-systeme-de-vision%e2%80%89/", "bloglinks": {}, "links": {"http://fr.wikipedia.org/": 1, "http://pixel-shaker.fr/": 1}, "blogtitle": "Pixel shaker"}, {"content": ["Je suis actuellement en train de préparer un cours sur la vision artificielle. Je relis donc mes classiques. Ainsi, le livre « Vision par ordinateur - outils fondamentaux » de Horaud & Monga est un incontournable, parce qu'il est bien écrit et en français, même s'il date un peu ( ici en ligne ). \n\n Dans l'introduction, les auteurs indiquent que \n\n \n la reconnaissance visuelle doit être fiable et rapide \n \n\n , ce qui semble tomber sous le sens. \n\n Cependant, c'est une vision idéaliste. Un grand nombre de problèmes n'admettent pas de telles solutions. Il n'est évidemment pas question d'abandonner la fiabilité, sinon le système n'est pas utile. Par contre, la rapidité n'est pas forcément une propriété essentielle. Ce peut l'être pour l'ingénieur confronté à un problème incluant des contraintes de temps de calcul. Par contre pour le chercheur, je pense qu'il vaut mieux proposer une solution fiable et lente, si cette solution est nouvelle, plutôt que pas de solution du tout. \n\n Ainsi à ces deux propriétés, j'en ajouterais une troisième, plus essentielle - du moins pour le chercheur en vision : \n\n \n la reconnaissance visuelle doit être instructive. \n \n\n Le système proposé doit permettre de mieux comprendre ce qu'est la vision artificielle, même si à la limite il ne permet pas de résoudre un problème donné. Il doit enrichir la connaissance sur l'image numérique, son analyse et ses interactions. \n\n FMN."], "link": "http://pixel-shaker.fr/fr/2012/02/les-proprietes-essentielles-dun-systeme-de-vision/", "bloglinks": {}, "links": {"http://perception.inrialpes.fr/": 1}, "blogtitle": "Pixel shaker"}, {"content": ["S. Bayram, H.T. Sencar and N. Memon, \"A survey of copy-move forgery detection techniques\", IEEE Western New York Image Processing Workshop, 2008. \n\n Objectifs \n\n Cet article dresse un état de l'art la détection de falsification d'images par copier-coller. \n\n Méthodologie/Résultats principaux \n\n Une méthode de contrefaçon d'image consiste à copier une portion pour la coller sur une autre partie pour recouvrir une information importante. Le résultat est une falsification qui conserve la plupart des propriétés de l'image, puisque la modification est interne. \n\n La duplication peut faire intervenir des modifications géométriques (rotation ou homothétie) ou de valeurs (flo ou ajout de bruit). Une bonne détection doit donc être robuste à ces modifications. \n\n La détection de ce type de falsification revient donc à détecter des duplicatas dans une image. \n\n Les approches possibles \n\n \n Recherche exhaustive (explosion combinatoire) \n Utilisation des propriétés de l'intercorrélation (ne semble fonctionner que si de grandes portions de l'image sont dupliquées). \n Mise en correspondance de blocs. Cette méthode est la plus étudiée dans la communication. Il s'agit de découper (segmenter) l'image en blocs qui se recouvrent. La tâche consiste alors à détecter les blocs connectés qui ont été copiés et collés. \n \n\n Il est, dans ce dernier cas, important de disposer d'une représentation robuste des blocs. L'autre difficulté réside dans la comparaison des paires de blocs, qui doit être rapide. \n\n Les représentations des blocs \n\n La première opération consiste à découper l'image en blocs, puis chaque bloc doit être réprésenté : \n\n \n Par DCT ( Discrete Cosine Transform ) : robuste au bruit \n Par PCA ( Principal Component Analysis ) : robuste à la compression et au bruit, mais sensible au rééchantillonnage. \n Utilisation de la DWT ( Discrete Wavelet Transform ) pour décomposer l'image en quatre sous-bandes, puis divisions des sous-bandes en blocs recouvrant. Avantage : réduction du nombre de blocs. Puis applications de la SVD ( Singular Value Decomposition , analogue à PCA). Au final, cette méthode est robuste à la compression seulement. \n Utilisation des données couleur de chaque bloc (moyenne des canaux rouge, vert et bleu par exemple) : très robuste à la compression, au flou gaussien et au bruit. \n Récemment (par rapport à 2008), la transformée de Mellin-Fourier à été employée. Un vecteur est obtenu par projection 1D des valeurs du domaine log-polaire. Au final : robustesse à la rotation, homothétie et à la compression. \n \n\n Mise en correspondance des blocs \n\n Les articles comparés dans cette étude s'appuient tous sur un tri lexicographique des vecteurs d'attributs décrivant les blocs. L'idée est que deux blocs similaires auront des attributs similaires. Le tri lexicographique entrainera une proximité des vecteurs. Ainsi, des blocs correspondants viendront consécutivement dans la suite des vecteurs triés. \n\n Le challenge consiste alors à obtenir des temps de calcul faibles. L'utilisation de hachages est alors efficace. \n\n Critiques \n\n \n Le papier semble orienté en faveur d'une méthode des auteurs (celui à base de transformée Mellin-Fourier). \n \n\n FMN."], "link": "http://pixel-shaker.fr/fr/2012/02/note-de-lecture-a-survey-of-copy-move-forgery-detection-techniques-bayram-2008/", "bloglinks": {}, "links": {}, "blogtitle": "Pixel shaker"}, {"content": ["La tâche est souvent ardue, en raison de l'implication émotionnelle. Il convient donc de trouver le moyen de prendre de la distance avec les critiques. \n\n Dans son billet How to revise research papers after receiving harsh reviews , Daniel Lemire donne d'excellents conseils à ce propos. \n\n En particulier : \n\n \n If someone finds ten different flaws in your work, don’t look at it as one message: break it into ten components and address each one separately \n \n\n Le « diviser pour mieux régner », appliqué à l'écriture scientifique en quelque sorte. L'effet psychologique est effectivement plus réduit que de prendre toutes les critiques d'un seul bloc. \n\n Et en reprenant un écrit de Brian Martin  : \n\n \n I’ve found a way to make the revision process easier. I don’t reread my text, because that just cements my previous approach. Instead, I go through the recommendations of the referees and the editor one by one, making changes. After I finish all those changes, large and small, I print out the whole article and read through it, fixing up expression and making it flow. \n \n\n Cette façon de procéder m'était inconnue, mais je la trouve excellente. \n\n FMN."], "link": "http://pixel-shaker.fr/fr/2012/01/comment-reviser-un-article-durement-critique%e2%80%89/", "bloglinks": {}, "links": {"http://www.bmartin.cc/": 1, "http://lemire.me/blog": 1}, "blogtitle": "Pixel shaker"}, {"content": ["attention, (mauvaise) humeur ! \n\n Hier, je discutais avec un collègue (le sujet importe peu). La conversation dérive sur le traitement d'image et le traitement du signal. Arrive la sentence « l'image c'est du signal ! ». Par cette phrase lapidaire, mon interlocuteur entend « le traitement d'image est du traitement du signal ». Sous-entendu, les traiteurs d'image ne sont rien d'autre que des traiteurs de signal. \n\n C'est une opinion répandue. Enfin, surtout chez les traiteurs de signal. C'est d'ailleurs un bon test pour savoir si la personne s’occupe d’images ou de signaux. J'en connais qui travaillent sur les deux. Ceux-là sont irrécupérables ;o). \n\n En tout cas, c'est une opinion répandue, mais fausse. Extraordinairement fausse, même ! Il est vrai qu'un certain nombre d'outils présents dans la mallette du traiteur d'image sont issus du traitement du signal (filtrages linéaires, par exemple). Mais ce que les traiteurs de signal oublient, c'est qu'une image est une information à deux dimensions. La topologie, la géométrie sont des concepts complètement absents d'un signal. Alors que les notions de voisinage, de proximité ou de distance sont essentielles dans une image. \n\n Donc, il ne faut pas dire « une image est un signal à deux dimensions », mais « un signal est une image à une dimension » ! \n\n FMN."], "link": "http://pixel-shaker.fr/fr/2012/01/limage-cest-du-signal%e2%80%89-ou-le-contraire%e2%80%89/", "bloglinks": {}, "links": {}, "blogtitle": "Pixel shaker"}]