[{"blogurl": "http://pleiotropy.fieldofscience.com\n", "blogroll": [], "title": "Pleiotropy"}, {"content": ["I seriously have trouble believing this. Can anybody shed some light? \n \n \n \n \n \n \nIt's from the Royal Ontario Museum in Toronto. Wikipedia on Crurotarsans (spelling?) says nothing of it."], "link": "http://pleiotropy.fieldofscience.com/feeds/570044733547901055/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["What is the origin of new genes? In order to do new stuff, new genes are needed. Where do they come from, then? \n \nHorizontal gene transfer (HGT) - direct transfer of a gene from one organism to another - is rampant within bacteria, so they may gain new function this way. However, that does not explain how the gene came to be in the first place. \n \nNeofunctionalization: If the function is carried out by the original, the copy is free to evolve a new function by point mutations (etc.). However, such copies are much more likely to degrade by those mutations and lose the original function, thereby becoming a pseudogene. \n \nSubfunctionalization: If the gene is pleiotropic, i.e. it has more than one function (expressed in more than one trait or cell-type or at different times), then the gene and its new copy can turn off gene expression differentially such that they share the set of functions. However this doesn't allow either much chance for evolving new function by mutation. \n \nSo what to do? \n \nNäsvall et al. gave me this present for my 40th: Real-Time Evolution of New Genes by Innovation, Amplification, and Divergence . \n \nThey describe a new model/mechanism by which duplicated genes can retain the selection pressure to not succumb to deleterious mutations. They call it the innovation-amplification-divergene model (IAD). \n \n \n \nIAD works like this: A gene initially has one function only (A). Then some genetic changes makes it also have a new function, b, which at first is not of too great importance. Then some environmental change favors the gene variants with the minor b-function (the innovation stage). This is then followed by duplication of the gene, such that there are now more than one copy that carries out A and b (the amplification stage). At this stage there is selection for more b, and at some point genetic changes in one of the copies results in a gene that is better at the new function, B. At this point, selection for the genes that do both A and b is relaxed, because the new gene (blue) carries out the new function. The original gene then loses the b function, and we are left with two distinct genes. Viola! \n \nIn other words, the green gene first becomes pleiotropic, is copied, followed by divergence, and then loss of pleiotropy. (How they could fail to mention pleiotropy in the article is beyond me.) The crucial feature is that at no point is the gene or any of the copes under no selection; there is always selection for them to be retained, so gene loss never occurs (pseudogenes are not created). \n \nThe researchers then look at a preexisting parental gene in Salmonella enterica that has low levels\nof two distinct activities that allows them to grow without the amino acids histidine and tryptophan, respectively. \n \n \n \n \n Multiple evolutionary trajectories recovered through IAD. The x-axis indicates the HisA activity (assayed as growth rate in minimal glycerol medium with added tryptophan); the y axis indicates the TrpF activity (assayed as growth rate in minimal glycerol medium with added histidine). (A) Evolution of specialist enzymes (yellow) in which one activity is improved at the expense of the other. (B) Evolution of specialist enzymes (yellow) after initial evolution of a generalist enzyme (blue). \n \nThe figures here show how the generalist gene evolved to become specialists genes with increased function, doing better without both amino acids. \n \nThis is a model that explains how a gene with two functions can evolve to become two genes with distinct function under continued selection. It is this last part about selection that makes it novel, but it relies on the idea that the original gene had already evolved two distinct functions - that it was pleiotropic. \n \nPleiotropy comes from the Greek πλείων pleion, meaning \"more\", and τρέπειν trepein, meaning \"to turn, to convert\". It designates the occurrence of a single gene affecting multiple traits, and is a hugely important concept in evolutionary biology. \n Reference: \nNäsvall J, Sun L, Roth JR, and Andersson DI (2012). Real-time evolution of new genes by innovation, amplification, and divergence. Science (New York, N.Y.), 338 (6105), 384-7 PMID: 23087246"], "link": "http://pleiotropy.fieldofscience.com/feeds/4457597785041034083/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://2.blogspot.com/": 1, "http://www.sciencemag.org/": 1, "http://www.nih.gov/": 1, "http://www.researchblogging.org/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["David Morrison just hosted Carnival f Evolution #52 , and now he has written a post with lots of statistics of CoE: The network history of the Carnival of Evolution . \n \nIn short, we're doing quite well compared to many other carnivals who have gone extinct. This is especially true for science carnivals, of which CoE is the only active carnival listed on BlogCarnival.com . \n \n \n \n \n The steady growth of CoE through time. \" Fortunately, the number of posts has shown a steady upward curve, as indicated in the sixth graph, although not always at the one-blog-post-per-day rate set in the earliest days. However, over the past 20 Carnivals there has been an average of 1.06 blog posts cited per day of passing time, so we are certainly holding our own.\""], "link": "http://pleiotropy.fieldofscience.com/feeds/7459561952925623851/comments/default", "bloglinks": {}, "links": {"http://phylonetworks.blogspot.nl/": 1, "http://phylonetworks.blogspot.com/": 1, "http://1.blogspot.com/": 1, "http://BlogCarnival.com/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["Here we go again with the new articles on evolution. This is just a very small sample that I chose out of interest from the last couple of weeks - and just from a few journals that I get eToCs sent from. In the meantime there has been nothing in Answers Research Journal , and I don't know where else to check. If you do, please let me know. \n \n \n Variation in personality and fitness in wild female baboons \n Biodiversity tracks temperature over time \n Epistasis as the primary factor in molecular evolution \n Aposematism and the Handicap Principle \n Turning Back the Clock: Slowing the Pace of Prehistory \n Physico-Genetic Determinants in the Evolution of Development \n The spatial architecture of protein function and adaptation \n Complex brain and optic lobes in an early Cambrian arthropod \n Crossing the threshold: gene flow, dominance and the critical level of standing genetic variation required for adaptation to novel environments \n Mutational meltdown in selfing Arabidopsis lyrata \n Aging: An Evolutionarily Derived Condition \n What could arsenic bacteria teach us about life? \n Genomic Variation in Natural Populations of Drosophila melanogaster \n Clonal Interference in the Evolution of Influenza \n Evolutionary Dynamics on Protein Bi-stability Landscapes can Potentially Resolve Adaptive Conflicts \n Criticality Is an Emergent Property of Genetic Networks that Exhibit Evolvability"], "link": "http://pleiotropy.fieldofscience.com/feeds/5002195830790888542/comments/default", "bloglinks": {}, "links": {"http://1.blogspot.com/": 1, "http://www.answersingenesis.org/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["Yesterday I went to the annual Thomas S Whittam Memorial Lecture here at MSU. Howard Ochman talked about \"Evolutionary Forces Affecting Bacterial Genomes\", though he had changed the title to \"Determinants of Genome Size and complexity. \n \nBased on research in his lab had two conclusions about the evolution of bacterial genomes: \n \n \n Genome size is drifting \n GC-content is under selection \n \nThe very tight correlation between gene content and genome size (i.e., there is a linear relationship between number of genes and length of the genome) is driven by genetic drift, and not selection. People often say that small genomes are selected for, but clearly there are not. This is in part caused by a bias towards deletions (compared to insertions). I asked him why there is this bias, and he did not have an answer. (Well, he gave me an answer, but he also acknowledged that it didn't get to the point.) The common ancestor had a large genome, and many bacteria - particularly pathogens and endosymbionts - have subsequently lost DNA resulting in a reduced genome size (Kuo et al, 2009, but see Kuo and Ochman, 2010). \n \n \n \n \nThere are trends in the GC-content (amount of guanine and cytosize in the DNA) that differs among bacterial taxa. But closely related species have similar GC-content, and it turns out that genetic drift is not responsible for this, but that it is driven by selection. \"Escherichia coli strains harboring G+C-rich versions of genes display higher growth rates\" (Raghavan, 2012). \n \nGenome size and abundance of pseudogenes correlates with the size of the effective population size: a larger N e gives larger genomes, while smaller N e results in smaller genomes. Pseudogene abundance is less straightforward, with the largest and smallest genomes and N e both having few pseudogenes, but those intermediate in size having many. \n \n \n \n \n \n References \n Kuo CH, & Ochman H (2010). The extinction dynamics of bacterial pseudogenes. PLoS genetics, 6 (8) PMID: 20700439 \n Kuo CH, Moran NA, & Ochman H (2009). The consequences of genetic drift for bacterial genome complexity. Genome research, 19 (8), 1450-4 PMID: 19502381 \n Raghavan R, Kelkar YD, & Ochman H (2012). A selective force favoring increased G+C content in bacterial genes. Proceedings of the National Academy of Sciences of the United States of America, 109 (36), 14504-7 PMID: 22908296"], "link": "http://pleiotropy.fieldofscience.com/feeds/4639330628038092793/comments/default", "bloglinks": {}, "links": {"http://www.researchblogging.org/": 1, "http://events.msu.edu/": 1, "http://1.blogspot.com/": 1, "http://www.yale.edu/": 1, "http://www.nih.gov/": 3, "http://en.wikipedia.org/": 1, "http://2.blogspot.com/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["I'm reading a book chapter by Peter Stadler from 2002 called Landscapes and Effective Fitness [1]. It has this absolutely gorgeous figure:\n\n \n \n \n \n \n I love it. But just before this figure he has this equation: \n \n \n \nI hate it. I hate it because all it says is that each type, x , is at a frequency P x of the total population, so those P x sum to one. But of course. I just don't think this kind of writing is conducive to discourse, because in biology there is already a huge gap between the majority who don't read (and cite) papers with equations, and those who write them. So why muddy the waters with equations like this that says next to nothing? \n \nHowever, I reiterate (and is why I'm reading the chapter) that this figure of a genotype-phenotype-fitness map is super cool.There are many more different genotypes (the genetic make-up of an organism) than there are different phenotypes (the combined physical attributes of the organism). This must be so, because we now know that each trait is affected by many genes; it takes more than one gene to make a trait (there may be exceptions where only one gene encodes a trait). \n \nThe figure is a conceptual map, but real g-p mapping is sort of the holy grail in evolutionary biology at the moment. With a real map like in hand evolutionary dynamics can be predicted, and we will be able to say which genetic changes are required to change the phenotype. However, realistically we can only map a very small portion of the genotype on to the phenotype, and there even seems to be some confusion about what the proper answer is to the question of what the genotype-phenotype map looks like. Hopefully the answer won't be too mathy... \n \n References \n[1] Peter F. Stadler, & Christopher R. Stephens (2003). Landscapes and Effective Fitness Comm. Theor. Biol DOI: 10.1080/08948550302439 \n[20] A testable genotype-phenotype map: Modeling evolution of RNA molecules. In:\nLässig, M. and Valleriani, A., editors, Biological Evolution and Statistical Physics , pp. 56–83. Springer-Verlag, Berlin, 2002."], "link": "http://pleiotropy.fieldofscience.com/feeds/3080876301818935741/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://1.blogspot.com/": 1, "http://www.researchblogging.org/": 1, "http://dx.doi.org/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["Bjørn's two rules of being a good speaker: \n \n Love the words that you speak \n Always have something to say \n \nAn engaged speaker is more enjoyable to listen to than a bored one. If you love the words as they leave your mouth, you are more likely to engage the audience. Caveat: we all hate someone who loves to speak - too much. I am here talking about giving a presentation, where you are expected to deliver a monologue. In dialogue, be a good listener. \n \nIf you don't have something to say, don't give a talk. As a scientist, this is the same as not having done anything, in which case you are not doing your job. But I also mean this in a more general sense: live life learning, and have your lessons to share. If not, then it's a waste, in my opinion. \n \n \n \nI'm at the 16th Evolutionary Biology Meeting in Marseille, and I trust I don't need to say that some of the presentations don't measure up to the science behind them. And that's a shame; people being bored listening to your talk when they really should be excited about the science. It's a total myth that all one needs to do is do good science, and people will be interested in your talk. Rather, unless it is the something you are supremely interested in (which is probably only a small fraction of what you hear at conferences and seminars), then people tend to lose interest, tune out, and sometimes even feel antipathy for the speaker. \n \nThere are other things a speaker can do, but those are not my rules. \n \nI am speaking tomorrow evening on the Impact of Epistasis and Pleiotropy on Adaptation ."], "link": "http://pleiotropy.fieldofscience.com/feeds/727508393156142098/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://sites.univ-provence.fr/": 1, "http://rspb.royalsocietypublishing.org/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["[The following is a post written for BEACON .] \n \n What is epistasis? \nEpistasis is a measure of the strength of epistatic interactions. Epistatic interactions are non-additive interactions between alleles, loci, or mutations. That is, if the combined effect of a pair of mutations is not what we expect from their individual effects, we then say there is epistasis between those two mutations. \n \nTwo mutations that are both detrimental on their own can be beneficial when they occur together. An example of this is from Joe Thornton’s lab : the present function of reduced sensitivity to hormone in vertebrate glucocorticoid receptor is an example of this. Two mutations both reduced sensitivity and destabilized the newly duplicated gene shortly after its birth 450 million years ago. A third mutation – neutral without the first two mutations – buffered the destabilization, and allowed to gene to go fixation (Carroll et al., 2010). \n \nEpistasis is mostly measured in terms of fitness, as the deviation from additivity, but in principle any trait-value can be used*. If mutation A increases fitness by 5% and B increases fitness by 10%, then we might expect that an organism with both mutations get a fitness increase of 1.05×1.10=1.155 or 15.5%. This would be the case if the two mutations do not interact, so that their effects on fitness are independent of each other. The deviation can be measured in various ways, but the proper way of doing it would be like this: \n \nε = log 10 [W AB × W 0 / (W A × W B )], \n \nwhere W 0 is the fitness of the organisms with neither mutation. This is the best definition (!), because we assumed above that the effects of the mutations are to increase fitness by a fraction of the current fitness, rather than by adding a number. If mutations did increase fitness by an absolute number, we might measure epistasis as \n \nε = W AB + W 0 – (W A + W B ). \n \nBoth of these measures are then zero when there is no epistasis, and both can be extended to deal with more than two mutations interacting. When ε>0 we call it positive epistasis , and negative epistasis when ε<0 (Fig. 1). \nSo, if an organism with both mutations have a fitness of 1.20, then the amount of epistasis is ε = log 10 [1.20 / (1.05 × 1.10)] = 0.01660. If two deleterious mutations together have a beneficial effect, the sign of the joint effect is reversed, and this is called reciprocal sign epistasis (e.g., W A = 0.95, W B = 0.90, W AB = 1.20, giving ε = 0.1472). A trivial case of negative epistasis is when both mutations are independently neutral, but their joint effect is deleterious (e.g., W A = 1.0, W B = 1.0, W AB = 0.90, ε = -0.04576). I say this is a trivial case, because this type of interaction could be one where two genes carry out the same function, thereby exhibiting robustness by being redundant; the organisms then only suffers a fitness decrease when both genes are not working properly. \n \n Fig. 1: Schematic illustration of epistasis. Two mutations A and B can interact epistatically in different ways with varying effects on fitness. The fitness of the wild-type is represented by the black baselines, and the heights of arrows represent the fitness after one mutation (W A or W B ) and after both mutations (W AB ). Green, positive epistasis, red, negative epistasis, black, no epistasis. In (a), two independently beneficial mutations may have their joint effect increased or diminished (W AB larger or smaller), while in (b) the independent effect of the two mutations is deleterious and beneficial, respectively, and the combined expected effect on fitness is deleterious. In (c), each mutation by itself is deleterious, but when they interact, the result can be reciprocal sign epistasis (green arrow). These sketches illustrate an additive model, where the sum of W A and W B is equal to W AB without epistasis. In our model, using the geometric mean this corresponds to taking the logarithms of the fitness. From Østman et al. (2012). \n \nEpistasis is a feature of the genotype-phenotype map, and of genetic architecture. The genes that together are responsible for a trait (e.g., eyes, lungs, blood-clotting) are likely to interact and have non-zero epistasis. Many genes are also pleiotropic, i.e. part of gene-networks of more than one trait (Fig. 2), as they are expressed in different contexts (tissues, cell-types, in response to different environmental cues, etc.). \n Fig 2: Epistatic modules. (A) Hypothetical genotype-phenotype map with three modules of groups of genes affecting three traits: eyes, lungs, and blood-clotting. The genes within each module interact epistatically, while some genes exhibit pleiotropy (black arrows). Not all pairs of genes affecting the same trait necessarily have a non-zero epistasis. (B) Human liver coexpression network and corresponding gene modules. The gene coexpression network consists of the top 12.5% most differentially expressed genes (5,012 expression traits). The colors of the nodes represent their module assignments. Each of the colors correspond to a trait, and most genes are only expressed in that trait, though some are expressed in more than one (pleiotropy), as indicated by lines signifying coexpression. From Friend (2010). \n \n Why is epistasis important in evolution? \nOne reason why epistasis is so important in evolutionary biology is that it affects the fitness landscape. The structure of the fitness landscape in large part determines many important things in evolution, such as evolvability , robustness, repeatability, contingency, and speciation. If the environment dictates that on set of genes/loci has a particular combination of alleles that optimizes fitness, then without epistasis each gene can be optimized individually until the optimal combination is reached (i.e., there is one peak in the local fitness landscape, aka smooth landscape). Deterministically, the population will end up on the peak. However, if the genes/loci interact, then fitness values are modified, and the fitness landscape will no longer be smooth, but contain multiple local peaks with valleys in between. Evolution in such a rugged fitness landscape will not be predictable, and multiple outcomes are now possible. Because there are multiple peaks the population might get stuck on a local peak with lower fitness than the highest peak in the landscape. Another possibility is that more than one peak is climbed at the same time, and if such a situation can be sustained, it can lead to evolutionary branching and even speciation. \n \nAnother reason why epistasis is so important is that interactions between genes means that much more complex traits can be made. If genes did not interact, then no trait would be affected by more than one gene (is this necessarily always true?). It is of course not possible to make a complex structure with only one kind of protein. Conversely, the more genes interact within a module, the more complex the trait can be, which in turn translates into higher fitness. With only a handful of genes available, only a simple eye can develop, while many genes together can make a more complex structure, which can increase the organism’s fitness. The fact that genes interact epistatically is why complex multicellular organisms with abundant cellular differentiation are possible at all. \n \n How prevalent is epistasis? \nVery. Basically, when people measure it, pretty much all pairs of mutations are epistatic. That’s hard to believe is true, and it probably isn’t. Measuring fitness is generally difficult; you have to measure the fitness of four organisms, and just a little bit of error will give ε different from zero. Therefore it is reasonable to attribute lots of non-zero measures below some limit to no epistasis. And then still, it turns out lots of pairs of mutations have significant epistasis between them. \n \nFor example, Costanzo et al. (2010), using data from a genome-wide, quantitative analysis of genetic interactions in yeast, showed that even when including only high values of epistasis (|ε|>0.08), then a large fraction of gene pairs are epistatic (Fig. 3A). Or in Drosophila melanogaster , where 15 insertions in the genes involved in startle-induced locomotion show extensive genetic interactions (Fig. 3B) \n \n \n Fig. 3: Prevalance of epistasis. (A) The distribution of genetic interaction network degree for negative (red) and positive (green) interactions involving query genes. From Costanzo et al. (2010). (B) Epistatic interactions for startle-induced locomotion among 15 P[GT1] insertion lines in double heterozygous genotypes. From Yamamoto et al. (2008). \n \n What is the current research focus? \nTwo major areas of research in evolution are adaptation and speciation. This has been so for a long time, and while we do know a lot about both, there is little doubt that this will not change in the foreseeable future. Adaptation is particularly affected by epistasis and pleiotropy , and it is an outstanding question to what extent adaptation is enhanced or mitigated by epistasis. Empirical data suggest that epistasis causes diminishing returns (e.g., Kahn et al, 2010), but this probably just means that the shape of fitness peaks are shallower the closer you get to the apex, which would just mean that the biggest returns on fitness comes with the first beneficial mutations (which are more likely to go to fixation in the first place). How much does epistasis affect evolvability? Fitness landscape ruggedness can limit a population’s ability to evolve, and ruggedness depends on the amount of epistasis among and within genes. But are these epistatic interactions set in stone, or are they malleable? In other words, how easy is it to create epistatic interactions, and once formed, can they be broken and allow for new advances in adaptation? \n \nSpeciation is also a much studied area of evolutionary biology, but the impact of genetic architecture is only recently coming into focus. Epistasis can cause Dobzhansky-Muller incompatibilities , which can lead to reproductive isolation (which is cool if your gold standard of speciation is the Biological Species Concept). But more generally, the epistastic nature of the genetic architecture causing multiple fitness peaks implies that evolutionary branching can occur. It remains an open question how much this is governed by epistasis, and particularly whether epistasis is a prerequisite for speciation of microbes. \n \n* Not that I am thereby saying that fitness is just another trait. I hold the view that fitness – reproductive success – is a function of other traits, such that a network would point from genes to traits, and traits to fitness. \n \n References \n Carroll SM, Ortlund EA, and Thornton JW (2011). Mechanisms for the evolution of a derived function in the ancestral glucocorticoid receptor. PLoS Genetics, 7 (6) PMID: 21698144 \nCostanzo M, et al. (2010). The Genetic Landscape of a Cell Science, 327 DOI: 10.1126/science.1180823 \nFriend SH (2010). The need for precompetitive integrative bionetwork disease model building. Clinical pharmacology and therapeutics, 87 (5), 536-9 PMID: 20407459 \nKhan AI, Dinh DM, Schneider D, Lenski RE, and Cooper TF (2011). Negative epistasis between beneficial mutations in an evolving bacterial population. Science (New York, N.Y.), 332 (6034), 1193-6 PMID: 21636772 \nYamamoto A, Zwarts L, Callaerts P, Norga K, Mackay TF, and Anholt RR (2008). Neurogenetic networks for startle-induced locomotion in Drosophila melanogaster. Proceedings of the National Academy of Sciences of the United States of America, 105 (34), 12393-8 PMID: 18713854 \nØstman B, Hintze A, and Adami C (2012). Impact of epistasis and pleiotropy on evolutionary adaptation. Proceedings of The Royal Society Biological sciences, 279 (1727), 247-56 PMID: 21697174"], "link": "http://pleiotropy.fieldofscience.com/feeds/4413770396018228059/comments/default", "bloglinks": {}, "links": {"http://beacon-center.org/blog": 1, "http://beacon-center.org/": 3, "http://pages.uoregon.edu/": 1, "http://www.nih.gov/": 5, "http://en.wikipedia.org/": 3, "http://dx.doi.org/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["Did I fool you for a moment?"], "link": "http://pleiotropy.fieldofscience.com/feeds/1393703023090873062/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 2}, "blogtitle": "Pleiotropy"}, {"content": ["How often do you go \"shiiiiiiiiiiit, so that's how it is!?!\" What would really shock you? \"FUCK! I never thought that would be the case...\" \n \nProbably not that often. But those moments are so great, and as a scientist, I'd say we sort of live for them. \n \nI was thinking about this in terms of working in evolution. What would be a really big moment that I could say advanced my understanding of how living things evolve? Most papers I read anymore are incremental advances. Actually, all of them are. When I first started learning about evolution, I was in near-constant shock/revelational mode. It was pure delight to discover what we know about evolution. But now that I know most of it, nothing much surprises me anymore. Which is a shame. \n \nSo it got me thinking about where I could search for such moments. Something akin to learning that the Earth is not the center of the universe, or that everything is made of atoms. Or that there were dinosaurs, and that we evolved. The rest seems to be details. Important details, but not revelational. \n \nI do various things in evolution, but my overarching focus is the origin of evolutionary novelty (but I like speciation, too). How do new things come into existence? The first eyes, first brain, first blood. People will then say that those things are derived from previous structures. Eyes from simpler photoreceptors, brains from simple nervous systems, blood cells from other cells. And these systems derived from yet simpler cells, but along the way, something new happened at least at some points that enabled these new systems/structures to form. New proteins were added to the mix, encoded by new genes. So where did these new genes come from? Well, they were derived from other genes, by duplication and neofunctionalization: a new gene is a copy and a refashioning of an old gene. So far so good. Then where did the first gene come from? Sorry, I don't work on origin-of-life stuff. \n \nIs that it? Not quite. There are some major transitions in evolution to be explained. Unicellularity to multicellularity, cellular differentiation, asexual to sexual reproduction, and stuff like that. \n \nBut then, I am still left with this feeling at times that there is really nothing that would really upset my world-view (of evolution) much anymore. Still nothing revelational in sight. I hope I'm wrong."], "link": "http://pleiotropy.fieldofscience.com/feeds/4627436315401300275/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 1, "http://en.wikipedia.org/": 2}, "blogtitle": "Pleiotropy"}, {"content": ["These are the new papers for the last couple of weeks that I would like to read but will probably never get to. Gone are the days of the polymaths already, and now this! \n \n \n Systematic underestimation of the age of selected alleles \n Predatory Fish Select for Coordinated Collective Motion in Virtual Prey \n Rapid evolution of Wolbachia incompatibility types \n Avoidance of roads and selection for recent cutovers by threatened caribou: fitness-rewarding or maladaptive behaviour? \n Weak Selection and Protein Evolution \n Patterns of Neutral Diversity Under General Models of Selective Sweeps \n Selective Sweeps in Multilocus Models of Quantitative Traits \n Distinct evolutionary patterns of morphometric sperm traits in passerine birds \n A selective force favoring increased G+C content in bacterial genes \n Evolutionary Dynamics of Strategic Behavior in a Collective-Risk Dilemma \n Evolution of Stress Response in the Face of Unreliable Environmental Signals \n Network Context and Selection in the Evolution to Enzyme Specificity \n Clade Age and Species Richness Are Decoupled Across the Eukaryotic Tree of Life \n Evolutionary medicine: its scope, interest and potential* \n The role of ‘soaking’ in spiteful toxin production in Pseudomonas aeruginosa \n On the evolutionary origins of the egalitarian syndrome \n Clade Age and Species Richness Are Decoupled Across the Eukaryotic Tree of Life \n \n \n \n \n* Because I am meeting with Stephen Stearns when he visits MSU this Thursday, I will take an actual look at this review article. Paul Ewald was here last week, and we had a good talk about selection in pathogens and human disease. I also met with Randolph Nesse last semester, so evolutionary medicine has been in focus a lot lately."], "link": "http://pleiotropy.fieldofscience.com/feeds/3042986335594176233/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://en.wikipedia.org/": 1, "http://www.yale.edu/": 1, "http://www-personal.umich.edu/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["A new wealth of articles by the ENCODE (the ENCyclopedia Of DNA Elements) consortium suggest that far more of the human genome carries out some function or other, and one might conclude that very little DNA is junk: \n \nFrom an introduction to the new ENCODE papers: \n \nCollectively, the papers describe 1,640 data sets generated across 147 different cell types. Among the many important results there is one that stands out above them all: more than 80% of the human genome's components have now been assigned at least one biochemical function . \n[Emphasis added.] \n80%? That is a lot (see [2] for details). It doesn't throw out the idea of junk-DNA, i.e., that there is DNA that has no function - but it puts the number much closer to zero than the 90% that I have heard before.\n\nBut I seriously wonder what is meant by \"function\". Take a look at this image[1]: \n \n \n Gene regulation is a very spatial thing, which means that if you were to move a gene (i.e., the protein-coding DNA, or exons) somewhere else, then if would probably not be transcribed at the right time. So, if you were to cut out a length of DNA that doesn't have any function, then other DNA will be shifted spatially, and this might screw up proper transcription. So, DNA without function might be important as a filler. On the other hand, ENCODE includes in the 80% everything that is transcribed (i.e., DNA is used to produce RNA), but that doesn't mean that it has a function, as defined in my book. RNA may be floating around in the cell, and may never be translated (into protein), and may not have any other (e.g. regulatory) function either. On top of that, ever if it is translated and a protein is created based on that DNA, it doesn't necessarily follow that the protein does anything (could even be detrimental to the organism), and then that surely isn't functional. \n \nTo me, this is one of those moments where my understanding of how things work is challenged. If it really is true that no more than 20% of the human genome is junk (and it apparently could be a lot less than that), then I am happy to update my understanding, but I am super-skeptical that there is that little junk in the human genome. But I am not too happy with the usage of the words junk and non-functional here. \n \n References \n[1] Joseph R. Ecker, Wendy A. Bickmore, Inês Barroso, Jonathan K. Pritchard, Yoav Gilad & Eran Segal (2012). Genomics: ENCODE explained Nature, 489 DOI: 10.1038/489052a \n \n[2] The ENCODE Project Consortium (2012). An integrated encyclopedia of DNA elements in the human genome Nature, 489 DOI: 10.1038/nature11247"], "link": "http://pleiotropy.fieldofscience.com/feeds/2686521485945730549/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://www.nature.com/": 1, "http://en.wikipedia.org/": 1, "http://www.researchblogging.org/": 1, "http://dx.doi.org/": 2}, "blogtitle": "Pleiotropy"}, {"content": ["The 51st edition of Carnival of Evolution is up at The Stochastic Scientist: Darwin's Restaurant . There's something on the menu for everyone.\n \n \nNext edition will be hosted by The Genealogical World of Phylogenetic Networks ."], "link": "http://pleiotropy.fieldofscience.com/feeds/3432785051963813868/comments/default", "bloglinks": {}, "links": {"http://stochasticscientist.blogspot.com/": 1, "http://phylonetworks.blogspot.com/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["There must be lots of people out there on the interwebz with questions about evolution. People are evidently very interested, whether they are creationists, evolutionists*, or on the fence. When I first started blogging, it was really to spread the word about evolution, so maybe it's about time to explicitly invite people to ask. \n \n \n \nI was prompted to call for questions because I got a promotional offer from Google Adwords. I have now set up an ad so that people searching on certain keywords might find their way here, inviting them to ask questions. \n \n \n \nSo, if you have a question about evolution, you can ask them anywhere in the comments, and I'll make sure to try to answer, or refer you to someone else who can. \n \n \n \n \n \n \n \n \n \nI'll keep a FAQ : \n \n \n \n1) Q: Did we evolve from monkeys? A: Not from monkeys alive today, but surely it would not be much of a stretch to call the most recent common ancestor of humans and present-day monkeys monkeys, since that species probably looked at lot like something resembling a monkey. You can use Time Tree to find out when humans and monkeys split: about 29 million years ago . Since then the human and the baboon lineages have been evolving separately. That there are still monkeys around today does not invalidate evolution anymore more than the fact that there is still dust around invalidates creationism. \n \n \n \n* I use the term 'evolutionist' to mean someone who believes in evolution, and 'evolutionary biologists' for the professional scientist."], "link": "http://pleiotropy.fieldofscience.com/feeds/1818957102339384107/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://www.timetree.org/": 2}, "blogtitle": "Pleiotropy"}, {"content": ["Here's pickings from the last month of new papers in evolution. Those are just the ones that popped out at me in the tocs, but there are of course many, many others. I wonder how many were published in creation science and intelligent design? What are those journals again? Answers Research Journal is one - nothing there since July 11th (check out the archive there, if you want to have a laugh). \n \n Functional and evolutionary trade-offs co-occur between two consolidated memory phases in Drosophila melanogaster \n Life histories and the evolution of cooperative breeding in mammals \n Evolutionary novelty in a rat with no molars \n General and inducible hypermutation facilitate parallel adaptation in Pseudomonas aeruginosa despite divergent mutation spectra \n ADAPTATION AND MALADAPTATION IN SELFING AND OUTCROSSING SPECIES: NEW MUTATIONS VERSUS STANDING VARIATION \n Epistasis from functional dependence of fitness on underlying traits \n Dolphin genome provides evidence for adaptive evolution of nervous system genes and a molecular rate slowdown \n Trophic specialization influences the rate of environmental niche evolution in damselfishes (Pomacentridae) \n Kin selection, not group augmentation, predicts helping in an obligate cooperatively breeding bird \n Genetic change for earlier migration timing in a pink salmon population \n Superinfection and the evolution of resistance to antimalarial drugs \n Fluctuations of Fitness Distributions and the Rate of Muller’s Ratchet \n A Resolution of the Mutation Load Paradox in Humans \n Calcium and salinity as selective factors in plate morph evolution of the three-spined stickleback (Gasterosteus aculeatus) \n Ontogeny Tends to Recapitulate Phylogeny in Digital Organisms \n FISHER'S GEOMETRICAL MODEL OF FITNESS LANDSCAPE AND VARIANCE IN FITNESS WITHIN A CHANGING ENVIRONMENT \n GENETIC SIGNATURE OF ADAPTIVE PEAK SHIFT IN THREESPINE STICKLEBACK \n EXPLOSIVE RADIATION OF A BACTERIAL SPECIES GROUP \n The Caribbean slipper spurge Euphorbia tithymaloides: the first example of a ring species in plants \n How does adaptation sweep through the genome? Insights from long-term selection experiments"], "link": "http://pleiotropy.fieldofscience.com/feeds/7199836563942326609/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.answersingenesis.org/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["For the love of references! If the submitted posts didn't all have references for support, they do now, because host of the 50th CoE edition , Marc Srour, has provided them himself. Everyone blogger who has a post included in this edition should go read it and consider reading the paper(s) that Marc refers to. \n \nIn my case, that would be \n \nChapter 2 of Luisi’s 2006 book, The Emergence of Life, has an excellent overview of the definitions of life. \nUnfortunately, the preview on Amazon does not include the relevant pagers (page 21-23). If you happen to have those in electronic format, please let me know. \n \nMarc comments on every single post, and I think this is an excellent idea. Who says CoE shouldn't be a place where the merit of individual posts are discussed? Anyone?"], "link": "http://pleiotropy.fieldofscience.com/feeds/4604163246533948853/comments/default", "bloglinks": {}, "links": {"http://bioteaching.wordpress.com/": 2}, "blogtitle": "Pleiotropy"}, {"content": ["With his \"holey adaptive landscapes\", Sergey Gavrilets (e.g. 1997) solved the problem of crossing valleys of low fitness in the fitness landscape* by positing that for high-dimensional landscapes (which is realistic - typically the genotype consists of thousands of genes and many more DNA nucleotides) there is always a ridge between fitness \"peaks\" (which are then not really peaks). The only rationale for that idea is that the more neighbors a genotype has, the higher the chance that the fitness of one of them is about the same. However, there are indications that this is generally not true. Gavrilets himself says that if all the high fitness genotypes are over in one \"corner\" of the fitness landscapes, then there could not always be ridges. One way to formulate this is Kauffman's Massif Central hypothesis, which just says that the chance of finding a fitness peak of high fitness is higher closer to another high peak; peaks cluster in genotype space, and there is a correlation between peak fitness of neighbors. This has already been shown to be true in Kauffman's NK landscape (Østman et al., 2010), and is under investigation in other models as well. Stay tuned. \n \n \n \n Ridges are irrelevant \nThat is not to say that it couldn't be true that there are ridges in real biological fitness landscapes of extremely high dimensionality. After all, the numerical landscapes investigated have few genes/loci in comparison. But, looking at real biological fitness landscapes empirically, there is every reason to believe that they are rugged, containing many peaks varying in height/fitness. I could state it like this: no one (that I have heard of) have shown that there is always a path of about constant fitness between any two genotypes. In other words, there are generally (at least) not any accessible paths between genotypes separated by more than one mutation that does not vary enough in fitness that selection can distinguish between them**. However, even if there is, it doesn't matter! If there were always paths of neutral fitness - ridges - between any two genotypes, it would be extremely unlike that the population would find them. The ridges, supposedly, appear in fitness landscapes of very high dimensionality, meaning that the number of neighboring genotypes is going to be huge, so when increasing dimensionality and the first ridge appears, there are already a fantastic number of mutational neighbors, making it very improbable that the ridge will be discovered by stochastic processes (as evolutionary processes inherently are). \n \n Fitness landscapes are not static \nNot only has it been shown that valleys can be crossed when the mutation rate is not prohibitively low (Østman et al, 2012), as in the weak mutation, strong selection regime (WMSS), where each new mutation is lost or goes to fixation alone, so no two mutations segregate in the population at the same time. But Gavrilets assumed that fitness landscapes are static in both space and time. Static in space means that they are the same in different geographical locations (wet vs. dry conditions, for example). Static in time means that for one location it stays constant and fitness does not change from one point in time to another. And I really should not have to explain how not true this is, right? I mean, not only is it obvious that a genotype adapted to a wet environment will not have the same fitness in a dry environment, it should also make immediate sense that the environment at one location can change over time, for example from a wet climate to a dry one. Fitness landscapes are clearly not static functions (references, you lazy bastard!). \n \nThe fitness landscape changes when 1) environmental conditions change and 2) when the population changes. Changes in population size can reduce the strength of selection; the larger the population is, the better able selection is to distinguish small fitness effects. When the population size is low, stochastic effects dominate, and genetic drift rules. In this case, valleys may be crossed in small populations just because the decrease in fitness while crossing the valley matters less (but see Weissman et al., 2009). \n \nThe effect of changing the environment is to change the fitness landscape. This could result in peaks shifting position in genotype-space, peaks appearing and disappearing, and deep valleys becoming shallow or vice versa. In two dimensions, instead of thinking of a rigid landscape, think of a seascape of water (e.g., Mustonen and Lässig, 2009). In this case, where fitness as a function of genotype is forever changing, evolutionary dynamics (i.e., moving around in the fitness landscape, crossing valleys, and locating new peaks) may be reduced to moving only uphill, rather than having to actually tolerate deleterious mutations at all. Some landscapes may indeed be rather static over longer periods of time, and then the dynamics of populations crossing valleys may be relevant. But it is totally possible that all the important evolutionary changes occur when the fitness landscape changes, rendering theories of valley-crossing somewhat immaterial. \n \n \n\n* There are these two terms in use among researchers: adaptive landscapes and fitness landscapes. The only thing the former term has going for it is that Sewall Wright (1931) - accredited as the inventor of the idea - called it \"adaptive landscapes\". However, most people actually call it \"fitness landscapes\", but in addition to that important fact, it also makes a lot more sense. A fitness landscape is a function where fitness is given by genotype or phenotype values (rather than frequencies - incidentally, Gavrilets and I agree that fitness as a function of population allele frequencies makes no sense), so it makes a lot more sense to call it that. On top of that, fitness as a function of genotype/phenotype does not have to have anything to do with adaptation. The fitness landscapes can be flat, in which case there will be no adaptation going on. To my exasperation I just discovered a new book here at the Evolution 2012 conference in Ottawa by the title of The Adaptive Landscape in Evolutionary Biology (Oxford University Press). Nearly all the chapters, written by more or less famous people in the field, have 'adaptive landscape' in the title. Piss me off, it does. \n \n ** If two genotypes differ in fitness by a small amount, it may be too small for selection to distinguish between them. Since evolution is an inherently stochastic process, in which genetic drift is always present, and selection only chooses who gets to reproduce based on probabilities (fitness can be thought of as this probability), having higher fitness than your neighbor does not guarantee that you will have more offspring; it only makes it so on average. Generally, selection can distinguish fitness effects that are greater than one divided by the population size (s>1/N). If the selection coefficient (the measure of the fitness effect of a mutation, s=w'/w-1, where w' is the fitness with mutation, and w without) is less than one over the population size, then that mutation/genotype will drift, and selection makes no difference. The smaller the population is, the larger a mutation's fitness effect has to be for selection to see it, and therefore selection is weaker in small populations. This is the basis of Sewall Wright's Shifting Balance Theory (Wright, 1982), which explains how crossing valleys in a rugged fitness landscape can be done by breaking the population up into smaller groups (demes), which are then able to drift across the valleys, because selection is now weaker. \n \n References: \nGavrilets S and Gravner J (1997). Percolation on the fitness hypercube and the evolution of reproductive isolation . Journal of theoretical biology, 184 (1), 51-64 PMID: 9039400 \n \n Mustonen V and Lässig M (2009). From fitness landscapes to seascapes: non-equilibrium dynamics of selection and adaptation . Trends in genetics : TIG, 25 (3), 111-9 PMID: 19232770 \n\n \n \n \n Weissman DB, Desai MM, Fisher DS, and Feldman MW (2009). The rate at which asexual populations cross fitness valleys . Theoretical population biology, 75 (4), 286-300 PMID: 19285994 \n \n \nWright S (1931).\n Evolution in Mendelian populations \nGenetics (16), pp. 97–159\n\n \n \nWright S (1982). The shifting balance theory and macroevolution . Annual review of genetics, 16 , 1-19 PMID: 6760797 \n \n Østman B, Hintze A, and Adami C (2010). Critical properties of complex fitness landscapes Proc. 12th Intern. Conf. on Artificial Life, H. Fellerman et al., eds. (MIT Press, 2010), pp. 126-132 arXiv: 1006.2908v1 \n \n \n Østman B, Hintze A, and Adami C (2012). Impact of epistasis and pleiotropy on evolutionary adaptation . Proceedings. Biological sciences / The Royal Society, 279 (1727), 247-56 PMID: 21697174"], "link": "http://pleiotropy.fieldofscience.com/feeds/2049481164868784325/comments/default", "bloglinks": {}, "links": {"http://arxiv.org/": 1, "http://www.nih.gov/": 5, "http://1.blogspot.com/": 1, "http://www.researchblogging.org/": 1, "http://www.esp.org/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["The 13th conference on Artificial Life is going on right now at Michigan State University. Follow tweets at #alife13 , and see program here . Being hosted by BEACON , it's got lots of evolution in action."], "link": "http://pleiotropy.fieldofscience.com/feeds/7772856858043084140/comments/default", "bloglinks": {}, "links": {"http://alife13.org/": 1, "https://twitter.com/": 1, "http://3.blogspot.com/": 1, "http://beacon-center.org/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["Why is there something rather than nothing? Pick your favorite reason among Michael Shermer's picks in Nothing is Negligible: Why There is Something Rather than Nothing. \n \n \n \n \n \n\n\n \n \nIn the meantime, while scientists sort out the science to answer the question Why is there something instead of nothing?, in addition to reviewing these dozen answers it is also okay to say “I don’t know” and keep searching. There is no need to turn to supernatural answers just to fulfill an emotional need for explanation. Like nature, the mind abhors a vacuum, but sometimes it is better to admit ignorance than feign certainty about which one knows not. If there is one lesson that the history of science has taught us it is that it is arrogant to think that we now know enough to know that we cannot know. Science is young. Let us have the courage to admit our ignorance and to keep searching for answers to these deepest questions."], "link": "http://pleiotropy.fieldofscience.com/feeds/5497459303865399273/comments/default", "bloglinks": {}, "links": {"http://www.skeptic.com/": 1, "http://1.blogspot.com/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["Some like to define living organisms as that which \n \n1) reproduces, \n2) has inheritance, and \n3) has variation. \n \nIn other words, living things would be those which evolve by natural selection. Rosie Redfield ( blog ) espoused this view in a recent and otherwise really goo talk at the Evolution 2012 conference in Ottawa ( #evol2012 Twitter feed ). Jerry Joyce ( lab page ) did the same at the 74th symposium of Quantitative Biology at Cold Spring Harbor Labs in 2009. \n \nBut this is folly. \n \nFirst of all, I can easily give an hypothetical example of something that must clearly be alive, but which does not evolve. I'll defer that to the end of this post. \n \nBut I can also give an example of something that most people will not agree is alive, namely languages. Metaphorically, I can accept that languages are alive. \"Danish is such a beautiful language, alive with raunchy adjectives and verbs that sing.\" Or something. But not actually alive in a literal sense. It is spoken by beings that are alive, but is no more alive than thoughts or books, even if it does evolve (note that languages evolution really isn't of the Darwinian kind, either, just like memes aren't). \n \nWe can of course define for our own purposes life (or living things) as anything we want. Doing that sensibly, however, is key, since science is all about communication. I could define life as anything that grows, anything that moves, anything that catalyzes chemical reactions, etc. Those are all things that most things we would call life do in some way or other. But it would not be sensible, because there are things that are not alive that do those things, too. Fires grow, the wind moves, earth catalyzes. Defining something sensibly means that it should conform to daily use of the term, or in the cases where it does not, it should make sense to refine the vernacular. \n \nSo in defining life as something that evolves by natural selection, we would both include things that clearly are not alive in the sense that most people understand it (language), and we would also exclude some things that are clearly alive, but does not evolve. \n \nThis latter thing that is alive but does not evolve - what is it, then? It's true that no living organisms that we know of do not evolve, right? \n \nWell, both true and false. First of all, individual organisms do not evolve at all. Populations evolve. Lineages evolve. Individuals develop - from a single cell to an adult human, for example. Organisms are collections of cells, and does not evolve. Does that mean I am not alive? Clearly I am. This definition does not work. It is true that all living things descend* with modification from ancestors that were different from themselves. But what if we one day discovered an organism, looking quite like any other, but which does not die and does not reproduce? Would it not be alive? \n \nSuppose we go to another planet and find one being there, looking exactly like a human being. Everything we can measure about this being confirms that it is just as much alive as you and me. It eats, moves, heals, replenishes, communicates, feels, defecates. Learning more about this being, though, we find that it has no ancestors, and that it does not age. It does not reproduce, and it is the only such being on the planet. Thus, there is no lineage of descent and no population that can evolve. So this being is then not alive? Of course it is. This definition does not work. \n \nFor those of you who would object that this example is irrelevant, because no such being that is alive but does not evolve has ever been found: definitions must encompass such thought experiments, or they are useless. If our definitions can not guide us when we are in doubt - in situations where something new is encountered, them they are useless. In that case we might as well just define life as the things that we already know are alive, which just amounts to bookkeeping. \n \nLastly, see what I did there? I demolished something without providing a solution. Tough luck! I am not required to put forth another definition that I think is better than this one. Just as well as I am not required to come up with some alternative to religion just because I am an atheist. \n \n \n \n \nIs R2-D2 alive? Is it evolving? \n \n* Actually, I prefer to say 'ascend', like the twigs on a tree grows up, and not down. Idiosyncrasies."], "link": "http://pleiotropy.fieldofscience.com/feeds/7924124800743924961/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "https://twitter.com/": 1, "http://www.scripps.edu/": 1, "http://rrresearch.fieldofscience.com/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["Here we are a group of bloggers in Quebec just across the border from Ottawa having poutine . Jerry Coyne , Rosie Redfield (blue hair), T. Ryan Gregory , Steve Watson, and Seanna Watson. Picture is taken by Larry Moran ."], "link": "http://pleiotropy.fieldofscience.com/feeds/6710169399117922705/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.evolverzone.com/": 1, "http://sandwalk.blogspot.ca/": 1, "http://rrresearch.fieldofscience.com": 1, "http://en.wikipedia.org/": 1, "http://whyevolutionistrue.wordpress.com": 1}, "blogtitle": "Pleiotropy"}, {"content": ["Lots of people are tweeting from the Evolution 2012 conference in Ottawa. It's the biggest evolution conference ever - first joint North American and European. Sad for those who are missing it, but at least you can follow it on Twitter."], "link": "http://pleiotropy.fieldofscience.com/feeds/7044635579950701320/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 1, "https://twitter.com/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["CoE #49 is up at the Mousetrap . This is Joachim Dagg's blog, and he really likes mousetraps. I suppose this may be inspired by Michael Behe, but I cannot be sure.\n\nHere's one of my favorites: \n \n \n \n \n As he says, notice the trap to the right. There are other interesting things to notice here. \n \n Next edition - the 50th - will be at Teaching Biology ."], "link": "http://pleiotropy.fieldofscience.com/feeds/5401742675669504385/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://bioteaching.wordpress.com/": 1, "http://historiesofecology.blogspot.com/": 1}, "blogtitle": "Pleiotropy"}, {"content": ["[ Repost from July 4th, 2009 .] On this 4th of July allow me to quote that famous sentence from the Declaration of Independence : \"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\" I personally disagree and agree with everything said in that sentence at the same time. Those truths are not self-evident. They must be arrived at. They aren't truths to me, and yet they are all goals worth pursuing. All men (humans?) are not created equal, but some are born into slavery, poverty, or born with mental or physical disabilities. However, they should be treated with equal respect and compassion. Since there is no Creator to endow us with anything, nor to uphold any rules (the latter, at least, is evidently true), then rights are something that we humans instill by law, and nothing else. A \"right\" to life doesn't even make any sense, but that we afford, by law and compassion, everyone with the help they may need to live, that would be a worthwhile effort (hopefully we'll get there eventually). Liberty is a human concept, thus we decide what we want of it. And it is safe to say that nearly everyone living in this country (that's the USA) agrees to uphold the law, and thereby forego some of that very liberty. Freedom is good, but only partially so*. Same for pursuing happiness, granted you don't diminish anyone else's, I would say. In summary, those words can be interpreted with good meaning, but are so horribly written that they allow themselves to be used with favor by anyone anywhere on the political spectrum. In regards to independence, I value it as much as - equate it to, even - Life, Liberty and the pursuit of Happiness. I say on to ye, let these proud nations be free to govern themselves. Free Tibet , if that's what they really want (by majority). Let Taiwan go. Let the measure of China be whether nations want to be part of them. If not, take it up for consideration, and change in ways that will entice others to join you. Why is larger better, anyway? Greenland ceased to be a Danish colony in 1953. If they want independence, I say let them have it. Iceland got their independence from Denmark in 1944. Good for them. The Faroe Islands , like Greenland, is a part of the Danish Kingdom, and has been stirring with thoughts of independence. If they can ever make a decision, let them them go too, if that's what they decide. Then get a proper football team. *Who said \"Free as a bird. The next best thing to be.\"?"], "link": "http://pleiotropy.fieldofscience.com/feeds/8168941352622632319/comments/default", "bloglinks": {}, "links": {"http://www.ushistory.org/": 1, "http://pleiotropy.fieldofscience.com/": 1, "http://en.wikipedia.org/": 5}, "blogtitle": "Pleiotropy"}, {"content": ["When one gene comes under a new selection pressure, a population can respond by increasing the frequency of the better alleles. This can involve directional selection , whereby the population shifts towards the new optimum, and/or it can entail stabilizing selection , where the genetic diversity of the population decreases. In both cases allele frequencies change, and this is what (biological) evolution is. \n \nThis is all fairly straightforward. However, when there are many populations that are distinct species, and they all come under the same new selection pressure, then what is that? If we can detect selection between these distinct populations, is that still evolution? It is not evolution in the traditional sense, which center its attention on what happen within a population. So if we’re not looking at what happens within one population, can we even say that we are studying evolution? \n \n In a previous post I explained how we have used metagenomics to retrieve DNA sequences of a specific gene called nitrite reductase (nirK) that soil bacteria use to obtain energy from fertilizer. When sequencing the soil only a limited set of sequences are discovered. Imagine then that some species are more abundant in the soil than others. Because it is random with respect to which species they come from, we are then clearly more likely to retrieve sequences from the most abundant species. There are many bacterial species that has a copy of nirK, and we are limited in how many sequences we can obtain. Many species will therefore not be represented in our sample. \n \nNow, comparing these sequences is done using the formalism of d N /d S , which measures the ratio between non-synonymous nucleotide substitutions and synonymous substitutions (substitutions that change an amino acid vs. those that do not). d N /d S (also designated by ω) is measured between species, so it is perfect for the sequences we have. The analysis showed that ω is very low, indicating purifying selection – there are more synonymous nucleotide changes compared to non-synonymous changes than expected if both were equally likely. That means that nirK is being constrained and optimized, presumably because the gene carries out an important function for the bacteria. Changes to the resulting protein are not tolerated, though a little variation in the amino acid sequence between the species does exist. \n \nFurthermore, different environments were compared. In one environment, deciduous forest (DF), the soil is not fertilized. In another environment used for standard agriculture (AG), the soil is fertilized. The analysis showed that the sequences in AG are under stronger purifying selection than sequences in DF (figure 1). Presumably this is because the conditions in AG make it more favorable and more important to have a really good copy of nirK that can help the bacteria to obtain energy from the nitrate in the fertilizer. \n\n \n \n \n \nFigure 1. dN/dS is smaller in Ag than in DF, indicating that there is stronger purifying selection in AG compare to DF. ES and SF are environments that have not been used for agriculture for about 20 and 40 years, respectively. \n \n \nSo far, so good. Now here is my question. Given that the bacteria experience purifying selection, do we really know what is happening to the community of species? Take a look at the following figure. \n \n \n\n\n\n \n \nFigure 2. An artist’s representation of different populations in two-dimensional amino acid space. Click to enlarge. \n \nThe farther sequences are from each other, the fewer amino acids they have in common. In (A) several species of bacteria can be seen, each represented by a Gaussian distribution, where the darkest points are the more abundant sequences. The red cross represents the optimal sequence (need there be only one?), but because bacteria in DF get most of their energy from oxygen, nirK is of relatively little consequence. In (B) and (C), AG has been loaded with fertilizer, so now there is ample opportunity to get energy from that. Therefore the species experience a pull towards the optimal sequence. In (B) this results in each of the population shifting their distribution towards to optimum, while in (C) they do not shift, but instead the species that are already closer to the optimum experience an increases in carrying capacity, such that they become more abundant compared to species that are farther away from the optimum. \n \nd N /d S basically measures this distance in amino acid space, and clearly this distance is on average diminished in (B). However, because we are more likely to retrieve sequences from the more abundant species, the average distance between sequences is also diminished in (C). In other words, both models are consistent with d N /d S being lower in AG, and we therefore cannot say what is really going on in the soil. Is there a way to distinguish between the two models? Could we take some bacteria to the lab and grow them under DF and AG like conditions, and then figure this out? Is there a third model that can explain the data as well? \n \nAnd then the question of evolution – is this even evolution? Some biologists simply call this species sorting , and dismiss that it is evolution. However, I argue that it is evolution, because what we are observing is the effect of natural selection, which in (B) causes a change in allele frequencies within each population, and in (C) because it changes abundance that can lead to long-term changes in community structure. \n \nEvolution or not? What do you think?\n\nCross-posted on BEACON's blog ."], "link": "http://pleiotropy.fieldofscience.com/feeds/9010143605173361028/comments/default", "bloglinks": {}, "links": {"http://beacon-center.org/blog": 2, "http://beacon-center.org/": 1, "http://en.wikipedia.org/": 5, "http://1.blogspot.com/": 1}, "blogtitle": "Pleiotropy"}]