[{"blogurl": "http://googlepolitics.blogspot.com\n", "blogroll": [], "title": "Politics & Elections Blog"}, {"content": ["Every four years in the United States, people prepare to head to the polls and increasingly search for information about how to register to vote, where to vote and who is on their ballot. Even though it is 2012, important voting information is disorganized and hard to find on the Internet. To help voters research candidates and successfully cast their ballot on Election Day, we’ve launched our new Voter Information Tool . \n \n \n \n \nYou can enter your address to find information on your polling place, early vote locations, ballot information with links to candidates’ social media sites and voting rules and requirements. The tool is easy to embed on any website and is open source so developers can modify it to create custom versions. We're working with a number of media partners to ensure the tool is accessible across the web, and partners like Foursquare and AT&T are doing great work building apps on our Civic Information API . \n \nWe hope this tool will help make getting to the polls and casting your ballot as simple as possible. \n \n Posted by Jesse Mwaura, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/1976049491827010017/comments/default", "bloglinks": {}, "links": {"http://google.com/": 1, "https://developers.google.com/": 1, "https://www.google.com/": 1, "http://code.google.com/": 1, "http://4.blogspot.com/": 1, "http://developers.google.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["This week Comedy Central relaunched its Indecision2012 caption competition. We collaborated with them to add little extra magic, so that now you can use the tool to make your own memes and share them socially on the web. \n \nEmpowering individuals with information is at the core of Google’s mission, and the the Indecision2012 caption competition is a great way to get people sharing and talking about politics and democracy. It’s easily accessible, and helps to engage with the election in a fun way. \n \n Comedy Central's Indecision is the network’s digital hub for election news and political comedy. With a website, daily blog, photo galleries, original video, mobile apps and social media, Comedy Central's Indecision finds the funny in politics and puts it everywhere you are. \n \nGoogle is committed to civic engagement and using technology to get people involved in the 2012 election. We look forward to watching the best memes go viral as people share them across the web. \n \nGo check out the competition at www.indecisionforever.com/caption-challenge . Make a meme, enter the competition, and share the fun! \n \n Posted by the Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/3997402866314471669/comments/default", "bloglinks": {}, "links": {"http://www.indecisionforever.com/": 2}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Election Day in the United States is just three weeks away and campaigns at all levels are ramping up for the home stretch. With Election Day just around the corner, there will be an increased barrage of campaign ads, fundraising requests, and visits from the candidates. Today, in collaboration with CNN, we're launching the Campaign Explorer to help you make sense of it all. \n \nThe Campaign Explorer lets you visualize ad spending, fundraising, and candidate travel from the presidential campaigns on the electoral map. You can dive into data for a state, compare multiple states, and then save and share snapshots with your own insights. Here's a snapshot we created comparing travel and ad spending across three major battleground states - Ohio, Virginia, and Florida: \n \n \n \n \nAt Google we're passionate about using technology to open up data and make it more useful, and we hope the Campaign Explorer will help do that for some election data. We're thrilled to partner with CNN to make this possible. CNN brought a wealth of campaign information and years of journalistic expertise, and we made use of the latest web technologies in HTML5 to present this data in a new and engaging way. \n \nBe sure to share your snapshots on Google+ and mention +Google Politics & Elections and we'll reshare the most interesting. You can learn more about what we're doing for the US election and others worldwide at google.com/elections . \n \n Posted by Eric Hysen, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/537683610836817918/comments/default", "bloglinks": {}, "links": {"http://google.com/": 2, "http://www.html5rocks.com/": 1, "http://1.blogspot.com/": 1, "http://www.google.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Posted by: Adam Grunewald, Politics & Elections Team and Mobile Ads Marketing While it’s easy to get caught up by the passion and finger pointing in Tuesday night’s debate, it’s important to remember the real purpose of a presidential debate - educating and informing the American people. We wanted to understand how viewers use their smartphones and tablets as ‘second screens’ to research and fact-check topics during and after the debate. So we took a look at debate-related search queries coming from mobile devices on Tuesday and found that: \n Mobile has become a central component of this year’s election: 2,000% increase in debate-related searches on mobile in 2012 vs. 2008 \n Mobile helps voters find spur-of-the-moment information: 3,300% increase in searches related to Libya immediately after the question about presidential accountability for the Benghazi attack \n Mobile is used simultaneously with television: 47% of Tuesday’s elections-related mobile searches occurred during and immediately after the debate \n \n Mobile devices: our couch companions Already this election season, we’re seeing voters research issues, find information, and even register to vote across desktop, smartphone, tablet and television. This data reinforces the need for political campaigns to engage voters across all four screens - especially during key campaign events. With the portability of mobile devices, many people are using them while watching television to search for follow-up information or to fact-check. The debates were a great example of this mobile multi-tasking as people turned to their mobile devices in real time to find more information about the comments and issues raised by the candidates. Looking at a timeline of searches for a specific issue like energy throughout the debate, we can see that the spikes in searches occur in direct response to specific conversation sparks on television. \n  \n (Click image above for larger version) \n \n Immediate information In addition to being used in front of the television, people turn to their mobile devices when they’re looking for immediate information. The “always-on” nature of tablets and “always with you” nature of smartphones make them quick and easy to pick up for a spontaneous search. During the debate we saw enormous spikes in mobile queries immediately after panelist questions or statements from the candidates. For example, within one minute of Mary Fallano’s question to Romney about his tax plan, tax-related mobile searches increased by over 500%. This is true not just while watching the debates, but also throughout the day as people use their smartphones while talking about politics with friends, listening to the news, or even after coming across an offline ad. Four screens to victory As we enter the final weeks of the presidential election, digital devices will be key to helping voters decide which candidate is right for them. It’s a well-known fact that one of the keys to a successful candidacy is controlling the message. What’s clear in today’s multi-screen world, is that controlling the message on any issue requires that a candidate have a strategy to engage with voters across all four screens ."], "link": "http://googlepolitics.blogspot.com/feeds/8843765530441256739/comments/default", "bloglinks": {}, "links": {"http://1.blogspot.com/": 1, "http://www.google.com/": 2}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Cross- Posted by Julie Hootkin VP, Global Strategy Group and Robert Blizzard VP, Public Opinion Strategies \n \n [From time to time we invite guests to blog about initiatives of interest, and are very pleased to have Julie Hootkin of Global Strategy Group and Robert Blizzard of Public Opinion Strategies join us here. – Ed.] \n \n \n \n \nAs the 2012 campaign enters its final weeks, new research suggests that the Internet offers candidates a real opportunity to reach the most sought-after voters – those who have not yet made up their minds. According to a survey of 500 persuadable voters in Florida, Ohio, Nevada, Virginia and Wisconsin conducted between October 2 and October 7, 2012 by Global Strategy Group and Public Opinion Strategies, the Internet is an increasingly important resource when it comes to getting information about this year’s campaigns and elections. \n \nRead the full memo here ."], "link": "http://googlepolitics.blogspot.com/feeds/6968894597880824632/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://posted%20by%20dominic%20campbell%2C%20founder%20of%20futuregov%20%20[from%20time%20to%20time%20we%20invite%20guests%20to%20blog%20about%20initiatives%20of%20interest%2C%20and%20are%20very%20pleased%20to%20havedominic%20campbell%2C%20founder%20of%20futuregov%20join%20us%20here.%20%E2%80%93%20ed.]/": 1, "http://pos.org/": 2, "http://globalstrategygroup.com/": 2}, "blogtitle": "Politics & Elections Blog"}, {"content": ["The presidential debates have generated some of the most memorable moments from the campaign trail. From a digital perspective, we’ve come along way from the first televised presidential debate in 1960 to the first debate livestream in 2012. Here are three ways you can use Google to discover and engage with the latest debate coverage and claim your front row seat to all four general election debates. \n \n FOLLOW TRENDS - Healthcare? Jobs? Immigration? What are Americans searching for around the debates? Find the latest Google search trends and consumer insights on google.com/elections or by following the Google Politics & Elections page . We’re also on the ground at each debate location partnering with the Consumer Electronics Association (CEA) to highlight key trends on our \" Insights from the 2012 Debates \" media wall. \n \n \n \n \n \n WATCH LIVE - Watch the livestream at youtube.com/politics via our partners at ABC News and catch what the YouTube Elections Hub partners -- ABC News , Al Jazeera English , BuzzFeed , Larry King , New York Times , Phil DeFranco , Univision and the Wall Street Journal -- are saying pre-and-post debate. Missed the debate? Check back on Thursday for full clips and highlights. \n \n HANGOUT - Keep an eye on the our Google+ page for hangouts around the debates with the Washington Post , USA Today , Mitt Romney ’s campaign, students from the University of Denver and many more. Join the conversations and share your thoughts by using #googlepolitics in your posts. \n \nLet the debates begin! \n \n \n Posted by Natalie Vernon, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/5424056390195379625/comments/default", "bloglinks": {}, "links": {"https://plus.google.com/": 5, "http://www.ce.org/": 1, "http://1.blogspot.com/": 1, "http://youtube.com/": 9, "http://www.youtube.com/": 3, "http://www.google.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Cross-posted from the Google Developers Blog \n \nGoogle’s mission is to organize the world’s information and make it universally accessible and useful. To make it easier for you to build apps with voting information on the web, we are releasing our new Google Civic Information API . The API enables you to look up comprehensive voting information for an individual U.S. address, including polling place, early vote sites, contests, and local election official contact information. By releasing this API, we hope to unleash the creativity of the Internet and help you build innovative products that push civic information to your communities in interesting ways. \n \nAs you know, this type of information can change frequently as we get closer to Election Day, and we will make every effort to ensure we're returning timely and accurate data. We have also included contact information for local election officials in the API so voters can find the most accurate information. \n \nWhile this API only includes voting information for elections in the U.S., we plan to expand to other countries and include other types of civic information. Please join the Google Civic Information API Forum for updates on the data available and check out the Google Politics & Elections page to find more information about the work we are doing around the election and our international elections programs. \n \nYou can get started here through the Google APIs Explorer. The API is available now, but please note that full information isn't yet available for the November 6th General Election. We expect to be able to provide full live data around the middle of October, as it becomes available. For now, we recommend building your applications using the test data we provide. We'll be using the API to power our own election tools over the coming weeks, including an embeddable app anyone can use on their site, and we're looking forward to seeing the applications you come up with! \n \nThe Civic Information API replaces our previous Google Election Center API , which will be turned down after January 1, 2013. \n \nFor questions, comments, and to showcase your apps using the API, we encourage you to use the Google Civic Information API Forum . \n \n Posted by Chetan Sabnis, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/4524934660905508792/comments/default", "bloglinks": {}, "links": {"http://googledevelopers.blogspot.com/": 1, "http://developers.google.com/": 2, "http://www.google.com/": 1, "https://developers.google.com/": 4}, "blogtitle": "Politics & Elections Blog"}, {"content": ["With just 76 days until Election Day, next week begins a flurry of political activity as the national conventions get underway. And while very few people can make the trip to the Republican National Convention in Tampa, FL., or the Democratic National Convention in Charlotte, N.C., Google+ is bringing the conventions straight to your laptops and mobile phones in a series of Google+ hangouts with the convention organizers and top media organizations. \n \nOver the course of both conventions, you’ll be able to tune in live via Google+ hangout, hearing from and talking with top media outlets who are on hand to make sense of all the politics. Check out The official Google+ pages for the Republican National Convention ( #RNC2012 ) and DemConvention ( #DNC2012 ) to get the latest news. Also, tune into our Google Politics & Elections page every day to see live Google+ hangouts with the following media partners: \n \n \n Associated Press \n CBS News \n CNN \n Fox News \n Huffington Post \n LA Times \n National Journal \n NBC News/MSNBC \n Newsweek/Daily Beast \n New York Times \n NJ Star-Ledger \n PBS NewsHour \n Reuters \n Wall Street Journal \n Washington Post \n \n \n \nWe’re looking forward to making this year’s conventions the most interactive ever. In addition to these hangouts with top Google+ partners, we’ll have a few surprises up our sleeves to give you never-before-seen access to the conventions. Stay tuned for more in the coming days as things heat up in Tampa and Charlotte! \n \n \n Posted by Steve Grov e, Google+ Head of Community Partnerships Team"], "link": "http://googlepolitics.blogspot.com/feeds/7249270471558391944/comments/default", "bloglinks": {}, "links": {"http://www.demconvention.com/": 1, "https://plus.google.com/": 21, "http://www.gopconvention2012.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["( Cross-posted from the Official YouTube Blog ) \n \nToday we’re introducing the YouTube Elections Hub , a one-stop channel for key political moments from now through the upcoming U.S. election day on November 6. You can watch all of the live speeches from the floor of the upcoming Republican and Democratic National Conventions, see Google+ Hangouts with power brokers behind the scenes, and watch a live stream of the official Presidential and Vice Presidential debates. You won’t need to go anywhere else for the must-watch moments of this election cycle...they’re all happening here live. \n \nIn addition to videos from politicians and parties, a diverse range of news organizations—both established names in media and sought-after new voices—are sharing their coverage of the political process on the new hub . You’ll find live and on-demand reporting and analysis from ABC News , Al Jazeera English , BuzzFeed , Larry King , New York Times , Phil DeFranco , Univision and the Wall Street Journal . Each will put their own stamp on the Presidential race—from the conventions to the debates to election night. \n \n \n \nOf course, we’ll have special live coverage around the Republican National Convention from August 27 to 30, the Democratic National Convention from September 4-6, the Presidential and Vice Presidential debates in October, and election night. Bookmark the Elections Hub now for a front row seat along the road to the White House. \n \n \n Posted by Olivia Ma, YouTube News Manager, recently watched \" Sarah Palin Gives Obama Advice to Win the Election - The DeFranco US Election Weekly Recap #1 .\""], "link": "http://googlepolitics.blogspot.com/feeds/2194424064387355721/comments/default", "bloglinks": {}, "links": {"http://youtube-global.blogspot.com/": 1, "http://www.youtube.com/": 13}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Cross-posted on the Inside AdWords Blog \n \nIn his autobiography , Former House Speaker Tip O’Neill famously said “All politics is local”. With all 435 seats up for election in brand new Congressional Districts this November , that adage rings even more true for House candidates running this fall. Through the redistricting process that takes place every 10 years, every district takes on a new shape - with new voters. This makes reaching the right voters with the right message even tougher. \n \nStarting today, in addition to targeting specific zip codes , we’re enabling an even more useful solution that allows political campaigns to reach voters within a specific Congressional District. \n \nSay you are running for Congress in the 6th District of Maryland - which features a highly publicized race between Ten-term incumbent Rep. Roscoe Bartlett and Montgomery County businessman John Delaney. The 6th is located in western Maryland, and has been a longtime GOP stronghold, but was drastically reshaped by redistricting which has made it more competitive. \n \nBarlett and Delaney’s campaigns are waging a battle in the oddly shaped district that has voters in many zip codes, towns and communities looks like this: \n \n \n(This map embedded above is courtesy of data from Azavea ) \n \nAs campaigns know, reaching these households in an effective manner with traditional means takes time and - importantly - valuable resources. This district is a great example - it includes voters who live in the Washington D.C. media market. But, as you can see from the map, buying TV ads in DC won’t reach your voters in the 6th District. \n \nNow, with congressional district targeting in AdWords, campaigns can quickly and easily target their search, display, mobile and video ads *solely* within that particular district’s border. You can start by heading into AdWords and selecting your District number from the location menu populated with district information in simple Google Maps format, prepared by Azavea . Build your ad and you’re on your way. \n \n \n \nWe’ve built a sizeable team that is working around the clock to help all candidates get the most from their online advertising efforts. Congressional District Targeting in AdWords is just one more way that we’re working hard to deliver better ads for users and voters and better tools for political campaigns. \n \nBy working across all four screens , digital ads are highly accountable, precise, and continually evolving. Google’s complete solution helps thousands of political campaigns in all shapes and sizes make the web work for them. Our products are designed to work together, enabling campaigns do more with less online. Head over to the Four Screens to Victory site to learn more about how your campaign can win the moments that matter. \n \n \n \n Posted by: Charles Scrase, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/6926997203662674476/comments/default", "bloglinks": {}, "links": {"https://www.google.com/": 1, "http://adwords.blogspot.com/": 3, "http://googlepolitics.blogspot.com/": 3, "http://www.google.com/": 1, "http://books.google.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Earlier this year, we introduced “ Four Screens to Victory ”, a framework for political campaigns that outlined how Google can help make the web work for candidates and issues groups up and down the ballot. With these digital platforms, campaigns can build their organizations, define the issues, persuade the electorate and - importantly - get the vote out and win the moment that matters in November on Election Day. \n \nAccess to political information no longer comes from one place - or one screen. In just the four years since the last presidential election, the continued growth of the web and the proliferation of mobile devices has radically transformed when, where, and how voters access political information. \n \nThe numbers are in, and savvy political campaigns need to take notice. The rules of reaching voters have changed and new approaches are warranted because: \n \n More than 80% of eligible voters are online \n Similarly, 83% of mobile phone owners are registered voters \n 1 out of every 3 likely voters in November say that they didn’t watch tv in the past week \n Voters are spending more media time on their mobile devices than newspapers & magazines combined \n \n \n (Click the infographic below to get a larger version) \n \n  \nIf you’re as inspired as we are by some of the data and the implications on your own political campaign, check out the “Four Screens to Victory” site to spark some ideas of your own and see how you can make the web work for your campaign. \n \n Posted by: David Kaufman, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/2561492914187517499/comments/default", "bloglinks": {}, "links": {"http://google.com/": 1, "http://googlepolitics.blogspot.com/": 1, "https://lh6.googleusercontent.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["The conventional wisdom for political campaigns has been to save as much money for as long as possible, and then to spend it all communicating with voters down the stretch right near Election Day. But this year that's started to change. The most sophisticated campaigns are investing earlier....Now those of you political insiders know that there's some precedent here: Paul Begala hangs part of Clinton's '96 victory on the campaign's ability to define Dole early, Karl Rove and company successfully deployed this strategy against John Kerry, and the Obama campaign has been seemingly operating out of the same playbook, attempting to define Mitt Romney in an ad blitz that began last April. But the levels of early spending this cycle are unprecedented. And with good reason. \n \nThe latest research points out that voter influence starts early: 44% of voters saying they research candidates and issues more than four months out from Election Day (Shopper Sciences). And search query data backs this up. \n \nIn 2008, we saw that over 60% of searches on policy-related terms for President Obama (like “Obama policies” and “Obama economic plan”) came well ahead of Election Day and before October 1st. While some of the spikes are attributable to the primary with Hillary Clinton, the steady baseline of Obama searches indicates that voters were researching, learning, and making up their minds' about the candidate long before October. \n \n \n \n  \n*Google Internal Data \n \nAnd this isn’t just on a national level; the trend is also strong in the states. The 2008 Franken/Coleman Senate race in Minnesota was one of the hottest in the country and voters also got started early in their research. Fully 70% of searches on the candidates’ names came before October 1st. \n \nThis cycle, early searching has been dramatically higher than the 2008 race. Searches for Governor Romney from June 27, 2011 - July 15, 2012 are three times higher than searches for Senator McCain in the same period four years ago--a sign that Obama and his allies are attempting to capitalize on in their move to define their opponent early, when many voters are making their initial assessments. \n \n \n \n  \nMcCain data: June 25, 2007 - July 13, 2008 \nRomney data: June 27, 2011 - July 15, 2012 \n*Google Internal Data   Investing early is a growing trend in other industries as well - most notably in the retail space where stores are opening their doors and upping their promotions well in advance of Black Friday. And guess what? 34% of people now start their holiday shopping before October (Shopper Sciences). Take two other monumental events this year - the Super Bowl and the Olympics. Pre-released Super Bowl spots from Chevy and VW scored millions of views on YouTube in advance of game day while Visa and Coke Olympics campaigns topped the Ad Age viral video chart in May -- a full 3 months before the summer games. \n \nWhy does it pay to be an early mover? For starters, it’s easier to break through. According to Politico, the 2012 cycle may go down in history as the most cluttered and expensive. Reaching engaged voters when they’re researching candidates, reading up on issues and forming opinions early just makes sense. Finally, you get more bang for your buck earlier. On average cost-per-view for Youtube TrueView advertising increased 267% in the 2010 Cycle in October 27 - November 2 compared to the three months prior. \n \nHere are a few simple strategies to buy more efficiently and make an early investment count over time: \n \n 1. Capture the attention of early searchers by starting early \nWhen voters are looking for information on candidates or important issues, search is the first place they turn. Help them find you fast by making your message stand out via search ads and then convert their interest into signups, volunteer hours, and donations. And with mobile search traffic on candidates skyrocketing from less than 1% of total queries in January 2008 to at least a quarter today, make sure you have a mobile-optimized website that makes it easy for smartphone and tablet users to connect with you. \n \n \n \n  \n*Google Internal Data \n \n 2. Complement your TV buy with online and mobile video \nWith 45% of likely voters nationwide saying that live TV isn’t their primary mode of consuming video (Shopper Sciences, April 2011), a multi-screen strategy is a must-have for a successful campaign. Online and mobile video not only extend a TV campaign message more efficiently over time, but deliver unique creative solutions like interactive video ads that can transform your campaign messages into engaging experiences to persuade voters. \n \n 3. Speak to key audiences continuously with targeted display advertising \nYou know who your key voters are, and targeted display ads are efficient enough that you can go up early and never come down. Whether you want to reach suburban moms, NASCAR dads or Hispanics, targeted display advertising lets you communicate continuously with your key audiences, wherever they are. Reaching your primary audiences in the right moments over time and across devices is an effective way to drive awareness, engagement and voter preference. \n \n 4. Remarket to engaged users \nRemarketing lets you continuously re-engage people who previously visited your website or watched your online video. For example, you can tailor messaging specifically to those who may have visited an action page of your candidate’s website, but didn’t sign up or donate. Whether you’re looking to raise money, solicit volunteers or any other goal, remarketing should be a strategic component of every campaign. \n \n 5. Use social extensions to boost your search performance and discoverability \nStart early and build your campaign’s social marketing efforts by sharing social annotations like +1 buttons between your ads and social network pages. This feature helps build a larger collection of social recommendations that improves ad performance. Ads displaying a +1 annotation have seen clickthrough rate uplifts of 5%-10% (Google Internal Data, 2012) \n \n Posted by Jennifer Gross, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/1126584397789698125/comments/default", "bloglinks": {}, "links": {"http://www.google.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Almost 20% of the US population speaks Spanish and as we get closer to Election Day access to information about candidates and important issues will be in high demand. We want to help make sure all American voters have the information they need to head to the polls at their fingertips. \n \nSo today, we’re expanding our language accessibility and providing the Google.com/elections site in Spanish. Now, when you go to Google.com/elections you will be able to choose “Spanish” from the language menu to get news content, trends, and all of our elections coverage in Spanish. \n \n \n \n \n (click to enlarge) \n \nCasi el 20% de la población de los Estados Unidos habla español y al acercarnos al día de las elecciones estadounidenses, la demanda por el acceso a la información sobre los candidatos y temas importantes va en aumento. Queremos asegurarnos de que todos los votantes estadounidenses tengan a su alcance la información que necesitan para dirigirse a las urnas. \n \nAsí que hoy estamos ampliando nuestra disponibilidad en idiomas y ofreciendo nuestro sitio Google.com/elections en español. Ahora, cuando vayas a Google.com/elections podrás elegir la opción \"español\" en el menú del idioma y ver el contenido de las noticias, las tendencias, y toda nuestra cobertura de las elecciones en español. \n \n Posted by Jason Brooks, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/5319650689009777001/comments/default", "bloglinks": {}, "links": {"http://google.com/": 2, "http://2.blogspot.com/": 1, "http://www.google.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["The summer before a Presidential election typically brings unending speculation about potential Vice Presidential picks. Veepstakes, as the process has commonly been referred to since 1988, has become a favorite topic of discussion among journalists and politicos. A Vice Presidential pick not only plays a big role in the campaign process, but also can have a profound impact on the democratic process. Theodore Roosevelt, Lyndon Johnson and George H.W. Bush are all Vice Presidents that have gone on to become Commander-in-Chief. \n \nWe are excited to partner with Washington Post ’s Chris Cillizza and The Fix to launch our first Veepstakes Trends Dashboard to track the buzz around Republican presidential candidate Mitt Romney’s potential VP pick. The Veepstakes dashboard allows you to take the web’s real-time political pulse by comparing potential VP candidates' YouTube video views, search traffic, and Google News mentions. You can even drill down and check out which potential nominee has been searched the most over the the last day, week or month. \n \nCheck back for updates and trends as Veepstakes speculation continues! \n \n Posted by Chetan Sabnis and Jesse Mwaura, Google Politics and Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/3948316279175373704/comments/default", "bloglinks": {}, "links": {"http://www.washingtonpost.com/": 1, "http://www.google.com/": 1, "http://www.washingtonpost.com/blog": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["French voters are set to cast their votes for the final and decisive round of the Parliament elections this Sunday. The outcome will determine whether the elected socialist President François Hollande can secure a left-wing majority in the Lower House, something which hasn’t happened since 2002. \n \nResults will appear in real-time on Google Maps on Sunday evening starting at 8pm CEST as they are published by the French Ministry of Interior. Internet users in France will be able to easily discover who will represent them in each of France’s 577 electoral districts for the next five years by viewing our elections map. \n \nAs we did for the Presidential Elections in France, we developed a color coded map which makes it very easy to visualize how well a party did across the country by clicking on a party name on the right side-bar. \n \n \n \nAs Election Day approaches, be sure to check out the latest campaign news, videos and Google+ posts from political parties on www.google.fr/elections ! \n \n Posted by Florian Maganza, Policy Analyst, Paris"], "link": "http://googlepolitics.blogspot.com/feeds/541053720354014713/comments/default", "bloglinks": {}, "links": {"http://www.google.fr/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["The Super Bowl and Presidential Election are two of the largest and most anticipated national events -- with over 110 million viewers of Super Bowl XLVI and an expected 130 million* voters on Election Day 2012. The Super Bowl stands out as the most important event for marketers, with roughly $230 million spent on game day from brands like Pepsico, Anheuser Busch and General Motors. The stakes for both events are incredibly high. \n \nCan we learn from and apply techniques from one of those massive events to the other? Specifically, we thought it would be interesting to examine if political campaigns can learn anything from approaching Election Day from the same perspective that big brand marketers have used ahead of the big game. We found that savvy marketers who started early produced results for the Super Bowl and smart political campaigns can have an impact in the same way. \n \nAhead of this year’s Super Bowl, some of the top spenders tried to break free of the noise during the game. They took marketing in a new direction and pre-released their “television” commercials online prior to game day. Honda CRV, for example, released a teaser video that was a recreation of Matthew Broderick in Ferris Bueller’s Day Off taking an adventure in his Honda CRV. The video, released on YouTube more than a week before the game, received over 5 million views in just one week, as well as attention from numerous press outlets leading up to the big game. \n \n \n \n \n \nOther brands like Chevrolet, MetLife, Volkswagen and E-Trade also leveraged the benefits of greater awareness, intrigue and “talk value” from promoting their content online well in advance of game day. While they may have given up the “surprise factor” of unveiling their new ads on the big screen on February 5th, it appears that they gained a lot more. These early releases online made it easier for viewers to form opinions ahead of time in a less cluttered environment, and - importantly - then share and discuss them within their friends, family, and co-workers. The multi-screen effect provided more engagement opportunities with the brand - allowing viewers to view, vote, comment and “like” ads online or via mobile devices. \n \nWhile the Elections advertising cycle is much longer than the Super Bowl, the value of starting early still applies. Here are three ways your campaign can benefit from a pre-Labor Day advertising investment across four screens (television, computers, tablets and mobile phones): \n \n Preview key messages to maximize impact \nLet’s face it: for campaigns, November is incredibly noisy. By the time these elections are upon us, most of us (political nuts aside) are a bit sick of seeing all the political ads and messages. Between TV commercials, direct mail, and online ads, campaigns are bombarding voters right up to the voting booth. Thus, taking a page from the corporate marketer’s playbook, beginning your campaign investment early not only allows your message to break through with greater ease, but empowers voters to engage with your content. \n \nThe Roger Williams for U.S. Congress Committee successfully drove campaign awareness, donations and earned media beginning in June 2011 for the 2012 election cycle. The Committee promoted issue-oriented video ads on YouTube, along with overlays that drove viewers to a specialized donation landing page. One such video, \"The Donkey Whisperer\" , which draws humorous parallels between Democrats and Williams’ hungry donkeys, received 50,000 views in the first 48 hours and considerable attention from bloggers and traditional media outlets. Separating your candidate or issue from the pack can turn passive viewing in a noisy environment into active viewing in a less cluttered environment. \n \n Marry offline and online \nTelevision ads alone are not enough to reach voters. Today, an ad is a stimulus, and people respond immediately by searching for more information. In fact, in a survey of likely South Carolina Republican primary voters, 60% who searched online after seeing an advertisement used a search engine to check information about a candidate (POS/Google Study, 2012). \n \nFurthermore, campaigns that run across screens have 24% greater recall and 17% greater engagement than those on a single screen (Nielsen Multi-Screen Lab Study, 2011) so you want to deliver your message over time to reach and influence voters on all the media sources they consume -- from watching television, reading articles online and using mobile applications. \n \n Get bang for your buck \nBuying early lets you maximize your campaign budget in two important ways. First, prices are much lower May through August so you’re able to reach the same audience much more efficiently. Second, reservable inventory is not always available as it gets closer to the election, especially in battleground states. If you don’t already have your budget allocated, start now with a strategy that allows you to begin early and then scale where and when it’s right for your campaign. Don’t wait until the last minute when inventory is depleted. Finally, take advantage of the efficiencies of buying media across multiple screens. \n \nMany Super Bowl 2012 advertisers made the web work in a bigger way a by sharing content with viewers across screens ahead of game day. By expanding their single :30 second television moment to new online moments, they drew more viewers to their content and peaked interest earlier. Candidates - at all levels - have the same ability to take advantage to win the moments that matter much earlier in the cycle to score more votes at “game time.” \n \n \n \n * Figure based on 2008 turnout data. \n \n \n \n Posted by Jennifer Gross, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/7203433603715891641/comments/default", "bloglinks": {}, "links": {"http://www.youtube.com/": 2, "http://www.google.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["The lengthy and tense redistricting process is finally wrapping up, but anyone wanting a national map of congressional districts faces the tedious task of compiling them from each state — until now! We’re excited to share this year’s U.S. Congressional districts in a single place . \n \nOur friends at Azavea have worked hard to track and compile this data from every state, and they graciously agreed to share this product of their Cicero API to be freely used by media, campaigns, and anyone else who has use for it. \n \n \n \n \n (click to enlarge) \n \nWhy is this data so hard to come by, and why did it take until now to get it? Well, the US Constitution requires rebalancing representation between the states based on population shifts, making each district within a state just about equal in population. However, each state determines how to draw new district lines. To cut a long story short, each of the 43 states with at least two Representatives uses its own process and timeline to draw and approve the lines. \n \n This dataset features the lines for the 2012 elections. You’ll note missing data for Kansas: the lines haven’t finalized there yet, and we’ll add that data once it’s available. Also, in several states there are ongoing court challenges - should a court order a review or a change of district lines, we’ll work to reflect those changes. \n \nWith several months to go until the general election, we hope that that members of the media, developers, and others trying to understand, explain, and advocate in this political cycle, can make good use of this data. \n \n Posted by Jesse Friedman, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/2076442409195184269/comments/default", "bloglinks": {}, "links": {"http://redistricting.lls.edu/": 1, "http://www.azavea.com/": 1, "https://www.google.com/": 2, "http://4.blogspot.com/": 1, "http://www.senate.gov/": 1, "http://azavea.com/": 1, "http://cookpolitical.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Last Sunday, France went to the polls for the second round of its Presidential Elections. François Hollande, the socialist leader, won the race for the French presidency with just under 52% of the votes beating the incumbent Nicolas Sarkozy. \n \nAs we did for the first round two weeks ago, our results map displayed the results in real time. We used Google Fusion Tables to store the raw results data for France's 30,000+ communes/towns and 100+ departments. \n \n \n \n \nWe updated our Fusion Tables in real-time alongside our map, feel free to dig into the tables to create your own visualizations and tools. \n \nRound 1 Tables: By Department and Commune \nRound 2 Tables: By Department and Commune \n \nYou can also take a look at the official data from the French Ministry of the Interior here . \n \n Posted by Steven Samorodin, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/2420530129798210498/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://google.com/": 1, "http://www.gouv.fr/": 1, "http://www.google.fr/": 1, "https://www.google.com/": 4}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Posted by Florian Maganza, Policy Analyst, Paris \n \n(Cross-posted from the Google European Public Policy Blog ) \n \nThe Internet plays a central role in citizens’ search for information about elections. Polling company Opinionway published a study at the end of last year that showed 52% of French citizens follow the electoral campaign online compared to 38% for the written press and 27% for the radio. \n \nIn order to help satisfy this growing demand, we developed www.google.fr/elections , an information hub to study, watch, discuss and participate in the French presidential campaign. Google tools such as Google News, Google+ YouTube and Google Maps were integrated to present information from a variety of sources on the campaign and its results. \n \nThis French presidential site is the latest edition of our Google election websites. After being rolled out in the United States to cover the Republican primaries, they now have expanded internationally to include presidential elections in Senegal , Egypt and Mexico . \n \nWhen the polls closed last night at 8 p.m. in France, French internet users discovered the election results in real-time on Google Maps. Viewers could see each candidate’s performance for each of France’s 106 departments as well as for each of the country’s 33,844 towns. \n \n \n \nBy clicking on a candidate on the side-bar, users were able to visualize the nuances in a candidate's performance. The brighter the colour, the more votes a candidate obtained. \n \nSocialist candidate Francois Hollande and incumbent president Nicolas Sarkozy finished first and second respectively. The two front-runners now face off for the next two weeks until French voters again go to the polls. Google will be there to five the results in real time - and in great detail. See you on May 6th for the 2nd and decisive round!"], "link": "http://googlepolitics.blogspot.com/feeds/4191931459674360721/comments/default", "bloglinks": {}, "links": {"http://googlepolicyeurope.blogspot.com/": 1, "http://www.google.fr/": 1, "http://www.larevueparlementaire.fr/": 1, "http://www.opinion-way.com/": 1, "http://www.google.com/": 3, "http://http//www.google.com/elections/ed/mx?hl=es_MX": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Now that the Republican presidential primary race is winding down, we’ve got a new way to look back through three months of voting and caucusing. The latest version of our election results map lets you see the county-by-county results across the nation. This new feature allows you to see the details of thousands of counties by seamlessly gliding your mouse over our map . \n \n \n \n \n (click to enlarge) \n \nAs with the previous map, click anywhere within a state to zoom in and see the statewide totals. And if you’d rather go back to the state-level colors, there’s a toggle at the top right (note that there are a few states where county-level data is not available, and in that case we show statewide totals in both views). And don’t forget a feature we’ve had for a while: if you click a candidate’s name up top, it shows their relative strength on the map. \n \nWe do understand that not every state calls them counties, please know we don’t mean to offend the parishes of Louisiana or the boroughs of Alaska. Speaking of county trivia, did you know that there are 31 different Washington Counties , or that San Bernardino County, CA is larger than the Rhode Island, Delaware, Connecticut and New Jersey combined? With so much geographic diversity in our vast nation, we hope this extra tool makes the politics of it all a little easier to sort out. \n \n Posted by Jesse Friedman, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/1066429935700629707/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://en.wikipedia.org/": 1, "http://www.google.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["The first Republican National Convention was held in 1856 in Pittsburgh, Pennsylvania and the only way to participate was to travel hundreds of miles by train, horse, or foot. We have come a long way since then. Technology has changed the political process from one that voters watch from afar, to one that people can participate in, engage with, and shape in a democratic way right from home. \n \nThe 2012 Republican presidential nominating convention in Tampa will be a convention without walls. Google and YouTube viewers will get an exclusive backstage pass to connect with Republican leaders off the podium via Google+ Hangouts, bringing convention conversations directly to voters. We will also be livestreaming key events right into their living rooms. \n \nWe are excited to partner with the 2012 Republican National Convention and serve as the official social platform and livestream provider. Be sure to tune in! \n \n Posted by Niki Fenwick, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/8764410303316650560/comments/default", "bloglinks": {}, "links": {"http://www.gopconvention2012.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["Ninety-five delegates are up for grabs in today's GOP primaries in the District of Columbia, Maryland, and Wisconsin. Almost half of the delegates will be awarded in winner-take-all Wisconsin where Mitt Romney and Rick Santorum are battling for the number one spot \n \nAs Mitt Romney continues his quest for the 1,144 delegates required to win the GOP nomination, Google Search data in Wisconsin indicates interest in Romney surged (to the tune of +125.1%) during the week leading up to the state’s primary. By contrast, interest in Newt Gingrich decreased by 19.7% during the same period of time. \n \n \n \n \nAlthough Rick Santorum has dominated search during much of the past week in Maryland, Mitt Romney took the lead over the last day. If Romney manages to sweep the popular vote in Maryland’s congressional districts, he stands to take home all of the state’s 37 delegates. \n \n \n \n \n Posted by Samantha Smith, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/7431026593803392869/comments/default", "bloglinks": {}, "links": {"http://1.blogspot.com/": 2, "http://www.google.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["While college basketball fans descend on New Orleans for the NCAA’s Final Four , another \"final four\" compete across the country for the Republican presidential nomination. \n \nAs the primary schedule slows down, we measured delegates and states won, YouTube views, Search interest, and Google+ fans to bring you the GOP final four. Looks like Mitt Romney leads in all categories except YouTube views and Search interest, where Ron Paul and Rick Santorum lead these respective areas. \n \n \n \n \n click image to enlarge \n \n Posted by Natalie Vernon, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/5341740415395983374/comments/default", "bloglinks": {}, "links": {"http://www.ncaa.com/": 1, "http://3.blogspot.com/": 1}, "blogtitle": "Politics & Elections Blog"}, {"content": ["As we’ve shown through our search trends series, voters across the globe turn to Google and YouTube first to research, understand and share political views and candidates everyday. However, Google isn’t just a tool for voters. Our Politics & Elections Team has created solutions that help campaigns and candidates - up and down the ballot - organize, reach the electorate, and persuade undecided voters by connecting with them. Increasingly today, that connection with voters isn’t just happening at front doors and local coffee shops. It is happening online as voters use the Web to get involved in the issues that matter to them. \n \nThe Internet has fundamentally transformed how voters receive information on candidates and issues and has helped shift politics from a passive process to an active, participatory one. For campaigns and candidates, that means that the because of the Internet access to relevant political information no longer comes from one place--or one screen. Our recent research shows that voters - YOUR VOTERS - use an average of 14.7 sources of information to help make their candidate selection and are connected to multiple devices throughout the day ( Google/Shopper Sciences, 2011 ). \n \nSo, whether your goal is a seat on the town council, building up support for your chosen issue, or even a race for the White House, integrated marketing efforts must engage voters across four screens: television, computers, tablets and mobile phones. Even if your goal isn’t 1600 Pennsylvania Avenue, but rather a seat in the State House or looking to help fix a local issue , research shows that using four screen ad campaigns are 48% more effective in driving campaign awareness and 77% more effective in driving campaign engagement. \n \n  \nToday, we’re launching “ Four Screens to Victory ” inside the Google Politics & Elections Toolkit where candidates and staff can make the web work for you. By learning how Google’s measurable solutions can win the moments that matter, campaigns can accelerate and amplify the impact of your television ads and help create a multi-platform marketing strategy that reaches voters where they spend time. With a solid strategy, a lot of hard work, and a little help from the team here at Google, we hope you and your supporters will be using your four screens - tablet, smartphone, TV and computer - to read good news on election night. \n \n \n \nPosted by: Charles Scrase, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/9212246043452372371/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://youtu.be/": 1, "http://www.google.com/": 2}, "blogtitle": "Politics & Elections Blog"}, {"content": ["This week, the Supreme Court is presiding over what some legal experts are calling a landmark case. The nine justices will determine whether certain sections of the Affordable Care Act are constitutional. Over the last two years, Republicans and Democrats have engaged in a fierce branding war over what to call the law. While the Obama Administration has used the phrases “Affordable Care Act” and “healthcare reform,” opponents of the legislation have labeled it “Obamacare.” \n \nWe decided to take a look at the last year’s worth of Google search trends to see which label has gained the most traction. While the phrases “Affordable Care Act” and “healthcare reform” were the most-searched in early 2011, “Obamacare” has become the most common searched term of the three for 2012. We also looked at the top rising searches associated with \"Obamacare.\" \n \n \n (click image to enlarge) \n \n \n \n Posted by Samantha Smith, Google Politics & Elections Team"], "link": "http://googlepolitics.blogspot.com/feeds/969070329634426465/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.google.com/": 1}, "blogtitle": "Politics & Elections Blog"}]