[{"blogurl": "http://blogs.abcnews.com/thenumbers\n", "blogroll": [], "title": "Politics » Polls"}, {"content": ["President Barack Obama, accompanied by Homeland Security Secretary Janet Napolitano, second from left, and others, speaks about superstorm Sandy during a visit to the Federal Emergency Management Agency (FEMA) Headquarters in Washington, Oct. 31, 2012. (Image Credit: Carolyn Kaster/AP Photo) \n Likely voters of all political stripes give broadly positive ratings to Barack Obama’s response to the devastating storm that smashed the East Coast this week. Whether it makes a difference in the long-deadlocked presidential election is another question. \n Initially, the latest ABC News/Washington Post daily tracking poll finds essentially no change: Likely voters are back to exactly an even split in preferences, 49-49 percent between Obama and Mitt Romney – within a point or two of where the race has been all along. \n See PDF with full results and charts here. \n Regardless, in interviews conducted last night, 78 percent rate Obama’s response to the hurricane positively (as excellent or good), while just 8 percent see it negatively. Romney, who naturally has had a far less prominent role in this issue, is rated positively for his response to the hurricane by 44 percent, negatively by 21 percent, with many more, 35 percent, expressing no opinion. \n The federal government’s overall response to the storm is rated about as well as Obama’s, 73 percent positive in this poll, produced for ABC by Langer Research Associates . These ratings are far higher than the government’s, or George W. Bush’s, a week after Hurricane Katrina in 2005. \n The future, of course, is uncertain, and these ratings can change depending on the pace of recovery. Notably, many in each case rate the responses to date as “good” rather than “excellent,” leaving room for reconsideration as the efforts progress. \n PARTISAN? – Views on Obama’s response to the hurricane exhibit some bipartisanship in an otherwise highly partisan period; he’s rated positively on the issue by 63 percent of Republicans as well as more than 80 percent of Democrats and independents, and by nearly as many conservatives (73 percent) as moderates and liberals (eight in 10). The federal government’s response more broadly is rated essentially equally favorably across partisan and ideological lines. \n Partisanship roars back in views of Romney’s response; these likely are based on political predispositions, given his lack of an official role in the effort itself. His 70 percent positive score among Republicans drops to 40 among independents and 24 percent among Democrats. \n This survey was conducted the past four nights, including interviews after Hurricane Sandy made landfall Monday night. Out of a national sample of 1,288 likely voters, 102 were interviewed Monday and Tuesday in the Northeast. Results in this group are in accord with comparable data from nights before the storm struck. \n ELECTION – Partisanship in the election itself is profound, with Obama and Romney each supported by at least 90 percent of likely voters within their parties. Depending on turnout, that can leave things up to independents, a movable group that’s less rooted in partisan preferences. \n Their latest direction gives some ground to Obama: Independents now divide by 51-46 percent, Romney-Obama, matching the president’s best in this group since July. He’s gained 8 percentage points among independents, and Romney’s lost 7, since last week. \n That shift among independents doesn’t tell the whole story because the makeup of the eventual electorate, and precise vote preferences among groups, are yet to be settled. But as with so many other measures, it underscores the unusual closeness of the contest. \n MORE GROUPS – Among other divisions are the continued sharp differences by race. Whites in this survey favor Romney by 58-40 percent, including white men bt 62-36 percent. Nonwhites, for their part, back Obama by 79-20 percent. The question again is turnout proportions; nonwhites accounted for a record 26 percent of voters in the 2008 exit poll. \n Turnout’s a question, as well, among young voters, a particularly strong group for Obama this year as in 2008, but one that seems less engaged this time around. At this point in 2008, 63 percent of adults under age 30 reported being registered to vote; that compares with 57 percent now. The falloff has occurred specifically among young men; just half now report being registered, down 13 points from this time last year. \n Time, of course, is running short. Eighteen percent of likely voters in fact say they’ve already voted, and about as many more intend to do so between now and Election Day. \n But the differences between these two groups, too, have tightened. Those who’ve voted early or intend to do so, previously looking better for Obama, now divide by a narrow 51-48 percent; and Election-Day likely voters, previously better for Romney, today split by 47-51 percent. It’s close in both, just like it’s close overall. \n FIRST/SECOND TERM – Another result looks at whether likely voters are focused more on what Obama has done in his first term – when the economy’s been in dire straits – or on what he might do in a second term. The division is 27-47 percent, with an additional 17 percent saying they’re focused on both. \n Vote preferences among these groups are telling. Among those focused on Obama’s first term, Romney leads by a 17-point margin, 58-41 percent. By contrast, among those who are more interested in what Obama would do in a second term, or who say both matter equally, it’s a 16-point Obama lead, 57-41 percent. Those results explain both candidates’ broad themes – for Obama, a focus on what’s ahead; for Romney, one on what’s gone wrong, particularly economically. \n ECONOMY and EMPATHY – Results specifically on the economy also reflect the dynamics of this contest. Trust to handle the economy has been Obama’s greatest vulnerability, yet Romney has been unable to capitalize on it fully; the two continue to run essentially evenly in trust to handle it, 49-47 percent, Romney-Obama. Romney had opened a 9-point lead on the economy last week; it didn’t hold. \n But then there’s empathy, which has been Obama’s strong suit – understanding the economic problems of average Americans. On this they’re now at 50-44 percent, Obama-Romney, better for Obama from last week, but well down from his double-digit lead on empathy last summer. \n There’s a telling contrast between these sentiments and those four years ago. At this time in the 2008 election Obama led John McCain by 10 points among likely voters, 52-42 percent, in trust to handle the economy, and by a broad 18 points, 56-38 percent, in economic empathy. That’s why the 2008 election was not a particularly close one – and why this year’s is another story entirely. \n METHODOLOGY – This ABC News/Washington Post poll was conducted by telephone Oct. 27-30, 2012, among a random national sample of 1,288 likely voters, including landline and cell-phone-only respondents. Results have a margin of sampling error of 3 points, including design effect. (Question 26 was asked Oct. 29-30 among 623 likely voters; those results have a 4.5-point error margin. Question 28 was asked Oct. 30 among 344 likely voters; those results have a 6-point error margin.) The survey was produced for ABC News by Langer Research Associates of New York, N.Y., with sampling, data collection and tabulation by Abt-SRBI of New York, N.Y. \n Partisan divisions in this survey, Democrats-Republicans-independents, are 33-28-36 percent among likely voters. Partisan divisions in the 2008 exit poll were 39-32-29 percent.  “Battleground states” as designated by the ABC News Political Unit are Colorado, Florida, Iowa, Minnesota, Nevada, New Hampshire, North Carolina, Ohio, Pennsylvania, Virginia and Wisconsin."], "link": "http://abcnews.go.com/blogs/politics/2012/10/storm-response-earns-obama-praise-amid-the-elections-deadlock-drama/", "bloglinks": {}, "links": {"http://langerresearch.com/": 1, "http://www.langerresearch.com/": 2, "http://abcnews.go.com/": 1}, "blogtitle": "Politics » Polls"}, {"content": ["Image Credit: Sara D. Davis/Getty Images \n \n A tightening of the gender gap and a closer race among political independents mark trends among likely voters the past several days, but with no meaningful change to the bottom line in the evenly matched 2012 presidential race. \n Nationally, likely voters divide by 49-48 percent between Mitt Romney and Barack Obama in the latest ABC News/Washington Post daily tracking poll. That’s exactly where it’s been in seven of the nine ABC/Post tracking poll releases since the start of last week, albeit with movement in some underlying measures – toward Romney in the middle of last week, then easing back since. \n See PDF with full results and charts here. \n In the 11 states designated as battlegrounds by the ABC News Political Unit, moreover, it’s 49-48 percent, Obama-Romney, in this poll, produced for ABC by Langer Research Associates , when all 12 nights of this daily tracking poll are combined. \n Such close overall results raise the possibility that one candidate could win the popular vote, another the electoral college, as in 2000. Were that to happen, likely voters by 56-37 percent say the winner of the popular vote should prevail. Sadly for them, the Constitution says otherwise. \n The latest results are based on interviews through a four-day period including Monday evening, when Hurricane Sandy struck the Northeast. Out of a national sample of 1,271 likely voters, 51 were interviewed Monday in the Northeast, the typical number in a single night. Eighty-six percent of those interviews were completed by 6:30 p.m., and all by 7:30 p.m. The storm, preceded by heavy winds and rain, made landfall at about 8 p.m. Data from the Monday night interviews in the Northeast are in accord with those from previous nights. \n GROUPS – One notable shift is in the gender gap, which widened to its largest of the campaign last week but has narrowed since. Today women divide by 50-48 percent between Obama and Romney, compared with 56-41 percent at the largest gap last week; and preferences among men, similarly, have narrowed, to 46-51 percent now, from 40-57 percent last week. \n Those changes have come in some particular groups. Gains for Romney last week among white men who lack a college degree have subsided slightly; he’s also lost some ground with men who are political moderates or independents. Obama meanwhile has slipped among women who are under age 50, or who hold college degrees; and his support from Republican women has gone from slight to slighter. \n Whatever the vote preferences, underpinnings of the gender gap remain: As is customary, women are 9 percentage points more likely than men to identify themselves as Democrats. \n Preferences also have shifted a bit among independents, from a campaign peak of 58-38 percent in Romney’s favor last week to 52-45 percent now. Reflecting sharper partisanship, Obama’s doing better with independents who lean toward the Democratic Party, and, as noted above, with independent men. A competitive result for Romney among unmarried independents has faded; that’s a return to the norm, in that unmarried people generally are a more Democratic group. \n VALUES – As if there weren’t enough results to illustrate the continued closeness of the race, a new question in this tracking poll asks likely voters which candidate better represents their personal values. The result: another nearly even split, 49-47 percent between Obama and Romney. \n Group differences on the question are predictably vast; 90 percent of liberals pick Obama as better reflecting their values, and 80 percent of conservatives pick Romney. More moderates say Obama rather than Romney better represents their values, 54-40 percent; the numbers overall even out because conservatives outnumber liberals by 13 points. \n While Obama does better than Romney on values among moderates, it’s numerically in Romney’s favor among independents, 48-43 percent (although not a statistically significant difference, given the sample size). Among other groups, 54 percent of whites prefer Romney on values, while 77 percent of nonwhites select Obama. \n COLLEGE – On the electoral college question mentioned above, majorities across the political spectrum (albeit just slightly among Republicans) favor the popular vote winner – 59 percent of independents, 56 percent of Democrats and 51 percent of Republicans. That’s a change from 2004, when, perhaps recalling the outcome of the 2000 election, a much larger majority of Democrats said the popular vote should prevail – and most Republicans plumped for the electoral college. \n The real answer, probably, is that it depends. In a similar question in 2000, just before the election most Republicans favored the popular vote, but after it, a majority said the electoral college should win the day – as it did, for the Republican candidate. \n THE STORM – A more immediate question, if not yet answerable, is the impact on the election, if any, of Monday’s devastating hurricane. It’s a prognosticator’s paradise, with little probative experience. Credit or blame for the response likely will be based on how smoothly or shakily it proceeds; the public’s patience is bounded by the magnitude of the disruption and the strength of the recovery effort. The answer, then, may take time – and with the election a week away, there’s precious little of that available. \n METHODOLOGY – This ABC News/Washington Post poll was conducted by telephone Oct. 26-29, 2012, among a random national sample of 1,271 likely voters, including landline and cell-phone-only respondents. Results have a margin of sampling error of 3.5 points, including design effect. (Questions 13e and 24 were asked Oct. 28-29 among 637 likely voters; those results have a 4.5-point error margin.) The survey was produced for ABC News by Langer Research Associates of New York, N.Y., with sampling, data collection and tabulation by Abt-SRBI of New York, N.Y. \n Partisan divisions in this survey, Democrats-Republicans-independents, are 33-28-35 percent among likely voters. Partisan divisions in the 2008 exit poll were 39-32-29 percent.  ”Battleground states” as designated by the ABC News Political Unit are Colorado, Florida, Iowa, Minnesota, Nevada, New Hampshire, North Carolina, Ohio, Pennsylvania, Virginia and Wisconsin."], "link": "http://abcnews.go.com/blogs/politics/2012/10/tighter-gender-gap-sharper-partisanship-but-no-change-in-the-bottom-line/", "bloglinks": {}, "links": {"http://langerresearch.com/": 1, "http://www.langerresearch.com/": 2, "http://abcnews.go.com/": 1}, "blogtitle": "Politics » Polls"}, {"content": ["Sara D. Davis/Getty Images \n With the election a week away Mitt Romney faces persistent skepticism about his commitment to the middle class, a vulnerability for the Republican challenger that’s keeping the race locked tight – a precise dead heat in the latest ABC News/Washington Post tracking poll, 49-49 percent. \n Barack Obama, for his part, inched to a bare majority in job approval in the latest four-night survey, benefitting from a gradual improvement in economic attitudes – still weak, but trending up. Notably, it’s his first time over 50 percent approval among likely voters in ABC/Post polls since July, just in time to counter what had been underlying momentum for Romney last week. \n See PDF with full results and charts here. \n In one of Obama’s key assets, a broad 66 percent of likely voters continue to say he does more to favor the middle class than the wealthy, a measure that’s held steady even as Romney gained on a range of other attitudes. Just 14 percent in this poll, produced for ABC by Langer Research Associates , think Obama favors the wealthy. \n Romney continues to struggle on the same question: Just 34 percent think that, as president, he’d favor the middle class; virtually the same as it’s been in ABC/Post polls since midsummer. Fifty-three percent think he’d favor the wealthy – enough for trouble. \n Among people who don’t think Romney would favor the wealthy, nearly all support him – by a vast 92-6 percent. But among the 53 percent who do think he’d do more for the wealthy than the middle class, that flips to nearly as broad a margin in Obama’s favor, 87-10 percent. \n ABC News \n BETTER? – Romney’s response on the middle class has been to underscore the shortfall in prosperity that’s made Obama vulnerable in the first place. Just 22 percent in this poll say they’ve gotten better off under his presidency, vs. 33 percent worse off. The rest say they’re in about the same shape financially as when Obama took office. \n But the trend in these sentiments also is keeping Obama in the game. The “better off” number has advanced from a mere 8 percent among all Americans in July 2009 and from 13 percent a year ago. The “worse off” number, in the past year, has been essentially unchanged. \n Obama, naturally, has a huge lead among “better off” likely voters, 82-17 percent, as does Romney among the larger number who say they’re worse off, 89-10 percent. (It’s worth noting that political predispositions color these financial self-assessments.) The tougher battle for Romney is among people who say they’re in the same shape financially as when Obama took office; they currently split in Obama’s favor, 61-35 percent. \n These dynamics appear to have helped Obama stem Romney’s advance on other basic economic views after the final debate last week. Through September and mid-October the two were in a virtual dead heat in trust to handle the economy. By the middle of last week Romney’d taken a 9-point lead on this key question. But it’s reverted since – now Romney +2, essentially tied again. \n On economic empathy, similarly, Obama is back to a marginal advantage, 50-44 percent vs. Romney in “understanding the economic problems people in this country are having.” That, too, had tightened last week, to a non-significant +2 for Obama, the closest of the campaign. \n The give-and-take on these measures illustrate the reasons the race is so close: Discontent with the economy, but somewhat less pessimism about its impacts; soft approval ratings for the president, yet still at the halfway mark; and mixed views on who’s better suited both to handle the economy, and to understand the damage it’s done to average Americans. \n CONTACT and GROUPS – If it stays this close, a dead-even race is one that’s decided by turnout, and there the ground games come into play. The latest data show Romney still keeping pace with Obama in voter contacts overall – but Obama moving back to an edge in efficiency, that is, in contacting people who actually support him, in order to encourage their turnout. \n Nationally, 26 percent of likely voters say they’ve personally been contacted by a representative of Obama’s campaign, 24 percent by Romney’s. In the 10 states designated as battlegrounds by the ABC News Political Unit, more, 45 percent, report being contacted by Obama, 39 percent by Romney. \n In efficiency, Obama has regained a lead, especially in the battleground states. There, among those contacted by the Obama campaign, 66 percent say they’re in fact Obama supporters. Among those contacted by Romney’s campaign, fewer support him, 51 percent. \n Trends among groups, meanwhile, show continued remarkable polarization. Ninety-one percent of Democrats support Obama, at the high end for the party’s past presidential candidates. Romney, for his part, is at 94 percent among Republicans, a new high of the campaign. \n Independents are customarily a more changeable group, as they’re less anchored by partisanship. They now divide 53-43 percent in Romney’s favor. Independents are a more GOP-leaning group now than in 2008; how far they lean could make the difference next week. \n METHODOLOGY – This ABC News/Washington Post poll was conducted by telephone Oct. 25-28, 2012, among a random national sample of 1,259 likely voters, including landline and cell-phone-only respondents. Results have a margin of sampling error of 3.5 points, including design effect. The survey was produced for ABC News by Langer Research Associates of New York, N.Y., with sampling, data collection and tabulation by Abt-SRBI of New York, N.Y. \n Partisan divisions in this survey, Democrats-Republicans-independents, are 35-28-34 percent among likely voters. Partisan divisions in the 2008 exit poll were 39-32-29 percent.  ”Battleground states” as designated by the ABC News Political Unit are Colorado, Florida, Iowa, Nevada, New Hampshire, North Carolina, Ohio, Pennsylvania, Virginia and Wisconsin."], "link": "http://abcnews.go.com/blogs/politics/2012/10/edge-on-the-middle-class-helps-obama-counterpunch/", "bloglinks": {}, "links": {"http://langerresearch.com/": 1, "http://www.langerresearch.com/": 2, "http://abcnews.go.com/": 1}, "blogtitle": "Politics » Polls"}, {"content": ["Eric Gay, David Goldman/AP Photo \n As it enters its frenetic final week the presidential race is drawing more close attention than any such contest in 28 years, a testament to a campaign that has been the closest by some measures in pre-election polls dating back even further – to 1960, or even to the early days of polling in 1936. \n Support for Barack Obama and Mitt Romney has averaged 48-48 percent since September, the closest in ABC/Post polls, or Gallup polls before them, in comparable periods dating back 76 years. It’s also the first contest since 1960 in which neither candidate, in this period, has exceeded 50 percent support (adjusting for third-party vote where applicable). \n \nSee PDF with full results, charts and tables here. \n Steady the past three days, the gap is now a single point, with 49 percent support for Romney among likely voters, 48 percent for Obama in this poll, produced for ABC by Langer Research Associates. At this stage in 2008, Obama had held majority support since Oct. 11. \n The comparison of the average gap between the leading candidates was done using results from September through this point before the election in ABC/Post polls since 1984 and available Gallup polls before them dating to 1936. The data are thin in some years – just one poll from this period in 1944, and just three in 1940, 1948, 1956, 1960, 1964, 1972 and 1980. \n The tight race is making it a closely followed one: Sixty-eight percent of likely voters say they’re following the election “very” closely – a non-significant 2 points more than at this time four years ago, and the most in ABC/Post or Gallup polls dating to the second Reagan election. \n Possible effects of Hurricane Sandy, bearing down on the Northeast, are unclear. But high attention to the election could presage high voter turnout. And marking Romney’s competitiveness compared with John McCain’s in 2008, close attention is up especially among conservatives and Republicans, two of his strongest support groups. \n TWO ISSUES – Two particular findings also indicate the unusual dynamics of this year’s election. One is taxes: Republicans customarily prevail on the issue, but Obama and Romney instead run essentially evenly in trust to handle it, 46-48 percent. \n That result – possibly indicating continued suspicion of Romney’s economic priorities – is useful for Obama. At the same time, it’s been better for him; trust on taxes has tightened from an unusual 11-point advantage for the Democrat nearly a week ago – a change that occurred almost entirely among political independents, the most moveable voters in national elections. \n The other issue is health care, usually a strong point for Democrats, but now one on which preferences again divide very closely, 49-46 percent Obama-Romney, likely reflecting doubts about elements of Obama’s health care reform law. \n APPROVAL and ECONOMY – These are hardly the only tight measures. In another fundamental gauge in an incumbent election, Obama’s job approval rating stands at 50 percent among likely voters; it’s been 48 to 50 percent since before the conventions. \n George W. Bush saw 50 percent approval among likely voters in an ABC/Post poll on Oct. 20, 2004, and he was at 48 percent among all adults in a Gallup poll Oct. 31 that year. The only other incumbent to win re-election with approval this low was, possibly, Harry S. Truman, with 40 percent approval in a Gallup poll in June 1948. No result closer to that election is available. \n A continued challenge for Obama is the intensity of sentiment about his work in office to date – a 10-point difference in the number who “strongly” disapprove, 40 percent, vs. strongly approve, 30 percent. \n The economy has been Obama’s millstone; it could be asked why he’s competitive at all, given the length and depth of the downturn. Poor economic conditions usually doom a president, as with the first President Bush in 1992. One answer is that politics are comparative, and Romney’s not sealed the deal in persuading voters he could do better. \n Likely voters now divide 50-45 percent between Romney and Obama on who would better handle the economy, back to within the margin of sampling error after a foray by Romney beyond it, 52-43 percent, last week. \n It’s also a non-significant 5-point gap on another important measure, economic empathy, defined as who better understands people’s economic problems – on this 49 percent pick Obama, 44 percent Romney. Last week Romney had closed to within 2 points on empathy. \n VOTING and GROUPS – Another key dynamic in the age of early voting is who casts their ballot, and when. Twelve percent of likely voters say in fact they’ve already voted, a number that’s more than doubled in the past week and likely will rise very steeply this week. \n Early voters report having supported Obama over Romney by 57-40 percent, almost exactly Obama’s advantage among early voters against McCain in 2008. The difference this year is that Romney leads Obama by 10 points among likely voters who plan to cast their ballots on Election Day – a group in which Obama and McCain were essentially even in 2008 polling. \n It’s a result that suggests the outcome of this contest will be hard to anticipate; it likely will come down to Election-Day turnout. And – again unlike in 2008 – the campaigns’ outreach to their potential voters is evenly matched this year, as detailed in Friday’s analysis. \n Finally, divisions among groups match their recent patterns – a wide lead for Romney among whites (now 17 points, 57-40 percent), especially white men (61-36 percent); and a wider lead for Obama among nonwhites (75-23 percent). Independents divide by 55-40 percent in Romney’s favor, moderates by 57-39 percent in Obama’s. And while Obama holds a nearly 2-1 advantage among likely voters younger than 30, the contest has tightened among those in their 30s – potentially a new battleground group, among the many in the 2012 contest. \n METHODOLOGY – This ABC News/Washington Post poll was conducted by telephone Oct. 24-27, 2012, among a random national sample of 1,278 likely voters, including landline and cell-phone-only respondents. Results have a margin of sampling error of 3.5 points, including design effect. The survey was produced for ABC News by Langer Research Associates of New York, N.Y., with sampling, data collection and tabulation by Abt-SRBI of New York, N.Y. \n Partisan divisions in this survey, Democrats-Republicans-independents, are 35-28-34 percent among likely voters. Partisan divisions in the 2008 exit poll were 39-32-29 percent."], "link": "http://abcnews.go.com/blogs/politics/2012/10/2012-presidential-race-is-its-own-perfect-storm/", "bloglinks": {}, "links": {"http://langerresearch.com/": 1, "http://www.langerresearch.com/": 2, "http://abcnews.go.com/": 1, "http://abcnews.go.com/blog": 1}, "blogtitle": "Politics » Polls"}, {"content": ["Republican presidential candidate and former Massachusetts Gov. Mitt Romney greets supporters as he campaigns at the Pensacola Civic Center in Pensacola, Fla., Saturday, Oct. 27, 2012. / Charles Dharapak/AP Photo \n Mitt Romney has matched Barack Obama on the question of who’s presented a clearer economic plan, a measure on which the president held a broad 16-point advantage this summer – further evidence of the underlying shifts that make the 2012 presidential race so close. \n Likely voters in the latest ABC News/Washington Post poll divide by 43-43 percent on who’s offered a clearer plan for the economy, compared with a 49-33 percent division in Obama’s favor on the same question in July – improvement for Romney as the campaign’s progressed. \n See PDF with full results and charts here. \n Romney’s also advanced in another area, affirmative voting, measured by the share of his backers who say they mainly support him rather than oppose Obama. Yet Romney still trails Obama on this potentially motivational measure, one reason the president is still so competitive. \n The race remains very narrowly divided – 49 percent support for Romney, 48 percent for Obama among likely voters in this poll, produced for ABC by Langer Research Associates . That almost precisely matches the average, 48-48 percent, in 11 ABC/Post polls since midsummer. Even with gains by Romney on some fundamentals, there’s been no breakout in this remarkably close contest. Notably, neither candidate has yet received majority support. \n FOR/AGAINST – Among Obama’s supporters, 77 percent say they’re mainly for him, rather than chiefly against Romney. The affirmative vote for Romney is lower – 58 percent. But that’s up by 10 percentage points since just after the conventions, and by a broad 22 points since July. \n Comparisons to the last incumbent election, in 2004, are instructive: Eighty-six percent of George W. Bush’s supporters were mainly “for” him rather than “against” John Kerry, while only 39 percent of Kerry’s support was affirmative. Obama’s affirmative support lags Bush’s by 9 points, and Romney’s exceeds Kerry’s by 19; as a result, Obama’s 19-point lead in affirmative voting pales compared with Bush’s 47-point advantage in this measure eight years ago. \n The question is whether negative voting is sufficient to motivate turnout – particularly among the more than third of Romney’s supporters who are mainly against Obama, not for Romney. (In another measure, the candidates are still essentially even in “strong” enthusiasm among their supporters, also better for Romney than it was before the debates.) \n MOMENTUM – As first noted Friday , Obama’s managed to stem Romney’s recent advances on some fundamental measures, raising questions about what had been clear post-debate momentum for the Republican. \n Romney had moved by midweek to his first significant advantage in trust to handle the economy, (a 9-point lead) and battled Obama to virtual parity on economic empathy – who best understands Americans’ economic problems. Today Romney still leads on the economy, by 7 points – no real slippage, but no further progress. On empathy, it’s a non-significant Obama +3, again no real change from midweek, but tighter than Obama’s +9 in mid-October. \n VOTED? – Early turnout, so far, favors Obama: Eleven percent of likely voters in this survey say in fact that they’ve already voted, and they report having favored Obama by 57-40 percent, almost exactly his margin among early voters in ABC/Post polling in 2008. \n Romney still has time to catch up; perhaps more important, he leads by 11 points among likely voters who plan to cast their ballots on Election Day. At this point in 2008, by contrast, Obama and John McCain were essentially even among Election Day likely voters, 49-47 percent. \n While early voters so far are favoring Obama, Romney, as noted in Friday’s analysis, is keeping pace with him on another measure of the ground game, voter contact. Equal numbers of likely voters say they’ve been contacted by the Obama and Romney campaigns (23 percent in both cases), an effort in which Obama surpassed McCain in 2008. \n Obama and Romney also remain very close in contact efficiency – reaching likely voters who are their actual supporters – another area in which Obama trumped McCain. \n Homing in on the 10 states designated as battlegrounds by the ABC News Political Unit (see the methodology section below for the list), contact again is very evenly matched – 43 percent say they’ve heard from Obama’s campaign, 41 percent from Romney’s. Obama had led by 13 points in battleground-state contacts two weeks ago. \n Vote preferences in those battleground states also are extremely close – 48-50 percent, Obama-Romney. That compares with a 16-point Obama lead in the strongly Democratic states, and a 19-point advantage for Romney in those designated as strongly Republican. \n GROUPS – Finally, the election remains marked by broad differences across partisan and demographic groups. The gender gap, for example, remains wide, an 11-point lead for Obama among women vs. a 13-point lead for Romney among men. \n Romney has a 58-39 percent lead among whites, pushed ahead by 63 percent support among white men (vs. 54 percent among white women); McCain’s support from white men in 2008, for comparison, was 57 percent. Also Romney is winning support from 81 percent of evangelical white Protestants, surpassing McCain’s 73 percent from this group in the 2008 exit poll. \n Obama counters with backing from nearly eight in 10 nonwhites, who’ve made up a growing share of the electorate in the past generation; they account for one in four likely voters in this survey. And Obama’s winning support from 64 percent of 18- to -29-year olds, virtually on pace with his 2008 record in this group. The essential question in a close race of course, is who among these sharply divided groups proves motivated enough to cast their ballots. \n METHODOLOGY – This ABC News/Washington Post poll was conducted by telephone Oct. 23-26, 2012, among a random national sample of 1,295 likely voters, including landline and cell-phone-only respondents. Results have a margin of sampling error of 3.5 points, including design effect. (Questions 5a, 5b and 13d were asked Oct. 24-26 among 962 likely voters; those results have a 4-point error margin.) The survey was produced for ABC News by Langer Research Associates of New York, N.Y., with sampling, data collection and tabulation by Abt-SRBI of New York, N.Y. \n Partisan divisions in this survey, Democrats-Republicans-independents, are 35-29-33 percent among likely voters. Partisan divisions in the 2008 exit poll were 39-32-29 percent. “Battleground states” as designated by the ABC News Political Unit are Colorado, Florida, Iowa, Nevada, New Hampshire, North Carolina, Ohio, Pennsylvania, Virginia and Wisconsin."], "link": "http://abcnews.go.com/blogs/politics/2012/10/even-split-on-economic-plans-marks-a-so-close-2012-contest/", "bloglinks": {}, "links": {"http://langerresearch.com/": 1, "http://www.langerresearch.com/": 2, "http://abcnews.go.com/": 1, "http://abcnews.go.com/blog": 1}, "blogtitle": "Politics » Polls"}, {"content": ["                                                                     (Image Credit: Sara D. Davis/Getty Images) \n \n \n President Obama and Mitt Romney are running essentially even not only in vote preferences but also in voter contact, a critical element of a race so close the campaigns’ ground games could well make the difference. \n As their field teams go into overdrive, some underlying shifts toward Romney paused in the latest ABC News-Washington Post poll. Still, the race itself is essentially unchanged: 49-48 percent among likely voters, compared with 50-47 percent Thursday. \n See PDF with full results and charts here. \n After advances earlier this week, there’s no further gain for Romney on key economic measures in today’s poll, produced for ABC by Langer Research Associates . And strong enthusiasm among his supporters, which rose sharply after the first debate, has been essentially stable since – neither losing nor gaining more ground, and even with Obama, but not ahead. \n Those results make the campaigns’ get-out-the-vote efforts potentially pivotal. While 22 percent of likely voters personally have been contacted by Obama’s campaign, as many, 23 percent, have been contacted by Romney’s side. That’s tightened from a 5-point Obama advantage in contacts in mid-October; Obama similarly had a 7-point advantage over John McCain in contacts at about this point in 2008. \n More important, Romney has caught up in the efficiency of his outreach as well. Among likely voters who’ve been contacted by his campaign, 63 percent, indeed, are Romney supporters. That’s on pace with Obama, who has had 65 percent efficiency in his campaign contacts. It’s a measure on which Obama led Romney by 17 percentage points two weeks ago, and was ahead of McCain by 22 points at this time in 2008. Efficiency matters because contacts are meant to encourage turnout; the campaigns want to reach, and encourage, their supporters. \n Romney also has sharpened his turnout efforts in the 10 states now designated by the ABC News Political Unit as battlegrounds (see the end of this report for the list). There, 40 percent of likely voters have been contacted by the Obama campaign, 39 percent by Romney’s. Efficiency is numerically better for Obama, but within the margin of error for this subset of the population. \n Obama led Romney by 13 points in contact in these states two weeks ago; again, Romney has caught up – not ahead, but even. \n VOTING – Voter contacts matter all the more given the increasing prevalence of early and absentee voting. Just 61 percent of likely voters in this survey say they plan to vote on Election Day; the rest either plan to vote early or, in the case of 8 percent, already have done so. \n And there’s a difference in these groups: Among people who say they plan to vote early (or have done so), Obama leads in vote preferences by 55-42 percent. Among those who plan to hold off until Election Day itself, those numbers reverse – a 10-point Romney advantage, 54-44 percent. \n TRACKING TRENDS – The ABC-Post tracking poll, based on a four-day rolling average of results, showed improving trends for Romney through Wednesday night; as reported Thursday, these took him to his first clear lead over Obama in trust to handle the economy, and his first virtual dead heat in who better understands Americans’ economic problems. \n Those now have stabilized. Romney, for instance, went from an insignificant plus-2 points in trust to handle the economy in four nights of interviews completed Sunday to plus-9 points in those completed Wednesday; it’s plus-7 now. On empathy, Romney went from minus-9 points in mid-October to minus-7 Sunday and minus-2 Wednesday; in the latest interviews it’s steady at minus-2, with no further advance. Both are key measures to watch in an election framed by the longest, deepest economic downturn since the Great Depression. \n GROUPS – Those shifts in sentiment, as reported previously, occurred chiefly among white men, especially those who lack a college degree. Romney is at another new high in the latest poll among white men, with 66 percent support, lifting him to 60 percent among whites overall, tying his best of the contest. Whites account for 75 percent of all likely voters. \n Political independents have shifted as well, to a campaign record 58-38 percent, Romney-Obama. As with the other results, that reflects a move toward Romney among lower-income white independents and among independent men. Additionally, more conservative independents say they’ll vote, and prefer Romney. \n One apparent impetus, as noted Thursday, is that independents are disproportionately likely to say their opinions of Romney improved as a result of his performance in the debates. \n Leading among independents doesn’t tip the race to Romney because Democrats slightly outnumber Republicans, by 4 points among likely voters, and Obama wins nearly all Democrats (as does Romney with Republicans). Democrats outnumbered Republicans by 7 points in the 2008 exit poll. \n Obama’s at a new high among blacks in this poll, with an almost unanimous 97 percent support, lifting him to 82 percent among nonwhites overall, also his best to date. And a wide gender gap continues – Romney plus-18 points among men, Obama plus-13 among women. The result among women is typical; it’s Romney’s lead among white men that’s making the race so close. They constitute 37 percent of likely voters. The question is whether that’s enough to keep Romney’s post-debate momentum moving. \n METHODOLOGY – This ABC News-Washington Post poll was conducted by telephone Oct. 22-25, 2012, among a random national sample of 1,382 likely voters, including landline and cellphone-only respondents. Results have a margin of sampling error of 3 points, including design effect. The survey was produced for ABC News by Langer Research Associates of New York, N.Y., with sampling, data collection and tabulation by Abt-SRBI of New York, N.Y. \n Partisan divisions in this survey, Democrats-Republicans-independents, are 34-30-32 percent among likely voters. Partisan divisions in the 2008 exit poll were 39-32-29 percent. “Battleground states” as designated by the ABC News Political Unit are Colorado, Florida, Iowa, Nevada, New Hampshire, North Carolina, Ohio, Pennsylvania, Virginia and Wisconsin."], "link": "http://abcnews.go.com/blogs/politics/2012/10/candidates-tie-in-voter-outreach-a-closer-ground-game-than-in-08/", "bloglinks": {}, "links": {"http://langerresearch.com/": 1, "http://www.langerresearch.com/": 2, "http://abcnews.go.com/": 1}, "blogtitle": "Politics » Polls"}, {"content": ["Charles Dharapak/AP Photo \n Mitt Romney has seized further advantage on economic issues at the core of the 2012 campaign, taking him to 50 percent support among likely voters vs. 47 percent for Barack Obama – Romney’s highest vote-preference result of the contest to date. \n The difference between the two candidates is within the margin of sampling error in the latest ABC News/Washington Post daily tracking poll, and their individual support levels have not significantly changed. But the momentum on underlying issues and attributes is Romney’s. \n See PDF with full results and charts here. \n \n Romney’s gains are clear especially in results on the economy. This poll, produced for ABC by Langer Research Associates , finds that likely voters now pick Romney over Obama in trust to handle the economy by 52-43 percent – the first time either candidate has held a clear lead over the other on this central issue. \n Equally important, Romney has erased Obama’s customary advantage on which candidate better understands the economic problems of average Americans. Today, 48 percent pick Obama, 46 percent Romney – essentially a dead heat. Yesterday and today mark the first time in the campaign that Obama hasn’t had at least a marginally significant lead on economic empathy. \n Within-group trends on both these economic measures were covered in yesterday’s analysis ; they reflect movement in Romney’s direction almost exclusively among white men, and particularly among less-educated white men. \n SIGNALS – There are other signals of Romney’s gains. Expectations are one: Fifty-two percent of likely voters now expect Obama to win the election, down from a peak of 61 percent in late September. Forty percent expect Romney to win – still well fewer than half, but up by 8 percentage points. \n Notably, political independents divide by 42-46 percent on whether they expect Obama or Romney to win; that’s shifted dramatically from 61-31 percent in Obama’s favor. Whites, likewise, have moved from a 55-38 percent expectation in Obama’s favor Sept. 29 to 44-48 percent now. \n Romney is more competitive in another area, as well – international affairs. Even though likely voters by 2-1 picked Obama as the winner of Monday’s debate on foreign policy, comfort with Romney on the issue nonetheless has progressed. He runs essentially evenly with Obama in trust to handle international affairs, 48-47 percent, Obama-Romney; they were about this close on Monday, but it was +7 for Obama in mid-October and +8 in early September. \n Obama retains a larger numerical (but not significant) edge on another issue, trust to better advance the interests of the middle class, 50-45 percent. It was similar, 51-43 percent, when last asked in an ABC/Post poll completed Sept. 9. \n In other results, Obama has a 49 percent job approval rating among likely voters – it’s been 49 or 50 percent steadily since mid-October – but more “strongly” disapprove than strongly approve, 41 percent vs. 30 percent – an intensity gap that may work against him. \n  \n HORSE RACE – Romney never before has exceeded 49 percent support in ABC/Post polls, making his 50 percent a new high numerically. That includes new highs among a range of groups – including 60 percent support among whites, 56 percent among white women, 58 percent among middle- to upper-middle income adults and 83 percent among conservatives. \n Most strikingly, Romney’s advanced to 57 percent support among independents. They’re a changeable group, less rooted in partisan predispositions, so their eventual preferences – and their turnout – are uncertain. But they’re key to Romney’s current fortunes; he’s improved among independents by 9 points in the past week. \n The debates are one apparent reason. By a broad 47-10 percent, independents say the debates left them with a better rather than a worse impression of Romney. In the same group, by contrast, just 17 percent say their impression of Obama improved – and 26 percent say it got worse. \n Polarization, meantime, is extreme; Obama is at a new high in support among nonwhites, 80 percent, and continues to pull in broad support from younger adults – six in 10 of those younger than 40. All the same, at 61 percent, his support among unmarried women, a core Democratic group, has reached a new low, chiefly because he’s slipped among unmarried white women. \n Still, the gender gap overall remains wide: women for Obama by 54-43 percent; men for Romney by 57-40 percent. \n As noted, the overall 3-point gap between Romney and Obama in this poll is not statistically significant. Given the sample size, it would take a difference of greater than 6 points for the result to be significant at the customary 95 percent confidence level, or more than 5 points at a less-stringent 90 percent confidence level (referred to as a “slight” or marginal difference). \n While the race, then, remains close, Romney’s momentum has come in time for most voters: Thirty-seven percent of likely voters say they’ve voted early or plan to, but that includes far fewer, 8 percent, who already have done so. It’s a number that’s growing daily, putting each campaign’s get-out-the-vote efforts to the critical test. \n METHODOLOGY – This ABC News/Washington Post poll was conducted by telephone Oct. 21-24, 2012, among a random national sample of 1,386 likely voters, including landline and cell-phone-only respondents. Results have a margin of sampling error of 3 points, including design effect. (Questions 12f, 12h and 21 were asked Oct. 23-24 among 707 likely voters; those results have a 4.5-point error margin.) The survey was produced for ABC News by Langer Research Associates of New York, N.Y., with sampling, data collection and tabulation by Abt-SRBI of New York, N.Y. \n Partisan divisions in this survey, Democrats-Republicans-independents, are 34-30-31 percent among likely voters. Partisan divisions in the 2008 exit poll were 39-32-29 percent."], "link": "http://abcnews.go.com/blogs/politics/2012/10/romney-hits-the-50-percent-mark-with-a-clear-edge-on-the-economy/", "bloglinks": {}, "links": {"http://langerresearch.com/": 1, "http://www.langerresearch.com/": 2, "http://abcnews.go.com/": 2, "http://abcnews.go.com/blog": 1}, "blogtitle": "Politics » Polls"}, {"content": ["Pablo Martinez Monsivais/AP Photo \n Mitt Romney has advanced to a slight lead over Barack Obama in trust to handle the economy, and Obama has slipped beneath a clear majority in who better understands the public’s economic problems – two key metrics of the 2012 presidential race. \n These trends in the latest ABC News/Washington Post daily tracking poll aren’t strong enough to change current preferences, nor is the 2-1 view that Obama won Monday night’s final debate. But they’re among the underlying dynamics making the race seem closer now than a month ago. \n See PDF with full results and charts here. \n The candidates remain essentially tied, with 49 percent of likely voters for Romney, 48 percent for Obama in this poll, produced for ABC by Langer Research Associates . That includes vast and sharpening gaps among some groups, with highs for both candidates among core supporters. \n One example is white men, in particular those who lack a college degree; almost all of the recent shifts in trust on the economy and perceived economic empathy have occurred in this group. Romney’s support among white men is its highest of the campaign, a 2-1 margin, 65-32 percent. That compares with 57-41 percent, McCain-Obama, in the 2008 exit poll. \n While it’s closer among white women, 53-44 percent, Romney-Obama, that very broad support among white men lifts Romney to a new high among whites overall, 59 percent. And it expands the gender gap to a new high as well: A 17-point lead for Romney among men, 57-40 percent, compared with a 15-point advantage for Obama among women, 56-41 percent. \n And it’s men, compared to four years ago, who are making it close. Obama beat John McCain among women in 2008 by 13 points, similar to his margin over Romney today. But McCain only tied Obama among men, a far cry from Romney’s large advantage in this group now. \n Obama pushes back among other groups. One example is Hispanics, whom Obama described as crucial to his re-election in a Des Moines Register interview released today. While they make up a small share of the national electorate in this survey, 8 percent (about the same as in 2008), Obama is supported by 75 percent of Hispanics – a new high this season, and more than his 67 percent in the 2008 exit poll. They indeed could be critical in close states, or in those with larger concentrations of Hispanic voters. \n Obama, additionally, is winning a near-unanimous 95 percent support from blacks, and 79 percent of nonwhites overall, matching his high of the 2012 campaign. Nonwhites account for 24 percent of likely voters in this survey – very close to their 2008 turnout, 26 percent. \n THE ECONOMY – While preferences among groups – and their turnout – will determine the outcome, concerns about the economy are driving this contest, and there Romney has made gradual progress. Likely voters now pick him over Obama by 50-44 percent as the candidate they trust to do a better job handling the economy, a slight but marginally significant lead for Romney for the first time since late August. \n As noted, that shift has occurred almost entirely among white men: They favor Romney over Obama on the economy by a 35-point margin now (65-30 percent), compared with 19 points in mid-October (57-38 percent). There’s been essentially no change in the same period among white women (+14 points for Romney in trust to handle the economy) or among all nonwhites (+51 points for Obama). \n Get more pure politics at  ABCNews.com/Politics  and a lighter take on the news at  OTUSNews.com \n While Obama never has had a clear lead overall in trust to handle the economy, he’s usually prevailed in another measure, which candidate better understands the economic problems of ordinary Americans. On this, however, he’s gone from a 9-point advantage (51-42 percent) in mid-October to 50-45 percent now – a 5-point differential that is not statistically significant given this survey’s margin of sampling error. As with trust to handle the economy, Obama hasn’t scored this weakly relative to Romney on economic empathy since late August, just before the party conventions. \n The shift on empathy, as with trust on the economy, has occurred almost exclusively among white men, moving from a non-significant 8-point tilt to Romney on this question in mid-October to a 26-point margin now. Views among white women and nonwhites on economic empathy, again, are essentially unchanged. \n Drilling further, these shifts, in both cases, have occurred disproportionately among a specific group of white men – those who lack a college degree. They expressed greater trust in Romney to handle the economy by 24 points in mid-October, but do so by a 47-point margin now. And on economic empathy the margin for Romney among less-educated white men has moved from 13 points in mid-October to 40 points now. \n DEBATE THIS – These trends may mitigate whatever benefit Obama sought to take from the third and final presidential debate – given, especially, the apparent lasting benefit to Romney of his performance in the first debate. \n Using single-night survey results from last night, likely voters by 48-24 percent say Obama won the third debate. Nonetheless, they also say by a 21-point margin, 37-16 percent, that as a result of all three debates together, their opinion of Romney has gotten better rather than worse. Obama gets just a split decision on the same better/worse question, 16 percent vs. 18 percent. (The rest say their opinions didn’t change.) \n PERFORMANCE and ENTHUSIASM – Obama’s overall job approval rating among likely voters stands at 50 percent, a challenging number albeit not one that precludes re-election. Another result, though, indicates his difficulties compared with four years ago: At his apex in 2008, 71 percent of his supporters said they were “very” enthusiastic about his candidacy. It’s 60 percent now, essentially the same as Romney’s strong enthusiasm (which, as noted yesterday, well surpasses John McCain’s in ’08.) \n These measures return the discussion to turnout, and that’s not just a question for Election Day. Seven percent of likely voters say in fact they’ve already voted, and they divide almost precisely evenly between Obama and Romney; an additional 28 percent say they’re going to vote early, but haven’t yet. The race among early voters and Election Day voters alike is close – within the margin of sampling error in both cases – raising the question of whether Obama, who far outpaced McCain among early voters in 2008, can replicate the feat this time. \n METHODOLOGY – This ABC News/Washington Post poll was conducted by telephone Oct. 20-23, 2012, among a random national sample of 1,394 likely voters, including landline and cell-phone-only respondents. Results have a margin of sampling error of 3 points, including design effect. (Questions 19-20 were asked Oct. 23 among 357 likely voters; those results have a 6.5-point error margin.) The survey was produced for ABC News by Langer Research Associates of New York, N.Y., with sampling, data collection and tabulation by Abt-SRBI of New York, N.Y. \n Partisan divisions in this survey, Democrats-Republicans-independents, are 34-30-32 percent among likely voters. Partisan divisions in the 2008 exit poll were 39-32-29 percent."], "link": "http://abcnews.go.com/blogs/politics/2012/10/romney-takes-lead-on-economy-white-men-are-the-movers/", "bloglinks": {}, "links": {"http://langerresearch.com/": 1, "http://www.langerresearch.com/": 2, "http://abcnews.go.com/": 3}, "blogtitle": "Politics » Polls"}, {"content": ["Rick Wilking/Pool/Getty Images \n Mitt Romney eked out bragging rights in the latest ABC News/Washington Post tracking poll, claiming 49 percent support among likely voters vs. Barack Obama’s 48 percent – Romney’s first numerical edge, however slight, since before the party conventions. \n Slight is the word: Taking it to two decimals (for illustration only – not to imply false precision), Romney has 48.51 percent support, Obama 48.44 percent – about as close as it can be. Still, with rounding, Romney’s 1-point numerical edge is his first since an ABC/Post poll Aug. 25. \n See PDF with full results and charts here. \n Underscoring Obama’s challenges two weeks before Election Day, his job approval rating now stands at 49 percent among likely voters, its lowest since late September (48 percent) and trouble for him to the extent that the election is a referendum on his performance. Among previous incumbents, George W. Bush dipped to 50 percent among likely voters – but not lower – in the fall of his successful re-election campaign. \n Moreover, likely voters now divide by 50-45 percent, Romney-Obama, in whom they trust to do a better job handling the economy. The 5-point gap, while not statistically significant, is its widest, again, since Aug. 25. \n Obama, however, retains pushback on the question of empathy, another significant independent predictor of vote preferences. He leads Romney by 7 points, 51-44 percent, in who better understands the economic problems people in this country are having. \n ENTHUSIASM and INTEREST – Interviews for the latest ABC/Post daily tracking poll, produced for ABC by Langer Research Associates , were conducted Friday through Monday, almost entirely before the candidates’ final debate Monday night. While debates rarely directly impact vote preferences, they can more subtly influence campaign dynamics, as with Romney’s gains in some underlying measures, such as strong enthusiasm among his backers, after the first debate Oct. 3. \n Today Romney and Obama are precisely matched on that measure: Sixty-two percent of each candidate’s supporters say they’re “very” enthusiastic about their choice. That’s a change from the last two presidential elections, in which the eventual winners, Obama in 2008 and Bush in 2004, clearly led their opponents in strong enthusiasm at this point. It’s one reason the race this year is so close. \n In a telling comparison, Obama’s strong enthusiasm is a scant 3 points lower than it was two weeks before Election Day in 2008, but Romney’s is a broad 24 points higher than McCain’s four years ago. Compared to 2004, strong enthusiasm for Obama and Romney is similar to Bush’s (60 percent), and well ahead of John Kerry’s (50 percent) at about this time in their contest. \n Another measure, interest in the race, has risen steadily: On Sept. 9, just after the party conventions, 51 percent of likely voters said they were following the election very closely. That’s now risen to 64 percent, precisely the same as at this point in 2008. \n GROUPS – With his overall support matching his previous high in late August, Romney’s at new numerical highs in some individual groups – among “very” conservative likely voters, with 92 percent support; among married men, with 64 percent; and among seniors, with 57 percent. \n Obama, for his part, retains strength in core Democratic groups, including a new high among liberals, 90 percent; as well as 93 percent support from blacks and seven in 10 among Hispanics. At 62 percent, his support among young adults, under age 30, rivals Romney’s among seniors; the question is the extent to which young voters turn out. \n Finally, if enthusiasm is a far closer call now than in 2008, so are early voting intentions. In ABC/Post polling four years ago, Obama won likely voters who said they voted early by a wide 18 points. Today, by contrast, among the 33 percent who say they will vote early (or already have done so), the contest is essentially tied, 50-48 percent, Obama-Romney. \n Obama’s difficulties compared with 2008 appear in another way: Among people who say they supported him four years ago, 85 percent still are doing so, but 12 percent say they’ll switch to the Republican. Among McCain voters, by contrast, Romney’s retaining 96 percent support. \n METHODOLOGY – This ABC News/Washington Post poll was conducted by telephone Oct. 19-22, 2012, among a random national sample of 1,382 likely voters, including landline and cell-phone-only respondents. Results have a margin of sampling error of 3 points, including design effect. The survey was produced for ABC News by Langer Research Associates of New York, N.Y., with sampling, data collection and tabulation by Abt-SRBI of New York, N.Y. \n Partisan divisions in this survey, Democrats-Republicans-independents, are 34-29-32 percent among likely voters. Partisan divisions in the 2008 exit poll were 39-32-29 percent."], "link": "http://abcnews.go.com/blogs/politics/2012/10/romney-ekes-out-bragging-rights-for-obama-approval-slips-below-50/", "bloglinks": {}, "links": {"http://langerresearch.com/": 1, "http://www.langerresearch.com/": 2, "http://abcnews.go.com/": 1}, "blogtitle": "Politics » Polls"}, {"content": ["Image credit: Olivier Douliery-Pool/Getty Images/Chris Maddaloni/CQ Roll Call \n Mitt Romney carries newfound competitiveness in trust to handle international issues into the final presidential debate, combined with his highest personal popularity of the 2012 campaign. But continued weakness in his perceived economic priorities is keeping the race a close one. \n Among other shifts, after last week’s second debate, which included a spirited exchange on women in the workplace, the contest now has its largest gender gap of the season – a 14-point lead for Barack Obama among women, vs. a 12-point advantage for Romney among men. \n Tune in for anchored streaming coverage of the final presidential from ABC News Political Director Amy Walter, GMA Weekend anchor Dan Harris and Yahoo! News White House correspondent Olivier Knox. It kicks of at 8 p.m. ET. Watch it at abcn.ws/live \n The result, as in previous ABC News/Washington Post polls since late summer, is essentially a dead heat between the candidates overall. In the first of what will be daily ABC/Post tracking polls for the rest of the contest, 49 percent of likely voters back Obama, 48 percent Romney. \n \n See PDF with full results and charts here. \n With tonight’s debate focused on foreign policy, the poll, produced for ABC by Langer Research Associates , finds Romney virtually tied with Obama in trust to handle international affairs (49-46 percent, Obama-Romney) and terrorism (47-46 percent), as well as to serve as commander-in-chief of the armed services (48-45 percent). That reflects a shift in Romney’s favor; Obama led on terrorism by 11 points as recently as Sept. 29, and on international affairs by 7 points earlier this month. \n In another milestone for Romney, 50 percent of likely voters express a favorable opinion of him overall, while 47 percent see him unfavorably – his highest popularity score of the season, and one of the rare times he’s been numerically above water in this measure. His personal popularity now roughly matches Obama’s 52-46 percent, favorable-unfavorable. \n Watch ABC’s pre-debate live stream : \n \n\n While more pick Obama as winner of the second debate, these advances for Romney appear to reflect a carry-over effect of his first debate performance. Overall, 37 percent of likely voters say their opinion of Romney has improved as a result of the two debates, double the 19 percent who think less of him. Obama gets just an even split, 15 percent to 18 percent, better-worse. (The rest say the debates haven’t changed their views of the candidates – 65 percent in Obama’s case, 43 percent in Romney’s). \n Still, Obama clawed back some ground in the second debate – he’s seen as having won it by 48-29 percent, compared with Romney’s 71-17 percent in the first debate. And the number of likely voters with a better opinion of Obama as a result of the two debates has advanced from 8 percent after the first debate to, as noted, 15 percent after the second. Those results underscore what’s at stake in the candidate’s last face-off tonight. \n ABC News/Washington Post poll tracking since July 2012 \n CHALLENGES – While Romney shows momentum on some underlying attributes, he also still faces some fundamental challenges. Obama is benefitting from slightly improving economic attitudes; as many likely voters now say the economy is improving as say it’s worsening, 37 percent vs. 36 percent, numerically positive for the first time since spring in comparable data. \n Most strikingly, a majority continues to think Romney, if elected, would favor the wealthy rather than the middle class, by 54-33 percent. Obama, by contrast, consistently has been seen by an overwhelming majority, now 66-15 percent, as having done more to favor the middle class than the wealthy. \n Read ABC analysis: Why both campaigns are focusing on swing states. \n \n Get more political news at ABC News.com/Politics . \n Overcoming this perception may be Romney’s single biggest challenge ahead; one complication in his addressing it is Obama’s advantage in two other areas: Better understanding the economic problems of average Americans, on which the president leads Romney by 7 points; and honesty and trustworthiness, on which Obama’s up by 9. \n ISSUES and APPROVAL – Obama has an unusual advantage on another issue, again likely reflecting skepticism about Romney’s economic priorities: In trust to handle taxes, typically a better issue for Republican candidates, Obama leads by 11 percentage points, 53-42 percent – the president’s biggest lead on taxes all season. \n Obama also is competitive with Romney in trust to handle the deficit, (49-45 percent, Romney-Obama); that’s tightened from a wide Romney advantage in the spring and summer, perhaps reflecting some impact from Obama’s continued criticisms of Romney’s budget numbers. Obama, moreover, leads by 12 points on handling Medicare and by 13 points in trust to handle women’s issues. Women prefer Obama on women’s issues by a wide 18 points; men, by 7. \n On trust to handle the economy – the election’s top issue and Obama’s greatest vulnerability – it’s another virtual dead heat, 48-46 percent, Romney-Obama. \n Still, Obama’s job approval rating overall is 50 percent among likely voters, a point short of a majority. In historical terms, that can be adequate to win re-election (George W. Bush and, possibly, Harry S. Truman), but certainly not comfortably so. \n While there have been shifts under the surface, it’s notable how little overall preferences have changed in this contest: Obama’s support among likely voters has been between 47 and 49 percent steadily since just before the conventions; Romney’s, 46 to 49 percent. And likely voter definitions with different turnout estimates produce essentially identical horse race results. \n STATES and GROUPS – As well as close overall, the contest stands at 51-47 percent, Romney-Obama, in the nine battleground states designated by the ABC News Political Unit – well within the margin of sampling error, and not significantly different from the mid-month 51-46 percent, Obama-Romney, in these same states. But regardless of sampling error, the bigger number now is Romney’s, another indication of the competitiveness he’s showing. \n Obama has a little pushback on another metric: The share of his supporters who describe themselves as “very enthusiastic” has advanced to 64 percent, his highest of the season, and matching his level at this time in 2008 (but below his peak that year). Romney’s strong enthusiasm, at 58 percent, is numerically off its peak at mid-month, after the first debate. \n Among groups, again perhaps reflecting the second debate, this poll finds a shift in Obama’s direction among college-educated white women. They go for Obama over Romney by 55-42 percent now, vs. a preference for Romney by almost an identical margin, 56-42 percent, in mid-October. Other slight shifts mitigate the overall impact – Romney’s gained among white men, especially among those who lack a college degree – but it explains the wider gender gap. \n Romney leads by 15 points among whites overall, while Obama comes back with a vast 78-19 percent advantage among nonwhites. There’s a hardening at the ideological poles, with Obama and Romney at their highest support of the campaign among liberals and “very” conservatives, respectively (88 percent of liberals for Obama, 89 percent of very conservatives for Romney). The fight’s among moderates, now +16 points for Obama, and somewhat conservatives, +37 for Romney. \n There’s also extreme polarization among Democrats and Republicans, with a scant 3-point difference between the candidates among independents, 49 percent for Romney, 46 percent for Obama. A slight 5-point turnout advantage for Democrats makes the race essentially tied – and, if nothing breaks open, makes turnout the key to the 2012 race. Turnout’s especially important since a third of likely voters say they plan to vote early – including 5 percent who already have. \n METHODOLOGY – This ABC News/Washington Post poll was conducted by telephone Oct. 18-21, 2012, among a random national sample of 1,376 likely voters, including landline and cell-phone-only respondents. Results have a margin of sampling error of 3 points, including design effect. The survey was produced for ABC News by Langer Research Associates of New York, N.Y., with sampling, data collection and tabulation by Abt-SRBI of New York, N.Y. \n Partisan divisions in this survey, Democrats-Republicans-independents, are 34-29-33 percent among likely voters. Partisan divisions in the 2008 exit poll were 39-32-29 percent. “Battleground states” as designated by the ABC News Political Unit are Colorado, Florida, Iowa, Nevada, New Hampshire, North Carolina, Ohio, Virginia and Wisconsin."], "link": "http://abcnews.go.com/blogs/politics/2012/10/debate-ahead-romney-gains-on-intl-affairs-but-continues-to-lag-on-economic-priorities/", "bloglinks": {}, "links": {"http://langerresearch.com/": 2, "http://abcnews.com/": 1, "http://abcnews.go.com/": 3, "http://abcnews.go.com/blog": 1, "http://www.langerresearch.com/": 1}, "blogtitle": "Politics » Polls"}]