[{"blogurl": "http://quomodocumque.wordpress.com\n", "blogroll": [], "title": "Quomodocumque"}, {"content": ["This, from Politico’s Dylan Byers , is infuriating: \n Prediction is the name of Silver’s game, the basis for his celebrity. So should Mitt Romney win on Nov. 6, it’s difficult to see how people can continue to put faith in the predictions of someone who has never given that candidate anything higher than a 41 percent chance of winning (way back on June 2) and — one week from the election — gives him a one-in-four chance, even as the polls have him almost neck-and-neck with the incumbent. \n Why?  Why is it difficult to see that?  Does Dylan Byers not know the difference between saying something is unlikely to happen and declaring that it will not happen? \n Silver cautions against confusing prediction with prophecy. “If the Giants lead the Redskins 24-21 in the fourth quarter, it’s a close game that either team could win. But it’s also not a “toss-up”: The Giants are favored. It’s the same principle here: Obama is ahead in the polling averages in states like Ohio that would suffice for him to win the Electoral College. Hence, he’s the favorite,” Silver said. \n For all the confidence Silver puts in his predictions, he often gives the impression of hedging. Which, given all the variables involved in a presidential election, isn’t surprising. For this reason and others — and this may shock the coffee-drinking NPR types of Seattle, San Francisco and Madison, Wis. — more than a few political pundits and reporters, including some of his own colleagues, believe Silver is highly overrated. \n Hey!  That’s me!  I live in Madison, Wisconsin!  I drink coffee!  Wait, why was that relevant again? \n To sum up:  Byers thinks Nate Silver is overrated because he “hedges” — which is to say,  he gives an accurate assessment of what’s going on instead of an inaccurate one. \n This makes me want to stab my hand with a fork. \n I’m happy that Ezra Klein at the Post decided to devote a big chunk of words to explaining just how wrong this viewpoint is , so I don’t have to.  You know what, though,  I’ll bet Ezra Klein drinks coffee."], "link": "http://quomodocumque.wordpress.com/2012/10/30/if-you-cant-say-anything-intelligent-about-probability-dont-say-anything-at-all/", "bloglinks": {}, "links": {"http://www.politico.com/blog": 1, "http://feeds.wordpress.com/": 1, "http://www.washingtonpost.com/blog": 1}, "blogtitle": "Quomodocumque"}, {"content": ["I’m working in the math department library today and have gotten distracted by a collection of historical math textbooks that’s just gone on the shelves. \n From  College Mathematics:  A First Course (1940), by W. W. Elliott and E. Roy C. Miles: \n The authors believe that college students who take only one year of mathematics should acquire a knowledge of the essentials of several of the traditional subjects.  From teaching experience, however, they are convinced that a better understanding is gained if these subjects are presented in the traditional order.  Students who take only one year of college mathematics are usually primarily interested in the natural sciences or in business administration. \n The book covers algebra, trigonometry, Cartesian geometry, and calculus.  The definition of the derivative as a limit is given, but the epsilon-delta definition of limit is not.  Startling to think that science majors came to college never having taken algebra or analytic geometry. \n Further back in time we get  Milne’s Progressive Arithmetic , from 1906.  This copy was used by Maggie Rappel, of Reedsville, WI, and is dated January 15th, 1908.  Someone — Maggie or a later owner — wrote in the flyleaf, “Look on page 133.” \n On the top of p .133 is written \n Auh!  Shut up your gab you big lobster, you c? \n You got me, Maggie! \n I can’t tell what grades this book is intended for, but certainly a wide range; it starts with addition of single digits and ends with reduction of fractions to lowest terms.  What’s interesting is that the book doesn’t really fit our stereotype that math instruction in olden times was pure drill with no attention paid to conceptual instruction and explanation.  Here’s a problem from early in the book: \n How many ones are 3 ones and 4 ones?  Write the sum of the ones under the ones.  How many tens are 6 tens and 2 tens?  Write the sum of the tens under the tens.  How do you read 8 tens and 7 ones?  What, then, is the sum of 24 and 63?  Tell what you did to find the sum. \n From the introduction: \n Yet the book is not merely a book of exercises.  Each new concept is carefully presented by questions designed to bring to the understanding of the pupil the ideas he should grasp, and then his knowledge is applied.  The formal statement of principles and definitions is, however, reserved for a later stage of the pupil’s progress. \n Would these sentiments be so out of place in a contemporary “discovery” curriculum?"], "link": "http://quomodocumque.wordpress.com/2012/10/23/historical-textbook-collection/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1}, "blogtitle": "Quomodocumque"}, {"content": ["Debate trivialities:  some people were concerned that Obama pronouncing the name of the second-biggest nuclear power on the subcontinent as “Pah-ki-stahn,” rather than “Pack-i-stan,” sent the wrong message.  Apparently this issue is not a new one  for the President. \n My first reaction is to say “Why not pronounce it Pah-ki-stahn if that’s how the Pah-ki-stanis pronounce it?”  And in some sense the world is moving in that direction.  It used to be customary to say “Eye-rack” and “Eye-ran” — my sense is that standard newcaster usage has shifted from Eye-rainians to Ee-rahnians.  (What does Romney say?  What do self-consciously Middle-American politicians say?) \n But it’s clear that no pure principle of that kind is in effect.  We would roll our eyes at a politician who called Israel “Yisroel” or Germany “Deutschland.” \n Those pronunciations don’t match the English spelling, though.  So maybe the principle is “Among those pronunciations which are licensed by the written name of the place in English, use the one that best approximates the name of the place as natives would say it.”  But on this account, Israel would come out something like “Ees-rah-el”, whereas in real life there’s a staunch bipartisan consensus around the utterly un-Hebrew “Izz-ree-yul.”  And any candidate who followed this theory and said “Frahnce” would be wiped off the electoral map. \n Is the politically savvy protocol simply “pronounce things the way Americans are used to pronouncing them?”  But that doesn’t explain the shift on Iran and Iraq.  And it doesn’t explain why certain sensitive types bristle at hearing “Pah-ki-stahn” but would give a pass to “Chee-lay.”  And surely not even the crankiest political uptightniks still insist on saying “Peking” just to get up the nose of the ChiComs. \n Stop the presses:  a quick Google for “Peking site:nationalreview.com” reveals that there are, indeed, cranky political uptightniks who say “Peking” just to get up the nose of the ChiComs .  I should have known."], "link": "http://quomodocumque.wordpress.com/2012/10/23/the-politics-of-pronunciation/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.nationalreview.com/": 1, "http://www.economist.com/blog": 1}, "blogtitle": "Quomodocumque"}, {"content": ["I was pleased to see that this year’s Joint Mathematics Meetings in San Diego offers subsidized on-site childcare  for participants in the meeting.  But even after the subsidy, it isn’t exactly cheap; at $14/hour, a mathematician who wanted to attend the conference full-time would easily spend over $300 on childcare. \n Can you use your NSF grant to cover this $300?   Nope: \n Can NSF award funds be used for travel and associated dependent-care expenses for dependents of individuals funded on an NSF award? \n NSF award funds may not be used for domestic travel costs or associated dependent-care expenses for individuals traveling on NSF award funds. Travel costs associated with dependents may be allowable for International travel in accordance with Award and Administration Guide Chapter V.B.4, which contains several stipulations, including that travel must be continuous for a period of six months or more. \n What about organizers of NSF-funded conferences?  Can we offer to use NSF money to cover childcare costs for attending mathematicians?   That’s another nope : \n Can conference/workshop awards or travel funds from research awards be used to support child care at conferences and workshops? \n NSF award funds may not be used to pay for travel costs or expenses related to onsite care (e.g., daycare) for dependents of participants at NSF-sponsored conferences and workshops. NSF-sponsored conferences and workshops are encouraged to consider child-care services to ease the burden on attendees, but the costs of such services are the responsibility of those that choose to utilize the accommodations. \n For me to go to a conference requires me to buy a plane ticket and book a hotel room.  NSF wants me to go to conferences, so they allow me to charge these unavoidable expenses to my grant.  If I’m a single parent of a 1-year-old child, going to a conference requires me to have childcare available at the conference location.  No childcare means I don’t go to the conference.  If NSF is willing to pay two hundred bucks a night for my hotel room, why not a hundred bucks a day for childcare?"], "link": "http://quomodocumque.wordpress.com/2012/10/20/the-nsf-should-fund-conference-daycare/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://jointmathematicsmeetings.org/": 1, "http://www.nsf.gov/": 2}, "blogtitle": "Quomodocumque"}, {"content": ["New paper on the arXiv , joint with Tom Church, Benson Farb, and UW grad student Rohit Nagpal.  In our first paper on FI-modules (which I blogged about earlier this year) a crucial tool was the fact that the category of FI-modules over a field of characteristic 0 is  Noetherian ; that is, a submodule of a finitely generated FI-module is again finitely generated.  But we didn’t know how to prove this over a more general ring, which limited the application of some of our results. \n In the new paper, we show that the category of FI-modules is Noetherian over an arbitrary Noetherian ring.  Sample consequence:  if M is a manifold and Conf^n M is the configuration space of ordered n-tuples of distinct points on M, then we show that \n dim_k H_i(Conf^n M, k) \n is a polynomial function of n, for all n greater than some threshold.  In our previous paper, we could prove this only when k had characteristic 0; now it works for mod p cohomology as well.  We also discuss some of the results of Andy Putman’s paper on stable cohomology of congruence subgroups  – it is a bad thing that I somehow haven’t blogged about this awesome paper! — showing how, at the expense of losing stable ranges, you can remove from his results some of the restrictions on the characteristic of the coefficient field. \n Philosophically, this paper makes me happy because it brings me closer to what I wanted to do in the first place — talk about the representation theory of symmetric groups “for general n” without giving names to representations.  In characteristic 0, this desire might seem a bit perverse, given the rich and beautiful story of the bijection between irreducible representations and partitions.  But in characteristic p, the representation theory of S_n is much harder to describe.  So it is pleasing to be able to talk, in a principled way, about what one might call “representation stability” in this context; I think that when V is a finitely generated FI-module over a finite field k it makes sense to say that the representations V_n of k[S_n] are “the same” for n large enough, even though I don’t have as nice a description of the isomorphism classes of such representations."], "link": "http://quomodocumque.wordpress.com/2012/10/09/fi-modules-over-noetherian-rings/", "bloglinks": {}, "links": {"http://arxiv.org/": 2, "http://quomodocumque.wordpress.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "Quomodocumque"}, {"content": ["Remember yesterday, when I was talking about the inglorious end of the Orioles 1997 season, when I reflected that sometimes the best team in the league faces a win-or-go-home playoff game, and they’ve got a legitimate ace on the mound who pitches a brilliant game, and yet … they lose? \n Well, it happened to the Rangers last night.  I’ve never watched Yu Darvish before, but jeez.  A couple of times I was pretty sure I actually heard the baseball utter the word “Psych!” as it jerked away from an Oriole’s helpless swing. \n Anyway:  the Orioles move on to the ALDS against the Yankees.  New York’s “playoff experience” will no doubt be made much of.  Here’s the number of career playoff games, prior to last night, for the O’s postseason lineup: \n Nate McLouth 3 \n J.J. Hardy 7 \n Chris Davis 0 \n Adam Jones 0 \n Matt Wieters 0 \n Jim Thome 67 \n Mark Reynolds 7 \n Ryan Flaherty 0 \n Manny Machado 0 \n They haven’t been there before.  Will it hurt them?  It didn’t keep the Orioles from beating Darvish, and I don’t think it’ll keep them from beating the Yankees, either."], "link": "http://quomodocumque.wordpress.com/2012/10/06/theyve-been-there-before/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1}, "blogtitle": "Quomodocumque"}, {"content": ["I don’t know if it’s much remembered outside Baltimore, but it was a brutal heartbreaker .  Mike Mussina was brilliant, pitching 8 shutout innings and allowing only a single hit; but the Orioles hitters couldn’t come through when it counted, stranding 14 runners over the course of the game.  Tony Fernandez finally won it for the Indians, 1-0, with a homer off Armando Benitez in the 11th, only the third Cleveland hit of the game. \n Jim Thome, tonight’s DH for the Orioles, started in that game too, on the other side.  Since then, Thome’s played in 39 playoff games, while the Orioles have played in none. \n The Rangers are the best team in the American League, playing at home, with a legitimate ace starting the game. \n But so were the Orioles, in 1997, and the Indians beat them. \n Go O’s."], "link": "http://quomodocumque.wordpress.com/2012/10/05/the-last-orioles-postseason-game/", "bloglinks": {}, "links": {"http://www.baseball-reference.com/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "Quomodocumque"}, {"content": ["One good feature of meeting Adam Phillips was that I got to ask him about Grothendieck’s use of the phrase “the capacity to be alone,” generally associated with the psychoanalyst D.W. Winnicott.  Winnicott was Phillips’s analysts’s analyst, and Phillips has written extensively on him, so I thought I’d run the quote by him.  Phillips told me: \n \n Grothendieck’s conception of the capacity to be alone as “a basic capacity in all of us from the day of our birth” is certainly not that of Winnicott, who was talking about a capacity that’s acquired later via the developing relationship between infant and mother. \n Familiarity with psychoanalytic terminology was fairly common in France at the time, and doesn’t necessarily mean Grothendieck was psychoanalyzed or had any particular interest in analytic theory; in particular, the French analyst Francoise Dolto had a radio show in the 1970s which helped popularize Winnicott’s ideas in France."], "link": "http://quomodocumque.wordpress.com/2012/10/02/grothendieck-winnicott-update/", "bloglinks": {}, "links": {"http://quomodocumque.wordpress.com/": 2, "http://psiconet.org/": 1, "http://feeds.wordpress.com/": 1}, "blogtitle": "Quomodocumque"}, {"content": ["Or so I argue in today’s Boston Globe, where I review Silver’s excellent new book.  I considered trying to wedge a “The Signal and The Noise” / “The Colour and the Shape” joke in there too, but it was too labored. \n Concluding graf: \n Prediction is a fundamentally human activity. Just as a novel is no less an expression of human feeling for being composed on a laptop, the forecasts Silver studies — at least the good ones — are expressions of human thought and belief, no matter how many theorems and algorithms forecasters bring to their aid. The math serves as a check on our human biases, and our insight serves as a check on the computer’s bugs and blind spots. In Silver’s world, math can’t replace or supersede us. Quite the contrary: It is math that allows us to become our wiser selves."], "link": "http://quomodocumque.wordpress.com/2012/09/30/nate-silver-is-the-kurt-cobain-of-statistics/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://bostonglobe.com/": 1}, "blogtitle": "Quomodocumque"}, {"content": ["I have often been told I needed to sit down and have a conversation with a psychoanalyst, and now I’m doing it — in public!   Adam Phillips and I will be at Hillel Friday morning to talk about the challenges of writing about technical material for a general audience.  Feel free to suggest questions for Phillips in the comments."], "link": "http://quomodocumque.wordpress.com/2012/09/25/me-and-adam-phillips-friday-29-sep-1130am/", "bloglinks": {}, "links": {"http://wisconsinsciencefest.org/": 1, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Quomodocumque"}]