[{"blogurl": "http://www.r-tutor.com\n", "blogroll": [], "title": "R Tutorial"}, {"content": ["In our previous statistics tutorials, we have treated population parameters as fixed\nvalues, and provided point estimates and confidence intervals for them. An\nalternative approach is the Bayesian statistics. It treats population parameters as\nrandom variables. Probability becomes a measure of our belief in possible outcomes.\nWith new tools like OpenBUGS, tackling new problems requires building new\nmodels, instead of creating yet another R command.\n\n \n read more"], "link": "http://www.r-tutor.com/bayesian-statistics/openbugs", "bloglinks": {}, "links": {"http://www.r-tutor.com/": 2}, "blogtitle": "R Tutorial"}, {"content": ["A variation of the standard definition of Kendall correlation coefficient is necessary in\norder to deal with data samples with tied ranks. It known as the Kendall’s tau-b \n coefficient and is more effective in determining whether two non-parametric data samples with ties are correlated.\n \n read more"], "link": "http://www.r-tutor.com/gpu-computing/correlation/kendall-tau-b", "bloglinks": {}, "links": {"http://www.r-tutor.com/": 3}, "blogtitle": "R Tutorial"}, {"content": ["In our last tutorial on SVM training with GPU, we mentioned a necessary step to\npre-scale the data with rpusvm-scale , and to reverse scaling the prediction outcome.\nThis cumbersome procedure is now simplified with the latest RPUSVM .\n read more"], "link": "http://www.r-tutor.com/gpu-computing/svm/rpusvm-2", "bloglinks": {}, "links": {"http://www.r-tutor.com/": 4}, "blogtitle": "R Tutorial"}, {"content": ["Most elementary statistical inference algorithms assume that the data can be modeled by linear parameters with a normally distributed error component. A new class of algorithms called support vector machine (SVM) remove such constraint.\n \n read more"], "link": "http://www.r-tutor.com/gpu-computing/svm/rpusvm-1", "bloglinks": {}, "links": {"http://www.r-tutor.com/": 2}, "blogtitle": "R Tutorial"}, {"content": ["With the distance matrix found in previous tutorial, we can use various techniques of\n cluster analysis for relationship discovery. For example, in the data set mtcars , we\ncan run the distance matrix with hclust , and plot a dendrogram that displays a\nhierarchical relationship among the vehicles. \n \n read more"], "link": "http://www.r-tutor.com/gpu-computing/clustering/hierarchical-cluster-analysis", "bloglinks": {}, "links": {"http://www.r-tutor.com/": 4}, "blogtitle": "R Tutorial"}, {"content": ["In hypothesis testing, a type II error is due to a failure of rejecting\nan invalid null hypothesis. The probability of avoiding a type II error is\ncalled the power of the hypothesis test, and is denoted by the quantity\n 1 - β &#x00A0; .\n \n read more"], "link": "http://www.r-tutor.com/elementary-statistics/type-2-errors", "bloglinks": {}, "links": {"http://www.r-tutor.com/": 2}, "blogtitle": "R Tutorial"}, {"content": ["In an experiment study, various treatments are applied to test subjects and the\nresponse data is gathered for analysis. A critical tool for carrying out the analysis is\nthe Analysis of Variance (ANOVA). It enables a researcher to differentiate\ntreatment results based on easily computed statistical quantities from the treatment\noutcome.\n \n read more"], "link": "http://www.r-tutor.com/elementary-statistics/analysis-variance", "bloglinks": {}, "links": {"http://www.r-tutor.com/": 2}, "blogtitle": "R Tutorial"}]