[{"blogurl": "http://regularize.wordpress.com\n", "blogroll": [], "title": "regularize"}, {"content": ["I case anybody wondered: I did not make it to produce a single post from Oberwolfach last week. For me it was an unusual dense week. Not only that there were many interesting talks on a tight schedule. The “talk-free” parts of the days I had a lot of interesting and stimulating discussions and the [...]"], "link": "http://regularize.wordpress.com/2012/10/27/no-post-from-oberwolfach/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["Guess where this is: Well, I spoiled the solution in the title anyway (and of course, some of you recognized the sculpture in the last picture): I am in Oberwolfach this week at the workshop “Computational Inverse Problems”. Maybe I’ll find some time to blog about some talks but I am not sure if I [...]"], "link": "http://regularize.wordpress.com/2012/10/22/indian-summer-at-oberwolfach/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["In a previous post I wrote about my experience with three job interviews for math professorships in Germany I had earlier this year. In this post I’ll tell the next part of the story. As the previous post on this topic, this post is a mixture of a description of my own experience and the [...]"], "link": "http://regularize.wordpress.com/2012/10/02/what-happens-when-you-get-a-ruf-i-e-a-job-offer/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["I am migrating to a new laptop and, as usual, this is a bit more work than I expected… One issue I could not resolve to my satisfaction was the migration of my RSS-archives in Akregator (especially since I plan to switch to a different feed reader). Hence, I just collect in this post the [...]"], "link": "http://regularize.wordpress.com/2012/09/26/leftovers-in-my-rss-reader/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["Let be a compact subset of and consider the space of continuous functions with the usual supremum norm. The Riesz Representation Theorem states that the dual space of is in this case the set of all Radon measures, denoted by and the canonical duality pairing is given by We can equip with the usual notion [...]"], "link": "http://regularize.wordpress.com/2012/09/20/the-simplex-of-probabilty-measures-and-semi-continuous-compressed-sensing/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["In my previous post “Yes we can change. Why the DMV should change its name” I tried to make some advertisement for the petition that the “Deutsche Mathematiker-Vereinigung” should change its name to “Deutsche Mathematische Vereinigung”. Yesterday I received the new issue of the Mitteilungen der DMV and there is the result: Votes cast: 1007 [...]"], "link": "http://regularize.wordpress.com/2012/09/17/no-we-couldnt-why-the-dmv-did-not-change-its-name/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["It’s out! Our department has a vacant position for optimization to fill! In particular we are looking for somebody working in continuous (nonlinear) optimization. Well, I know there have been a number of open positions with a similar scope recently, but I also know there are plenty of excellent people working in this field. In [...]"], "link": "http://regularize.wordpress.com/2012/08/30/open-position-in-optimization-at-my-math-department/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["ISMP is over now and I’m already home. I do not have many things to report on from the last day. This is not due the lower quality of the talks but due to the fact that I was a little bit exhausted, as usual at the end of a five-day conference. However, I collect [...]"], "link": "http://regularize.wordpress.com/2012/08/25/ismp-over-non-convex-and-non-smooth-minimization-l1-and-lp/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["Today there are several things I could blog on. The first is the planary by Rich Baraniuk on Compressed Sensing. However, I don’t think that I could reflect the content in a way which would be helpful for a potential reader. Just for the record: If you have the chance to visit one of Rich’s [...]"], "link": "http://regularize.wordpress.com/2012/08/23/ismp-inverse-problems-with-uniform-and-tv-does-not-preserve-edges/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["Today I report on two things I came across here at ISMP: The first is a talk by Russell Luke on Constraint qualifications for nonconvex feasibility problems. Luke treated the NP-hard problem of sparsest solutions of linear systems. In fact he did not tackle this problem but the problem to find an -sparse solution of [...]"], "link": "http://regularize.wordpress.com/2012/08/22/ismp-alternatingly-projecting-of-non-convex-sets-and-demixing-by-convex-optimization/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["The second day of ISMP started (for me) with the session I organized and chaired. The first talk was by Michael Goldman on Continuous Primal-Dual Methods in Image Processing. He considered the continuous Arrow-Hurwitz method for saddle point problems with convex in the first and concave in the second variable. The continuous Arrow-Hurwitz method consists [...]"], "link": "http://regularize.wordpress.com/2012/08/21/ismp-second-day/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["The scientific program at ISMP started today and I planned to write a small personal summary of each day. However, it is a very intense meeting. Lot’s of excellent talks, lot’s of people to meet and little spare time. So I’m afraid that I have to deviate from my plan a little bit. Instead of [...]"], "link": "http://regularize.wordpress.com/2012/08/20/ismp-first-day/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["Today I arrived at ISMP in Berlin. This seems to be the largest conference on optimization and is hosted by the Mathematical Optimization Society. (As a side note: The society recently changed its name from MPS (Mathematical Programming Society) to MOS. Probably the conference will be called ISMO in a few years…). The reception today [...]"], "link": "http://regularize.wordpress.com/2012/08/20/ismp-in-berlin-reception/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["In this post I just collect a few papers that caught my attention in the last moth. I begin with Estimating Unknown Sparsity in Compressed Sensing by Miles E. Lopes. The abstract reads Within the framework of compressed sensing, many theoretical guarantees for signal reconstruction require that the number of linear measurements exceed the sparsity [...]"], "link": "http://regularize.wordpress.com/2012/07/26/estimating-unknown-sparsity-sparse-signal-processing-and-proximal-newton-type-methods/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["This is the last part of the lecture notes for the course in integral transforms. 1. Fourierreihen und das Abtasttheorem Neben der Fourier-Transformation auf , , und sind auch analoge Transformationen für Funktionen auf Rechtecken interessant. Dies führt auf die sogenannten Fourierreihen. Mit ihrer Hilfe werden wir das Abtasttheorem beweisen 1.1. Fourierreihen in Wir betrachten [...]"], "link": "http://regularize.wordpress.com/2012/07/20/integraltransformationen-fourier-reihen-und-das-abtasttheorem/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["If you are looking for a good reason to prefer the Lebesgue integral over the Riemann integral and remember something like “Lebesgue goes better with limits” but could not memorize a specific example, then you should have a look on this stunning sequence of functions (which I found in Brenner and Scotts “Mathematical Theory of [...]"], "link": "http://regularize.wordpress.com/2012/07/06/why-lebesgue-is-better-with-limits-than-riemann/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["This is the second to last set of notes of my lecture on integral transforms. 1. Die Fourier-Transformation Die Laplace-Transformation ist “einseitig” in dem Sinne, dass sie für Funktionen auf der Halbachse definiert ist. Analog zur -Transformation ließe sich auch eine zweiseitige Transformation definieren: Für sei Für die einseitige Transformation haben wir im vorherigen Abschnitt [...]"], "link": "http://regularize.wordpress.com/2012/07/05/integraltransformationen-die-fourier-transformation/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["Today I found the new issue of the “Mitteilungen der DMV” in my mailbox. Here, DMV does not stand for Department of Motor Vehicles but for Deutsche Mathematiker-Vereinigung which is somehow the German counterpart of the AMS. The Mitteilungen were accompanied by paper ballot with which all members of the DMV can vote for or [...]"], "link": "http://regularize.wordpress.com/2012/06/26/yes-we-can-change-why-the-dmv-should-change-its-name/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["Today is the 100th birthday of a famous mathematician. Part of his fame comes from his work on mathematical biology, namely his ideas about patter formation in biological systems (such as the stripes of a zebra). One interesting result he obtained was that such patterns can be formed by diffusion processes which are usually known [...]"], "link": "http://regularize.wordpress.com/2012/06/23/happy-100th-birthday-to-a-famous-mathematician/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}, {"content": ["Have you heard of Boris’s Law of Blogging? No? I also tried to stick to it from the beginning (although I do not know this guy named Boris) because wordpress does recommend a similar thing when you start a blog. Well, I did not always succeed to stick to it and now it’s almost three [...]"], "link": "http://regularize.wordpress.com/2012/06/18/advice-collected-by-a-young-mathematician/", "bloglinks": {}, "links": {}, "blogtitle": "regularize"}]