[{"blogurl": "http://web.ece.rice.edu/richb\n", "blogroll": [], "title": "Richard Baraniuk"}, {"content": ["Rice University announced the creation of the  Rice Center for Digital Learning and Scholarship (RDLS) to bring an array of online education initiatives under one banner.  RDLS will comprise: \n \n STEMScopes – K-12 science curriculum \n Connexions – open-access textbook publishing platform \n OpenStax College – free college textbooks \n OpenStax Tutor – learning analytics and personalized learning \n \n To learn more, see the press release and center website ."], "link": "http://web.ece.rice.edu/richb/2012/08/26/rice-founds-e-learning-center/", "bloglinks": {}, "links": {"http://web.rice.edu/": 2, "http://stemscopes.com": 1, "http://news.rice.edu/": 1, "http://openstaxcollege.org": 1, "http://rdls.rice.edu": 2, "http://cnx.org": 1, "http://dsp.rice.edu/": 1}, "blogtitle": "Richard Baraniuk"}, {"content": ["Great progress with the first free textbooks from  OpenStax College .  We expect to save students at least $1 million this fall after 13,000 of our physics and sociology textbooks were ordered or downloaded in their first 10 weeks on the market. \n Our first two titles will save students more money in one semester than they cost to develop.  Indeed, we’re well on our way to our five-year goal of saving 1 million college students $95 million. \n Media coverage so far: \n \n “ Free Textbooks Shaking Up Higher Education ” \nTIME Business \n “ Rice U. Hopes Mix of Grants and “Add-Ons” Will Support Free Textbooks ” \nThe Chronicle of Higher Education \n Rice U. Press Release"], "link": "http://web.ece.rice.edu/richb/2012/08/17/openstax-college%e2%80%99s-free-textbooks-will-save-students-1m-this-fall/", "bloglinks": {}, "links": {"http://web.rice.edu/": 1, "http://business.time.com/": 1, "http://news.rice.edu/": 1, "http://openstaxcollege.org": 1, "http://chronicle.com/blog": 1}, "blogtitle": "Richard Baraniuk"}, {"content": ["Open Education: One Perfect Storm Yields Three Revolutions \n Telefonica Visión Movistar , July 2012 \nRichard Baraniuk \n In this article, we study how a “perfect storm” is powering three revolutions that promise to reinvent the way educators produce and disseminate educational materials and fundamentally change the relationship students have with content.  While the timescale of education transformation has until now been measured in decades, even centuries, OE has the potential to fundamentally change the way authors, instructors, and students interact worldwide virtually overnight. \n A pdf version is available here ."], "link": "http://web.ece.rice.edu/richb/2012/07/13/movie-star/", "bloglinks": {}, "links": {"http://web.rice.edu/": 1, "http://miw3.com/": 1}, "blogtitle": "Richard Baraniuk"}, {"content": ["OpenStax College is pleased to announce the first editions of College Phy sics and Introduction to Sociology . \n Both of these completely free textbooks are available now for download and use on computers, mobile devices, and e-book readers.  No registration or password required, and access never expires.  Print editions will be available shortly. \n We have been overwhelmed by the positive responses to samples of these books.  Now you can check them out in their entirety.  As always, comments are welcome. \n Openstax College – Crossing the OER chasm one textbook at a time."], "link": "http://web.ece.rice.edu/richb/2012/06/30/first-2-openstax-college-books-published/", "bloglinks": {}, "links": {"http://web.rice.edu/": 1, "http://openstaxcollege.org": 1, "http://openstaxcollege.org/": 4}, "blogtitle": "Richard Baraniuk"}, {"content": ["A. C. Sankaranarayanan, C. Studer, and R. G. Baraniuk, “ CS-MUVI: Video Compressive Sensing for Spatial-Multiplexing Cameras “, IEEE International Conference on Computational Photography, Seattle, WA, April, 2012. \n Abstract:  Compressive sensing (CS)-based spatial-multiplexing cameras (SMCs) sample a scene through a series of coded projections using a spatial light modulator and a few optical sensor elements. SMC architectures are particularly useful when imaging at wavelengths for which full-frame sensors are too cumbersome or expensive. While existing recovery algorithms for SMCs perform well for static images, they typically fail for time-varying scenes (videos). In this paper, we propose a novel CS multi-scale video (CS-MUVI) sensing and recovery framework for SMCs. Our framework features a co-designed video CS sensing matrix and recovery algorithm that provide an efficiently computable low-resolution video preview. We estimate the scene’s optical flow from the video preview and feed it into a convex-optimization algorithm to recover the high-resolution video. We demonstrate the performance and capabilities of the CS-MUVI framework for different scenes. \n The CS-MUVI concept:  The key challenge with sensing videos with cameras such as the single pixel camera (SPC) is that the scene changes with every compressive measurement obtained. Traditional L1-recovery methods fail in the presence of rapid motion. We circumvent this problem by designing special measurement matrices that enable a two-step recovery process; the first step is to estimate motion in the scene and the second step is to recover the scene in full spatial and temporal resolution. \n CS-MUVI project page \n CS-MUVI demo video"], "link": "http://web.ece.rice.edu/richb/2012/04/08/video-compressive-sensing-via-cs-muvi/", "bloglinks": {}, "links": {"http://web.rice.edu/": 1, "http://dsp.rice.edu/": 2, "http://www.youtube.com/": 1}, "blogtitle": "Richard Baraniuk"}, {"content": ["Welcome to Open Educational Resources (OER) Week!  The Connexions and OpenStax College teams will be speaking several times this week about our recent progress on free, open-source textbooks. \n \n OpenStax College \n Connexions"], "link": "http://web.ece.rice.edu/richb/2012/03/05/oer-week-5-10-march-2012/", "bloglinks": {}, "links": {"http://web.rice.edu/": 1, "http://openstaxcollege.org": 1, "http://cnx.org": 1}, "blogtitle": "Richard Baraniuk"}, {"content": ["C. Hegde and R. G. Baraniuk, “ Signal Recovery on Incoherent Manifolds ,” preprint, February 2012. \n Abstract:  Suppose that we observe noisy linear measurements of an unknown signal that can be modeled as the sum of two component signals, each of which arises from a nonlinear sub-manifold of a high-dimensional ambient space. We introduce Successive Projections onto INcoherent manifolds (SPIN), a first-order projected gradient method to recover the signal components. Despite the nonconvex nature of the recovery problem and the possibility of underdetermined measurements, SPIN provably recovers the signal components, provided that the signal manifolds are incoherent and that the measurement operator satisfies a certain restricted isometry property. SPIN significantly extends the scope of current recovery models and algorithms for low-dimensional linear inverse problems and matches (or exceeds) the current state-of-the-art in terms of performance. \n  \n The above example illustrates SPIN recovery of two manifold-modeled components from compressive measurements of a noisy N =64×64 image.  The clean image consists of the linear superposition of a disk and square of fixed sizes but unknown locations. Additive Gaussian noise (SNR = 14dB) has been added to the image prior to taking M =50 compressive measurement ( M/N = 1.2%).  (a) Original noisy image.  (b) Reconstructed disk.  (c) Reconstructed square.  The extension to more than two manifolds is straightforward. \n A simple SPIN software toolbox is available."], "link": "http://web.ece.rice.edu/richb/2012/02/26/multi-manifold-signal-recovery/", "bloglinks": {}, "links": {"http://web.rice.edu/": 1, "http://dsp.rice.edu/": 2}, "blogtitle": "Richard Baraniuk"}, {"content": ["The Fourth-Annual Connexions Conference was held 14-18 February 2012 at Rice University.  A great time was had by all!  Attendance roughly doubled from last year, to 155 on-site and 60 webcast attendees.  Additionally, 56 hardy souls toiled 16-18 February on a range of technical and content sprints. \n  \n Highlights included: \n \n Launch of OpenStax College \n Partnership announcements with Sapling Learning, WebAssign, Consolidated Graphics, and others \n Siyavula ‘s amazing progress (South Africa is printing 2.5 million high school science and math textbooks – one for every student in the country) \n A technical sprint that helped define a componentized architecture for Connexions that will greatly increase its reach and scalability \n A content sprint that input an entire Siyavula Life Sciences textbook into Connexions in two days! \n \n These are exciting times for open education in general and Connexions in particular.  With this kind of momentum, we are planning to hold the Fifth Annual Conference on our moon base (under construction)."], "link": "http://web.ece.rice.edu/richb/2012/02/21/connexions-conference-2012/", "bloglinks": {}, "links": {"http://web.rice.edu/": 3, "http://conference.cnx.org": 1, "http://openstaxcollege.org": 1, "http://cnx.org/": 1, "http://siyavula.org": 1}, "blogtitle": "Richard Baraniuk"}, {"content": ["OpenStax College is a nonprofit organization committed to improving student access to quality learning materials.  Today we announce the first 5 of a library of 20+ free, open-source textbooks for the highest-impact college courses: College Physics, Introduction to Sociology, Anatomy and Physiology, Biology, and Concepts in Biology .   College Physics and Introduction to Sociology will be available in early Spring 2012 for adoption in Fall 2012; the other three books will follow in Fall 2012. \n OpenStax College free textbooks are developed and peer-reviewed by educators to ensure they are readable, accurate, and meet the scope and sequence requirements for college courses.  Through our partnerships with companies and foundations committed to reducing costs for students, OpenStax College is working to improve access to higher education for all.  OpenStax College is an initiative of Rice University and is made possible through the generous support of the Hewlett, Gates, 20 Million Minds, and Maxfield Foundations. \n For more information, see the OpenStax College website and press release . \n OpenStax College is proudly powered by Connexions ."], "link": "http://web.ece.rice.edu/richb/2012/02/07/openstax-college-is-launched/", "bloglinks": {}, "links": {"http://web.rice.edu/": 1, "http://openstaxcollege.org": 1, "http://cnx.org": 1, "http://www.rice.edu/": 1}, "blogtitle": "Richard Baraniuk"}, {"content": ["The Fourth Annual Connexions Conference will be held on 15 February 2012 at Rice University.  Each year the Connexions Conference brings together more than 100 education thought leaders from around the world.  This year’s conference promises to be especially exciting, as we launch large scale initiatives on open textbooks and open education technology. \n Please visit conference.cnx.org to register + find out more about the conference and software and content sprints on 16, 17 February 2012.  (Register before 17 January 2012 and take advantage of the early bird discount.)"], "link": "http://web.ece.rice.edu/richb/2012/01/11/connexions-conference-15-february-2012/", "bloglinks": {}, "links": {"http://web.rice.edu/": 1, "http://conference.cnx.org": 1}, "blogtitle": "Richard Baraniuk"}]