[{"blogurl": "http://rna-seqblog.com\n", "blogroll": [], "title": "RNA-Seq Blog"}, {"content": ["Next generation sequencing technology provides a powerful tool for measuring gene expression (mRNA) levels in the form of RNA-sequence data. Method development for identifying differentially expressed (DE) genes from RNA-Seq data, which frequently includes many low-count integers and can exhibit severe overdispersion relative to Poisson or binomial distributions, is a popular area of ongoing research. \n Here, researchers at National Institute of Standards and Technology present quasi-likelihood methods with shrunken dispersion estimates based on an adaptation of Smyth’s (2004) approach to estimating gene-specific error variances for microarray data. The suggested methods are computationally simple, analogous to ANOVA and compare favorably versus competing methods in detecting DE genes and estimating false discovery rates across a variety of simulations based on real data. \n \n An R package called QuasiSeq, used to implement the suggested methods of this article is available from the CRAN website: http://cran.r-project.org/web/packages/QuasiSeq/index.html \n \n Lund SP, Nettleton D, McCarthy DJ, Smyth GK. (2012) Detecting Differential Expression in RNA-sequence Data Using Quasi-likelihood with Shrunken Dispersion Estimates. Stat Appl Genet Mol Biol. 11(5). [ article ] \n \n Detecting DE in RNA-Seq Data Using Quasi-likelihood with Shrunken Dispersion Estimates is a post from: RNA-Seq Blog \n Incoming search terms: www rna-seqblog com detecting-de-in-rna-seq-data-using-quasi-likelihood-with-shrunken-dispersion-estimates"], "link": "http://www.rna-seqblog.com/data-analysis/expression-tools/detecting-de-in-rna-seq-data-using-quasi-likelihood-with-shrunken-dispersion-estimates/", "bloglinks": {}, "links": {"http://www.degruyter.com/": 1, "http://www.rna-seqblog.com/": 1, "http://www.rna-seqblog.com": 1, "http://cran.r-project.org/": 1}, "blogtitle": "RNA-Seq Blog"}, {"content": ["Lung cancer is the most common cause of cancer-related death in both men and women throughout the world. Cigarette smoke contains over 60 known carcinogens (Hech, 2003) and tobacco smoke is the main contributor to lung cancer (Biesalski et al., 1998) . Therefore, the tissues of those smokers with and without lung cancer provide great resources to study their gene expression changes and find out those lung cancer related genes to help corresponding treatment. \n To better understand the gene expression differences between smokers with and without lung cancer, researchers at the Third Medical Military University, China analyzed two related datasets from short read archive (Beane, 2011). \n They quantified the expression of human genes in these two samples of smokers with and without lung cancer. Differential expression analysis revealed a number of differentially expressed genes. The results show some interesting phenomenon of the gene expression profiles between smokers with and without lung cancer, and highlight that RNA-Seq technologies are powerful tools to study the characteristics of human transcriptome. \n \n Cheng P, Cheng Y, Li Y, Zhao Z, Gao H, Li D, Li H, Zhang T. (2012) Comparison of the Gene Expression Profiles Between Smokers With and Without Lung Cancer Using RNA-Seq . Asian Pac J Cancer Prev 13(8), 3605-9. [ article ] \n \n Comparison of the Gene Expression Profiles Between Smokers With and Without Lung Cancer Using RNA-Seq is a post from: RNA-Seq Blog"], "link": "http://www.rna-seqblog.com/publications/comparison-of-the-gene-expression-profiles-between-smokers-with-and-without-lung-cancer-using-rna-seq/", "bloglinks": {}, "links": {"http://www.apocpcontrol.org/": 1, "http://www.rna-seqblog.com": 1, "http://www.rna-seqblog.com/": 1}, "blogtitle": "RNA-Seq Blog"}, {"content": ["By Monica Heger from GenomeWeb News \n Pacific Biosciences booked four new systems in the third quarter of 2012, an increase from just one in the previous quarter, but down from six in the year-ago quarter. The Q3 orders bring its backlog to five systems. \n Additionally, the company is planning to launch new chemistry in the fourth quarter that it says will increase average read lengths to 5,000 bases with five percent of reads above 13,000 bases. PacBio’s current C2 chemistry yields average reads of 3,000 bases with five percent above 8,000 bases. \n “Long reads are especially valuable for de novo assembly applications and targeted sequencing of large repeat regions and regions with complex structural variation,” CEO Mike Hunkapiller said during a conference call discussing the company’s 2012 third-quarter earnings. \n Nevertheless, the company faced steep revenue declines this quarter — down 73 percent to $2.8 million from $10.5 million in the year-ago quarter and missing analysts average estimates of $3.1 million. \n The company did not recognize any revenue from sales of its PacBio RS sequencer during the quarter. It booked just one system in the previous quarter, which was still in the process of being installed in the third quarter, Hunkapiller said. \n He added that this was to be expected, as the company was not focused on booking instruments in the first half of the year, but that bookings should pick up in the second half of 2012. \n “We made progress on this goal in the third quarter with bookings for four new systems,” Hunkapiller said, which the company attributes to “the progress we’ve made in reliability and performance and focusing on making our customers successful.” \n The company expects to recognize instrument revenue in the next quarter, as it installs some of the five systems currently in its backlog, Ben Gong, vice president of finance and treasurer, said during the call. \n Product Enhancements \n As the company said in previous earnings calls this year, it focused on the first half of the year on making improvements to the PacBio RS system. \n Hunkapiller said he is “pleased” with the progress the company has made on this front, noting that “system reliability has come a long way” since the beginning of the year. Customers now have the C2 chemistry upgrade, which has significantly improved “system uptime,” he said. \n Additionally, two products launched in recent months — the MagBead sample-loading station, which increases the number of long reads and lowers input requirements; and new software to detect base modifications — have made a big impact on instrument utilization, he added. \n Going forward, the company expects base modification analysis to be a key application of the PacBio RS. \n Last quarter, the company said it had developed new chemistry that it was testing in house ( IS 7/31/2012), and this week, Hunkapiller said that the new chemistry would be launched in the fourth quarter of this year. \n The chemistry increases average read lengths from 3,000 to 5,000 bases with the longest reads over 13,000 bases. \n The increase in read lengths and subsequent increases in throughput will enable new applications, Hunkapiller added. For example, he said the company has already received positive feedback from an early-access customer that is using the chemistry to sequence the rice genome, which is “replete with repetitive elements and duplications.” \n Happy Customers \n Another of the company’s goals for 2012 was to focus on its existing customer base, betting that happy customers would drive adoption of the system ( IS 5/8/2012 ). \n The company recently held a user meeting that drew 78 attendees from 25 different customer sites, Hunkapiller said, citing two customer presentations that highlight the RS system’s capabilities. \n In one project, researchers from the Center for Genomics Sciences at the Allegheny-Singer Research Institute sequenced and assembled bacterial strains from both human and plant pathogens, using only PacBio sequencing and the Celera assembler, Hunkapiller said. \n As part of a project for the US Department of Agriculture, the group sequenced and assembled 20 strains of a plant pathogen that causes diseases in more than 100 plant species, using four SMRT cells per genome. Additionally, the group just received funding from the National Institutes of Health for a project to sequence around 1,700 influenza strains in order to understand pathogen evolution. For this, the team will use three SMRT cells per genome. \n A second group, at the Human Genome Sequencing Center at Baylor College of Medicine, has been using the RS to improve assembly of primate genomes, Hunkapiller said. The Baylor group is studying the genome of the sooty mangabey monkey, which is naturally resistant to AIDS, and comparing it to the macaque genome, which is extremely susceptible to the disease, in order to identify the genetic pathways associated with resistance and susceptibility. \n While a draft genome for the sooty mangabey exists, Hunkapiller said that the genome, which had been sequenced to 100-fold coverage using Illumina technology, contained 186,000 gaps and had an N50 contig size of 35,000 bases. \n Sequencing on the PacBio reduced the gaps by 65 percent and tripled the length of the contigs, he said. The Baylor team plans to publish the software that it used for the assembly in PLoS One , he added. \n Financials \n Product revenue was $1.3 million, down from $9.8 million in the year-ago quarter, while service and other revenue increased to $1.3 million from $535,000 in the comparable period of 2011. \n Net loss narrowed to $22.7 million from $29.2 million in the third quarter of 2011. \n R&D costs fell 37 percent to $12.6 million from $20 million, while SG&A spending declined 21 percent to $10.1 million from $12.8 million. \nLooking ahead, Gong said that he expects fourth-quarter revenues to “increase sequentially,” with expenses remaining stable. Additionally, he said the company is targeting less than $20 million of cash use per quarter, so it should finish the year with around $100 million in cash, not including any additional capital the company may raise. \nAs of Sept. 30, 2012, cash and investments totaled $119.4 million. \n ( read more… ) \n ( Read the PacBio press release ) \n PacBio Books Four Systems in Q3 – Plans Q4 Chemistry Upgrade to Enable Longer Average Read Length is a post from: RNA-Seq Blog \n Incoming search terms: www rna-seqblog com pacbio-books-four-systems-in-q3-plans-q4-chemistry-upgrade-to-enable-longer-average-read-length"], "link": "http://www.rna-seqblog.com/news/pacbio-books-four-systems-in-q3-plans-q4-chemistry-upgrade-to-enable-longer-average-read-length/", "bloglinks": {}, "links": {"http://www.rna-seqblog.com/": 1, "http://www.genomeweb.com/": 3, "http://www.rna-seqblog.com": 1, "http://investor.pacificbiosciences.com/": 1}, "blogtitle": "RNA-Seq Blog"}, {"content": ["Bioinformatician to join new Biomedical Sequencing Facility – Vienna, Austria \n from naturejobs.com \n We are looking for an experienced bioinformatician to join the new Biomedical Sequencing Facility at the CeMM Research Center for Molecular Medicine of the Austrian Academy of Sciences and the Medical University of Vienna. A strong background in software engineering and extensive programming experience are mandatory. \n The Institute [ http://www.cemm.at/ ] \nThe CeMM Research Center for Molecular Medicine is an international and interdisciplinary research institute of the Austrian Academy of Sciences. Driven by medical needs, CeMM integrates basic research and clinical expertise to pursue innovative diagnostic and therapeutic approaches focused on cancer, inflammation and immune disorders. CeMM is located in a new tailor-made building at the center of the Vienna Medical University campus, within walking distance of Vienna’s historical city center. According to a study by “The Scientist”, CeMM is among the top-5 best places to work in academia world-wide, see: http://the-scientist.com/2012/08/01/best-places-to-work-academia-2012 . Vienna is frequently ranked the world’s best city to live. It is a United Nations city with a large English-speaking community. The official language at CeMM is English, as more than 30 different nationalities are represented. \n The Biomedical Sequencing Facility \nThe CeMM and the Medical University of Vienna (MUV) recently joined forces and launched the Biomedical Sequencing Facility (BSF), which is coordinated by CeMM Principal Investigator and MUV Guest Professor Dr. Christoph Bock. The goals of the BSF are to foster biomedical research and to catalyze the advent of genomic medicine in Vienna and Austria. The BSF is currently equipped with two Illumina HiSeq 2000 sequencers; and further machine purchases are planned for 2012/2013. It is supported by a powerful scientific computing cluster, which is upgraded annually to keep pace with strongly increasing amounts of biomedical data. Furthermore, project-based access to the Vienna Scientific Cluster (a TOP500 supercomputer) provides ample resources for large-scale integrative analyses and bioinformatic methods development. The BSF supports various experimental protocols for biomedical research, including genome and exome sequencing, epigenome mapping, and transcriptome profiling. Furthermore, the BSF collaborates with clinical labs at the MUV toward establishing genome sequencing as part of routine clinical diagnostics. \n Associated Labs at CeMM \n• The Medical Epigenomics lab is headed by Dr. Christoph Bock and studies the contribution of epigenetic defects to cancer, utilizing both experimental and computational methods ( http://medical-epigenomics.org/ and http://www.cemm.oeaw.ac.at/?id=235 ). \n• The Pediatric Immunogenomics lab is headed by Dr. Kaan Boztug, focusing on the work on the genetics and genomics of primary immundeficiencies, congenital bone marrow failure syndromes and malignant disorders of childhood ( http://www.cemm.oeaw.ac.at/index.php?id=186 ). \n• The Cancer Genomics lab is headed by Dr. Robert Kralovics, investigating the genomic basis of chronic and acute hematological malignancies ( http://www.cemm.oeaw.ac.at/index.php?id=33 ). \n• In addition to these three labs (which are physically co-located with the BSF), the facility maintains a broad network of collaborators across Vienna’s medical campus as well as nationally and internationally. \n The Candidate \nWe are looking for highly motivated and academically outstanding candidates with a strong background in the computational sciences and familiarity with high-throughput technologies in biology and medicine. The ideal candidate for the position of bioinformatician has received an excellent academic training in bioinformatics (both PhD-level and Master-level applications will be considered, and salary/responsibilities will be matched to the experience level of the candidate) and is looking for a longer term job perspective that includes software development and maintenance of high-throughput pipelines, data analysis services and collaborative research projects. For those candidates who would like to use this position as a stepping stone toward obtaining a faculty position at an internationally competitive university or research institute, we will provide the freedom to pursue and publish methodological and/or biomedical research of the highest quality. \n Please submit cover letter, curriculum vitae, academic transcripts and contact details of three referees to \n application@cemm.at . Please indicate the reference code in the subject line: Bioinformatician BSF. \n Deadline for applications : 31 October 2012. \n For more information please visit the CeMM website: www.cemm.at \nPDF of the Announcement: http://tinyurl.com/8wanw3t \n Check out all the recently posted RNA-Seq jobs at: http://www.rna-seqblog.com/jobs/ \n Featured RNA-Seq Job is a post from: RNA-Seq Blog \n Incoming search terms: targeted rna sequencing myseq helicos biosciences rna"], "link": "http://www.rna-seqblog.com/jobs-2/featured-rna-seq-job/", "bloglinks": {}, "links": {"http://www.ac.at/": 3, "http://www.cemm.at/": 1, "http://the-scientist.com/": 1, "http://www.rna-seqblog.com/": 2, "http://tinyurl.com/": 1, "http://www.rna-seqblog.com": 1, "http://medical-epigenomics.org/": 1, "http://www.cemm.at": 1}, "blogtitle": "RNA-Seq Blog"}, {"content": ["Spliced Transcripts Alignment to a Reference (STAR) \n Accurate alignment of high-throughput RNA-Seq data is a challenging and yet unsolved problem because of the non-contiguous transcript structure, relatively short read lengths and constantly increasing throughput of the sequencing technologies. Currently available RNA-Seq aligners suffer from high mapping error rates, low mapping speed, read length limitation and mapping biases. \n Now, researchers at Cold Spring Harbor Laboratory, NY have developed the Spliced Transcripts Alignment to a Reference (STAR) software based on a previously un-described RNA-Seq alignment algorithm which utilizes sequential maximum mappable seed search in uncompressed suffix arrays followed by seed clustering and stitching procedure. \n They have used STAR to align their large (exceeding 80 billon reads) ENCODE Transcriptome RNA-Seq dataset. \n STAR outperforms other aligners by more than a factor of 50 in mapping speed, aligning to the human genome 550 Million 2x76bp paired-end reads per hour on a modest 12-core server, while at the same time improving alignment sensitivity and precision. In addition to unbiased de novo detection of canonical junctions, STAR can discover non-canonical splices and chimeric (fusion) transcripts, and is also capable of mapping full length RNA sequences. \n Implementation and Availability: STAR is implemented as a standalone C++ code. STAR is free open source software distributed under GPLv3 license and can be downloaded from http://code.google.com/p/rna-star/ \n \n  Dobin A, Davis CA, Schlesinger F, Drenkow J, Zaleski C, Jha S, Batut P, Chaisson M, Gingeras TR. (2012) STAR: ultrafast universal RNA-seq aligner. Bioinformatics [Epub ahead of print]. [ abstract ] \n \n STAR – an ultrafast universal RNA-Seq aligner is a post from: RNA-Seq Blog \n Incoming search terms: rna-star"], "link": "http://www.rna-seqblog.com/data-analysis/splicing-junction/star-an-ultrafast-universal-rna-seq-aligner/", "bloglinks": {}, "links": {"http://www.rna-seqblog.com/": 1, "http://code.google.com/": 1, "http://www.rna-seqblog.com": 1, "http://bioinformatics.oxfordjournals.org/": 1}, "blogtitle": "RNA-Seq Blog"}, {"content": ["UZH/ETH – FGCZ – Functional Genomics Center Zurich \n www.fgcz.ch/ \n The Functional Genomics Center Zurich (FGCZ) is a joint state-of-the-art research and training facility of the ETH Zurich and the University of Zurich. With latest technologies and expert support in genomics, transcriptomics, proteomics, metabolomics, and bioinformatics, the FGCZ carries out research projects and technology development in collaboration with the Zurich Life Science research community. \n RNA-Seq Quantification – Presentation is a post from: RNA-Seq Blog \n Incoming search terms: www rna-seqblog com rna-seq-quantification-presentation"], "link": "http://www.rna-seqblog.com/presentations/rna-seq-quantification-presentation/", "bloglinks": {}, "links": {"http://fgcz-intranet.uzh.ch/": 1, "http://www.fgcz.ch/": 1, "http://www.rna-seqblog.com": 1, "http://www.rna-seqblog.com/": 1}, "blogtitle": "RNA-Seq Blog"}, {"content": ["Abstract/Presentation Information \n \n \n \n \n Title: Quantitative trait locus analysis for next-generation sequencing with the functional linear models.(20) (11:30AM-11:45AM on Wed) (Platform) \n Author(s): M. Xiong, L. Luo, Y. Zhu \n Keywords: Statistical Genetics and Genetic Epidemiology, KW059 – family linkage analysis, KW073 – genetic epidemiology, KW080 – genome-wide association, KW079 – genome sequencing, KW083 – genotype-phenotype correlations \n \n \n \n \n Title: Discovering SNPs Regulating Human Gene Expression Using Allele Specific Expression from RNA-Seq data.(39) (11:45AM-12:00NOON on Wed) (Platform) \n Author(s): E. Eskin, E. Kang, B. Han, A. J. Lusis, L. Martin, S. Shiffman \n Keywords: Bioinformatics and Genomic Technology, KW008 – bioinformatics, KW151 – regulation of transcription, KW169 – transcription \n \n \n \n \n Title: RNA-Seq identifies differentially expressed genes and mutations in oligodendrogliomas.(1236W) (3:15PM-4:15PM on Wed) (Poster) \n Author(s): E. Schrock, K. Szafranski, J. A. Campos Valenzuela, S. Schauer, D. Krex, A. Rump, K. Hackmann, G. Schackert, L. Kaderali, M. Platzer, B. Klink \n Keywords: Cancer Genetics, KW011 – brain/nervous system, KW012 – cancer, KW079 – genome sequencing, KW126 – oncogenesis \n \n \n \n \n Title: Widespread novel RNA editing in human brain tissue, identified by RNA-Seq.(2622W) (3:15PM-4:15PM on Wed) (Poster) \n Author(s): L. Hou, N. Akula, J. Wendland, D. T. Chen, X. Jiang, K. Choi, B. K. Lipska, J. E. Kleinman, F. J. McMahon \n Keywords: Psychiatric Genetics, Neurogenetics and Neurodegeneration, KW155 – RNA, KW102 – massively parallel sequencing, KW134 – phenotype \n \n \n \n \n \n \n \n \n \n Title: Transcriptome sequencing of nPOD type 1 diabetes pancreatic samples for viral sequence identification.(3600W) (3:15PM-4:15PM on Wed) (Poster) \n Author(s): S. Morfopoulou, G. Zhao, R. Ferreira, A. Pugliese, J. Petrosino, L. Thackray, V. Plagnol, nPOD-Virus group \n Keywords: Bioinformatics and Genomic Technology, KW031 – computational tools, KW041 – diabetes, KW087 – immune system, KW089 – infectious disease \n \n \n \n \n Title: Rapid and Efficient Methods for Preparing Globin- and rRNA-Depleted Directional RNA-Seq Libraries.(3668W) (3:15PM-4:15PM on Wed) (Poster) \n Author(s): C. Kinross, J. Hitchen, N. Caruccio, R. Sooknanan \n Keywords: Bioinformatics and Genomic Technology, KW155 – RNA, KW081 – genomic methodologies, KW079 – genome sequencing \n \n \n \n \n Title: RNA-seq uncovers the influence of structural variants on transcriptome diversity.(3674W) (3:15PM-4:15PM on Wed) (Poster) \n Author(s): E. Ait Yahya Graison, A. Reymond \n Keywords: Bioinformatics and Genomic Technology, KW034 – copy number/structural variation, KW155 – RNA, KW004 – alternative splicing, KW102 – massively parallel sequencing, KW113 – model organisms \n \n \n \n \n Title: Selective sequencing of mature transcripts in the human brain by cytoplasmic RNA-Seq.(3728W) (3:15PM-4:15PM on Wed) (Poster) \n Author(s): A. Zaghlool, A. Ameur, J. Halvardson, L. Cavelier, L. Feuk \n Keywords: Bioinformatics and Genomic Technology, KW155 – RNA, KW079 – genome sequencing, KW004 – alternative splicing \n \n \n \n \n Title: The ENCODE effort combining RNA-seq and RT-PCR-seq allows to catalog thousands of novel lncRNAs.(506W) (3:15PM-4:15PM on Wed) (Poster) \n Author(s): C. Howald, A. Tanzer, J. Chrast, F. Kokocinski, T. Derrien, N. Walters, J. Manuel Gonzalez, A. Frankish, B. L. Aken, T. Hourlier, J. Vogel, S. White, S. M. J. Searle, J. Harrow, T. Hubbard, R. Guigò, A. Reymond \n Keywords: Genome structure, variation and function, KW004 – alternative splicing, KW155 – RNA, KW068 – gene localization, KW082 – genomic structure, KW125 – noncoding RNA \n \n \n \n \n Title: Comparative analysis of strand-specific RNA sequencing approaches.(512W) (3:15PM-4:15PM on Wed) (Poster) \n Author(s): D. Munafo, P. Liu, C. Sumner, L. Apone, B. Langhorst, E. Yigit, L. Merrill, F. Stewart, E. Dimalanta, T. Davis \n Keywords: Genome structure, variation and function, KW044 – digital gene expression, KW111 – micro RNA, KW125 – noncoding RNA, KW155 – RNA, KW169 – transcription \n \n \n \n \n Title: Transcriptome genomic analysis using RNA-seq in three tissues of a twin cohort.(546W) (3:15PM-4:15PM on Wed) (Poster) \n Author(s): A. Buil, A. Brown, M. Davies, A. Viñuela, M. Gallardo, D. Glass, M. Blasco, R. Durbin, T. D. Spector, E. T. Dermitzakis for the EUROBATS Consortium \n Keywords: Genome structure, variation and function, KW004 – alternative splicing, KW044 – digital gene expression, KW151 – regulation of transcription, KW155 – RNA \n \n \n \n \n Title: “Seq-ing” the Myotonic Dystrophy Transcriptome.(Sess. 24) (09:40AM-10:00AM on Thu) (Invited Scientific) \n Presenter(s): E. Wang \n \n \n \n \n Title: A Study of Asthma Pharmacogenomics Using RNA-Seq.(638T) (3:15PM-4:15PM on Thu) (Poster) \n Author(s): B. E. Himes, R. Hu, P. Wagner, D. Chan, B. Klanderman, R. A. Panettieri Jr., K. Tantisira, S. T. Weiss, Q. Lu \n Keywords: Pharmacogenetics, KW130 – pharmacodynamics, KW131 – pharmacogenetics, KW153 – respiratory system, KW155 – RNA \n \n \n \n \n Title: Massively-parallel sequencing of the brain transcriptome reveals differential expression of novel genes in bipolar disorder.(260) (08:15AM-08:30AM on Fri) (Platform) \n Author(s): N. Akula, J. Barb, X. Jiang, J. Wendland, K. Choi, S. Sen, B. K. Lipska, J. E. Kleinman, H. C. Bravo, D. T. Chen, P. J. Munson, F. J. McMahon \n Keywords: Psychiatric Genetics, Neurogenetics and Neurodegeneration, KW004 – alternative splicing, KW011 – brain/nervous system, KW155 – RNA, KW008 – bioinformatics, KW169 – transcription \n \n \n \n \n Title: Discovery of genomic variants from RNA-sequencing data.(289) (08:45AM-09:00AM on Fri) (Platform) \n Author(s): R. Piskol, G. Ramaswami, J. B. Li \n Keywords: Bioinformatics and Genomic Technology, KW159 – SNP analysis/discovery, KW155 – RNA, KW169 – transcription, KW008 – bioinformatics, KW102 – massively parallel sequencing \n \n \n \n \n Title: Multivariate profiling approach to inference on differential expression in RNA-Seq data with small sample size.(3567F) (2:15PM-3:15PM on Fri) (Poster) \n Author(s): S. Oh, M. Kim, S. Song \n Keywords: Bioinformatics and Genomic Technology, KW008 – bioinformatics, KW031 – computational tools, KW044 – digital gene expression, KW071 – genes in development, KW081 – genomic methodologies \n \n \n \n \n Title: Golden Helix GenomeBrowse: Cloud-enabled visual analytics of DNA and RNA-Seq NGS data.(3579F) (2:15PM-3:15PM on Fri) (Poster) \n Author(s): G. Rudy, S. Gardner, M. Thiesen \n Keywords: Bioinformatics and Genomic Technology, KW008 – bioinformatics, KW031 – computational tools, KW079 – genome sequencing, KW155 – RNA, KW159 – SNP analysis/discovery \n \n \n \n \n Title: Identification of human RNA editing sites using publically available RNA-sequencing data.(543F) (2:15PM-3:15PM on Fri) (Poster) \n Author(s): G. Ramaswami, J. B. Li \n Keywords: Genome structure, variation and function, KW155 – RNA, KW011 – brain/nervous system, KW008 – bioinformatics \n \n \n \n \n Title: The genetics of gene expression, splicing and transcriptional efficiency through Poly-A selection and ribosomal depletion RNA sequencing in humans.(547F) (2:15PM-3:15PM on Fri) (Poster) \n Author(s): M. Pala, M. Marongiu, A. Mulas, R. Cusano, F. Crobu, F. Reinier, R. Berutti, M. G. Piras, C. Joens, D. Schlessinger, G. Abecasis, A. Angius, S. Sanna, F. Cucca, S. B. Montgomery \n Keywords: Genome structure, variation and function, KW004 – alternative splicing, KW151 – regulation of transcription, KW102 – massively parallel sequencing, KW140 – population genetics, KW155 – RNA \n \n \n \n \n Title: Functional RNA Editing Sites Identified by Comparative Transcriptome Analysis.(577F) (2:15PM-3:15PM on Fri) (Poster) \n Author(s): R. Zhang, G. Ramaswami, L. P. Keegan, T. Deng, M. A. O’Connell, J. B. Li \n Keywords: Bioinformatics and Genomic Technology, KW008 – bioinformatics, KW056 – evolution, KW078 – genome scan, KW155 – RNA, KW124 – nervous system \n \n \n \n \n Title: Whole transcriptome analysis of Velocardiofacial Syndrome (VCFS) using next-generation sequencing.(579F) (2:15PM-3:15PM on Fri) (Poster) \n Author(s): Y. Zhang, J. Jin, X. Zhu, M. Haney, Y. Kluger, S. Weissman, A. Urban \n Keywords: Genome structure, variation and function, KW034 – copy number/structural variation, KW102 – massively parallel sequencing, KW079 – genome sequencing, KW151 – regulation of transcription \n \n \n \n \n Title: The Gamma Method for gene set analysis of RNA-Seq data: Simulation results and application to a smallpox vaccine study.(1426F) (3:15PM-4:15PM on Fri) (Poster) \n Author(s): B. L. Fridley, G. D. Jenkins, D. E. Grill, J. M. Biernacka, R. B. Kennedy, G. A. Poland, A. L. Oberg \n Keywords: Statistical Genetics and Genetic Epidemiology, KW155 – RNA, KW008 – bioinformatics, KW031 – computational tools, KW079 – genome sequencing, KW087 – immune system \n \n \n \n \n Title: Constructing biological network using RNA-seq data.(1504F) (3:15PM-4:15PM on Fri) (Poster) \n Author(s): Y. Choi, M. Coram, H. Tang \n Keywords: Statistical Genetics and Genetic Epidemiology, KW105 – mathematical modeling, KW155 – RNA \n \n \n \n \n Title: RNA-SEQ survey of human lymphoid and myeloid cells – a resource for identifying causal genes in validated immune-mediated disease loci.(1982F) (3:15PM-4:15PM on Fri) (Poster) \n Author(s): S. Foisy, C. Beauchamp, A. Alikashani, F. Latour, M. Ladouceur, S. Lessage, J. D. Rioux \n Keywords: Complex Traits and Polygenic Disorders, KW008 – bioinformatics, KW031 – computational tools, KW044 – digital gene expression, KW102 – massively parallel sequencing, KW155 – RNA \n \n \n \n \n Title: Analysis of Whole Transcriptome specific to the Temporal Pole of Late-Onset Alzheimer’s disease.(341) (04:45PM-05:00PM on Fri) (Platform) \n Author(s): C. E. Humphries, M. A. Kohli, P. W. Whitehead, W. F. Hulme, L. Nathanson, D. C. Mash, M. A. Pericak-Vance, J. R. Gilbert \n Keywords: Complex Traits and Polygenic Disorders, KW011 – brain/nervous system, KW123 – neurogenetics, KW125 – noncoding RNA, KW122 – neurodegeneration, KW004 – alternative splicing \n \n \n \n \n RNA-Seq a big topic at upcoming ASHG 2012 is a post from: RNA-Seq Blog \n Incoming search terms: ashg 2012 pineapple transcriptome plos one Rapid and Efficient Methods for Preparing Globin- and rRNA-Depleted Directional RNA-Seq Libraries (3668W) (3:15PM-4:15PM on Wed) (Poster"], "link": "http://www.rna-seqblog.com/events/rna-seq-a-big-topic-at-upcoming-ashg-2012/", "bloglinks": {}, "links": {"http://www.rna-seqblog.com": 1, "http://www.ashg.org/": 1, "http://www.rna-seqblog.com/": 1}, "blogtitle": "RNA-Seq Blog"}, {"content": ["Sex-biased genes are thought to drive phenotypic differences between males and females. The recent availability of high-throughput gene expression data for many related species has led to a burst of investigations into the genomic and evolutionary properties of sex-biased genes. In Drosophila, a number of studies have found that X chromosomes are deficient in male-biased genes (demasculinized) and enriched for female-biased genes (feminized), and that male-biased genes evolve faster than female-biased genes. However, studies have yielded vastly different conclusions regarding the numbers of sex-biased genes and forces shaping their evolution. \n Now, researchers at the University of California, Berkeley have used RNA-Seq data from multiple tissues of D. melanogaster and D. pseudoobscura, a species with a recently evolved X chromosome, to explore the evolution of sex-biased genes in Drosophila. \n \n They compared several independent metrics for classifying sex-biased genes and find that the overlap of genes identified by different metrics is small, particularly for female-biased genes. \n They investigated genome-wide expression patterns and uncovered evidence of demasculinization and feminization of both ancestral and new X chromosomes, demonstrating that gene content on sex chromosomes evolves rapidly. \n They examined the evolutionary rates of sex-biased genes and showed that male-biased genes evolve much faster than female-biased genes, which evolve at similar rates to unbiased genes. \n \n Analysis of gene expression among tissues revealed that this trend may be partially due to pleiotropic effects of female-biased genes, which limits their evolutionary potential. Thus, these findings illustrate the importance of accurately identifying sex-biased genes and provide insight into their evolutionary dynamics in Drosophila. \n \n Assis R, Zhou Q, Bachtrog D. (2012) Sex-biased transcriptome evolution in Drosophila . Genome Biol Evol [Epub ahead of print]. [ article ] \n \n Sex-biased transcriptome evolution in Drosophila is a post from: RNA-Seq Blog"], "link": "http://www.rna-seqblog.com/publications/sex-biased-transcriptome-evolution-in-drosophila/", "bloglinks": {}, "links": {"http://www.rna-seqblog.com": 1, "http://gbe.oxfordjournals.org/": 1, "http://www.rna-seqblog.com/": 1}, "blogtitle": "RNA-Seq Blog"}, {"content": ["Looks like there is high confidence among the RNA sequencing community that the MiSeq will be the dominant benchtop sequencer. It is also interesting that this poll reached 100 voters much more quickly than most of our previous polls.  Is that because researchers are more sure of their answer to this question or possibly because they feel more strongly about it? \n  Total Number of Voters = 133 \n In our next poll, we thought is would be interesting to see how the political views of the RNA sequencing community compare with the general public. We asked who will you vote for (or would you vote for if not a US citizen) in the upcoming presidential election. We’ll check back after the actual election is held. \n Check it out in the left hand side-bar and cast your vote! \n RNA-Seq Blog Poll Results is a post from: RNA-Seq Blog \n Incoming search terms: seq poll illumina sequencing transcriptomics miseq Miseq RNA rna sequencing with miseq rna sequnecing with miseq seq presidential poll seq presidential polls"], "link": "http://www.rna-seqblog.com/poll-results-2/rna-seq-blog-poll-results-6/", "bloglinks": {}, "links": {"http://www.rna-seqblog.com": 1, "http://www.rna-seqblog.com/": 2}, "blogtitle": "RNA-Seq Blog"}, {"content": ["Pineapple (Ananas comosus var. comosus), is an important tropical non-climacteric fruit with high commercial potential. Understanding the mechanism and processes underlying fruit ripening would enable scientists to enhance the improvement of quality traits such as, flavor, texture, appearance and fruit sweetness. Although, the pineapple is an important fruit, there is insufficient transcriptomic or genomic information that is available in public databases. \n Now researchers at Universiti Malaysia Sabah have performed RNA-Seq of ripe yellow pineapple fruit flesh using Illumina RNA sequencing technology. About 4.7 million paired-end reads were generated and assembled using the Velvet de novo assembler. The assembly produced 28,728 unique transcripts with a mean length of approximately 200 bp. Sequence similarity search against non-redundant NCBI database identified a total of 16,932 unique transcripts (58.93%) with significant hits. Out of these, 15,507 unique transcripts were assigned to gene ontology terms. Functional annotation against Kyoto Encyclopedia of Genes and Genomes pathway database identified 13,598 unique transcripts (47.33%) which were mapped to 126 pathways. The assembly revealed many transcripts that were previously unknown. \n \n \n Ong WD, Voo LY, Kumar VS. (2012) De Novo Assembly, Characterization and Functional Annotation of Pineapple Fruit Transcriptome through Massively Parallel Sequencing . PLoS One 7(10), e46937. [ article ] \n \n Sequencing of the Pineapple Fruit Transcriptome is a post from: RNA-Seq Blog \n Incoming search terms: nanas pineapple fruit"], "link": "http://www.rna-seqblog.com/transcrioptome-sequenced/sequencing-of-the-pineapple-fruit-transcriptome/", "bloglinks": {}, "links": {"http://www.plosone.org/": 1, "http://www.rna-seqblog.com": 1, "http://www.rna-seqblog.com/": 1}, "blogtitle": "RNA-Seq Blog"}]