[{"blogurl": "http://robjhyndman.com\n", "blogroll": [], "title": "Rob J Hyndman"}, {"content": ["Souhaib Ben Taieb 1 and Rob J Hyndman 2 \n \n Université Libre de Bruxelles \n Monash University \n \n Abstract: \n We propose a new forecasting strategy, called rectify, that seeks to combine the best properties of both the recursive and direct forecasting strategies. The rationale behind the rectify strategy is to begin with biased recursive forecasts and adjust them so they are unbiased and have smaller error. We use linear and nonlinear simulated time series to investigate the performance of the rectify strategy and compare the results with those from the recursive and the direct strategies. We also carry out some experiments using real world time series from the M3 and the NN5 forecasting competitions. We find that the rectify strategy is always better than, or at least has comparable performance to, the best of the recursive and the direct strategies. This finding makes the rectify strategy very attractive as it avoids making a choice between the recursive and the direct strategies which can be a difficult task in real-world applications. \n   \n Download paper"], "link": "http://feedproxy.google.com/~r/ProfessorRobJHyndman/~3/ailDjU8MF9U/", "bloglinks": {}, "links": {"http://robjhyndman.com/": 1}, "blogtitle": "Rob J Hyndman"}, {"content": ["Erbas B, Dharmage SC, O’Sullivan M, Akram M, Newbigin E, Taylor P, Vicendese D, Hyndman RJ, Tang ML, Abramson MJ. \n Journal of Biometrics and Biostatistics (2012), S7-018. \n Abstract \n Background: Few case-control studies of time dependent environmental exposures and respiratory outcomes have been performed. Small sample sizes pose modeling challenges for estimating interactions. In contrast, case cross-over studies are well suited where control selection and responses are low, time consuming and costly. \n Objective: To demonstrate the feasibility and validity of a case crossover study of children admitted to hospital for asthma to examine interacting effects of time varying environmental exposures.   \n Methods: The Melbourne Air Pollen Children and Adolescent Health (MAPCAH) study recruited incident asthma admissions of children and adolescents aged 2–17 years to a tertiary hospital. A case was defined by date of admission, and eligible cases served as their own controls. We used bi-directional sampling design for control selection. At time of admission, participants underwent skin prick tests and nasal/throat swabs (NTS) to test for respiratory viruses. Questionnaires collected data on asthma management, family history and environmental characteristics. Daily concentrations of ambient pollen, air pollution and weather variables were also available. \n Results: 644 children were recruited. More than half (63%) were male with mean age 5.2 (SD 3.3) years. Non-participants were slightly younger at admission (mean age 4.3, SD 2.8, p <0.001), although the absolute differences were small. Participants and non-participants were well balanced on gender. The most common reason for refusal to participate in the study was “causing further distress to child by skin prick testing”. Of those recruited, 46% were sensitized to any pollen, 14% were sensitized to fungi, and 22% tested positive to egg or peanut allergens. 68% of children had positive NTS for human rhinovirus (HRV) at admission and 22% were still positive nine weeks later. Parental history of asthma and hay fever was common.  Children who skin-tested positive to any pollen were slightly older (mean 6.4 years, SD 3.6, p <0.001). \n Gender and age distributions were similar to the overall admissions to the tertiary hospital as well as in Victoria. Our study slightly under-represented winter admissions ( p <0.001), and was over-represented in summer( p <0.002). More admissions occurred during the grass pollen season in our study than in general asthma hospital admissions across Victoria (36% versus 22%, p <0.001). \n Conclusions:  The case cross-over method is a highly feasible design for a reasonably sized hospital-based study of children with asthma. MAPCAH has robust internal validity and strong generalizability. Collection of data on respiratory viruses and pollen exposure at the time of admission on children with asthma provides important information that will have clinical and public health impacts. \n   \n Key words: case crossover design, asthma, respiratory viral infections, internal validity \n   \n Online article"], "link": "http://feedproxy.google.com/~r/ProfessorRobJHyndman/~3/k84mCWJ9qec/", "bloglinks": {}, "links": {"http://www.omicsonline.org/": 2}, "blogtitle": "Rob J Hyndman"}, {"content": ["Invited talk, Australian Statistical Conference, Adelaide, 10 July 2012. \n COMPSTAT 2012, Cyprus, 29 August 2012. \n Seminar, Lancaster University, 10 September 2012. \n \n Abstract: Many applications require a large number of time series to be forecast completely automatically. For example, manufacturing companies often require weekly forecasts of demand for thousands of products at dozens of locations in order to plan distribution and maintain suitable inventory stocks. In population forecasting, there are often a few hundred time series to be forecast, representing various components that make up the population dynamics. In these circumstances, it is not feasible for time series models to be developed for each series by an experienced statistician. Instead, an automatic forecasting algorithm is required. \n I will look at some algorithms recently developed for automatically forecasting various types of time series, including approaches for handling functional time series, hierarchical time series, and time series with multiple seasonality. \n Slides: \n \n Downloads \n \n Long version (for ASC2012 and Lancaster Uni ) \n Short version (for COMPSTAT12 )"], "link": "http://feedproxy.google.com/~r/ProfessorRobJHyndman/~3/Zx3Y56JSGI8/", "bloglinks": {}, "links": {"http://www.compstat2012.org/": 2, "http://sapmea.asn.au/": 2, "http://www.ac.uk/": 2, "http://robjhyndman.com/": 2}, "blogtitle": "Rob J Hyndman"}, {"content": ["Talk given at the University of Adelaide, Friday 16 March 2012 \n Abstract: Electricity demand forecasting plays an important role in short-term load allocation and long-term planning for future generation facilities and transmission augmentation. Planners must adopt a probabilistic view of potential peak demand levels, therefore density forecasts (providing estimates of the full probability distributions of the possible future values of the demand) are more helpful than point forecasts, and are necessary for utilities to evaluate and hedge the financial risk accrued by demand variability and forecasting uncertainty. \n Electricity demand in a given season is subject to a range of uncertainties, including underlying population growth, changing technology, economic conditions, prevailing weather conditions (and the timing of those conditions), as well as the general randomness inherent in individual usage. It is also subject to some known calendar effects due to the time of day, day of week, time of year, and public holidays. \n I will describe a comprehensive forecasting solution designed to take all the available information into account, and to provide forecast distributions from a few hours ahead to a few decades ahead. We use semi-parametric additive models to estimate the relationships between demand and the covariates, including temperatures, calendar effects and some demographic and economic variables. Then we forecast the demand distributions using a mixture of temperature simulation, assumed future economic scenarios, and residual bootstrapping. The temperature simulation is implemented through a new seasonal bootstrapping method with variable blocks. \n The model is being used by the state energy market operators and some electricity supply companies to forecast the probability distribution of electricity demand in various regions of Australia. It also underpinned the Victorian Vision 2030 energy strategy. \n Slides \n \n Adelaide Uni slides \n Later version given at Monash University, 16 May 2012. \n Later version given at University of New South Wales, 1 November 2012. \n \n Key papers \n \n Hyndman, R.J. and Fan, S. (2010) “Density forecasting for long-term peak electricity demand”, IEEE Transactions on Power Systems , 25 (2), 1142–1153. \n Fan, S. and Hyndman, R.J. (2012) “Short-term load forecasting based on a semi-parametric additive model”. IEEE Transactions on Power Systems , 27 (1), 134–141."], "link": "http://feedproxy.google.com/~r/ProfessorRobJHyndman/~3/moy70HRxO8E/", "bloglinks": {}, "links": {"http://robjhyndman.com/": 5}, "blogtitle": "Rob J Hyndman"}, {"content": ["Rob J Hyndman a , Heather Booth b and Farah Yasmeen a \n a Department of Econometrics & Business Statistics, Monash University, Clayton, Victoria, Australia. \n b The Australian Demographic & Social Research Institute, Australian National University, Canberra, ACT, Australia. \n Demography , to appear. \n Revised version: 20 April 2012. \n Abstract: \nWhen independence is assumed, forecasts of mortality for subpopulations are almost always divergent in the long term. We propose a method for coherent forecasting of mortality rates for two or more subpopulations, based on functional principal components models of simple and interpretable functions of rates. The product-ratio functional forecasting method models and forecasts the geometric mean of subpopulation rates and the ratio of subpopulation rates to product rates. Coherence is imposed by constraining the forecast ratio function through stationary time series models. The method is applied to sex-specific data for Sweden and state-specific data for Australia. Based on out-of-sample forecasts, the coherent forecasts are at least as accurate in overall terms as comparable independent forecasts, and forecast accuracy is homogenised across subpopulations. \n Keywords: Mortality forecasting, coherent forecasts, functional data, Lee-Carter method, life expectancy, mortality, age pattern of mortality, sex-ratio. \n Download working paper \n Online paper"], "link": "http://feedproxy.google.com/~r/ProfessorRobJHyndman/~3/BfLTDbno_aU/", "bloglinks": {}, "links": {"http://muse.jhu.edu/": 1, "http://robjhyndman.com/": 1, "http://dx.doi.org/": 1}, "blogtitle": "Rob J Hyndman"}, {"content": ["Shu Fan and Rob J Hyndman \n Revised 10 January 2011 \n IEEE Transactions on Power Systems (2012), 27 (1), 134–141. \n Abstract \nShort-term load forecasting is an essential instrument in power system planning, operation and control. Many operating decisions are based on load forecasts, such as dispatch scheduling of generating capacity, reliability analysis, and maintenance planning for the generators. Overestimation of electricity demand will cause a conservative operation, which leads to the start-up of too many units or excessive energy purchase, thereby supplying an unnecessary level of reserve. On the contrary, underestimation may result in a risky operation, with insufficient preparation of spinning reserve, causing the system to operate in a vulnerable region to the disturbance. \n In this paper, semi-parametric additive models are proposed to estimate the relationships between demand and the driver variables. Specifically, the inputs for these models are calendar variables, lagged actual demand observations and historical and forecast temperature traces for one or more sites in the target power system. In addition to point forecasts, prediction intervals are also estimated using a modified bootstrap method suitable for the complex seasonality seen in electricity demand data. The proposed methodology has been used to forecast the half-hourly electricity demand for up to seven days ahead for power systems in the Australian National Electricity Market. The performance of the methodology is validated via out-of-sample experiments with real data from the power system, as well as through on-site implementation by the system operator. \n \n Download working paper \n \n Online published version"], "link": "http://feedproxy.google.com/~r/ProfessorRobJHyndman/~3/S5oXi74a0No/", "bloglinks": {}, "links": {"http://robjhyndman.com/": 1, "http://dx.doi.org/": 1}, "blogtitle": "Rob J Hyndman"}, {"content": ["Bircan Erbas 1 , Shahid Ullah 2 , Rob J Hyndman 3 , Michelle Scollo 4 , Michael Abramson 5 \n BMC Medical Research Methodology (2012) 12 :17. \n \n School of Public Health, La Trobe University, Bundoora, 3086Australia \n School of Human Movement and Sport Sciences, University of Ballarat,Mount Helen, Victoria, 3353,Australia \n Department of Econometrics and Business Statistics, Monash University, Clayton, 3800, Australia \n VicHealth Centre for Tobacco Control, The Cancer Council Victoria,100 Drummond St, Carlton, Victoria, 3053 \n School of Public Health and Preventive Medicine, Monash University,Alfred Hospital, Melbourne, 3004,Australia. \n \n ABSTRACT \n Background: Chronic Obstructive Pulmonary Disease (COPD) is currently the fifth leading cause of death in Australia, and there are marked differences in mortality trends between men and women. In this study, we have sought to model and forecast age related changes in COPD mortality over time for men and women separately over the period 2006–2025. \n Methods: Annual COPD death rates in Australia from 1922 to 2005 for age groups (50–54, 55–59, 60–64, 65–69, 70–74, 75–79, 80–84, 85+) were used. Functional time series models of age-specific COPD mortality rates for men and women were used, and forecasts of mortality rates were modelled separately for men and women. \n Results: Functional time series models with four basis functions were fitted to each population separately. Twenty-year forecasts were computed, and indicated an overall decline. This decline may be slower for women than for men. By age, we expect similar rates of decline in men over time. In contrast, for women, forecasts for the age group 75–79 years suggest less of a decline over time compared to younger age groups. \n Conclusions: By using a new method to predict age-specific trends in COPD mortality over time, this study provides important insights into at-risk age groups for men and women separately, which has implications for policy and program development. \n Key words: COPD mortality, functional data analysis, tobacco consumption, forecasting \n   \n Online article"], "link": "http://feedproxy.google.com/~r/ProfessorRobJHyndman/~3/VzIjw4rFUPU/", "bloglinks": {}, "links": {"http://www.biomedcentral.com/": 1, "http://dx.doi.org/": 1}, "blogtitle": "Rob J Hyndman"}, {"content": ["A new online forecasting textbook by Rob J Hyndman and George Athanasopoulos"], "link": "http://feedproxy.google.com/~r/ProfessorRobJHyndman/~3/rGO-Xl9jqOo/", "bloglinks": {}, "links": {}, "blogtitle": "Rob J Hyndman"}, {"content": ["Alysha M De Livera, Rob J Hyndman and Ralph D Snyder \n Journal of the American Statistical Association (2011) 106 (496), 1513–1527. \n Abstract \nA new innovations state space modeling framework, incorporating Box-Cox transformations, Fourier series with time varying coefficients and ARMA error correction, is introduced for forecasting complex seasonal time series that cannot be handled using existing forecasting models. Such complex time series include time series with multiple seasonal periods, high frequency seasonality, non-integer seasonality and dual-calendar effects. Our new modelling framework provides an alternative to existing exponential smoothing models, and is shown to have many advantages. The methods for initialization and estimation, including likelihood evaluation, are presented, and analytical expressions for point forecasts and interval predictions under the assumption of Gaussian errors are derived, leading to a simple, comprehensible approach to forecasting complex seasonal time series. Our trigonometric formulation is also presented as a means of decomposing complex seasonal time series, which cannot be decomposed using any of the existing decomposition methods. The approach is useful in a broad range of applications, and we illustrate its versatility in three empirical studies where it demonstrates excellent forecasting performance over a range of prediction horizons. In addition, we show that our trigonometric decomposition leads to the identification and extraction of seasonal components, which are otherwise not apparent in the time series plot itself. \n Keywords: exponential smoothing, Fourier series, prediction intervals, seasonality, state space models, time series decomposition. \n Pre-publication working paper \n Published paper \n Data \n \n Call center data (day of week indicator) \n Gasoline data \n Turkish electricity data"], "link": "http://feedproxy.google.com/~r/ProfessorRobJHyndman/~3/2wCc5b6Akng/", "bloglinks": {}, "links": {"http://robjhyndman.com/": 5, "http://dx.doi.org/": 1}, "blogtitle": "Rob J Hyndman"}, {"content": ["Melbourne R Users’ Group \nThursday, October 27, 2011, 6:00 PM \n Deloitte, Level 11 (Culture Room), 550 Bourke Street, Melbourne \n I will look at the various facilities for time series forecasting available in R, concentrating on the forecast package. This package implements several automatic methods for forecasting time series including forecasts from ARIMA models, ARFIMA models and exponential smoothing models. I will also look more generally at how to go about forecasting non-seasonal data, seasonal data, seasonal data with high frequency, and seasonal data with multiple frequencies. Examples will be taken from my own consulting experience. I will give an overview of what’s possible and available and where it is useful, rather than give the mathematical details of any specific time series methods. \n Slides \n Examples"], "link": "http://feedproxy.google.com/~r/ProfessorRobJHyndman/~3/cFsXek_H8cc/", "bloglinks": {}, "links": {"http://robjhyndman.com/": 2, "http://maps.google.com/": 1, "http://www.meetup.com/": 1}, "blogtitle": "Rob J Hyndman"}]