[{"blogurl": "http://robinryder.wordpress.com\n", "blogroll": [], "title": "Robin Ryder's blog"}, {"content": ["Pierre Jacob defended his PhD on Monday, which was also the first time I was on the examiner bench at a PhD viva (much less stressful than being the candidate!). Unsurprisingly, the viva went very well, with laudatory reports. His thesis is a collection of 5(!) papers he co-wrote, including Free energy SMC, SMC², Block independent Methopolis-Hastings, Parallel Adaptive Wang-Landau (my personal favourite), and our collaboration on the Wang-Landau Flat Histogram . \n I have been impressed not only by the quality of Pierre’s work, but also by his ability to start collaborations with many different researchers all around the world (co-authors in 6 countries already). He is now moving to Singapore for a postdoc with Ajay Jasra and has started a handful of very interesting projects, so there is much more to be expected!"], "link": "http://robinryder.wordpress.com/2012/09/07/pierre-jacobs-viva/", "bloglinks": {}, "links": {"http://robinryder.wordpress.com/": 1, "http://feeds.wordpress.com/": 1, "https://sites.google.com/": 2}, "blogtitle": "Robin Ryder's blog"}, {"content": ["Wikipedia is awesome, and we all rely on it on a day-to-day basis. For basic statistical topics, I usually find it very reliable. For more advanced topics, however, coverage is often sketchy or even non-existent. The article on ABC is exceedingly short; the one on the Wang-Landau algorithm is rather odd; the on on quantitative comparative linguistics is essentially a long list. \n I often get annoyed when people complain about Wikipedia, for two reasons: 1. Although imperfect, it is pretty good, and often better than other more widely accepted general knowledge encyclopedias; 2. If you find a problem, you should fix it rather than complain. \n Although I am far from being the most active contributor on Wikipedia, I edit it quite a lot, and am an administrator of Wikimedia Commons. But I have hardly done any contributions in Statistics, my area of expertise. The reason is simple: when I do Statistics, it is for my job, do I either do research or prepare lectures. Editing Wikipedia is a hobby, so I want it to be separate from my job. \n But this is sub-optimal: Wikipedia could be improved if more specialists were to participate. Also, and I should try not to be too depressed by this, anything I write on Wikipedia will probably be read thousands time more than the scientific papers I write. One could thus argue that it would be an efficient use of my time for me and other statisticians to edit Wikipedia on Statistics topics. One could even go further and state that it should be one of our duties. \n There are several obstacles here. The first obstacle is that Wikipedia’s model is that it can be edited by anyone; other encyclopedias which attempt to have articles written by specialists are nowhere near as successful (e.g. Citizendium). Some kind of assurance that an expert’s edits are given more importance than a layman’s could incentivize more experts to participate. I actually believe that in the large majority of cases, an expert’s contribution would be recognized as such and that no one would try to deconstruct it (most exceptions would be in topics subject to hot debate either in the scientific community or in the media). A second obstacle is that editing Wikipedia is not recognized in the career path of scientists: I might want scientists in general to participate in Wikipedia; but I won’t do it, because I really need to finish these three papers and grant proposals (a kind of NIMBY issue). A third obstacle is that scientists simply cannot be bothered to edit Wikipedia. \n PLoS Computational Biology has started an initiative to address these obstacles. In a nutshell: scientists write a review paper. It gets published in the journal, and the scientists get a publication on their CV. At the same time, the paper gets copied over to Wikipedia. The initial version is marked as being written by specialists, but anyone can edit it (e.g. improve the wording, add relevant links, etc.). Everyone wins. The first such article is on Circular permutation in proteins . \n Obviously, scientists should also edit Wikipedia even when they don’t get a publication out of it. But such initiatives will help get scientists involved. Explaining scientific topics to the general public is one of the duties of scientists, and Wikipedia is one of the best tools to do this."], "link": "http://robinryder.wordpress.com/2012/05/21/plos-scientific-paper-gets-also-published-on-wikipedia/", "bloglinks": {}, "links": {"http://blogs.plos.org/": 1, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 5}, "blogtitle": "Robin Ryder's blog"}, {"content": ["MCMC practitioners may be familiar with the Wang-Landau algorithm, which is widely used in Physics. This algorithm divides the sample space into “boxes”. Given a target distribution, the algorithm then samples proportionally to the target in each box, while aiming at spending a pre-defined proportion of the sample in each box. (Usually these predefined proportions are uniform.) \n This strategy can help move faster between modes of a distribution, by forcing the sample to visit often the space between modes. \n The most sophisticated versions of this algorithm combine a decreasing stochastic schedule and the so-called flat histogram criterion: whenever the proportions of the sample in each box are close enough to the desired frequencies, the stochastic schedule decreases. A decreasing schedule is necessary for diminishing adaptation to hold. \n Until now, it was unknown whether the flat histogram is necessarily reached in finite time, and hence whether the schedule ever starts decreasing. \n Pierre Jacob and I just submitted and arXived a proof that the flat histogram is reached in finite time under some conditions, and may never be reached in other cases."], "link": "http://robinryder.wordpress.com/2011/10/19/the-wang-landau-algorithm-reaches-the-flat-histogram-in-finite-time/", "bloglinks": {}, "links": {"http://arxiv.org/": 1, "http://feeds.wordpress.com/": 1, "http://statisfaction.wordpress.com/": 1}, "blogtitle": "Robin Ryder's blog"}, {"content": ["As of this month, I am no longer a postdoc, but an assistant professor ( maître de conférences ) at Université Paris Dauphine . \n My new contact details are: \n Robin Ryder \n Bureau C608 \n CEREMADE − Université Paris Dauphine \n Place du Maréchal de Lattre de Tassigny \n 75116 Paris \n Phone: (+33) 1 44 05 46 71 \n My e-mail is unchanged."], "link": "http://robinryder.wordpress.com/2011/09/29/new-position/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.dauphine.fr": 1}, "blogtitle": "Robin Ryder's blog"}, {"content": ["The Greek Stochastics γ conference was held last week in Crete and focused this year on MCMC methods ( last year was of statistics for biology). The schedule allowed little time for presentations from participants, but there were several “short courses”. In particular, Gareth Roberts gave a rather illuminating explanation on convergence of Gibbs samplers, in which each step of the sampler is viewed as a projection in a functional space. \n In a Gibb s sampler with two steps (1. update given ; 2. update given ), step 1 is a projection (recall that is a projection iff , and it is clear than performing step 1 twice in a row is the same as performing it only once); the same is true of step 2. The spaces we are projecting on are ugly, but if you view them as lines, it is easy to see that the successive iterations converge to the intersection of the two lines, which corresponds to a fixed point, as shown in this very ugly figure. The convergence is faster if the two lines are  close to orthogonal, which corresponds to correlation close to in the Gibbs sampler. Apparently, this line of thought was initiated by Yael Amit. I find it very helpful. \n Another fascinating talk was given by David Spiegelhalter (the “general interest” talk), on communicating in Statistics. David studies the question “Why do people find probability unintuitive and difficult?”; he suggests that the answer in “because probability in unintuitive and difficult”. He gave a startling example: in a phone survey, if you ask which is the greater risk between 1/100, 1/10 and 1/1000, about 25-30% of people give the wrong answer. Media reports often use such notation, with the numerator fixed to 1. The message would be better understood if probabilities were given with a fixed denominator (1/100, 10/100, 0.1/100). David had many other suggestions on explaining risk and uncertainty to non-statisticians, all very useful."], "link": "http://robinryder.wordpress.com/2011/06/08/greek-stochastics-%ce%b3/", "bloglinks": {}, "links": {"http://stochastics.gr/": 1, "http://robinryder.wordpress.com/": 2, "http://feeds.wordpress.com/": 1, "http://www.ac.uk/": 1, "http://www2.ac.uk/": 1}, "blogtitle": "Robin Ryder's blog"}, {"content": ["The results for the 2010 Savage award , bestowed by the International Society for Bayesian Analysis for PhD theses in Bayesian statistics, just came in. I am very pleased and honoured to have won the honourable mention in the Applied Methodology category! I shall be presenting the work ( Phylogenetic Models of Language Diversification ) at JSM in Miami in August. \n I am very grateful to the award committee, and am as always thankful for the fantastic supervision I received from Geoff Nicholls. \n This is a good year for French statistics, since Julien Cornebise won the award in the Theory category! Congratulations to the other winners, Ricardo Lemos and Daniel Williamson."], "link": "http://robinryder.wordpress.com/2011/04/01/savage-award-honorable-mention/", "bloglinks": {}, "links": {"http://www.bayesian.org/": 1, "http://feeds.wordpress.com/": 1, "http://bayesian.org/": 1, "http://www.amstat.org/": 1, "http://www.ubc.ca/": 1, "http://www.dauphine.fr/": 1}, "blogtitle": "Robin Ryder's blog"}, {"content": ["La Recherche , one of the leading French popular science magazines, has a monthly piece in which they present a Mathematician’s work in two pages. I had the honour and great pleasure of being featured in this month’s issue. Philippe Pajot interviewed me for over an hour about my work on models of language diversification and did a pretty good job at summarizing it in a few hundred words, with a presentation of the linguistic question, the data, and a mention of the issues of validation and error bars. There is also a brief attempt at explaining MCMC. \n A scan is below, for French-speaking readers."], "link": "http://robinryder.wordpress.com/2011/03/06/interview-in-la-recherche/", "bloglinks": {}, "links": {"http://robinryder.wordpress.com/": 3, "http://feeds.wordpress.com/": 1}, "blogtitle": "Robin Ryder's blog"}, {"content": ["Phylogenetic models of language diversification seem to be popular these days in French popular science magazines. Of the leading publications, La Recherche will feature an interview with yours truly in March, and Pour la Science has an 8-page cover story on the subject in the current issue. \n Popularizer Ruth Berger looks at the expansion of the Indo-Europeans from genetic and linguistic points of view, trying to reconcile them and to decide between the Kurgan (horsemen) and Anatolian (farmers) possible origins of Indo-European expansion. For the linguistics half, she looks at phylogenetic models to infer genealogies and dates, but skips the methodology and reproduces directly trees by Gray & Atkinson (2003) and Atkinson et al. (2005). \n It is a shame that the method is presented as a black box. Given the length of the article, it would have been possible to give a general idea of how dates are inferred: the ages of parts of the tree are known, and this information is used to estimate rates of change and other ages. Instead, the author suggests that the rates are already known [whence?] and are fed to the black box, which magically outputs a tree and dates.  There is barely anything about the uncertainty of the estimates, and nothing about validation. I also have trouble understanding the points made at the end about Linear A and the attempt to merge the Anatolian and Kurgan hypotheses. \n This issue is number 400 of Pour la Science . According to the editor-in-chief, they decided to celebrate with an issue on “theories and models”. Indo-European expansion is one of their examples, along with pieces on Grand Unification and on gene transfers . Uncertainty and validation are major parts of any decent modelling endeavour, and it is a shame that they did not seize the opportunity to educate their readership about these issues. \n I suppose it is hardly surprising that I am disappointed with a popular science paper on a topic related to my PhD…"], "link": "http://robinryder.wordpress.com/2011/02/10/pour-la-science-article-on-indo-european-expansion/", "bloglinks": {}, "links": {"http://www.nature.com/": 1, "http://feeds.wordpress.com/": 1, "http://onlinelibrary.wiley.com/": 1, "http://en.wikipedia.org/": 3}, "blogtitle": "Robin Ryder's blog"}, {"content": ["I had heard before of the 1955 book A Million Random Digits with 100,000 Normal Deviates (which is exactly what you think it is), but until Greg Ross pointed them out , I had never looked at the comments on Amazon .  They are hilarious. A short selection: \n \n “Such a terrific reference work! But with so many terrific random digits, it’s a shame they didn’t sort them, to make it easier to find the one you’re looking for.” \n “If you like this book, I highly recommend that you read it in the original binary.” \n “While the printed version is good, I would have expected the publisher to have an audiobook version as well.” \n “Once you get about halfway in, the rest of the story is pretty predictable.” \n “What other author could give us such a masterpiece? Infinite monkeys typing on infinite typewriters might be able to produce Shakespeare, but they could never produce something like this!” \n “My only regret is that there isn’t a sequel, because the author left it at a cliffhanger. ” \n “It starts with an innocent 10097, rapidly succeded by 32533. The reader has no idea if 10097 will ever appear again, and that’s the thrilling part. I won’t spoil the story, so if you want to know whether 10097 is repeated, buy the book.” \n \n (David Pogue has a list of other Amazon products which attract funny “reviews”.) \n \n A Million Random Digits with 100,000 Normal DeviatesA"], "link": "http://robinryder.wordpress.com/2011/01/20/a-million-random-digits-with-100000-normal-deviates/", "bloglinks": {}, "links": {"http://www.amazon.com/": 1, "http://www.futilitycloset.com/": 1, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1, "http://pogue.nytimes.com/": 1}, "blogtitle": "Robin Ryder's blog"}, {"content": ["The Internet is abuzz ( 1 2 3 )with Google’s Ngrams Viewer which allows to track frequency of usage of words and short phrases in “lots of books” from 1500 to 2008, in six languages. \n It would be easy to spend hours playing at these data. Here is a quick look at when Statistics (rightfully) overtook Mathematics, in English and in French books: \n  \n  \n Statistics overtook Mathematics half-a-century earlier in English than it did in French. I wonder what caused the bump in French around 1960."], "link": "http://robinryder.wordpress.com/2010/12/20/ngrams-when-statistics-overtook-mathematics/", "bloglinks": {}, "links": {"http://www.informationisbeautiful.net/": 1, "http://feeds.wordpress.com/": 1, "http://www.columbia.edu/": 1, "http://ngrams.googlelabs.com/": 3, "http://flowingdata.com/": 1}, "blogtitle": "Robin Ryder's blog"}]