[{"blogurl": "http://shuisman.com\n", "blogroll": [], "title": "Sander Huisman"}, {"content": ["Another Adobe Illustrator creation, another Mario related item; the Piranha plant. A large version can be found HERE."], "link": "http://shuisman.com/?p=1814", "bloglinks": {}, "links": {}, "blogtitle": "Sander Huisman"}, {"content": ["After seeing a couple of list of photography tips, I’d like to share some of them and a couple of my own: Always shoot in RAW! Really…always! Make sure that your RAW files are saved lossless and at the highest bit-depth (10, 12, or 14 bit typically) Think then shoot, not shoot then think Know [...]"], "link": "http://shuisman.com/?p=1765", "bloglinks": {}, "links": {}, "blogtitle": "Sander Huisman"}, {"content": ["Oriental Pearl Tower, Pudong, Shanghai, China EXIF: 18mm, f/4.5, ISO 2000, 1/40 sec"], "link": "http://shuisman.com/?p=1794", "bloglinks": {}, "links": {}, "blogtitle": "Sander Huisman"}, {"content": ["In this blog post I will show you some ideas on how to plot a bifurcation diagram. I will use the well-known logistic map: x[n+1] = r*x[n]*(1-x[n]) For every r we can start with some value x(0) and calculate x(100000) by repeatedly applying the above function. Where will it end up? And how does it [...]"], "link": "http://shuisman.com/?p=1712", "bloglinks": {}, "links": {}, "blogtitle": "Sander Huisman"}, {"content": ["*click for bigger pictures*"], "link": "http://shuisman.com/?p=1742", "bloglinks": {}, "links": {}, "blogtitle": "Sander Huisman"}, {"content": ["Starting from a square we iteratively cut it in pieces and slice it sideways."], "link": "http://shuisman.com/?p=1702", "bloglinks": {}, "links": {}, "blogtitle": "Sander Huisman"}, {"content": [], "link": "http://shuisman.com/?p=1697", "bloglinks": {}, "links": {}, "blogtitle": "Sander Huisman"}, {"content": ["Following my post of nov 2010 on pasta shapes, and the sequel to that last june, now, the New York Times interviewed me regarding the pasta. Check it out. As quite a few have asked; what is the process of creating a pasta, here is a video describing the process. Based on a lemniscate, we [...]"], "link": "http://shuisman.com/?p=1603", "bloglinks": {}, "links": {}, "blogtitle": "Sander Huisman"}, {"content": ["The year has (almost) passed and therefore it is a good time to look back on the resolutions I made in the beginning of the year. SUCCESS: Travel intercontinentally France: Toulouse Germany: Göttingen Lebanon: Beirut (بيروت‎), Byblos (جبيل), Baalbek (بعلبك‎), Sidon/Saïda (صيدا‎), Tyre/Sour (صور), and many more… Poland: Warsaw The Netherlands: Leiden, Delft, The Hague [...]"], "link": "http://shuisman.com/?p=1177", "bloglinks": {}, "links": {}, "blogtitle": "Sander Huisman"}, {"content": ["I updated my travel map! Now uses the new Google Maps API Streetview can now be used Added custom markers, with custom shadow Markers sorted by latitude; overlap is better Last added location is in red Markers will now show up periodically if you zoom fully out Check it out!"], "link": "http://shuisman.com/?p=1553", "bloglinks": {}, "links": {}, "blogtitle": "Sander Huisman"}]