[{"blogurl": "http://www.sankey-diagrams.com\n", "blogroll": [], "title": "Sankey Diagrams"}, {"content": ["From a presentation on energy management held by Thomas Keller of Ecowin (available at the KNUT Hessen website ) comes the following Sankey diagram. \n\n \n\t \n \n\n The diagram is in German, but I get the main point: Energy and heat consumption in a company in MJ per hour. Fuels are natural gas (black streams) and electricity (red streams). The white boxes are the processes consuming the energy. Grey flows are transformed energy or losses. \nData seems to come from a energy management software with measuring devices installed along the production line. The company is about to obtain ISO 50001 certification. \n I have recently noticed an increased use of Sankey diagrams in ISO 50001 case studies. Hope to see more of them coming."], "link": "http://www.sankey-diagrams.com/sankey-diagram-in-energy-management/", "bloglinks": {}, "links": {"http://www.knut-hessen.de/": 1, "http://www.sankey-diagrams.com/": 1, "http://www.knut-hessen.de": 1}, "blogtitle": "Sankey Diagrams"}, {"content": ["After all these Sankey diagrams for energy flows, flows of carbon, phosphorus, and the like here is a special one for all those of you, who are coffee addicts – like me. Saman Zomorodi on his blog ‘Saman’s System, Sites and Buildings’ features a coffee flow Sankey diagram in this post . \n\n \n\t \n \n\n This is an infographic for global coffee production. Producers are on the left side, coffee consumers are on the right. The dark brown flows are for developing nations, while the milk coffee color ones are for developed nations. No quantities given in the diagram, so we don’t learn the actual absolute figures. \n However, “this allows the reader to actually see where coffee is being made and how far it actually travels to another world region. As evident in the diagram, almost all coffee is produced in the developing nations, while the majority of it is consumed in the developed nations. This relationship underscores the unproportional amount the developed world consumes, while the developing nations have to pay many hidden costs.” \n The original image is >2MB and I had to resize it with a loss in quality. Visit Saman’s blog to download a highres version of the diagram ."], "link": "http://www.sankey-diagrams.com/coffee-sankey-diagram/", "bloglinks": {}, "links": {"http://www.sankey-diagrams.com/": 1, "http://saman3230.wordpress.com/": 3}, "blogtitle": "Sankey Diagrams"}, {"content": ["Just to let you know that I have made some updates to the Sankey Software page . Added tamc/Sankey and Foreseer (how was it possible I hadn’t done this before?!), removed some outdated links, updated license cost for one or two tools and so on…"], "link": "http://www.sankey-diagrams.com/sankey-software-page-update/", "bloglinks": {}, "links": {"http://www.sankey-diagrams.com/": 1}, "blogtitle": "Sankey Diagrams"}, {"content": ["From a collection of case studies on Energy Efficiency found on the website of the Australian Department of Resources, Energy and Tourism (RET) comes the following Sankey diagram. \n\n \n\t \n \n\n This is from a synthetic rutile plant of Iluka Resources Ltd. in Western Australia. \n Iluka used the output from the energy and mass flows model to generate a Sankey diagram to represent the results in a visually effective and concise manner. The Sankey diagram illustrates where energy is supplied to the process, how it is transformed and where it leaves the process. … The width of the arrows is in proportion to the amount of energy associated with each part of the process. The Sankey diagram is an effective and intuitive way to communicate the energy flows at the plant. The diagram was used extensively during Iluka’s opportunity workshops. The diagram assisted the staff at the workshop to focus their attention on where the largest energy flows exist and identify where the main areas for improvement lie. \n Flows are in percent of the energy input. Possible improvement measures are given in the grey boxes. \n Full case study here (PDF) ."], "link": "http://www.sankey-diagrams.com/sankey-for-energy-mass-balance/", "bloglinks": {}, "links": {"http://www.gov.au/": 2, "http://www.sankey-diagrams.com/": 1}, "blogtitle": "Sankey Diagrams"}, {"content": ["Back after a short later summer break. From a French educational website talking about agricultural practice and environmental management (‘Pratiques agricoles et gestion de l’environnement’) this small distribution Sankey diagram."], "link": "http://www.sankey-diagrams.com/misc-sankey-diagrams-uncommented-0/", "bloglinks": {}, "links": {"http://www.sankey-diagrams.com/": 1, "http://raymond.free.fr/": 1}, "blogtitle": "Sankey Diagrams"}, {"content": ["This simple energy consumption diagram shows a breakdown of electric energy in a company. It is shown – along with a second Sankey diagram – on the website of German consulting firm RQH consult . \n\n \n\t \n \n\n Flows are in MWh electric energy. The largest chunk of the 9,100 MWh (per year?) is consumed by ‘Spritzguss inkl. WP und Brunnenpumpe’ (Google translate: ”Injection including WP and well pump” )"], "link": "http://www.sankey-diagrams.com/simple-energy-distribution-diagram/", "bloglinks": {}, "links": {"http://www.rquadrath.de/": 1, "http://www.sankey-diagrams.com/": 1}, "blogtitle": "Sankey Diagrams"}, {"content": ["Nice to see that more and more applications now use Sankey diagrams rather than pie charts to visualize distributions. In this case it is a widget available in the dashboard of Boundary, a real-time application performance measurment (APM) suite . \n\n \n\t \n \n\n Inbound traffic is on the left side in green, outbound traffic to the right in blue. Only the top five connected hosts by traffic are shown. Inbound and outbound traffic is about the same size, so they have the same height in the stacked part in the middle. \n Similar to the cargo traffic Sankey diagram I did here , but in this case the traffic is not traffic of physical goods…"], "link": "http://www.sankey-diagrams.com/apm-inboundoutbound-traffic-visualization/", "bloglinks": {}, "links": {"http://www.sankey-diagrams.com/": 2, "https://boundary.com/": 1, "https://boundary.zendesk.com/": 1}, "blogtitle": "Sankey Diagrams"}, {"content": ["Following up to my last post , here is another Sankey diagram for phosphorus flows. This one is by Jason Pearson, TRUTHstudio and can be found in the ‘Visualization’ section of his website . Jason is also the designer of the Economy Maps ( see this March 2012 post ). \n\n \n\t \n \n\n Jason says that “the diagram demonstrates the key point: that only 15% of the phosphorous in the US food supply chain is ingested, with the remainder ending up as waste. The diagram also shows the proportion of phosphorous used or wasted in non-food supply chains” \n This one is more colorful than the Dutch one. Flows are in kt (kilotons). It has a left-to-right orientation (the other was vertical) and is very compact with almost no space betweend the bands, almost like in a block-style diagram. As a concession to this dense style, diagonal arrows don’t maintain their width."], "link": "http://www.sankey-diagrams.com/phosphorus-flows-in-the-u-s/", "bloglinks": {}, "links": {"http://www.sankey-diagrams.com/": 3, "http://www.truthstudio.com/": 1}, "blogtitle": "Sankey Diagrams"}, {"content": ["A recent visit to an organic farm and a chat with one of the staff on peak phosphorus made me search for Sankey diagrams on phophorus flows. Managed to find two, one of which is shown below. It is from an article ‘Phosphate recovery from animal manure the possibilities in the Netherlands’ by Van Ruiten Adviesbureau / Projectbureau BMA, for CEEP (November 1998) and shows phosphorus flows in the Netherlands in 1995 in million kg-P. \n\n \n\t \n \n\n “It can be seen that 84 million kg P are imported in cattle feed alone (roughly 1/3 of the amount of P that is imported in phosphate ore). The excretion of phosphorus in animal manure is 86 million kg P according to the chart (about 197 million kg P2O5) … Moreover the figure shows that discharges of household and industrial waste water contain 10 million kg P. This is about 1/10 of the amount of P in animal manure.” \n OK, this ia black/white retro style, but nevertheless a good Sankey diagram with flows to scale. Three vertical “columns” are for actual phosphorus imports: The largest quantity is direct imports (from phosphate rock, as phopshoric acid, and other organic phosphorous). The middle import column is for phosphorus embodied in food stuffs and animal feed. The third import pathway into the Netherlands is in waterways, such as the Rhine river, but this fraction remains unused. A large quantity of phosphorus is exported again (flows branching out to the left). 77 million kg-P per year accumulate in the soil. Another interesting detail is the flow labeled “stock mutations and statistical differences” branching out to the right. \n Also see this post with a nitrogen flow Sankey diagrams from the Netherlands. \n I will dig out the other phophorus Sankey and present it here in the near future…"], "link": "http://www.sankey-diagrams.com/phosphorus-flows-in-the-netherlands/", "bloglinks": {}, "links": {"http://www.sankey-diagrams.com/": 2, "http://www.ac.uk/": 1}, "blogtitle": "Sankey Diagrams"}, {"content": ["Just a quick post with a Sankey diagram for water flows in a hotel. Apprently from a research project called Zer0-M. More images here . \n\n \n\t \n \n\n No units for the streams, so I just guess these are litres per hotel guest per day or cubic metres per day. Unicolor, no directed arrows."], "link": "http://www.sankey-diagrams.com/water-flows-for-a-hotel/", "bloglinks": {}, "links": {"http://athene.ac.at/": 1, "http://www.sankey-diagrams.com/": 1}, "blogtitle": "Sankey Diagrams"}, {"content": ["As promised in this post on U.S. 2010 Energy Flows here are some other Sankey diagrams from a July 2012 publication by Eric Shuster, NETL/DOE . These diagrams show world trade flows for coal. \n The first one features the top coal exporters and their 2010 exports of coal to the regions America, Europe and Asia. This does not include domestic production, but just export. Indonesia and Australia are clearly the main exporters. Unit is in Mio short tons. \n\n \n\t \n \n\n The other coal Sankey diagram is for U.S. coal imports and exports in 2010. Here the unit is in 1,000s of short tons, hence the two must not be directly compared. Also, the inset of the yellow arrow for domestic production in comparison to U.S. import/export is not to scale with the other flows shown on the flow map. In fact, all the blue Sankey arrows appear as a small export flow (81,716) in the yellow Sankey miniature, and all red flows on the world map are summarized as the tiny import flows (19,353). \n\n \n\t \n \n\n The U.S. is primarily using its domestic coal and still able to export the surplus. \n Stay tuned to see the world’s natural gas flows from the same publication"], "link": "http://www.sankey-diagrams.com/world-coal-flows/", "bloglinks": {}, "links": {"http://www.doe.gov/": 1, "http://www.sankey-diagrams.com/": 3}, "blogtitle": "Sankey Diagrams"}, {"content": ["Architect Ziya Buluch has a comprehensive description of his project ‘The Nest’ on his blog . The Nest is a green building which is planned to have no external primary head demand. \n Scroll down to the end to find this Sankey diagram: \n\n \n\t \n \n\n The flows represent the heat energy. Overall demand for heat 37.46 kWh per square meter per year. 12.08 kWh/m2a is from solar panels, 25.38 kWh/m2a from an air-source heat pump (whaterver that is…). \n Untypical Sankey diagram, but nevertheless interesting. Flows are not really to scale (compare the 12 kWh inflow and the 6 kWh losses outflow, which should have half the width, or to the 25 kWh inflow that should be roughly twice as wide). Unicolor grey flows with a slight gradient from left to right."], "link": "http://www.sankey-diagrams.com/green_building_nest_heat_flows/", "bloglinks": {}, "links": {"http://www.sankey-diagrams.com/": 1, "http://ziyabuluch.com/": 2}, "blogtitle": "Sankey Diagrams"}, {"content": ["Didn’t know what wind gas was until I saw this presentation on “Towards 100% renewables and beyond power: The possibility of wind to generate renewable fuels and materials” by Michael Sterner of Fraunhofer IWES institute. Page 16 has this diagram: \n\n \n\t \n \n\n The process described is actually a way of storing energy. Electricity from wind power is used to produced hydrogen and converted to methane. As such it can be stored (e.g. in gas pipelines) and is available to generate electric energy during peak hours. Efficiency is only 36%, but alternatively wind turbines would have to be cut-off if they can’t feed their power into the grid. Other storage alternatives (such as pumped storage power ) are capacity limited. \n An overall interesting presentation, access the PDF here ."], "link": "http://www.sankey-diagrams.com/wind-to-gas-sankey-diagram/", "bloglinks": {}, "links": {"http://www.uni-kassel.de/": 1, "http://www.sankey-diagrams.com/": 3}, "blogtitle": "Sankey Diagrams"}, {"content": ["Dug out a folder on the hard disk of my old computer where I had stored many Sankey diagrams. Great stuff there I had saved years ago. Problem is that at the time I didn’t label the diagrams properly, so that I am now trying to trace where I got them from. \n Here is one I like quite a bit. It is featured on p. 24 of the Alsaka Energy Plan (available on the Alaska Energy Authority (AEA) website / directly access large PDF ) \n\n \n\t \n \n\n Alaska Energy Flows for 2006 in trillion BTU. Forget about the other fuels, this state’s energy is almost entirely based on crude. And – despite being an importer of oil – AK is primarily an exporter of oil. All other energy flows really seem to be insignificant because of the dominance of oil. Losses are not shown with streams, but rather are given as text on the node."], "link": "http://www.sankey-diagrams.com/alaska-energy-flows/", "bloglinks": {}, "links": {"http://www.sankey-diagrams.com/": 1, "http://www.akenergyauthority.org/": 2}, "blogtitle": "Sankey Diagrams"}, {"content": ["A brochure on efficient use of energy in manufacturing processes in industry was published in 2004 by Bavarian environment agency (LFU). With its catchy title ‘Protect Climate – Reduce Costs’ (German: ‘Klima schützen – Kosten senken’) the brochure targets at small and medium sized companies and aims to raise conciousness about energy efficiency in different areas of a manufacturing company such as pressurized air, air condition, heating/cooling, lighting and others. \n On page 6 this Sankey diagram shows an overview of energy flows in the company… \n\n \n\t \n \n\n … and on page 7 a detailed view of a process section (extruder, corrugator, spray bath) \n\n \n\t \n \n\n The first diagram is in percent of the total energy consumption, directing the interest to the areas that contribute most to energy consumption, losses (and energy costs) in the company. In the second diagram the unit is kW. \n Thanks to the blog reader who sent in the brochure and helped out in translating from German."], "link": "http://www.sankey-diagrams.com/energy-efficiency-in-manufacturing-processes/", "bloglinks": {}, "links": {"http://www.sankey-diagrams.com/": 2, "http://www.energieverbraucher.de/": 1}, "blogtitle": "Sankey Diagrams"}]