[{"blogurl": "http://blogs.sas.com/content/sascom\n", "blogroll": [], "title": "SAS Voices"}, {"content": ["If you're the commenting type or if you just like to read a good blog discussion, click over to one of the following SAS blog posts from last week. Each of these posts has drawn in multiple comments that provide additional information you might have missed the first time you [...]"], "link": "http://feedproxy.google.com/~r/TheSascomMagazineBlog/~3/H7tvW581wdU/", "bloglinks": {}, "links": {}, "blogtitle": "SAS Voices"}, {"content": ["“We may not see it but math is everywhere around us,” says Paul T. Savarese, Technical Support Statistician at SAS. You don’t have to be a statistician to enjoy this interview, in which Savarese discusses target shooting, Jay Leno and Guinness beer – and ties it all back to the fascinating subject [...]"], "link": "http://feedproxy.google.com/~r/TheSascomMagazineBlog/~3/VCxVp8j4MPI/", "bloglinks": {}, "links": {}, "blogtitle": "SAS Voices"}, {"content": ["As you might have heard, Dr. Jim Goodnight has a passion for helping customers solve problems. I've been thinking about Dr. Goodnight's background as I read up on the trendy \"data scientist\" term and wondering whether the SAS CEO was in fact the very first data scientist. Let's review the [...]"], "link": "http://feedproxy.google.com/~r/TheSascomMagazineBlog/~3/WUuQQtIEtXI/", "bloglinks": {}, "links": {}, "blogtitle": "SAS Voices"}, {"content": ["I recently talked with the director of analytic operations at a large office supply retailer who explained that his group is often approached with broad questions that they investigate historically and descriptively to help figure out where to go next. The broad questions often lead the retailer to learn things [...]"], "link": "http://feedproxy.google.com/~r/TheSascomMagazineBlog/~3/c44-T2nqADE/", "bloglinks": {}, "links": {}, "blogtitle": "SAS Voices"}, {"content": ["Just in case you missed my earlier post about cloud fragility, we have this from the New York Times on October 22, 2012: Amazon’s data centers in Northern Virginia crashed Monday afternoon, taking with it a number of popular Web sites, from Someecards, the quirky e-card company, to mobile applications [...]"], "link": "http://feedproxy.google.com/~r/TheSascomMagazineBlog/~3/H5nHW0vpCgs/", "bloglinks": {}, "links": {}, "blogtitle": "SAS Voices"}, {"content": ["I recently had the good fortune to travel to Phoenix, AZ, for the Inc. 500|5000 Conference & Awards, the must-attend event for the nation’s leading entrepreneurs. It is just that. Talk about inspiring!  In attendance were some of the most amazing people I have ever encountered -- folks who are [...]"], "link": "http://feedproxy.google.com/~r/TheSascomMagazineBlog/~3/-I8UPehCcO8/", "bloglinks": {}, "links": {}, "blogtitle": "SAS Voices"}, {"content": ["I asked a Nuclear Engineering Professor friend of mine, after the Fukushima power plant disaster of March 2011, whether that incident would have a positive or a negative impact on his industry. His response was that it would have a short-term positive impact as a result of publicity generating a [...]"], "link": "http://feedproxy.google.com/~r/TheSascomMagazineBlog/~3/dVHPCyKI18M/", "bloglinks": {}, "links": {}, "blogtitle": "SAS Voices"}, {"content": ["SAS provides solutions that have analytics integrated into reports that deliver insight into what will happen in the future, not just report on what has happened in the past.  Who wouldn't love that? However, what makes the SAS programming environment so useful to end users is how efficient and effective [...]"], "link": "http://feedproxy.google.com/~r/TheSascomMagazineBlog/~3/G9olvAa8rUM/", "bloglinks": {}, "links": {}, "blogtitle": "SAS Voices"}, {"content": ["Or... do you need to sell a kidney to improve your test scores? Recently I spent several days working with a group of instructional technology facilitators in North Carolina. Taking a break after the first morning session, the participants could not wait to share a SchoolTube video about differentiated instruction. [...]"], "link": "http://feedproxy.google.com/~r/TheSascomMagazineBlog/~3/X75DlC2wfo4/", "bloglinks": {}, "links": {}, "blogtitle": "SAS Voices"}, {"content": ["There is no denying the value of forecasting. Ask any business – what would it give to know what the demand for its products or services will be in next three months, six months, two years? Forecasting matters for all businesses, but it is especially important for smaller and midsize [...]"], "link": "http://feedproxy.google.com/~r/TheSascomMagazineBlog/~3/G7l1zPCiKMI/", "bloglinks": {}, "links": {}, "blogtitle": "SAS Voices"}]