[{"blogurl": "http://scienceinthesands.blogspot.com\n", "blogroll": [], "title": "Science in the Sands"}, {"content": ["Dear readers, I have migrated this blog, along with other things, to my new site: http://davidketcheson.info New posts will no longer appear here on blogspot.  You can read new posts on this page: http://davidketcheson.info/noteblog.html As the name indicates, my new site includes a combination notebook and blog.  The blog will include content like what I've posted here, while the notebook will be more technical and include details of my current research.  You can subscribe to the feed for both here: http://www.davidketcheson.info/atom.xml Or you can subscribe to just the blog/just the notebook with these feeds:   http://www.davidketcheson.info/scienceinthesands.xml   http://www.davidketcheson.info/notebook.xml   There are already four new posts over there, so get on over!"], "link": "http://scienceinthesands.blogspot.com/feeds/6675795680467841596/comments/default", "bloglinks": {}, "links": {"http://www.davidketcheson.info/": 3, "http://davidketcheson.info/": 1, "http://www.davidketcheson.info": 1}, "blogtitle": "Science in the Sands"}, {"content": ["NodePy is a Python package for analyzing numerical integrators for initial value ODEs.  It's essentially a collection of all the kinds of analysis I've used in my time integrator research, collected in a single object-oriented package.   If you have a new Runge-Kutta method and want to know all about it, NodePy can tell you most anything.  If you want to design new time integration methods, NodePy can help you. Although I'm rather proud of it, it fills a very small niche in the world and I'm not aware of anyone using it outside of my group and close collaborators.  If you've used it, please let me know in the comments. One of the thorniest issues in NodePy previously was that floating-point representations of method coefficients were sometimes insufficient, especially when studying very high order methods.  I've now updated NodePy to use Sympy Rationals (and radicals, etc.) wherever possible, allowing exact analysis of many properties. That and much more awaits in NodePy version 0.4 , now available via pip."], "link": "http://scienceinthesands.blogspot.com/feeds/4578943333440602491/comments/default", "bloglinks": {}, "links": {"http://numerics.edu.sa/": 2}, "blogtitle": "Science in the Sands"}, {"content": ["Note: this post is part of  a series on habits of the open scientist .  Here I discuss the third habit, pre-publication dissemination of research .  The previous post was on reproducible research .  A personal story In 2003-2004, as a senior undergraduate, I got involved in research on strong stability preserving (SSP) Runge--Kutta (RK) methods.  I noticed a number of \"numerical coincidences\" -- certain numbers characterizing ostensibly different properties of RK methods always happened to be exactly the same.  I didn't yet have the necessary background to fully prove the conjectured connection, but after months of work, I finally succeeded in completing a partial solution to the problem, which I wrote up as my undergraduate thesis.  Before I could submit a manuscript for publication, I discovered that two other researchers had just published the full result.  Hence my manuscript was, of course, unpublishable. Occasionally, situations like this are inevitable.  But those researchers had worked out and written up the result at least a year ahead of me -- before I even began the work in earnest.  If their work had been available to me at the outset, I could have devoted my time to unanswered questions. Refereeing is slow; distribution is fast In my field (applied math), it often takes more than 1 year for a submitted paper to be published.  This is because a thorough referee process of a manuscript takes time, and I think that time is worthwhile.  In contrast, I can \"publish\" a new paper on the arXiv in just 48 hours, or on my professional website instantaneously. Many readers may not wish to see my work until it has been refereed.  But for those working on similar problems, reading my work 1 year earlier can be very useful by pointing out promising new avenues or avoiding duplication of effort. The open scientist distributes his publishable research openly before the formal refereeing and publishing process, by placing completed manuscripts on a preprint server like the arXiv. If you're brave, you can also share your grant proposals  openly.  Concerns The first time you do this, you may feel worried that someone else will 'steal' your preprint and publish it before you.  But posting it on the arXiv makes it public and stamps it with a date, so such theft would be obvious to everyone.  You may be worried that others will steal your ideas and immediately begin working on your next planned research question.  But if you're like me, the number of related research questions to pursue is essentially endless and you'd be fortunate if your efforts attract others to work on closely related topics (for the truly self-interested, note that it will increase your citation count).  Finally, in some fields or subfields, there is cultural resistance to making preprints public; you can see my take on the issue in this prior blog post .  But there are signs that it is gaining wider acceptance . If everyone began to practice this, it would effectively transform the role of journals.  They would no longer be the primary distribution apparatus; their role would be that of filtering the already-published literature .  This would make a lot more science available a lot sooner, without sacrificing the usefulness of peer review.  Next up: Habit #4 --  Open notebook science ."], "link": "http://scienceinthesands.blogspot.com/feeds/7777148585610164309/comments/default", "bloglinks": {}, "links": {"http://scienceinthesands.co.uk/": 3, "http://www.nature.com/": 1, "http://jabberwocky.weecology.org/": 1, "http://blogs.ac.uk/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["Note: this post is part of  a series on habits of the open scientist .  Here I discuss the second habit,  reproducible research .  The previous post was on  open scientific publishing .   Reproducible research   Reproducibility is part of the definition of science: if the results of your experiment cannot be replicated by different people in a different location, then you're not doing science.  Far from being a mere philosophic concern, reproducible research has been a key issue in prominent controversies like climategate  and cancer research clinical trials . Especially disconcerting is the typical irreproducibility of scientific work involving computer code:  “Computational science is facing a credibility crisis: it’s impossible to verify most of the computational results presented at conferences and in papers today.” (LeVeque, Mitchell, Stodden, CiSE 2012) Frankly, I used to find that I was often unable to reproduce  my own  computational results after a few months, because I had not maintained sufficiently detailed notes about my code and my computing environment. The open scientist ensures that the entire research compendium  -- including not only the paper but the data, source code, parameters, post-processing, and computing environment -- is made freely available, preferably in a way that facilitates its reuse by others. I won't spend more time motivating reproducible research, since others have done that much better than I could .  Instead, let me focus on the relatively easy first steps you can take to make your research more reproducible. The bare minimum: publish your code and data  If you wish to set an example of good reproducible computational research practices, I have good news for you: the bar is very low at the moment.  The reason why \"it's impossible to verify most of the computational results\" is that most researchers don't release their code and data.   The first step toward working reproducibly is simply to put the code and data that is used in your published research out in the open. If you don't want to release your code to the public, please read about  why you should  and  why you can .  Once you're convinced, go endorse the  Science Code Manifesto . Releasing your code and data can be as simple as posting a tarball on your website with a reference to the paper it pertains to.  Or you may wish to start putting all your code out in the open on Bitbucket or Github , like I do .  I don't claim that these are the best  solutions possible, but they are a big step forward from keeping everything on your own hard drive. When you release your code and data, it is important to use an appropriate license.   Victoria Stodden , a leader in the reproducible research movement, recommends the use of a permissive license like modified BSD for code and  Science Commons Database Protocol  for data.  Together with the Creative Commons BY license for media (that I mentioned in my last post ), these comprise the Reproducible Research Standard , a convenient amalgamation of licenses for open science. Be sure to include a mention of reproducibility in your paper, along with links to the code and data.  If you release your work under the RRS, I suggest using  this citation . Real benefits  The open scientist may adopt reproducible research practices for philosophical reasons, but he soon finds that they bring more direct benefits.  Because he writes code and prepares data with the expectation that it will be seen by others, the open scientist finds it much easier for himself, students, and colleagues to build on past work.  New collaborations are formed when others discover his work through openly released code and data.  And (as in the case of this paper , for example) the code itself may be the main subject of publications in journals that have come to recognize the importance  of scientific software.  Taking it further Like free and open scientific publishing, reproducible research has become a very large movement, and only a book could hope to cover it all.  Here I've merely distilled some basic practical suggestions. Openly releasing code and data is only the first step.  Open scientists may wish to adopt tools that track code provenance and ensure a fully reproducible workflow, such as Madagascar VisTrails knitr Sumatra VCR Next up: Habit #3 --  Pre-publication dissemination of research ."], "link": "http://scienceinthesands.blogspot.com/feeds/9151334296275912840/comments/default", "bloglinks": {}, "links": {"http://biostatistics.oxfordjournals.org/": 1, "http://neuralensemble.org/": 1, "http://scienceinthesands.co.uk/": 4, "http://www.nature.com/": 1, "http://numerics.edu.sa/": 1, "http://github.com/": 1, "http://www.ijclp.net/": 1, "http://github.com": 1, "http://stodden.net": 1, "http://bitbucket.org": 1, "http://creativecommons.org/": 1, "http://vcr.stanford.edu/": 1, "http://yihui.name/": 1, "http://www.reproducibility.org/": 1, "http://sciencecodemanifesto.org/": 1, "http://scicomp.stackexchange.com/": 1, "http://magazine.amstat.org/blog": 1, "http://www.vistrails.org": 1, "http://www.bloomberg.com/": 1, "http://sciencecommons.org/": 1, "http://jarrodmillman.com/": 1, "http://en.wikipedia.org/": 2, "http://dx.doi.org/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["Note: this post is part of a series on habits of the open scientist .  Here I discuss the first habit, open scientific publishing .     Why you should publish openly    A hallmark of important scientific work is that it is reused, modified, and built upon by other scientists.  As a scientist, I spend a great deal of time and effort advertising my work to others so that they will read it and use it.     By default, scientific works fall subject to copyright law, which is intended to prevent reuse and modification.  To make matters worse, the copyrights are typically held by publishers who charge a fee just for access.   Copyright makes sense for musicians and popular authors, because they make a living by charging for access to their works.  But as a scientist, I don't get paid by those who read and use my work, nor do I seek to.  So copyright does not serve me, even from a purely self-interested perspective .     Stepping back from personal interest, I believe that academic scientists have a moral imperative to freely distribute their work, for two reasons.  First, in academia science is primarily funded by taxes.  Therefore, it has been 'purchased' by the public and cannot rightly be withheld from them.  Second, and more importantly, science is intended to benefit humanity.  If it is to do so, it must be shared and communicated.  That is why it has been said that \"science must push copyright aside.\"     The  open scientist proactively ensures that published research is freely and conveniently available to all.  Ideally, the open scientist releases research under a license like Creative Commons BY that explicitly allows use in derivative works as long as attribution is given.      How you can provide free, open access to your work   Green open access (self archiving): independently of publication in a journal, the author uploads a pre-print, post-print, or final published version of the article to an institutional server, preprint server, or personal webpage.  Anyone can download this version of the article for free.  The author pays nothing and the reader pays nothing.   Gold open access : The author pays the publishing journal a fee in order to have the article available for free on the publisher's website.  Author charges typically are in the range of hundreds to thousands of dollars.   I have written elsewhere about the dangers of the gold open access model .  Suffice it to say that the gold open access approach severely limits which journals I can submit to and consumes my research funds, whereas the green model does not.   I post all my preprints on the arXiv and on my professional website before submission.  Where allowed, I post final versions as well.   Many journals still have restrictive policies that prevent green open access.  If you believe this to be the case for journals that you publish in, it's worth checking to be sure.  You can easily find this information in the Sherpa/Romeo database .  The number of publishers who still don't allow any kind of green open access are surprisingly few.  For instance, even the evil Elsevier typically allows archiving of pre- and post-prints .      Best practices: pushing copyright aside   If you are brave, you can even  modify the journal's copyright transfer agreement , to allow you to retain copyright and release your work under Creative Commons BY .  This is also (surprisingly) often accepted by publishers .  I haven't done this yet, but I plan to do so with all of my future papers, including those currently under referee.   This first habit of the open scientist is essential but no longer revolutionary.  The open access movement has really picked up speed in the past year, with many petitions and initiatives by governments and funding agencies moving forward.   Next up: Habit #2 --  Reproducible research: open code, open data ."], "link": "http://scienceinthesands.blogspot.com/feeds/7172755368704394594/comments/default", "bloglinks": {}, "links": {"http://scholars.sciencecommons.org/": 1, "http://www.ac.uk/": 3, "http://creativecommons.org/": 1, "http://arxiv.org/": 1, "http://scienceinthesands.co.uk/": 3, "http://www.nature.com/": 1, "http://numerics.edu.sa/": 1, "http://adamdsmith.wordpress.com/": 1, "http://www.co.uk/": 1, "http://access2research.org/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["Science has always been based on a fundamental culture of openness.  The scientific community rewards individuals for sharing their discoveries through perpetual attribution, and the community benefits by through the ability to build on discoveries made by individuals.  Furthermore, scientific discoveries are not generally accepted until they have been verified or reproduced independently, which requires open communication.   Historically, openness simply meant publishing one's methods and results in the scientific literature.  This enabled scientists all over the world to learn about essential advances made by their colleagues, modulo a few barriers.  One needed to have access to expensive library collections, to spend substantial time and effort searching the literature, and to wait while research conducted by other groups was refereed, published, and distributed.   Nowadays it is possible to practice a fundamentally more open kind of research -- one in which we have immediate, free, indexed, universal access to scientific discoveries.  The new vision of open science is painted in lucid tones in Michael Nielsen's Reinventing Discovery .  After reading Nielsen's book, I was hungry to begin practicing open science, but not exactly sure where to start.  Here are seven ways I'm aware of.  Each will be the subject of a longer forthcoming post.   I believe that every scientist has a moral imperative to adopt the first two:   1. Freely accessible publications .  At a minimum, make sure that everyone is allowed to read your research. 2. Reproducible research .  Release your code and data so  that anyone who wants to can verify or build directly on your work.   The remaining five are marks of a truly open scientist:   3. Pre-publication dissemination of research .  Just because peer-review and journals take time, that doesn't mean you need to embargo your audience. 4. Open collaboration through social media .  Find the person who knows that one thing you need, through new scientific networking tools -- and share your own expertise where it's needed most. 5. Live open science .  Tell people about your marvelous discoveries -- as you make them. 6. Open expository writing .  Teach others about the field you work in through a blog or online book. 7.  Open bibliographies and reviews .  Let your colleagues know what you're reading, and what you've learned from it."], "link": "http://scienceinthesands.blogspot.com/feeds/5195607085851158662/comments/default", "bloglinks": {}, "links": {"http://scienceinthesands.co.uk/": 4}, "blogtitle": "Science in the Sands"}, {"content": ["I've almost reached the point where I can laugh about it.  This is really like a paper titled \"A practical means of travelling to the moon\" which is all about finding the shortest route to Cape Kennedy."], "link": "http://scienceinthesands.blogspot.com/feeds/4599969803999511810/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Science in the Sands"}, {"content": ["In this succinct memo , an advisory council at Harvard says that major periodical subscriptions, especially to electronic journals published by historically key providers, cannot be sustained: continuing these subscriptions on their current footing is financially untenable. It recommends the following course of action to the faculty: If on the editorial board of a journal involved, determine if it can be published as open access material, or independently from publishers that practice pricing described above. If not, consider resigning. It also specifies that \"i t is untenable for contracts with at least two major providers to continue on the basis identical with past agreements.\", but doesn't mention which two. Presumably they are a subset of {Springer, Elsevier, Wiley}."], "link": "http://scienceinthesands.blogspot.com/feeds/5504113796960647401/comments/default", "bloglinks": {}, "links": {"http://isites.harvard.edu/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["<>>>> When a one-step integrator is applied to the solution of the linear scalar ODE $$u'(t) = \\lambda u(t)$$ the resulting iteration takes the simple form $$U^{n} = R(h\\lambda) U^{n-1}$$ where $U^n$ is a numerical approximation to the solution $u(t_n)$ and $R(h\\lambda)$ is called the stability function .  The details of the stability function depend on the choice of numerical method, but for any explicit Runge-Kutta method, $R(z)$ is a polynomial whose degree is at most the number of stages of the method. The stability function completely characterizes the accuracy and stability of the method when applied to linear problems.  Consider the first order linear, autonomous ODE $$u'(t) = L u(t)$$ where now $u$ is a vector and $L$ is a square matrix.  The numerical solution will be $$U^{n} = R(hL) U^{n-1}.$$ The global error satisfies a similar recurrence; in particular, it gets multiplied by a factor $R(hL)$ at each step.  Let $\\lambda$ denote any eigenvalue of $L$; then If $L$ is a normal matrix, the solution will be absolutely stable in the Euclidean norm if all values $h\\lambda$ lie within the stability region $S$, defined as $$S = \\{ z\\in\\mathbb{C} : |R(z)|\\le 1\\}.$$ Thus the region of absolute stability defines the portion of the complex plane in which a given numerical integration method may appropriately be applied. In our preprint on Runge-Kutta stability regions , Aron Ahmadia and I claim that we have an algorithm to generate a stability region appropriate for any spectrum.  By considering high-degree polynomials, we find that the resulting stability regions are tightly adapted to the shape of the imposed spectrum. While this promises to be very useful for some problems, it also has an aspect that's just fun: we can generate stability regions with unusual shapes.  I haven't explored this much yet, but a first question that we ask in the preprint is how to generate a stability region for a spectrum of eigenvalues forming a rectangle in the left half of the complex plane. Here is an example of a resulting stability region:  The gray region is the set $S$ for a certain degree-20 stability polynomial corresponding to a consistent twenty-stage Runge-Kutta method.  As one colleague told me when I showed it to him, \"this seems too good to be true; is that rectangle really the stability region?\" Indeed it is.  Zooming in on the top edge we see the detailed structure of the boundary:  Zooming in even closer:  As is typical with optimal stability polynomials, we se that the boundary is tangent or nearly tangent to the desired region at a large number of points (about 20 in this case). What other shapes can be approximated?  More on that later..."], "link": "http://scienceinthesands.blogspot.com/feeds/2593423780459904784/comments/default", "bloglinks": {}, "links": {"http://arxiv.org/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["Authorship seems to be a complicated business in science. What is required to qualify for authorship? The first time I gave my thesis advisor a draft with his name on it, he politely told me that he liked it very much but it wasn't necessary to include him as an author since the research and writing had been done by me (this even despite the fact that the original idea for the project was his). In the end, he became more closely involved in some of the work and the revision of the paper, and we agreed that he should be an author. But that experience reinforced for me the high threshold for authorship that is usually expected in mathematics. I was surprised to find that the \"accepted\" answer to this question on academia.stackexchange.com What are the requirements for a supervisor to be included as an author on a paper, as opposed to just appearing in the acknowledgements? says As a graduate student, you can expect that your advisor will appear as an author on all of your papers. He is providing your funding, your resources, and (ostensibly) is the Primary Investigator on whatever project you happen to be working on. Even if he does not contribute, you are working on his project, and he wrote the grant for it, not you. Really? I was relieved to see that the currently highest-voted answer (though by a narrow margin) states In theoretical computer science (and mathematics), it is generally considered unethical to list someone as a co-author who has not made a novel and significant intellectual contribution to the paper. In particular, merely funding the research is not considered an intellectual contribution. Adding a supervisor's name to a paper to which they have not directly, intellectually contributed is lying . Clearly, the difference in perspective is based on different understandings of what authorship means. However, it seems clear that one cannot be an author of a document that one did not write any part of. And apparently KAUST's administration agrees with me on that count; in KAUST's \"Code of Practice on Responsible Conduct of Research\", one finds the following: ...the practice of gift or honorary authorship (that is the listing as an author by virtue of their reputation or seniority, e.g. as head of the laboratory, of someone who does not qualify as an author) [is] unacceptable. And furthermore The list of authors should be limited to those researchers who have made a substantial and identifiable intellectual contribution to the research upon which a publication is based. At mathoverflow , more interesting answers are given, including this highly-voted point of view: ...as a rule the supervisor should not be a co-author in the main paper taken from a student's thesis, even if he has contributed substantially to it... and this one, which aligns with my own perspective: ...if I suggest a problem and react to discussions with a student by giving suggestions and helping with background and helping with proofs, then I will not be a co-author. If I do work by myself on the paper, doing important technical work, then I must be a co-author."], "link": "http://scienceinthesands.blogspot.com/feeds/2870248014920785021/comments/default", "bloglinks": {}, "links": {"http://mathoverflow.net/": 1, "http://academia.stackexchange.com/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["Elsevier seems to have officially declared defeat in the face of the mathematical community's growing boycott to which I am party .  So, what now?  Let's look at Elsevier's surrender in more detail.  The boycott was based on three points, which I address below in reverse order.  3. Removal of support for the Research Works Act. This is a huge victory; since Elsevier's announcement, the bill has been withdrawn .  However, they have not changed their overall position on this front: ...we will continue to join with those many other nonprofit and commercial publishers and scholarly societies that oppose repeated efforts to extend mandates through legislation.   2. Bundling of journals.  Nothing on this front: ...we will seek to address concerns about the nature and composition of the large discounted agreements, through which most Universities now access journals – but addressing the base line pricing is a necessary first step. 1. High prices of Elsevier journals. Our target is for all of our core mathematics titles to be priced at or below US$11 per article (equivalent to 50-60 cents per normal typeset page) by next year, placing us below most University presses, some societies and other commercial competitors.  Where journals are more expensive than this, we will lower our prices, as we already have in recent years for journals such as the Journal of Algebra and Topology and its Applications, among others. The largest mathematics publishers (ranked by number of journals), and average price per article, according to data from journalprices.com *: Springer $33 Elsevier $21 Wiley $35 Taylor Francis $55 World Scientific $19 Cambridge Univ. Press $20 SIAM $8 Oxford $22 International Press $17 American Mathematical Society $8 Clearly, if Elsevier were to lower the price per article of all of its mathematics journals to $11 or less, it would be one of the most economical sources of mathematics publications, trailing only our dear professional societies, SIAM and the AMS.  Unfortunately, I fear that the word core is a key detail here.  Elsevier publishes a whopping 69 mathematics journals; how many of them are considered core?  Assuming that \"core\" refers to the same 15 Elsevier journals whose archives are now open (see the list below), then the average Elsevier price per article over all mathematics journals will drop by about $2 (actually by $2.37), leaving the average at $19 -- not bad compared to its peers, but still outrageous for the minimal value added.  Of course, these numbers don't include journals like J. Comp. Phys. and CMAME that are (or were) very important to applied mathematicians.  I'm sure Elsevier is not aware that those would be of concern to mathematicians either. Looking at the list above I wonder why we are going after Elsevier and not Springer or Wiley...  0. As a bonus, we got this: ...we have made the archives of 14 core mathematics journals open, from four years after publication, back to 1995...  This means that the contents are available for free after 4 years (not after 1 year, which is the case for most other Elsevier open archives).  The letter fails to mention what the 14 \"core mathematics\" journals are, so I'll list them here (as found on  this page ): Advances in Mathematics Annals of Pure and Applied Logic Differential Geometry and its Applications European Journal of Combinatorics Finite Fields and their Applications Information and Computation Journal of Algebra Journal of Combinatorial Theory A Journal of Combinatorial Theory B Journal of Functional Analysis Journal of Number Theory Journal of Pure and Applied Algebra Linear Algebra and its Applications Stochastic Processes and their Applications Topology and its Applications Interesting -- there are actually 15!  Perhaps one of them was already open? *: Note that I've computed these averages by giving equal weight to each journal.  It would be more appropriate to weight them by number of articles, but I don't have easy access to that data."], "link": "http://scienceinthesands.blogspot.com/feeds/757381826601715277/comments/default", "bloglinks": {}, "links": {"http://www.elsevier.com/": 1, "http://scienceinthesands.blogspot.com/": 1, "http://thecostofknowledge.com/": 1, "http://journalprices.com/": 1, "http://infojustice.org/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["After some deliberating and discussion with my students and post-docs, I have signed the boycott of Elsevier at http://thecostofknowledge.com.  I encourage those reading this to do the same. I am, of course, not an editor of an Elsevier journal or of any journal.  I have published in two Elsevier journals in the past: Journal of Computational Physics and Applied Numerical Mathematics.  Both are good venues, but I have not been overwhelmed by their handling of papers in the past (they even introduced an error in one of my papers).  There are plenty of good alternatives with lower subscription prices.  Hopefully there will soon be even more. I have also refereed for both of those journals, but no longer.  For those whose low-quality papers I have been rejecting, now is your big chance.  Submit them to JCP or APNUM and you can be sure that I won't be one of your referees."], "link": "http://scienceinthesands.blogspot.com/feeds/3913674577342437884/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Science in the Sands"}, {"content": ["From the Mendeley official blog :   The most laborious part of any research paper for me, and probably for many of you, is making sure that the references are formatted in the proper style. Is the title supposed to be in italics? Do I need a period or a comma here? It has always seemed like exactly the kind of thing that a computer should be able to do for me, and now with Mendeley it can. Nice to see that they're catching up with 1985 technology .  Yet mystifying why they choose to write their own rather than adopt what is already widely used."], "link": "http://scienceinthesands.blogspot.com/feeds/2354961041950158991/comments/default", "bloglinks": {}, "links": {"http://www.mendeley.com/blog": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["When should you submit your papers to the arXiv?  Before or after they are published in a journal?  It turns out that this is a controversial question, with different right answers from different communities.  Consider the following comment from a fascinating discussion on astrobetter.com : ...you want people to be using and thinking about the “final” version of the paper, not just something they found lying around on the internet. It would feel like cheating to me to post to astro-ph before having the paper formally accepted by the journal. I do pick out several people from the reference list whose work I cite...should they read it on astro-ph instead? I’d feel like a jerk ... I will never referee a paper that has already been thrown up on astro-ph . If they have that little respect for the refereeing process, fine, let them “publish” on the web. But it doesn’t (and shouldn’t) count . IMNSHO. (emphasis added) Contrast this with the following question and answer on MathOverflow : Q: How do people usually use arxiv to put their papers? At which stage does one usually put his/her paper/report there?  A: ...it is standard to post on the arxiv as soon as one is ready to share one's work with colleagues...it is quite common to post on the arxiv at the same time as submitting, or not long prior to submitting. (But there is nothing wrong with posting on the arxiv and then spending some more time polishing your preprint before submitting it to a journal.) There are many voices on both sides of the question in both of the discussions linked above.  How can we have such different views of how to use the arXiv?  People seem to have two very different concepts of what the arXiv is.  The arXiv itself doesn't tell us what exactly it is meant to be *,  so we're left to create a definition personally or as a community.  The first attitude above seems to be based on the following definition: A. The arXiv is an official outlet for papers whose quality and correctness has been certified already.  Its purpose is to make those papers available without the need to pay a journal subscription fee. The second opinion seems to be based on a quite different definition: B. The arXiv is a one-stop outlet for the latest scientific research in my field.  Its purpose is to disseminate new information as quickly and broadly as possible so that it can then be understood, evaluated, and added to. Personally, I take viewpoint B, which I think is more common among mathematicians.  What is the arXiv for you?   *: the most relevant statement from the arXiv primer is this: arXiv supplements the traditional publication system by providing immediate dissemination and open access to scholarly articles (which often later appear in conventional journals). It is important to note, however, that arXiv is not a repository for otherwise unpublishable material, nor is it a refereed publication venue."], "link": "http://scienceinthesands.blogspot.com/feeds/7431937423549593866/comments/default", "bloglinks": {}, "links": {"http://arxiv.org/": 1, "http://mathoverflow.net/": 1, "http://www.astrobetter.com/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["I recently received the following invitation in an e-mail from mjmms@masaumnet.com: Dear  Colleague I am glad to invite you as Guest Editor of MASAUM Journal of Mathematical and Statistical Sciences for year 2012. If you are interested to join us as guest editor, please send us following information ASAP. Full Name with Title : Designation: Affiliation: City & Country: Email: Area of Interest in Research: Latest Picture (optional): You are further invited to submit you valuable work for the first issue of the journal. Submission deadline is Jan 05, 2012. Your earlier and positive response will be highly appreciated. Managing Editor MJMSS   It struck me as strange that someone would consider me so important as to qualify to be a guest editor of his journal, yet needed me to send him my name.  The reason is obvious: this message was probably spammed to thousands (or more) of my colleagues. As readers of this blog may know, publishers like this are one of my pet peeves .  So I investigated a bit.  What I found was entertaining.  The publisher's homepage is www.masaumnet.com.  There one learns that \"MASAUM Network has a good team of well repute Professors...\" but evidently cannot afford to hire someone with the ability to write a grammatically correct sentence in English.  As I expected, the publisher has an online-only, \"Open Access\" model that really means author-pay .  The cost to publish an article is not terribly high ($200), although in a bizarre twist the price depends on the number of pages (shouldn't it depend on the number of MB?)  Even more entertaining is the fact that their instructions for authors state Paper submissions are accepted only in Doc format.  Other formats will not be accepted. That alone guarantees they will not get any serious mathematics submissions. Today, I received the following highly alarming message: Dear Colleague I am glad to inform you that information about you has been added at www.masaumnet.com/ebmjmss.html . Please check and confirm information displayed about you. If correction is needed ,let us know about it. If information about you has been missing ,please send us following information about you ASAP. Full Name with Title : Designation: Affiliation: City & Country: Email: Area of Interest in Research: Latest Picture (optional): You are further invited to submit you valuable work for the first issue of the journal. Submission deadline is Jan 15, 2012. Please forward this to concerned persons. Your earlier and positive response will be highly appreciated.  shiella Nancy Chief Coordinator on the behalf of Managing Editor MJMMS At this point, I myself was a \"concerned person\"!  So I followed the link and breathed a sigh of relief when I realized that my name does not appear anywhere on the page it leads to.  I've let them know in no uncertain terms that they are not authorized to use my name."], "link": "http://scienceinthesands.blogspot.com/feeds/5553848532705693963/comments/default", "bloglinks": {}, "links": {"http://scienceinthesands.blogspot.com/": 2, "http://www.masaumnet.com/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["Read it. Sign it. Do it. http://sciencecodemanifesto.org ."], "link": "http://scienceinthesands.blogspot.com/feeds/8016859192861448892/comments/default", "bloglinks": {}, "links": {"http://sciencecodemanifesto.org/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["The much-trumpeted \"Open Access\" movement in scientific publishing promises to revolutionize scientific accessibility, so that anyone can freely obtain the latest scientific research publications.  In this brave new world, the evil profit-driven publishers no longer prey upon the scientific community and taxpayers are no longer unjustly kept from reading about the work their taxes pay for. Unfortunately, the reality of open access has become virtually synonymous with the \"author-pay\" publishing model.   In the name of making scientific publishing more open, author-pay publishing raises a whole new barrier.  Instead of requiring the reader to pay for access, the author (i.e., the scientist) now must pay to have his article published.  So we are gaining freedom of access in exchange for giving up freedom of submission.  Does that make any sense? Consider the following quote from one of the great promoters of Open Access, Michael Nielsen: Einstein’s proposals were astounding, yet his arguments were so compelling that his work was published in one of the leading physics journals of his day, and was rapidly accepted by most leading physicists. How remarkable that an outsider, a virtual unknown, could come in to challenge many of our most fundamental beliefs about how the universe works. And, in no time at all, the community of physicists essentially said, “Yeah, you’re right.” (Reinventing Discovery: The New Era of Networked Science)  The reason Einstein's ideas gained rapid acceptance is that anyone -- even a patent clerk with no grant money! -- could submit their work to a leading journal and have it refereed by the experts.  What would have happened if the Open Access movement had transformed scientific publishing before he came along? Perhaps our children will one day launch an \"Open Submission\" campaign, crying that grad students and scientists from third world countries must no longer be barred from publishing just because they can't pay.  Let's make sure they don't have to.   Open submission , always taken for granted until now, must be one of the fundamental tenets of scientific publishing. Say no to author-pay journals.  Don't submit work to them, don't referee for them, and don't serve as editors for them. There is a better road to open access.  Put all your papers on the arXiv .  Publish only in journals that allow you to post a final version on your website (or institutional server).   Addendum : The many potential evils of the author-pay model are explained in more detail in two articles published in the Notices of the AMS: http://www.ams.org/notices/201109/rtx110901294p.pdf  http://www.ams.org/notices/200803/tx080300381p.pdf"], "link": "http://scienceinthesands.blogspot.com/feeds/701564073134983229/comments/default", "bloglinks": {}, "links": {"http://arxiv.org/": 1, "http://www.ams.org/": 2}, "blogtitle": "Science in the Sands"}, {"content": ["There is a new site on stackexchange for discussing computational science ! Please come participate -- there are already some great discussions. The site is now in public beta, so you don't need an invitation. In case you don't know about stackexchange, you may also be interested in the folowing: http://math.stackexchange.com/ http://physics.stackexchange.com/"], "link": "http://scienceinthesands.blogspot.com/feeds/1813465186032471921/comments/default", "bloglinks": {}, "links": {"http://physics.stackexchange.com/": 1, "http://scicomp.stackexchange.com/": 1, "http://math.stackexchange.com/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["Up until Google's recent (catastrophic) changes to Reader , I used it to share and discuss interesting journal articles.  It was a near-perfect platform for this, and I'm hopeful that we'll have a replacement soon . The great utility of it was that my colleagues are very good at discerning which articles may be of interest to others in our circle.  This is no surprise, since we have similar research interests.  The fraction of articles that are actually interesting to me, for most journal RSS feeds that I check, is 1%-5%, which means I spend a lot of time scanning article titles.  In contrast, the fraction of papers shared by my colleagues that I find interesting is probably closer to 50%! I've found a nice way to display a public RSS feed of papers that I read*, via Mendeley (it's shown here on the right).  Now, ideally, Mendeley would allow me to publish a feed that includes all papers in my Mendeley library as I add them.  They don't, but they do something almost as good: they provide a public RSS feed showing all papers for any public Mendeley group, as they are added.  So here's what I did: 1. Create a public Mendeley group for my own library . 2. Whenever I import a new reference to Mendeley, I also add it to the group (note that you can do this via the dropdown menu in the popup that appears whenever you use the 'Import to Mendeley' bookmarklet . 3. I got the address for the feed from Mendeley (log in, click the 'Groups' tab, click 'Papers' on the left, and look for the RSS feed icon on the top right) and added a widget here on my blog, as well as on my professional webpage . That's it.  If you want to subscribe to this RSS feed, here it is: feed://www.mendeley.com/groups/1194891/david-ketcheson-s-library/feed/rss/   [*] Note that 'read' here means 'read at least the abstract.'"], "link": "http://scienceinthesands.blogspot.com/feeds/6919753392620452756/comments/default", "bloglinks": {}, "links": {"http://decafbad.com/blog": 1, "http://web.edu.sa/": 1, "http://www.mendeley.com/": 2, "http://www.mendeley.com": 1, "https://groups.google.com/": 1, "feed://www.mendeley.com/groups/1194891/david-ketcheson-s-library/feed/rss/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["I believe that the process of science—how discoveries are made—will change more in the next twenty years than it has in the past 300 years. -- Michael Nielsen, Reinventing Discovery I appreciate an author who's not afraid to make bold claims, and Michael Nielsen certainly fits that description. He goes on to say even that To historians looking back a hundred years from now, there will be two eras of science: pre-network science, and networked science. We are living in the time of transition to the second era of science. I grew up feeling that the golden age of science was the first half of the twentieth century, which gave us marvelous advances like relativity and quantum mechanics. According to Nielsen, though, I'm witnessing the most transformative period of scientific development since the invention of the scholarly journal in the 1700's. Although I'm a firm believer in the power of the internet to accelerate scientific advances, I was skeptical. I downloaded Michael Nielsen's Reinventing Discovery on Tuesday and read it in less than 48 hours (between shopping trips while on vacation in Dubai). Although I was familiar with much of the material in the book, it was an engaging and highly thought-provoking read that I think both scientists and laypersons will enjoy. I'll focus here on the ideas that struck me as especially insightful. Nielsen gives several examples to illustrate the beginnings of his foretold revolution; some are scientific ( the Polymath project , GalaxyZoo , FoldIt ) while others simply illustrate the power of our new networked world (Kasparov versus the World, Innocentive ). These examples are used extensively and lend a convincing empricism to a book that claims to predict the future. They also allow Nielsen to dive into actual science, adding to the fun. Many scientific advances are the result of combinations of knowledge from different fields, communities, or traditions that are brought together by fortuitous encounters among different people. In a well-networked world, these encounters can be made to happen by giving individuals enough accessible information and communication. Nielsen refers to this as \"designed serendipity\". The reason designed serendipity is important is because in creative work, most of us...spend much of our time blocked by problems that would be routine, if only we could find the right expert to help us. As recently as 20 years ago, finding that right expert was likely to be difficult. But, as examples such as InnoCentive and Kasparov versus the World show, we can now design systems that make it routine. Offline, it can take months to track down a new collaborator with expertise that complements your own in just the right way. But that changes when you can ask a question in an online forum and get a response ten minutes later from one of the world’s leading experts on the topic you asked about. The trouble is, of course, that the forum in question doesn't exist -- and if it did, who would have time to read all the messages? Nielsen delves into this question, discussing how to design an \"architecture of attention\" that allows individuals to focus on the bits most relevant to them, so that large groups of people can work on a single problem in a way that allows each of them to exercise his particular expertise. Taking the idea of designed serendipity to its logical yet astounding conclusion, Nielsen presents a science fiction (pun intended) portrayal of a future network that connects all researchers across disciplines to the collaborations they are most aptly suited for. I found this imaginary future world both fascinating and believable. The second part of the book explores the powers that are being unleashed as torrents of data are made accessible and analyzable. Here Nielsen draws examples from Medline, Google Flu Trends, and GalaxyZoo. While the importance of \"data science\" is already widely recognized, Nielsen expresses it nicely: Confronted by such a wealth of data, in many ways we are not so much knowledge-limited as we are question-limited...the questions you can answer are actually an emergent property of complex systems of knowledge: the number of questions you can answer grows much faster than your knowledge. In my opinion, he gets a bit carried away, suggesting that huge, complex models generated by analyzing mountains of data \"might...contain more truth than our conventional theories\" and arguing that \"in the history of science the distinction between models and explanations is blurred to the point of non-existence\", using Planck's study of thermal radiation as an example. Planck's \"model\" was trying to explain a tiny amount of data and came up with terse mathematical equations to do so. The suggestion that such a model is similar to linguistic models based on fitting terabytes (or more!) of data, and that the latter hold some kind of \"truth\" surprised me -- I suspect rather that models informed by so much data are accurate because they never need to do more than interpolate between nearby known values. Nevertheless, it was interesting to see Nielsen's different and audacious perspective well-defended. A question of more practical importance is how to get all those terabytes of data out in the open, and Nielsen brings an interesting point of view to this discussion as well, comparing the current situation to that of the pre-journal scientific era, when figures like Galileo and Newton communicated their discoveries by anagrams, in order to ensure the discoverer could claim credit later but also that his competitors couldn't read the discovery until then. The solution then was imposed top-down: wealthy patrons demanded that the discoveries they funded be published openly, which meant that one had to publish in order to get and maintain a job. The logical conclusion is that policies (from governments and granting agencies) should now be used to urge researchers to release their data and code publicly. Employment decisions should give preference to researchers who follow this approach. At present, the current of incentives rather discourages such \"open science\", but like Nielsen I am hopeful that the tide will soon turn. I was left pondering what I could do to help; Nielsen provides numerous suggestions. I'll conclude with some of the most relevant for computational scientists like myself. ...a lot of scientific knowledge is far better expressed as code than in the form of a scientific paper. But today, that knowledge often either remains hidden, or else is shoehorned into papers, because there’s no incentive to do otherwise. But if we got a citation-measurement-reward cycle going for code, then writing and sharing code would start to help rather than hurt scientists’ careers. This would have many positive consequences, but it would have one particularly crucial consequence: it would give scientists a strong motivation to create new tools for doing science. ... Work in cahoots with your scientist programmer friends to establish shared norms for citation, and for sharing of code. And then work together to gradually ratchet up the pressure on other scientists to follow those norms. Don’t just promote your own work, but also insist more broadly on the value of code as a scientific contribution in its own right, every bit as valuable as more traditional forms."], "link": "http://scienceinthesands.blogspot.com/feeds/4669277818448985711/comments/default", "bloglinks": {}, "links": {"http://polymathprojects.org/": 1, "http://michaelnielsen.org/blog": 1, "http://zoo1.galaxyzoo.org/": 1, "http://www.innocentive.com/": 1, "http://www.amazon.com/": 1, "http://fold.it/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["I often feel that the deluge of mathematical publications, fueled by the ever-increasing number of researchers and mounting pressure to publish, threatens to overwhelm my ability to keep up with advances.  I don't think this is peculiar to applied mathematics.  No matter how adept you are at sifting the chaff and finding the most relevant work in your field , you won't possibly have time to read every paper that is germane to your research, let alone those of tangential interest that might provide new research avenues.  For my part, although I take time to read new papers every week, I've resigned myself to the fact that I won't see more than the abstract of most of the papers I'd like to read, because I need to conduct new research, teach, write, and so forth. Reading and digesting a mathematical paper takes time and concentration.  Nevertheless, I find that perhaps 80% of the value I get out of reading most papers can be summed up in a paragraph or two that is easy to read and understand.  We all have practice producing those terse paragraphs because we regularly referee papers and provide a concise summary for the editor.  This summary includes things like \"what's really new in this work\" or \"how this relates to previous work\", as well as an evaluation of its merit.  Unfortunately, those referee reports are kept secret and unavailable to our colleagues.  I mentally create a similar report for most papers that I read in depth, although I don't usually write my evaluation down and I certainly don't send it to anyone.  What if every reader of a paper had access to the summaries and evaluations made by all the other readers?  I think we could all learn a lot more, a lot faster, about what our colleagues are accomplishing. Recently, Fields medalist Timothy Gowers proposed an approach to accomplishing just that. The idea is to bring the functionality of StackOverflow to the arXiv , creating a place where everyone can publish and everyone can openly referee or comment.  The StackOverflow system of reputation and up-/down-voting would be used to help the best papers and best comments float to the top.  As Gowers admits, there are plenty of obstacles, but I'm hopeful that people with his level of clout in the mathematical community could really bring this to pass.  His interest seems mostly based on issues with the current journal publication system , but I see it primarily as a way to \"collaboratively read\" the literature.  Indeed, it might be best if the site had no implications for decisions on hiring or tenure, to avoid any motivation to game the system.  The site would also be a great place for expository writing that can't be published in a journal . It's encouraging to see that some things are already moving in this direction.  A new website named PaperCritic has just been launched to accomplish something roughly along these lines.  It doesn't involve the StackOverflow system, but has Mendeley integration and allows you to post a public review of any paper.  Meanwhile, an increasing number of scientists are including paper reviews in their blog posts -- something I would like to do here. I think Mendeley could accomplish something useful in this direction if they would give users the option to make their library and notes public .  Then when I find a paper on Mendeley that says \"20 Readers\", I could find out who they are, see what they've written about that paper, and see what else they're reading. Note: I know that we already have Mathematical Reviews , but in my opinion it doesn't accomplish the goals mentioned above, mainly because the reviewer of a paper is often not sufficiently knowledgeable about the paper to say anything more insightful than what's in the abstract.  I find that Mathematical Reviews gives me papers to review that I would never have read otherwise.  What I'd like to see are reviews from the people who read the paper because it's germane to their own work. I discovered while writing this post that there was until very recently a successful site of this kind used by quantum computing researchers called scirate.com .  Perhaps we should focus on helping this guy get the site back up and start using it for math too. Edit: Another brand-new open review system:  http://open-review.org/"], "link": "http://scienceinthesands.blogspot.com/feeds/6547752784467405465/comments/default", "bloglinks": {}, "links": {"http://gowers.wordpress.com/": 1, "http://scienceinthesands.blogspot.com/": 1, "http://www.ams.org/": 1, "https://github.com/": 1, "http://www.mendeley.com": 1, "http://stackoverflow.com/": 1, "http://agtb.wordpress.com/": 1, "http://arxiv.org/": 1, "http://open-review.org/": 1, "http://feedback.mendeley.com/": 1, "http://www.papercritic.com": 1, "http://www.scirate.com/": 1, "http://terrytao.wordpress.com/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["I have both my personal and professional e-mail forwarded to a single Gmail account for convenience. One complication this causes is the need to use different signatures for correspondence from a single account. In the past, I've used the Blank Canvas Gmail Signatures extension in Firefox, but that has two drawbacks: 1. It has to be installed and the signatures configured separately on each computer I use. 2. It only works in Firefox. Credit goes to an entry at thenextweb.com for pointing out a better way.  Just use the Gmail labs feature \"canned responses\".   Save each of your signatures as a canned response, and then you can add it automatically when composing messages.  This works in every browser and only needs to be set up once.  Contrary to what it says on thenextweb.com, you can include html in your signatures when using this method. Something to watch out for: canned responses are actually saved as messages in your drafts folder.  They are hidden in the usual Gmail web view, but are visible in basic HTML mode or if you access mail through your phone.  Don't delete them."], "link": "http://scienceinthesands.blogspot.com/feeds/6067186282478473969/comments/default", "bloglinks": {}, "links": {"http://thenextweb.com/": 1}, "blogtitle": "Science in the Sands"}, {"content": ["As an academic, it's a good idea to maintain a professional website with a list of your publications .  Ideally, this list should include links to where visitors can download the papers (PDFs) and any related code .  In my case, I also maintain a website for my research group that has another publication list. Of course, you need to maintain local reference files with the citation info for your publications (for inclusion in later publications), as well as your CV. Maintaining all these separate lists can become very tedious, which is probably why most academics' sites are usually out-of-date.  Here's how I automate much of it: I use Bibtex . This allows automatic generation of bibliographies for papers and for my CV.  And it's the basis for generating HTML bibliographies, as outlined below. I use Mendeley . Mendeley allows me to create separate bibliographic lists (e.g., for my own publications and for those of my research group) and export them as bibtex files , using the desktop app.  It's also possible to get a bibtex file of your Mendeley publications directly on-line through BibBase .  You can even display a list of your publications on-line automatically using Mendeley, but it's not very customizable; for instance, they appear in alphabetical, rather than chronological order. I would use BibBase to automatically display an updated bibliography if my institutional server ran PHP or CGI scripts, but no luck there. My less-automatic solution is simple Python scripts that generate CSS-friendly HTML.  The scripts use the Python module bibliograph to parse bibtex entries.  I could instead use bibtex2html .  I like my solution better because the customization is all done using CSS rather than Python, so I can change the look without re-generating the HTML.  Of course, bibtex2html is a more polished and flexible tool than my 30-line script. Here's a CSS snippet that's used for this publication list : #pub {padding: 5px; border-width: 2px; border-style: none; background-color: #eee4b5; font-size: 1.2em; margin-top: 20px; margin-bottom: 20px;} #pub a{font-weight: bold; color: #09434e;} #pub name{font-weight: bold; color: #09434e;} #pub journal{font-style: italic;}   The workflow for adding a new paper to an html bibliography is: Add the paper in Mendeley. Export bibtex from Mendeley. Run Python scripts. Paste resulting HTML into the appropriate file. Again, it would be simpler if I could use Bibbase (cutting out steps 2-4).  It's still fairly painless, and it's easy to generate new bibilographic lists or customize the look of existing ones."], "link": "http://scienceinthesands.blogspot.com/feeds/6191171778887335934/comments/default", "bloglinks": {}, "links": {"http://www.bibbase.org/": 2, "http://web.edu.sa/": 2, "http://www.bibbase.org": 1, "http://www.mendeley.com": 1, "http://www.bibtex.org/": 1, "http://bibbase.org/": 1, "https://encrypted.google.com/": 1, "https://github.com/": 1, "http://www.mendeley.com/blog": 2, "http://numerics.edu.sa": 1, "http://numerics.edu.sa/": 2, "http://sciencecodemanifesto.org": 1}, "blogtitle": "Science in the Sands"}, {"content": ["Many of the fundamental skills of a scientist are seldom taught. Instead, one is expected to pick them up through intuition, informal conversations, or trial-and-error. One of these essential skills is how to search the literature for journal articles related to a particular topic. This is a challenging task with severe consequences for failure. Just ask any Ph.D. student who discovered that his thesis was focused on a problem that had already been solved. Or anybody who left grad school because of the overwhelming task of grasping and keeping up with the scientific literature related to his thesis topic.   Why The purpose of a literature search is not merely to become aware of what results are already known. Rather, a good literature search provides a map of the scientific terrain, indicating the general layout of a research area:   What are the main goals of research in this area? What kind of advances are considered significant, and why? What are the recognized open questions, and what impact would their answers have? What other research areas are most closely connected to this one? Are there other research areas with connections to this one that have not been recognized? How is this research area viewed by those who focus on related, competing topics? How With these goals in mind, how does one conduct an effective literature search? Here are some techniques that have served me well: Ask for help . You have a network of collaborators (or at least an advisor!) who each know some part of the literature much better than you. If you're starting research in a new topic where they have expertise, ask them for the most significant work on that topic. Ask their opinion of new papers that seem significant to you. Ask them for the right keywords, authors, and review articles to start with. Because they can make connections that a search engine never would, they are your most valuable resource. Use Google Scholar . Yes, there are countless databases and search tools out there for looking at a articles from a particular discipline or publisher. But I have yet to find one as effective as Scholar. I'm convinced that its coverage is much broader than any of the commercial academic databases available. For instance, few other databases cover the ArXiv , which is an essential source in some fields. Link forward through the literature . Every paper has a list of references to the works that it cites. But since you're mostly interested in learning about the state-of-the-art, it's usually more helpful to obtain a list of papers that cite the one you have. This is another major advantage of Google Scholar, which allows you to do so easily. Each search result includes a link to a list of all the articles that cite it. Learn how to do effective keyword searches. This skill has become incredibly valuable in the internet age, and nowhere more so than in searching for journal articles. When learning about a new topic, it can be hard to know which keywords to search for, and you should ask for help (see above). Once you know the right words, it can be very important whether search for A and B, A or B, A since year X, B authored by Y, and so forth. Learn how to refine your searches in this way. Learn to rapidly evaluate article titles and abstracts . You can't hope to read all the articles, or even all the abstracts published in your field. Your ability to find the most relevant ones is directly proportional to how quickly you can eliminate the irrelevant. I'm convinced that this skill can only be obtained by experience, but you can accelerate it by noticing articles that you thought would be useful but turned out not to be, as well as becoming aware of who the key authors are in an area. Check for articles in review journals . Most fields have some journals that publish only review articles. Such articles provide a broad overview of a topic along with a detailed bibliography; they are invaluable when starting research on a new topic. In my field, the most relevant are Acta Numerica and SIAM Review. Review articles tend to rank high in search engines because they are heavily cited, but it can be worth searching for them specifically or even browsing review journals that publish a low volume (like the two just mentioned). Check the websites of key authors. You can often find their preprints there long before the published article becomes available. Of course, you don't have time to do this on a large scale, so you have to be selective. I'm planning a future post that will discuss what to do with all the relevant and significant articles you find."], "link": "http://scienceinthesands.blogspot.com/feeds/701775363835826664/comments/default", "bloglinks": {}, "links": {"http://scholar.google.com": 1, "http://www.arxiv.org": 1}, "blogtitle": "Science in the Sands"}, {"content": ["The modern scientific method goes something like this: Obtain grants to fund your research. Conduct research. Write up results of your research. Submit your written work to a scientific journal. Sign a copyright transfer giving up all rights to your work. The last step may sound crazy if you're not an academic, but we usually don't think twice about it. After all, the publisher you're giving the rights to would always give you access to your own work if you needed it. Right? Wrong. The following letter from Dianne O'leary, Professor of Computer Science at the University of Maryland, is reproduced here with permission. From: Dianne O'Leary Date: Tue, 11 Oct 2011 13:42:18 -0400 Subject: Rejected Springer reprint request On September 9, I wrote to Springer asking for a pdf file of one of my papers: http://dx.doi.org/10.1023/A:1016614603137 Wang and O'Leary, Adaptive use of iterative methods in predictor-corrector interior point methods for linear programming Numerical Algorithms, 25 (2000) 387-406. It took until October 8 for them to answer my request, and they decided that I was not entitled to the pdf file of my own paper. This doesn't seem to be the way to maintain the good will of the community. They might have the legal right to make this decision, but it seems to me that it is bad logic and bad business, since they rely on us to provide, without financial compensation, the content for their journals and the refereeing of other manuscripts. My university does not subscribe to this journal -- too expensive -- so I was wondering if anyone had an idea of how I can obtain this pdf file. Thanks much. Dianne O'Leary One more reason to be careful about the journals you submit to. SIAM , for instance, allows the author not only unlimited use for personal purposes, but also to post the final version of the article on his/her institutional webpage. By the way, Prof. O'Leary now has over 200 copies of her article -- so there's no need to indundate her inbox with more. And apparently someone from Springer has now (on Oct. 19) given in and provided her official access to her article. Update from Prof. O'leary on Nov. 1:        In response to my posting of trouble getting a pdf file of one of my Springer-published papers, I received over 200 messages of support and advice. It is a great community! M.J.D. (Mike) Powell was inspired to contact Springer, and in response, I very promptly received the pdf file (which I have learned that Springer is willing to supply to every author) and legal permission to post it on my website (which Springer does not ordinarily give). This gives me exactly what I wanted, and I am grateful. I had sent my original request to Springer from the website of the article, clicking the \"permissions and reprints\" button at http://www.springerlink.com/content/p158q2276n7u0173/ . Apparently, this gives the wrong outcome if you are the author. The people who processed my request did not forward it to the appropriate person, the editor, found using the \"contact\" button on the journal's homepage. A week after my posting, Claude Brezinski, editor-in-chief of Numerical Algorithms, wrote me saying that my message might be interpreted as criticism of him and the editorial board of the journal. I meant no such criticism. Elizabeth Loew of Springer has been very helpful in trying to solve the problems and clarify the issues. It is in the current Springer copyright agreement that authors cannot post the journal pdf files to their own websites. Authors are allowed to email the pdf to colleagues. As Steve Vavasis noted last week, authors who care about making their articles more available need to look into mechanisms such as the SPARC copyright addendum: http://www.arl.org/sparc/author/addendum.shtml See also the SHERPA/RoMEO site that provides the copyright policy for many journals: http://www.sherpa.ac.uk/romeo"], "link": "http://scienceinthesands.blogspot.com/feeds/9222803601460896634/comments/default", "bloglinks": {}, "links": {"http://www.siam.org/": 1, "http://www.ac.uk/": 1, "http://www.arl.org/": 1, "http://www.springerlink.com/": 1, "http://dx.doi.org/": 1}, "blogtitle": "Science in the Sands"}]