[{"blogurl": "http://scienceandreason.blogspot.com\n", "blogroll": [], "title": "Science and Reason"}, {"content": ["Hubble Portrays a Dusty Spiral Galaxy (9/28/12) Located about 55 million light-years from the sun and spanning about eighty thousand light-years, NGC 4183 is a little smaller than the Milky Way. This galaxy, which belongs to the Ursa Major Group, lies in the northern constellation of Canes Venatici (The Hunting Dogs). NGC 4183 is a spiral galaxy with a faint core and an open spiral structure. Unfortunately, this galaxy is viewed edge-on from the Earth, and we cannot fully appreciate its spiral arms. But we can admire its galactic disk. The disks of galaxies are mainly composed of gas, dust and stars. There is evidence of dust over the galactic plane, visible as dark intricate filaments that block the visible light from the core of the galaxy. In addition, recent studies suggest that this galaxy may have a bar structure. Galactic bars are thought to act as a mechanism that channels gas from the spiral arms to the center, enhancing star formation, which is typically more pronounced in the spiral arms than in the bulge of the galaxy.  NGC 4183 – click for 1280×1027 image"], "link": "http://scienceandreason.blogspot.com/feeds/1680312370011729967/comments/default", "bloglinks": {}, "links": {"http://www.nasa.gov/": 2}, "blogtitle": "Science and Reason"}, {"content": ["M101: A Pinwheel in Many Colors (5/24/12) This image of the Pinwheel Galaxy, or also known as M101, combines data in the infrared, visible, ultraviolet and X-rays from four of NASA's space-based telescopes. This multi-spectral view shows that both young and old stars are evenly distributed along M101's tightly-wound spiral arms. Such composite images allow astronomers to see how features in one part of the spectrum match up with those seen in other parts. It is like seeing with a regular camera, an ultraviolet camera, night-vision goggles and X-ray vision, all at the same time. The Pinwheel Galaxy is in the constellation of Ursa Major (also known as the Big Dipper). It is about 70% larger than our own Milky Way Galaxy, with a diameter of about 170,000 light years, and sits at a distance of 21 million light years from Earth.   M101 – click for 1200×1200 image"], "link": "http://scienceandreason.blogspot.com/feeds/3491565723110579144/comments/default", "bloglinks": {}, "links": {"http://chandra.harvard.edu/": 2}, "blogtitle": "Science and Reason"}, {"content": ["A Spiral Within a Spiral (5/21/12) The NASA/ESA Hubble Space Telescope captured this image of the spiral galaxy known as ESO 498-G5. One interesting feature of this galaxy is that its spiral arms wind all the way into the centre, so that ESO 498-G5's core looks like a bit like a miniature spiral galaxy. This sort of structure is in contrast to the elliptical star-filled centres (or bulges) of many other spiral galaxies, which instead appear as glowing masses, as in the case of NGC 6384.  ESO 498-G5 – click for 1280×669 image"], "link": "http://scienceandreason.blogspot.com/feeds/5697442514760960982/comments/default", "bloglinks": {}, "links": {"http://www.spacetelescope.org/": 2}, "blogtitle": "Science and Reason"}, {"content": ["A galaxy blooming with new stars (12/15/11) The VLT Survey Telescope (VST) has captured the beauty of the nearby spiral galaxy NGC 253. The new portrait is probably the most detailed wide-field view of this object and its surroundings ever taken. It demonstrates that the VST, the newest telescope at ESO's Paranal Observatory, provides broad views of the sky while also offering impressive image sharpness. NGC 253 gleams about eleven and a half million light-years away in the southern constellation of Sculptor. It is often just called the Sculptor Galaxy, although other descriptive names include the Silver Coin or Silver Dollar Galaxy. It is easy to get a good look at NGC 253 through binoculars as it is one of the brightest galaxies in the sky after the Milky Way's closest, big galactic neighbour, the Andromeda Galaxy. Astronomers have noted the widespread active star formation in NGC 253 and labelled it a \"starburst\" galaxy. The many bright clumps dotting the galaxy are stellar nurseries where hot young stars have just ignited. The radiation streaming from these giant blue-white babies makes the surrounding hydrogen gas clouds glow brightly (green in this image).  NGC 253 – click for 1280×1012 image More: here"], "link": "http://scienceandreason.blogspot.com/feeds/8766467390731882054/comments/default", "bloglinks": {}, "links": {"http://www.eso.org/": 2, "http://www.space.com/": 1}, "blogtitle": "Science and Reason"}, {"content": ["There was some very important news recently about neutrino oscillation , which I wrote about here . Rather than go into the details there, it seemed better to put them in a separate article, and this is it. To recap, neutrinos are leptons , and like the better known leptons (electrons, muons, taus), neutrinos occur in three generations . The main characteristic that distinguishes the different generations of leptons is the quantum state called \" flavor \". Flavor is a quantum number that can, in principle, be measured. A neutrino is not necessarily in just a single flavor state; it can be in a quantum superposition of pure states . Every neutrino also has a corresponding antineutrino of the same flavor, and almost everything to be said here applies equally to antineutrinos. (It isn't entirely clear whether neutrinos and antineutrinos are actually distinct, or whether this parity can mutate into its opposite, but that's a whole other topic.) The flavor associated with a neutrino in a pure state is named after the corresponding lepton occurring in a particle interaction that creates or destroys the neutrino. Thus there are electron neutrinos, muon neutrinos, and tau neutrinos (denoted by ν e , ν μ , ν τ , respectively). Neutrinos are created or destroyed only in particle interactions governed by the weak force – neutrinos do not feel the strong force at all. And since all neutrinos have no electrical charge, they do not feel the electromagnetic force either. However, as will be noted later, neutrinos have nonzero mass, so they feel gravitational force. For example, the decay of a free neutron (n → p + e - + ̅ν e ), creates a proton, an electron, and an electron antineutrino. This process is known as beta decay , since the electrons that come out used to be called \"beta rays\". The reverse process, inverse beta decay (̅ν e + p → e + + n), destroys an electron antineutrino, and can be used to detect antineutrinos indirectly by observing the positron that results. (The positron causes Cherenkov radiation in a liquid medium.) However, since neutrinos almost never interact with other particles, this reaction is very rare. It's estimated that a neutrino would have to pass through several light-years of solid lead in order to have a 50% chance of interaction with a lead atom. So hardly any neutrinos register in detectors, but fortunately there are so many of them that detection is possible. Electron antineutrinos are produced in copious quantities in nuclear reactors, because of beta decay and other nuclear reactions that yield the energy from a nuclear reactor. They are also produced in abundance from the nuclear reactions that power the Sun and most other stars. Indeed, attempts to measure the neutrino flux from the Sun are what first brought attention to the phenomenon of oscillation. The size of this flux was simply too small to account for the known energy output of the Sun. This discrepancy was known as the Solar neutrino problem . The problem was definitively resolved only just over a decade ago, when it was shown that the discrepancy was real, not simply an artifact of some inadequacy of detectors. The same discrepancy appeared in many quite different types of experiments, and a theory of neutrino oscillation that had already been worked out was able to account for the discrepancies. In a nutshell, flavor is a quantum number, so it is only known when it is observed. The weird thing is that what is measured may change every time it is observed, because flavor is not a conserved quantum number in weak force interactions. There is some probability of observing any of the three possible flavor states in any measurement. This is another way of saying that actual neutrinos are in a superposition – a mixing – of flavor states. The probability of observing a particular state also fluctuates over time. Since some antineutrinos that originated with electron flavor have another flavor when they pass through a detector, they can no longer interact in a way the detector is able to register, so they appear to be missing. Discrepancies were also noted in trying to count neutrinos originating from other sources, such as neutrinos produced in nuclear reactors. This problem affects all three neutrino flavors. Muon neutrinos are produced in muon decays , which affect muons produced naturally in the atmosphere by cosmic rays. Muons created in particle accelerators also produce muon neutrinos when they decay. Experiments that detect only muon neutrinos also find discrepancies. But what drives this oscillation? To better understand that, it's necessary to consider the other thing that distinguishes particles, including neutrinos, of the three different generations, namely mass. The Standard Model originally assumed neutrino mass was zero, but this isn't required, and the theory can be modified to allow neutrino mass. However, neutrino mass is extremely difficult to measure, because neutrinos react so infrequently with other particles. So mass measurements have to be made indirectly. Further, experiments to date have been unable to do more than place rather loose upper and lower limits on possible masses. As it turns out, though, neutrino oscillation studies do indicate the differences in the square of the value of mass for different mass states. Of course, neutrinos were hypothesized in the first place, by Wolfgang Pauli , in order to account for conservation of energy, momentum, and angular momentum in particle interactions like neutron decay. But if neutrinos travel at the speed of light, like photons, they could be massless and still possess energy and momentum. It's quite possible for neutrinos to have rather high energy (MeV range and above), even though they have very little rest mass, because they are found to travel at very close to the speed of light. (But almost certainly not at or above the speed of light .) Astrophysics provides some very rough indirect mass estimates. A crude estimation of neutrino mass can be deduced from the estimated amount of non-baryonic dark matter in the universe (about 26% of the universe's total mass-energy content). Conditions in the very early universe fixed the total number density of all 3 flavors of neutrinos at 3/11 the number density of cosmic microwave background photons. From that it can be estimated that even if all non-baryonic dark matter were in the form of neutrinos, the average neutrino mass could be at most ~4 eV. Since it seems likely that neutrinos actually make up at most a few percent of dark matter, an average mass limit of < 0.3 eV seems quite likely. For comparison, the rest mass of an electron of 511 KeV – a difference of at least 6 orders of magnitude. Gravitational lensing data from studies of galaxy clusters has provided a second estimate for the average mass limit – 1.5 eV. Muon and tau neutrinos should be far rarer than electron neutrinos, so the average mass will be strongly dominated by electron neutrinos. Muon and tau neutrinos could be much more massive without affecting the average significantly. A third even looser estimate, specifically for electron antineutrinos, comes from observations of Supernova 1987a . 24 electron antineutrinos were detected in association with that event. Although they were detected about 3 hours before the first visible light, this is explained by supernova models, which indicate that neutrinos will be emitted before most photons, since the neutrinos hardly interact with collapsing stellar material in the supernova, while photons interact strongly. Allowing for that, the time of flight for neutrinos from the supernova, which occurred at a distance of ~168,000 light years, indicates a velocity just enough less than the speed of light that the mass could be at most 16 eV. Experiments to measure neutrino mass directly take extended periods of time, due to the slow rate of detection, so all that can actually be observed is the time average of mass, when appropriate probabilities of each state are included. One relatively early measurement, the Mainz experiment of 1999, gave the expected value of mass of electron antineutrinos from beta decay as at most 2.2 eV, at the 95% confidence level. Discussing \"the\" mass of a neutrino at all is somewhat problematical, since mass is a quantum state, just like flavor is. So a neutrino is in a superposition of mass states before it is observed. There are three possible mass states, associated with each of the three neutrino generations, but they do not correspond directly to the flavor states. Instead, flavor states are related to mass states by a unitary matrix – the Pontecorvo–Maki–Nakagawa–Sakata (PMNS) matrix. In the simple case in which there are 3 flavor states and 3 mass states there are 4 parameters that determine the matrix entries: three \"mixing angles\" (θ 12 , θ 13 , θ 23 ), and a fourth parameter (δ) that is nonzero only if neutrino oscillation violates CP symmetry (i. e. there is a difference in the behavior of neutrinos and antineutrinos). (The θ parameters are described as \"angles\" because they occur as arguments of trigonometric functions.) So far, fairly precise values have been determined for the three mixing angles (θ 13 most recently ). (In case neutrinos are Majorana particles , i. e. their own antiparticles, or there's even more weirdness, such as sterile neutrinos , the matrix is more complicated.) There's one additional complication for observing a specific mass state when a measurement is done. Quantum mechanics describes quantum particles as waves of a certain frequency. This frequency is related to particle mass, because special relativity relates mass to energy by E=mc 2 , and energy is related to frequency by E=hν, where ν is frequency and h is Planck's constant . So mc 2 =hν, and if mass can vary from one observation to another, so can frequency. The net result is that different mass states propagate at different speeds, and the PMNS relation transfers this effect to flavor states. Interference between waves for different flavor states is the basic cause of neutrino oscillation. So the probabilities associated with observation of specific flavor states depend in a complicated way on the mass differences between the specific mass states, as well as a particle's energy and the distance it has traveled since creation. For example, consider the probability that when the flavor of an electron antineutrino is observed after it has traveled a distance of L (meters) from its source. The probability that the particle will oscillate and not have electron flavor when observed works out to be approximately P ≈ sin 2 (2θ 13 ) sin 2 (1.267Δm 2 31 L/E) Here θ 13 is one of the three parameters that describe neutrino oscillation, Δm 2 31 is the difference in squared mass between the first and third mass state, and E is the neutrino energy (in MeV). Analogous formulas apply to oscillation of muon and tau neutrinos. Several things can be noted from this formula. Immediately after the particle is created, at L=0, the probability is 0 that its flavor has changed (because of the second sin 2 factor). The probability varies with the distance that a neutrino travels, fluctuating periodically as L increases. It reaches a maximum every time L is such that the second factor is 1. The first factor determines what the maximum of the probability can be, and it will be nonzero if θ 13 is. So θ 13 ≠ 0 is necessary for oscillation to occur. It's also sufficient, as long as Δm 2 31 ≠ 0. The are three possible differences of squares of mass states, but only two are independent, since, for instance, Δm 2 31 = Δm 2 32 + Δm 2 21 . These differences have been measured fairly precisely: Δm 2 32 ≈ 2.32×10 -3 (eV) 2 , Δm 2 21 ≈ 7.59×10 -5 (eV) 2 . These results don't tell a lot about the actual sizes of the mass states, except that they are all nonzero. Consequently all neutrino types experience oscillation, provided all the mixing angles are also nonzero too. In addition, there must be at least one mass state as large as √2.32×10 -3 ≈ 0.048 eV. As for the mixing angles, sin 2 (2θ 13 ) was just measured with decent precision to be about 0.092, and so θ 13 ≈ 8.8°. Earlier measurements didn't determine θ 13 to be nonzero with high significance, but the new result does, at 5.2σ. Previous measurements found sin 2 (2θ 12 ) ≈ 0.861 and sin 2 (2θ 23 ) ≈ 0.97, with corresponding angles 34.1° and 40.0°."], "link": "http://scienceandreason.blogspot.com/feeds/1298893243252045811/comments/default", "bloglinks": {}, "links": {"http://www.nature.com/": 2, "http://arxiv.org/": 1, "http://scienceandreason3.wordpress.com/": 1, "http://en.wikipedia.org/": 27, "http://www.uni-mainz.de/": 1, "http://news.sciencemag.org/": 1}, "blogtitle": "Science and Reason"}, {"content": ["Classic Portrait of a Barred Spiral Galaxy (2/3/12) The NASA/ESA Hubble Space Telescope has taken a picture of the barred spiral galaxy NGC 1073, which is found in the constellation of Cetus (The Sea Monster). Our own galaxy, the Milky Way, is a similar barred spiral, and the study of galaxies such as NGC 1073 helps astronomers learn more about our celestial home. Most spiral galaxies in the Universe have a bar structure in their centre, and Hubble’s image of NGC 1073 offers a particularly clear view of one of these. Galaxies’ star-filled bars are thought to emerge as gravitational density waves funnel gas toward the galactic centre, supplying the material to create new stars. The transport of gas can also feed the supermassive black holes that lurk in the centres of almost every galaxy. Some astronomers have suggested that the formation of a central bar-like structure might signal a spiral galaxy's passage from intense star-formation into adulthood, as the bars turn up more often in galaxies full of older, red stars than younger, blue stars. This storyline would also account for the observation that in the early Universe, only around a fifth of spiral galaxies contained bars, while more than two thirds do in the more modern cosmos.  NGC 1073 – click for 1280×1008 image More: here , here , here , here , here"], "link": "http://scienceandreason.blogspot.com/feeds/9215383986795642654/comments/default", "bloglinks": {}, "links": {"http://www.universetoday.com/": 1, "http://www.csmonitor.com/": 1, "http://www.space.com/": 1, "http://www.co.uk/": 2, "http://www.spacetelescope.org/": 2}, "blogtitle": "Science and Reason"}, {"content": ["A Galaxy Full of Surprises — NGC 3621 is bulgeless but has three central black holes  This image, from ESO’s Very Large Telescope (VLT), shows a truly remarkable galaxy known as NGC 3621. To begin with, it is a pure-disc galaxy. Like other spirals, it has a flat disc permeated by dark lanes of material and with prominent spiral arms where young stars are forming in clusters (the blue dots seen in the image). But while most spiral galaxies have a central bulge — a large group of old stars packed in a compact, spheroidal region — NGC 3621 doesn’t. In this image, it is clear that there is simply a brightening to the centre, but no actual bulge like the one in NGC 6744 (eso1118), for example. NGC 3621 is also interesting as it is believed to have an active supermassive black hole at its centre that is engulfing matter and producing radiation. This is somewhat unusual because most of these so-called active galactic nuclei exist in galaxies with prominent bulges. In this particular case, the supermassive black hole is thought to have a relatively small mass, of around 20 000 times that of the Sun.  NGC 3621 – click for 1280×1280 image"], "link": "http://scienceandreason.blogspot.com/feeds/4994005892468598466/comments/default", "bloglinks": {}, "links": {"http://www.eso.org/": 2}, "blogtitle": "Science and Reason"}, {"content": ["Amino acid alphabet soup Via Astrobiology Magazine , 8/19/11\n All living creatures on this planet use the same 20 amino acids, even though there are hundreds available in nature. Scientists therefore have wondered if life could have arisen based on a different set of amino acids. And what's more, could life exist elsewhere that utilizes an alternate collection of building blocks? \n It really is rather remarkable that such a small subset of possible amino acids make up (almost) all the proteins in every known living organism on the planet. What enforces this strict discipline is the fact that all life forms on Earth use the same genetic code – a remarkable fact in itself – and this code does not specify any amino acids other than the same 20 ones. The way the code works makes substitutions impossible.\n \n The reason for this inflexibility lies in the nature of transfer RNA , which is a critical part of the process in which genetic information encoded in DNA is converted to specific sequences of amino acids making up proteins. The DNA sequence of genes is first transcribed (in a process that is actually rather complicated) into another form of RNA – messenger RNA . All forms of RNA consist of a sequence of nucleotides , with every 3 nucleotides grouped together into \"words\". Since there are 4 possible nucleotides, there are 64 (=4 3 ) possible distinct words.\n \n In a molecule of transfer RNA, which typically comprises 73 to 93 nucleotides altogether, the three nucleotides at one end will match the sequence of one particular word of messenger RNA. The other end of the transfer RNA can bind to covalently to only one of 20 possible amino acids, completely ignoring any other amino acids. For any particular one of the 20 amino acids there are usually several different transfer RNAs that the amino acid can bind to, with each type corresponding to a specific 3-letter sequence of nucleotides. In this way there is a established a many-to-1 relationship between the 64 3-letter nucleotide words and the 20 amino acids. This is the genetic code.\n \n The 20 amino acids can be considered as letters of another alphabet, in which sequences of letters (sometimes thousands of each) make up specific proteins. There are several interesting questions about this genetic code. Why are only 20 amino acids used, even though hundreds exist in nature? How did this small subset happen to be chosen – and be the same subset in all living organisms on Earth? If there is life on other planets that still encodes genetic information with DNA and RNA for making proteins, must the same 20 amino acids be used?\n \n There is a range of possible answers to these questions. At one extreme, the subset of amino acids could have come about completely at random, perhaps being the first viable subset that emerged by chance and them became \"frozen\" in all successor life forms. At the other extreme, it could be that the amino acids actually used are the only ones that are able to build a suitable set of proteins. The intermediate case is that very early in the history of life many different subsets were in use, but in a process of evolution over time, the subset now used proved to be sufficiently superior to all others that it is the only one that survived in the conditions of the time.\n \n Stephen Freeland and Gayle Philip performed a computer study to investigate whether the exact subset of 20 amino acids in the alphabet were more likely to be a completely random selection, or instead to represent a set that emerged as somehow the best suited for constituting the proteins of life on Earth. They reasoned that there were various properties any amino acid could have that would affect its suitability as a constituent of proteins. Among the properties were size and electric charge of the molecule, and the molecule's degree of attraction to water (hydrophilicity). \n \n What they found was that the 20 amino acids actually occurring in proteins had a wide range of values for each of the properties, and that the range of properties was more evenly distributed over the subset than should occur if selection were random. In other words, the building blocks of proteins appear to be especially diverse in order to accommodate a large diversity of proteins that could be useful in living organisms. Thus evolution in the earliest stages of life on Earth probably favored the availability of many types of building blocks.\n \n Abstract : Did evolution select a nonrandom \"alphabet\" of amino acids? \n The last universal common ancestor of contemporary biology (LUCA) used a precise set of 20 amino acids as a standard alphabet with which to build genetically encoded protein polymers. Considerable evidence indicates that some of these amino acids were present through nonbiological syntheses prior to the origin of life, while the rest evolved as inventions of early metabolism. However, the same evidence indicates that many alternatives were also available, which highlights the question: what factors led biological evolution on our planet to define its standard alphabet? One possibility is that natural selection favored a set of amino acids that exhibits clear, nonrandom properties-a set of especially useful building blocks. However, previous analysis that tested whether the standard alphabet comprises amino acids with unusually high variance in size, charge, and hydrophobicity (properties that govern what protein structures and functions can be constructed) failed to clearly distinguish evolution's choice from a sample of randomly chosen alternatives. Here, we demonstrate unambiguous support for a refined hypothesis: that an optimal set of amino acids would spread evenly across a broad range of values for each fundamental property. Specifically, we show that the standard set of 20 amino acids represents the possible spectra of size, charge, and hydrophobicity more broadly and more evenly than can be explained by chance alone."], "link": "http://scienceandreason.blogspot.com/feeds/4669771254124731389/comments/default", "bloglinks": {}, "links": {"http://www.nih.gov/": 1, "http://en.wikipedia.org/": 5, "http://www.astrobio.net/": 2}, "blogtitle": "Science and Reason"}, {"content": ["A Spiral in Leo (8/10/11)\n This new picture from ESO’s Very Large Telescope shows NGC 3521, a spiral galaxy located about 35 million light years away in the constellation of Leo (The Lion). Spanning about 50 000 light-years, this spectacular object has a bright and compact nucleus, surrounded by richly detailed spiral structure.\n \n The most distinctive features of the bright galaxy NGC 3521 are its long spiral arms that are dotted with star-forming regions and interspersed with veins of dust. The arms are rather irregular and patchy, making NGC 3521 a typical example of a flocculent spiral galaxy. These galaxies have “fluffy” spiral arms that contrast with the sweeping arms of grand-design spirals such as the famous Whirlpool galaxy or M 51, discovered by Charles Messier. \n \n \n \n NGC 3521 – click for 1280×1280 image \n \n Actually, NGC 3521 looks a lot like NGC 2841 .\n \n More: here"], "link": "http://scienceandreason.blogspot.com/feeds/3833874078547833745/comments/default", "bloglinks": {}, "links": {"http://www.eso.org/": 2, "http://scienceandreason.blogspot.com/": 1, "http://www.space.com/": 1}, "blogtitle": "Science and Reason"}, {"content": ["Dawn of the black holes (Science News) The seeds of the universe’s first black holes could have formed in gas halos much smaller than previously calculated, Canadian and American astronomers report online April 21 at arXiv.org. Simulated seeds about 100 times the sun’s mass were more common in massive gas halos, as expected (more mass means more stuff to collapse into a black hole). But because smaller halos may birth fewer stars — and fewer stars mean more pristine gas is available to collapse — seed formation could continue in smaller halos longer than in larger ones. The results jibe with two competing theories of supermassive black holes and could explain why some small galaxies have big black holes. —Camille Carlisle The First Massive Black Hole Seeds and Their Hosts"], "link": "http://scienceandreason.blogspot.com/feeds/8799889029260266477/comments/default", "bloglinks": {}, "links": {"http://www.sciencenews.org/": 1, "http://arxiv.org/": 1}, "blogtitle": "Science and Reason"}, {"content": ["Black hole threesome revealed ( Science News ) Andy Warhol reportedly said, “One’s company, two’s a crowd and three’s a party.” New data reveal one heck of a black hole party, a U.S. team of researchers reports online April 19 at arXiv.org. Three supermassive black holes — humungous gravity sinks that may form the cores of galaxies — and the stars around them could be crunching together to form a single galaxy, the group says. The first two galaxies should join up in 8 million years, with the third coming in about 32 million years after that. While scientists suspect that many galaxies have formed from such pile-ons, only one other possible triplet has been discovered so far. —Daniel Strain Cosmic Train Wreck by Massive Black Holes: Discovery of a kpc-Scale Triple Active Galactic Nucleus"], "link": "http://scienceandreason.blogspot.com/feeds/59100304622037676/comments/default", "bloglinks": {}, "links": {"http://www.sciencenews.org/": 1, "http://arxiv.org/": 1}, "blogtitle": "Science and Reason"}, {"content": ["A Twisted Dust Web in the Galaxy IC 342 (7/20/11) Looking like a spiders web swirled into a spiral, the galaxy IC 342 presents its delicate pattern of dust in this image from NASAs Spitzer Space Telescope. Seen in infrared light, the faint starlight gives way to the glowing bright patterns of dust found throughout the galaxys disk. At a distance of about 10 million light-years, IC 342 is relatively close by galaxy standards, however our vantage point places it directly behind the disk of our own Milky Way. The intervening dust makes it difficult to see in visible light, but infrared light penetrates this veil easily. It belongs to the same group as its even more obscured galaxy neighbor, Maffei 2.  IC 342 – click for 960×806 image More: here , here"], "link": "http://scienceandreason.blogspot.com/feeds/5490946969656407412/comments/default", "bloglinks": {}, "links": {"http://www.space.com/": 1, "http://www.caltech.edu/": 3}, "blogtitle": "Science and Reason"}, {"content": ["\"Rose\" of Galaxies (4/20/11) The newly released Hubble image shows a large spiral galaxy, known as UGC 1810, with a disk that is distorted into a rose-like shape by the gravitational tidal pull of the companion galaxy below it, known as UGC 1813. A swath of blue jewel-like points across the top is the combined light from clusters of intensely bright and hot young blue stars. These massive stars glow fiercely in ultraviolet light. The smaller, nearly edge-on companion shows distinct signs of intense star formation at its nucleus, perhaps triggered by the encounter with the companion galaxy.  Arp 273 – click for 987×1000 image More: here , here , here , here , here , here , here"], "link": "http://scienceandreason.blogspot.com/feeds/2324818618065164618/comments/default", "bloglinks": {}, "links": {"http://hubblesite.org/": 1, "http://www.physorg.com/": 1, "http://content.usatoday.com/": 1, "http://www.space.com/": 1, "http://www.newscientist.com/blog": 1, "http://www.pcmag.com/": 1, "http://imgsrc.hubblesite.org/": 1, "http://physicsworld.com/blog": 1, "http://www.noao.edu/": 1}, "blogtitle": "Science and Reason"}, {"content": ["Wide Field Imager view of a Milky Way look-alike, NGC 6744 (6/1/11) This picture of the nearby galaxy NGC 6744 was taken with the Wide Field Imager on the MPG/ESO 2.2-metre telescope at La Silla. The large spiral galaxy is similar to the Milky Way, making this image look like a picture postcard of our own galaxy sent from extragalactic space. The picture was created from exposures taken through four different filters that passed blue, yellow-green, red light, and the glow coming from hydrogen gas. These are shown in this picture as blue, green, orange and red, respectively.  NGC 6744 – click for 1280×1078 image More: here , here , here , here , here , here , here"], "link": "http://scienceandreason.blogspot.com/feeds/8729796031078157799/comments/default", "bloglinks": {}, "links": {"http://www.skyandtelescope.com/": 1, "http://content.usatoday.com/": 1, "http://www.eso.org/": 3, "http://www.time.com/": 1, "http://www.space.com/": 1, "http://news.nationalgeographic.com/": 1, "http://www.science20.com/": 1}, "blogtitle": "Science and Reason"}, {"content": ["A Perfect Spiral with an Explosive Secret (5/30/11) This spiral galaxy was discovered back in the nineteenth century by French astronomer Édouard Jean-Marie Stephan, but in 2008 it became a prime target for observations thanks to the violent demise of a white dwarf star. The type Ia supernova known as SN2008a was spotted in the galaxy and briefly rivalled the brilliance of its entire host galaxy but, despite the energy of the explosion, it can no longer be seen this Hubble image, which was taken around a year and a half later.  NGC 634 – click for 1280×782 image More: here"], "link": "http://scienceandreason.blogspot.com/feeds/2203011379793656340/comments/default", "bloglinks": {}, "links": {"http://www.space.com/": 1, "http://www.spacetelescope.org/": 2}, "blogtitle": "Science and Reason"}, {"content": ["Flocculent spiral NGC 2841 Star formation is one of the most important processes in shaping the Universe; it plays a pivotal role in the evolution of galaxies and it is also in the earliest stages of star formation that planetary systems first appear. Yet there is still much that astronomers don’t understand, such as how do the properties of stellar nurseries vary according to the composition and density of the gas present, and what triggers star formation in the first place? The driving force behind star formation is particularly unclear for a type of galaxy called a flocculent spiral, such as NGC 2841 shown here, which features short spiral arms rather than prominent and well-defined galactic limbs. In an attempt to answer some of these questions, an international team of astronomers is using the new Wide Field Camera 3 (WFC3) installed on the NASA/ESA Hubble Space Telescope to study a sample of nearby, but wildly differing, locations where stars are forming. The observational targets include both star clusters and galaxies, and star formation rates range from the baby-booming starburst galaxy Messier 82 to the much more sedate star producer NGC 2841.  NGC 2841 – click for 1000×800 image More: here , here , here , here"], "link": "http://scienceandreason.blogspot.com/feeds/6436746666231891401/comments/default", "bloglinks": {}, "links": {"http://www.skyandtelescope.com/": 1, "http://hubblesite.org/": 1, "http://heritage.stsci.edu/": 1, "http://www.space.com/": 1, "http://imgsrc.hubblesite.org/": 1, "http://www.spacetelescope.org/": 1}, "blogtitle": "Science and Reason"}, {"content": ["Biologists are, at long last, beginning to understand the molecular processes responsible for aging in complex (multicellular) organisms – and to investigate ways to counteract these processes. We discussed one line of research in this recent article about a particular sirtuin (SIRT3) that helps relieve oxidative stress that can lead to DNA damage, which generally leads, in turn, to cell senescence or death. While oxidative stress is certainly a significant factor in aging, possibly the most significant, there are others. One of these is the limitation on a cell's ability to undergo cell division in order to produce new cells of the same type. This is especially important in tissues that regularly need to regenerate, such as skin and intestinal tissue. Everyone now knows about telomeres , whose main function is to constitute protective end caps on chromosomes. The limitation on number of cell divisions happens since about 100 base pairs are lost from telomeres during each cell division. When telomeres eventually become too short signals that are similar to those associated with other kinds of DNA damage shut down a cell's ability to divide further. This mechanism indirectly helps mitigate the risks of DNA damage that are present every time a cell divides – an inherently tricky process. However, this limitation on cell division isn't acceptable during embryonic development, when an organism's cell count is doubling most rapidly. So evolution has provided an enzyme – telomerase – that can rebuild telomeres, but is most active only during embryonic development. Except, of course, in cells that have become cancerous, where the ability to divide without limit is the name of the game. We discussed telomeres and telomerase in some detail a little over a year ago in this article , so you can go there for more. Because of the risk of cancer, it seems imprudent to reactivate telomerase for the long term within an organism, especially in long-lived animals such as humans. (In animals like mice, which live fast and die young, it's a different matter. Telomerase may remain somewhat active in mice during adulthood. (Mentioned here .)) But what if it were possible to reactivate telomerase for a relatively short period of time (compared to the whole lifespan)... might that provide an opportunity to rebuild telomeres to some extent? Even better, might that reverse, at least to some extent, the ravages of aging? We now have some research that seems to provide a fairly unambiguous affirmative answer... in a rather special case: Telomerase reactivation reverses tissue degeneration in aged telomerase-deficient mice . But didn't we just say that mice may retain telomerase activity throughout their lives? Yes, however it's a relatively simple matter to \" knock out \" the main telomerase gene in mice ( Tert ). When that's done the resulting strain of knock-out mice – after several generations – have shortened lifespans and a general phenotype of age-related debilities, as one would expect. (The first few generations apparently still have sufficiently long teleomeres.) Unfortunately, that's not a good enough model, since without a Tert gene, the organism has no way to manufacture telomerase. Simply giving the knock-out mice repeated infusions of telomerase is not a good way to ensure uniform distribution of the enzyme to all of the organism's cells. What to do? The experimenters came up with a rather clever solution. Normally the way that telomerase is activated in cells is by means of an \" estrogen receptor \" (ER), to which a form of the hormone estrogen ( 17β-estradiol to be precise) can bind and enable transcription of Tert. This ER can be tweaked so that estrogen binds to it only in the presence of another chemical, 4-hydroxytamoxifen (4-OHT). A special form of the Tert gene that includes this special ER can be \"knocked-in\" to the mouse germline. It then turns out that 4-OHT can be efficaciously supplied to a TERT-ER mouse (in the form of a time-release subcutaneous pellet) to turn telomerase expression on and off at the experimenter's will. With that technology in place, the researchers were then able to perform a series of experiments demonstrating, in these special mice, that a month-long burst of telomerase could actually reverse a number of the ill effects of telomerase deprivation. The first step was to show that without 4-OHT the TERT-ER mice (after a few generations) had many of the same problems, in the same degree, as later generations of knock-out mice that lacked Tert entirely. The TERT-ER mice (all of which were male) showed no signs of telomerase activity. Tissues in highly proliferative organs such as testes, spleen, and intestines showed notable atrophy. Lifespan of TERT-ER mice was about half that of normal (\"wild type\") mice. The first test to investigate the effects of telomerase reactivation by means of 4-OHT was done in vitro. Fibroblast cells from TERT-ER mice were cultured and found to be essentially senescent and not undergoing cell cycles. But when the cells were placed in media containing 4-OHT, teleomerase was reactivated, telomeres lengthened, and cell proliferation resumed. Some TERT-ER mice were then given a 4-week treatment of 4-OHT (subcutaneous pellets). At the end of that treatment there was a marked reversal of the degeneration that has occurred in testes, spleen, liver, and intestinal tissues, as well as resumption of sperm production. Survival time of these treated mice also increased. At the same time, 4-OHT had no effects on control mice that weren't lacking in telomerase and didn't have tissue degeneration. Noteworthy results were obtained from tests to assess nervous system condition. Proliferation of neural progenitor cells was found to resume in TERT-ER mice treated with 4-OHT. Normal numbers of mature oligodendrocytes reappeared. Lastly, high-level neurological functions were restored, as indicated by resumption of nearly normal olfactory sensitivity. An interesting conclusion that can be drawn from the neurological results is that neural progenitor cells probably survive loss of telomeres, so that they can rebuild neural cell populations if telomeres are repaired. The really interesting question, of course, is the extent to which these results may apply, in some form, to humans. Unfortunately, there are a number of reasons to be skeptical. For one thing, telomere shortening is only one factor, and quite possibly not the main one, in human aging. Aging can be thought of as a complex disease, like cancer, with many contributing factors. The consequences of telomere truncation are only one factor. Further, murine biology has signficant differences from human biology. Mice are less complex organisms, with rather short lifespans. Mice seem to retain some degree of telomerase activity throughout their lives, so they are not as well adapted to going for long periods without it. It is noteworthy that evidence was not found that TERT-ER mice treated with 4-OHT became more susceptible to cancer. Still, mice don't live very long, and they are adapted to maintain active telomerase. Humans are different. If telomerase is artificially kept active for years in humans, incipient tumorigenicity could be accelerated. Lastly, it's not necessarily easy to raise human telomerase activity levels in the first place. Although some telomerase-activating factors are known, they have not been tested extensively in humans for long periods of time, so their safety and efficacy profile is not known. These research results are quite interesting – but they only indicate the need for much more investigation.    Jaskelioff, M., Muller, F., Paik, J., Thomas, E., Jiang, S., Adams, A., Sahin, E., Kost-Alimova, M., Protopopov, A., Cadiñanos, J., Horner, J., Maratos-Flier, E., & DePinho, R. (2010). Telomerase reactivation reverses tissue degeneration in aged telomerase-deficient mice Nature, 469 (7328), 102-106 DOI: 10.1038/nature09603  Further reading: (* = especially recommended) * Telomerase reverses ageing process (11/28/10) * The Curious Case of the Backwardly Aging Mouse (11/29/10) * Partial reversal of aging achieved in mice (11/29/10) Harvard scientists reverse the ageing process in mice – now for humans (11/28/10) Gene reactivation reverses aging-related brain deficits in mice (11/30/10) Age-Reversing Drugs on the Horizon? Not So Fast (11/29/10) Telomere Tweaks Reverse Aging in Mice (11/29/10) Alzheimers and aging advances uncovered (11/29/10) An enzyme leads the dance of immortality and death (11/29/10) Scientists Find Way to Partially Reverse Aging in Mice (11/29/10)"], "link": "http://scienceandreason.blogspot.com/feeds/556998633432927447/comments/default", "bloglinks": {}, "links": {"http://www.smartplanet.com/": 1, "http://www.physorg.com/": 1, "http://content.usatoday.com/": 1, "http://blogs.discovermagazine.com/": 1, "http://www.wired.com/": 1, "http://www.nature.com/": 2, "http://www.businessweek.com/": 1, "http://scienceandreason.blogspot.com/": 2, "http://news.sciencemag.org/": 1, "http://en.wikipedia.org/": 11, "http://www.co.uk/": 1, "http://www.researchblogging.org": 1, "http://arstechnica.com/": 2, "http://dx.doi.org/": 1}, "blogtitle": "Science and Reason"}, {"content": ["Supermassive black hole in a type of galaxy where nobody expected to find one? Henize 2-10 is a small, mostly unremarkable compact dwarf galaxy. Its estimated dynamical mass is about 10 10 M ⊙ , only a few percent of our galaxy's mass, and its distance from us is about 30 million light years. It is irregular in shape and does not fit in any category of the standard Hubble sequence . The only respect in which Henize 2-10 has attracted attention – for several decades – before now is an extremely high rate of star formation in comparison to its size. The rate is 10 times that of the Large Magellanic Cloud , a satellite galaxy of the Milky Way that is also irregular in form and has approximately the mass of Henize 2-10. This research – An actively accreting massive black hole in the dwarf starburst galaxy Henize 2-10 – recently published Nature , now offers good evidence that at the center of Henize 2-10 is an active black hole of substantial but somewhat uncertain mass between 2×10 5 M ⊙ and 2×10 7 M ⊙ . That's a lot – it could exceed the mass of the Milky Way's black hole, ~4.2× 10 6 M ⊙ . The evidence presented that Henize 2-10 contains an actively accreting massive black hole is pretty good. It includes detection of radio emissions with a substantial non-thermal component. In other words, much of the radio emissions is due to something besides black body radiation – perhaps synchrotron radiation typical in active black hole jets. There is also a point source of high-energy X-ray emissions coming from the same location as the radio emissions. The evidence that these emissions are due to an active black hole isn't perfect. In particular, long-baseline interferometry shows gaps in the radio source, and the radio spectrum does not have the shape of a typical radio galaxy's. But consideration of other possible explanations indicates that the alternatives are rather improbable. However, the paper concludes \"the massive black hole in Henize 2-10 does not appear to be associated with a bulge, a nuclear star cluster or any other well-defined nucleus. This unusual property may reflect an early phase of black-hole growth and galaxy evolution that has not been previously observed. If so, this implies that primordial seed black holes could have pre-dated their eventual dwellings.\" The authors are implying that this black hole could have existed before Henize 2-10 itself. And further, since galaxies in the very early universe (z≥7) have many similarities to Henize 2-10 (as well as certain differences), that many of these very early galaxies could also have formed around pre-existing massive black holes. These concluding observations should, on the basis of the evidence provided, be regarded as rather speculative. There are substantial logical gaps in the reasoning. For one thing, Henize 2-10 is pretty unusual based on its high rate of star formation. This implies an unusual and probably chaotic recent history. And so there really isn't much solid reason to think that the central black hole predated the galaxy. How closely Henize 2-10 resembles very early galaxies is also open to question. The earliest stars, which made up the earliest galaxies, had very low metallicity and therefore tended to be much larger, brighter, and short-lived than stars forming in the present era. The assumption that galaxy evolution would be pretty similar between now and then is hard to make. Some of the popular media accounts go even further and suggest that \"most\" galaxies probably formed around pre-existing black holes. Even if that were true for Henize 2-10, all that can legitimately be inferred is the possibility, not the necessity, of that circumstance in most cases. There have been reports of the existence of supermassive black holes in galaxies without central bulges (not just irregular galaxies) – here , for example. There have even been studies of active black holes in the early universe that may have predated their galaxies, one of which I wrote about in this article: Which came first - the galaxy or the black hole? . There are also cases of fairly normal galaxies, such as M33 , that seem to have at most a very small central black hole – see here . So it's certainly a very real issue whether, at least in some cases, central black holes form before their galaxies, but the present study is just another interesting data point, not the last word on the subject.    Reines, A., Sivakoff, G., Johnson, K., & Brogan, C. (2011). An actively accreting massive black hole in the dwarf starburst galaxy Henize 2-10 Nature, 470 (7332), 66-68 DOI: 10.1038/nature09724  Further reading:  Dwarf Galaxy Harbors Supermassive Black Hole – 1/9/11 Ginormous Black Hole May Solve Longstanding Mystery – 1/9/11 Baby Galaxy Hosts Monster Black Hole – 1/10/11 Astronomers Discover Supermassive Black Hole in Center of Tiny Galaxy – 1/9/11 Supermassive Black Hole Peeks From Behind The Skirt Of A Dwarf Galaxy – 1/10/11 Huge Black Hole Found in Dwarf Galaxy – 1/10/11 Henize 2-10: A Surprisingly Close Look at the Early Cosmos – 1/10/11 A Black Hole “Too Big” For Its Galaxy – 1/12/11 Supersized Black Hole Seen in Small Galaxy – 1/11/11 Dwarf galaxy solves supermassive mystery – 1/10/11 Dwarf galaxy hides a cosmic 'Little Big Man' – 1/10/11 New Evidence Shows Black Hole Growth Preceding Galactic Formation – 1/9/11 A tiny galaxy that hides a big secret – 1/11/11 Itty Bitty Galaxy Home to Gargantuan Supermassive Black Hole – 1/11/11 Massive black hole found in nearby galaxy – 1/11/11"], "link": "http://scienceandreason.blogspot.com/feeds/7343913390868792415/comments/default", "bloglinks": {}, "links": {"http://www.skyandtelescope.com/": 1, "http://www.cosmosmagazine.com/": 1, "http://www.physorg.com/": 1, "http://blogs.discovermagazine.com/": 2, "http://www.wired.com/": 1, "http://www.universetoday.com/": 1, "http://www.sciencemag.org/": 1, "http://scienceandreason.blogspot.com/": 1, "http://news.discovery.com/": 1, "http://www.nature.com/": 1, "http://physicsworld.com/": 1, "http://en.wikipedia.org/": 8, "http://www.nrao.edu/": 1, "http://news.nationalgeographic.com/": 1, "http://www.virginia.edu/": 1, "http://www.scientificamerican.com/": 1, "http://www.space.com/": 1, "http://www.researchblogging.org": 1, "http://chandra.harvard.edu/": 1, "http://blogs.nature.com/": 1, "http://dx.doi.org/": 1}, "blogtitle": "Science and Reason"}, {"content": ["♦ Sirtuin proteins (11/16/07) ♦ The discovery of sirtuins, part 1 (11/17/07) ♦ The discovery of sirtuins, part 2 (11/20/07) ♦ Sirtuin news (1/21/08) ♦ SIRT1 and cancer (10/26/08) ♦ Testing the Fountain of Youth in the lab (2/7/11)"], "link": "http://scienceandreason.blogspot.com/feeds/1122868043960572911/comments/default", "bloglinks": {}, "links": {"http://scienceandreason.blogspot.com/": 6}, "blogtitle": "Science and Reason"}, {"content": ["It's been more than 10 years since it was noticed that certain enzymes – the sirtuins – had life-extending properties in organisms like yeast, and later nematodes , fruit flies, and mice. The excitement spread to other compounds, such as resveratrol , that seemed to activate or assist sirtuins. Hopes were high that such things might offer the known longevity benefits of calorie restriction in a pill form. Ever since then the gold rush has been on to figure out how these things work – and if possible, to be the first to market with the Fountain of Youth in a bottle. We've discussed sirtuins here a number of times before – here's a list of some of those discussions. If you need to brush up on the background, those would be good places to start. The initial sirtuin that seemed to be most important for the longevity of yeast was SIR2 . The gene for SIR2 is highly conserved in evolution – so it's probably kind of important. Homologs of SIR2 have been found in many sorts of higher organisms (nematodes, fruit flies, etc.). In mammals, including humans, there is a whole family of sirtuins, having at least 7 members, named SIRTx for x=1 to 7. (\"SIRT\" and \"sirtuin\" refer to SIR-two, where SIR was an acronym for \"silent information regulator\".) SIR2 is primarily a histone deacetylase (HDAC), that is, an enzyme that removes acetyl groups from histone proteins (and often other types of proteins as well). Histones are the building block proteins that make up nucleosomes , around which DNA is spooled in chromosomes. Normally, DNA is tightly bound to the histones, which prevents the genes in the tightly bound portion of DNA from being transcribed into RNA in order to make proteins. In other words, the genes bound to a histone are effectively silenced. In order for a gene to be expressed, the histone closest to the portion of DNA containing the gene has to have an acetyl group attached at an appropriate location. Enzymes (\" acetyltransferases \") attach acetyl groups (in the process called acetylation ) to histones in order to allow gene expression. Consequently, deacetylase enzymes, such as several sirtuins, are able to silence genes by removing acetyl groups from histones. SIRT1 is the most intensively studied mammalian sirtuin. Like SIR2, it is primarily a histone deacetylase that is active in a cell nucleus to silence a wide variety of genes. Since SIRT1 can silence a large number of genes, it affects many cellular processes. However, there is one additional complication. SIR2 and SIRT1 only have their deacetylation ability in the presence of a small molecule called NAD: nicotinamide adenine dinucleotide , and only when NAD has a net positive charge, due to the loss of one electron during the process of metabolism in which cells generate needed energy. NAD + denotes this form of NAD. (The neutral form of NAD is denoted by NADH.) Because of the role of NAD + , SIR2 is said to be a \"NAD + -dependent\" histone deacetylase. All this is important, because research over the past 10+ years has shown that the lifespan-extending properties of calorie restriction, especially in simple organisms like yeast and nematodes, seem to be related, at least sometimes, with the deacetylation properties of SIR2 in the presence of NAD + . When an organism is in a calorie restricted environment, metabolism slows down, and less NAD + gets used up. As a result, there is more NAD + around. So SIR2 is more effective. So genes are silenced that would otherwise be expressed. Silencing these genes seem to help an organism live longer when nourishment is not ample – so that it can survive until the buffet table is restocked. In an organism on a normal (not calorie restricted) diet, up-regulating SIR2 or otherwise enhancing its gene-silencing abilities seems to compensate for decreased amounts of NAD + , and thereby achieves for the organism some of the anti-aging benefits of a calorie-restricted diet without having to go hungry. The problem is that the expression of so many different genes can be affected by SIR2 deacetylation that it's difficult to identify which genes among these are actually useful for promoting longevity or retarding aging – especially in organisms more complex than yeast or nematodes. Now, however, research has come out involving a much less studied mammalian sirtuin, SIRT3 – Sirt3 Mediates Reduction of Oxidative Damage and Prevention of Age-Related Hearing Loss under Caloric Restriction . (I recommend viewing this link, since the illustration on the page will be helpful in understanding what follows here.) In spite of caveats I'll mention toward the end, this is a very significant and well-done piece of research. A number of properties of SIRT3 had already been observed prior to this latest research. It is, like SIRT1, also a NAD + -dependent deacetylase enzyme. But unlike SIRT1, its main activity is found in cell mitochondria instead of in the nucleus. Consequently, SIRT3 deacetylates mitochondrial proteins instead of histones. Of particular interest, this SIRT3 activity was known to be associated with calorie restriction (CR), because of overexpression in CR conditions and presumably also because of the NAD + -dependence. For example, studies in mice have shown that CR increases SIRT3 expression in liver mitochondria. Further, in knockout mice without SIRT3 mitochondrial fatty acid oxidation problems are found. Under CR SIRT3 is also overexpressed in mouse heart cells and may protect these cells from oxidative stress-induced cell death. (However, in this case it's possible that the effect resulted from HDAC activity in the cell nucleus.) So SIRT3 seems to be associated with anti-oxidant activity. There is, additionally, mechanistic evidence that SIRT3 inhibits mitochondria-related carcinogenesis. For instance, knockout mice without SIRT3 are susceptible to breast tumors. The latest research presents strong evidence that under calorie restriction SIRT3 is involved in suppressing oxidative damage. The evidence is based on studies of oxidative stress-induced cochlear cell death responsible for age-related hearing loss (AHL) in mice. AHL is a pretty typical example of health problems associated with aging – one that affects humans as well as mice. The research not only shows an association between SIRT3 and protection from oxidative damage, but goes deep into the apparent mechanism involved. A variety of different in vitro and in vivo experiments with knockout mice provide the evidence. To begin with, at the highest level, the researchers found that SIRT3 is required along with CR to inhibit age-related cochlear cell death and hearing loss. The knockout mice used in this, and other in vivo experiments, had both copies of the SIRT3 gene knocked out. The rate of progression of AHL was first measured in wild type (WT) mice as controls. CR was found to delay or mitigate AHL in the controls – but not in the knockout mice. This implies SIRT3 is necessary for CR to inhibit the progression of AHL – there's no benefit of CR for this condition without SIRT3. Further, when the cochlear cells of the experimental mice were examined, it was found that CR retarded cell death in the control animals but not in the mice without SIRT3. So the key process to be concerned with is progressive cell death related to aging. The next experiments showed that the cell death was the result of oxidative damage. A lot of other studies have shown that CR inhibits oxidative damage to DNA, proteins, and lipids in many types of mammalian tissues. In the present research this was confirmed by examination of DNA in cochlear, brain, and liver tissues of control mice. But CR did not inhibit oxidative damage in the same tissues of the knockout mice. So SIRT3 appears to be necessary for the inhibition of oxidative damage to DNA, which presumably was responsible for accelerated cell death. The next issue needing to be addressed is the mechanism by which CR inhibits oxidative damage. It is known that a small molecule, glutathione , is the major small molecule antioxidant in cells. Glutathione can exist in two oxidation states – reduced (GSH) or oxidized (GSSG). A high ratio of GSH to GSSG protects other molecules in the cell from oxidative damage, and GSH predominates in the healthy mitochondria of young mice. Conversely, a low ratio of GSH to GSSG is a marker for oxidative stress and/or aging. In the present research, the GSH:GSSG ratio was tested in control and knockout mice under CR conditions, at the age of 5 months. In the mitochondria of inner ear cells, as well as in brain and liver cells, it was found that the GSH:GSSG ratio increased as a result of CR in control mice, but not in knockout mice. Once again the presence of SIRT3 was shown to be necessary for an effect. Obviously, the next thing to look at is how the GSH:GSSG ratio is controlled. The enzyme glutathione reductase (GSR) is known to be responsible for converting GSSG to GSH. So what happens is that reactive oxygen species (ROS) get soaked up in converting GSH to GSSG, and GSR reverses this to convert GSSG back to GSH. However, in order to work GSR requires another molecule, nicotinamide adenine dinucleotide phosphate (NADPH) to do its job. NADPH is nothing but NAD, which we encountered in connection with the HDAC function of SIRT1, with a phosphate group attached. Like NAD, NADPH also exists in an oxidized form, NADPH + . This latter molecule predominates in mitochondria, and needs to be converted back to NADPH for use by GSR. (All this activity is really just shuffling electrons from one place to another. The pairs of molecules that mediate the activity are called \" redox couples\".) So, what is it that converts NADPH + to the plain old NADPH that we need? Well, that task is handled by yet another mitochondrial enzyme, isocitrate dehydrogenase 2 (Idh2). Don't despair – this is the last step! There is just one wrinkle. Idh2 is normally found in an acetylated form, in which case it is inactive. It needs to be deacetylated in order to become active and convert NADPH + to NADPH. And that is precisely where the deacetylation function of SIRT3 comes into play. The researchers hypothesized that SIRT3 was needed in order to activate Idh2. In order to test the hypothesis, they first measured acetylation of Idh2 in the control mice, with both normal and CR diets. With a normal diet, acetylation of Idh2 was substantial, but with CR there was an 8-fold decrease of acetylation. So it only remains to find the reason for that. In knockout mice, with no SIRT3, acetylation of Idh2 was \"robust\" with both normal and CR diets. That's a pretty good indication that SIRT3 was required for the effect. As a further indication, SIRT3 levels in the control mice were 3 times as high with a CR diet compared to a normal diet. So SIRT3 is necessary for deacetylation of Idh2 under CR conditions, but there's still the possibility that it isn't sufficient by itself. It's possible that CR has other effects that facilitate deacetylation – CR may cause expression or activation of other enzymes that are needed. It's also possible that CR has other effects that increase NADPH independently of Idh2. What if NADPH levels were tested directly? It was found that in the control mice NADPH did increase in all tissue types tested when a CR diet replaced a normal one, but this effect was not found in the knockout mice. Efforts were made to use biochemical experiments (in vitro) to determine whether SIRT3 alone is responsible for deacetylating Idh2 under CR conditions. For example, another sirtuin, SIRT5 , is also a deacetylase that occurs in mitochondria. Could it be helping deacetylate Idh2? The biochemical experiments indicated this was not the case. Unsurprisingly, both normal and knockout mice were found to be leaner when fed a CR diet. Is it possible that lower body mass, especially resulting from less fat tissue, had some role in the protection from oxidative damage resulting from a CR diet? Perhaps, but other factors like that certainly weren't sufficient, as it was pretty clear that SIRT3 (absent in the knockout mice) was necessary, at least as far as AHL is concerned. It's still possible that SIRT3 isn't necessary for anti-aging effects of CR in tissue types that weren't tested (i. e. other than inner ear, brain, and liver tissue), or in mammals other than mice. The case is pretty solid for AHL in mice, but obviously there are many other age-related conditions and other species that should be investigated. I should apologize for all the biochemical details presented here, but at least they should give you a good indication of just how complicated the effects of CR on aging and longevity can be – and probably are. There's a whole lot of work yet to be done before a reliable anti-aging pill can be developed for humans. Enthusiastic claims that this research \"could lead to\" therapies to slow down aging in general are basically BS. Yeah, these findings will help, but a heck of a lot more will be needed as well. (As an example of just how badly misleading journalists who write about this stuff can be, consider this report , which begins with the claim: \"In a remarkable demonstration of the ability of calorie restriction to blunt the effects of aging, scientists at the University of Wisconsin-Madison have succeeded in delaying age-related hearing loss in mice.\" Although the research showed that calorie restriction can do this, it did not produce any new way to do it. Instead, it shows how CR probably works by showing how CR doesn't work if SIRT3 is absent.) So what's the bottom line here? It's pretty clear from this and many other studies that oxidative damage in cells is a cause of cell death and therefore of various health problems associated with aging. Undoubtedly there are a number of other factors that contribute to aging-related problems, such as cell death due to other causes and weakening or disregulation of the immune system. And even in the case of oxidative damage, there are many ways it can come about, and also many ways it might be inhibited. If you think of aging as a complex disease, like cancer – a point of view that has its detractors – then there are bound to be many causes and contributing factors. And also many ways to inhibit or arrest the process. The example considered here is just one of many.    Someya, S., Yu, W., Hallows, W., Xu, J., Vann, J., Leeuwenburgh, C., Tanokura, M., Denu, J., & Prolla, T. (2010). Sirt3 Mediates Reduction of Oxidative Damage and Prevention of Age-Related Hearing Loss under Caloric Restriction Cell, 143 (5), 802-812 DOI: 10.1016/j.cell.2010.10.002  Further reading: Scientists ferret out a key pathway for aging (11/18/10) Calorie restriction delays age-related hearing loss, UW study finds (11/18/10) Scientists ID key protein that links dietary restriction with healthy hearing, aging (12/16/10) Calorie Restrictions Slow Aging by Enzyme Pathway (11/19/10)"], "link": "http://scienceandreason.blogspot.com/feeds/8539763582410459364/comments/default", "bloglinks": {}, "links": {"http://www.cell.com/": 1, "http://www.physorg.com/": 1, "http://psychcentral.com/": 1, "http://scienceandreason.blogspot.com/": 1, "http://en.wikipedia.org/": 24, "http://news.ufl.edu/": 1, "http://www.jsonline.com/": 2, "http://www.researchblogging.org": 1, "http://dx.doi.org/": 1}, "blogtitle": "Science and Reason"}, {"content": ["There's good evidence that massive black holes exist at the centers of most large galaxies having a central bulge, and even within galaxies that lack a central bulge, are small, or have an irregular form. Such black holes can range in size up to more than 10 billion solar masses (M ⊙ ). Little is known about what the average or typical mass of a central black hole is, although most are probably a lot smaller, such as that of Sagittarius A* in our galaxy, which is only ~4.2×10 6 M ⊙ . Four million solar masses is still pretty hefty, so such objects are usually called supermassive black holes (SMBHs), as opposed to black holes that form as supernova remnants and are only at most a few M ⊙ . It's not known exactly how SMBHs form and evolve. One clue is that most seem to reside in non-dwarf galaxies with a regular shape and a noticeable central bulge. This suggests that SMBHs form and evolve in tandem with the bulge. However, there are exceptions, such as one discussed here: Supermassive black hole in a dwarf galaxy . Another survey of small (under 10 10 M ⊙ ) inactive galaxies in the Virgo cluster found that at least 24% had an X-ray-emitting SMBH. Since a black hole emits little or no radiation directly, even SMBHs are difficult to detect at distances of millions of light years, unless they are surrounded by a substantial amount of gas and dust that is heated enough in the process of falling into the SMBH that it can strongly emit radiation on its own or produce other detectable effects, like jets. Objects that fall in this category are active galactic nuclei (AGN). In most cases only SMBHs that are active as AGNs are readily detectable, so these are the only specimens we know much at all about. I've discussed AGN a lot, most recently here , here , here , here , here . In order to study how SMBHs form and evolve we pretty much have to rely on studies of AGNs, which can provide many clues about this issue. Unfortunately, we don't know much about what causes a relatively quiescent SMBH to become active and turn into an AGN. It's this latter question that's addressed, indirectly, by the research to be discussed here. But first let's back up to SMBHs in general. There are several interrelated questions concerning their origin and evolution. What accounts for their formation and periods of rapid growth? Do they form before, after, or in parallel with the formation of the galaxies in which they reside? What stimulates their intense outbursts of energy as AGNs or quasars ? The most basic question is: What are the typical ways that SMBHs grow? Possible answers include merger between smaller SMBHs, slow but steady accretion of matter from the surrounding galaxy, or bursts of rapid accretion when substantial amounts of gas and dust are swept up by the SMBH. Each of these questions, among others, stimulates intense debates among astrophysicists who study such things. These questions are interesting and important not just for their own sake. Since there is a lot of evidence that the evolution of a galaxy and of its central SMBH occur in tandem, understanding the evolution of the SMBH helps us understand that of the whole galaxy. The research we're concerned with here was designed to study the question by surveying a large number of galaxies that can be examined in some detail because they are not too distant. In this case, that means having a redshift z≤1. That corresponds to a distance (measured in light travel time) of about 7.7 billion light years – a little more than half the size of the visible universe. Since the research needs to examine the visible form of the object, anything farther away is too distant for even the Hubble telescope to resolve in sufficient detail. Also, at z=1 all light from the visible part of the spectrum is shifted to infrared, which Hubble's optics aren't optimized for. An AGN produces quite energetic radiation across most of the electromagnetic spectrum. So, at least in most cases, it is a sign of the rapid burst model of growth mentioned above. This is typically just a relatively short phase in the life of the galaxy-black hole combination – on the order of a hundred million years or so. That's based on the observation that only about 1% (very roughly) of large galaxies are in this phase, over the 13.7-billion year age of the visible universe. Whether this represents the only mode of growth, or even the bulk of it, is the big unknown. And of course, if there are SMBHs that grow by modes other than rapid accretion, we won't even detect them as AGN. The standard model of AGNs, which is pretty well accepted by the astrophysical community, is that rapid accretion of interstellar gas and dust around a SMBH is what powers the AGN's \"engine\". Presumably, then, the AGN goes quiet when most of the available gas and dust has been consumed. But that leaves the question of what initiates the process in the first place. Since there are still many AGNs that are active in the universe out to z=1, so that the galaxies involved have been growing for at least 5 billion years since the early days of the universe, AGNs could not have been active for their entire lives. Therefore, something happened at some point to trigger the activity we observe now. Astrophysicists want to know what that something is. At least initially, there is much more gas and dust spread throughout the galaxy than in the center. Something has to happen to cause that matter to lose its angular momentum so it can fall into the center. One popular hypothesis has been that this process is triggered by mergers between mature galaxies of roughly equal size, as the gas and dust perturbed by the merger falls inward and is swept up by the central black holes (which might merge themselves). Up until now, there has not been a large-scale investigation of this hypothesis. Now we have one: The bulk of the black hole growth since z~1 occurs in a secular universe: No major merger-AGN connection . (Available at the arXiv: 1009.3265v2 .) A sample of 140 AGNs was selected for examination. Another sample of 1264 inactive galaxies, carefully matched in size, distance, etc. was also selected for comparison. The only reliable indication of an ongoing merger is a visible distortion of the object's shape, so this is taken as a proxy for the occurrence of a merger. However, the galaxies observed could be undergoing \"minor\" mergers that don't result in visible distortion (considering how far away most selected objects are). And on the other hand, there's no way to be sure that an object's observable distortion is due to a merger. So the conservative view is that this research is looking at the correlation between galaxy activity and distortion of shape. There are two specific questions addressed by the research: (1) How many AGN have a distorted structure that appears to be the result of a galactic merger? (2) Do AGNs show any significant difference in terms of visible distortion from otherwise comparable inactive galaxies? The first question is about whether mergers that produce distortions are a necessary condition for an AGN. Since fewer than 15% of AGNs have visible distortion, the answer is clearly \"no\". The second question concerns whether a merger that produces distortion is sufficient to trigger an AGN. Since there was no significant difference between AGNs and a control set of non-AGNs in terms of frequency of visible distortion, it seems that whatever causes a distorted form (such as a merger) is not a significant cause for triggering an AGN. Bottom line: Not only are distortion-producing mergers unnecessary for triggering an AGN, they do not even seem to be a significant cause. One way to think of it is as a visible symptom of some underlying process that might otherwise be hard to detect. (A medical example would be a cancer, whose presence might be indicated by physical symptoms or biochemical markers in the blood.) In the present case, it appears that having a distorted form isn't a symptom usually exhibited by a galaxy when an AGN is present - and in fact, it doesn't predict the presence of an AGN at all. It is important to be able to identify reliable symptoms, because a galaxy may have an AGN that is not readily detectable directly. Many AGNs are not intense radio sources, presumably because they do not have significant jet structures. And unless we are viewing the galaxy more or less face-on, radiation at shorter wavelengths can be blocked by a thick torus of gas and dust surrounding the central engine of the AGN. Not all important questions are answered by this study. For example, galaxy mergers that do not significantly distort galactic structure – perhaps involving the cannibalism of a small galaxy by a large one – might play an important role in triggering an AGN. The results of this research are surprising, because they seem to rule out distortion-producing galaxy mergers as an important cause of AGNs – the previous general assumption. However, it shouldn't be concluded that galaxy collisions can never produce AGNs, let alone SMBHs. There is still the question of whether a SMBH can form \"from scratch\" without some sort of \"seed\". It could be that very large black holes formed in the very first instants after the big bang, as \"primordial\" black holes. (See here , for example. Further possibility for the formation of seed black holes are discussed here .) However, a simulation study reported last year in Nature ( here ) showed that in the early universe, SMBHs could form directly from galaxy collisions. But conditions at that time were very different – there was much more gas around that hadn't formed into stars, and a much larger single mass of gas could accumulate without forming stars. Time permitting, as usual, I'd like to discuss this research in another post.    Cisternas, M., Jahnke, K., Inskip, K., Kartaltepe, J., Koekemoer, A., Lisker, T., Robaina, A., Scodeggio, M., Sheth, K., Trump, J., Andrae, R., Miyaji, T., Lusso, E., Brusa, M., Capak, P., Cappelluti, N., Civano, F., Ilbert, O., Impey, C., Leauthaud, A., Lilly, S., Salvato, M., Scoville, N., & Taniguchi, Y. (2011). THE BULK OF THE BLACK HOLE GROWTH SINCE Z~1 OCCURS IN A SECULAR UNIVERSE: NO MAJOR MERGER-AGN CONNECTION The Astrophysical Journal, 726 (2) DOI: 10.1088/0004-637X/726/2/57  Further reading:  Galaxy collisions may not fuel black holes after all (1/6/11) Mystery Deepens in Origin of Violent Black Holes (1/5/11) Galactic Smashups Leave Giant Black Holes Hungry (1/5/11) Study: Hyperactive Black Holes Aren’t Caused by Galactic Smash-ups (1/6/11) Collisions Cleared as Cause of Galactic Infernos (1/5/11) Identity parade clears cosmic collisions of the suspicion of promoting black hole growth (1/5/11)"], "link": "http://scienceandreason.blogspot.com/feeds/1248125188228094688/comments/default", "bloglinks": {}, "links": {"http://www.physorg.com/": 1, "http://blogs.discovermagazine.com/": 1, "http://www.wired.com/": 1, "http://researchblogging.org/": 1, "http://www.nature.com/": 1, "http://iopscience.iop.org/": 2, "http://arxiv.org/": 2, "http://scienceandreason2.wordpress.com/": 1, "http://scienceandreason.blogspot.com/": 6, "http://news.sciencemag.org/": 1, "http://www.msn.com/": 1, "http://en.wikipedia.org/": 5, "http://arstechnica.com/": 1, "http://dx.doi.org/": 1}, "blogtitle": "Science and Reason"}, {"content": ["In our previous article on cyclotomic fields we were talking about why the Galois group G of ℚ(μ n )/ℚ is isomorphic to (ℤ/nℤ) × , where n∈ℤ and μ n is the group of n th roots of unity, the roots of x n -1=0 in some extension of ℚ. (Check here for a list of previous articles on algebraic number theory.) So far we've shown that G is isomorphic to a subgroup of (ℤ/nℤ) × . We still need to show it is actually isomorphic to the whole group, or equivalently that |G|, the order of G, which is equal to the degree of the field extension, [ℚ(μ n ):ℚ], actually equals |(ℤ/nℤ) × |, which is φ(n), the number of positive integers less than and relatively prime to n. The group μ n is cyclic. Any generator of the group is, by definition, a primitive n th root of unity. We let ζ be an arbitrary but fixed such generator. Then ℚ(μ n )=ℚ(ζ). Let f(x) be the minimal polynomial of ζ. f(x)∈ℚ[x] is irreducible over ℚ. All other elements of μ n are of the form ζ a for some a∈ℤ, where a is well-defined modulo n. Further, ζ a is a primitive n th root of unity if and only if a is relatively prime to n, i. e. the greatest common divisor (a,n)=1. The degree of f(x) equals [ℚ(μ n ):ℚ] and |G|. At this point, all we know about these numbers is that they divide φ(n) (since |G| does). The group homomorphism j:G→(ℤ/nℤ) × was defined by the relation σ(ζ)=ζ j(σ) , for σ∈G. We showed that j(σ) is injective and independent of the choice of ζ. Hence G is isomorphic to a subgroup of (ℤ/nℤ) × , and therefore the degree of f(x) (and [ℚ(μ n ):ℚ] and |G|) is ≤φ(n). G is isomorphic to a proper subgroup of (ℤ/nℤ) × , i. e. not the whole group, if j is not surjective and the degree of f(x) is strictly less than φ(n). As we noted last time, the problem here is that we don't yet know that all φ(n) primitive n th roots of unity are zeroes of f(x), so that |G| and the degree of f(x) equal φ(n), and hence G(ℚ(μ n )/ℚ) ≅ (ℤ/nℤ) × . Stated another way, we don't yet know that the field homomorphism on ℚ(μ n ) induced by mapping ζ to ζ a is actually an automorphism of the field, hence an element of the Galois group. It could fail to be if, say, the minimal polynomial of ζ a is different from that of ζ, which could happen if the degree of f(x) is less than φ(n) because not all primitive n th roots of unity are zeroes of f(x). In order to rule out this possibility, we will show that the degree of f(x) is ≥φ(n). There are various ways to prove the isomorphism, and even a number of ways to prove that f(x) has φ(n) distinct roots, so its degree is ≥φ(n). Many of these proofs use machinery (such as discriminants, factorization and ramification of primes, etc.) that we haven't extensively discussed yet, so I'll avoid using such things in the proof. However, we'll get to these topics eventually, and also show a way to construct the automorphisms σ∈G explicitly – after finishing the proof that G(ℚ(μ n )/ℚ) ≅ (ℤ/nℤ) × . So let's get started. The roots of the minimal polynomial f(x)∈ℚ[x] are all conjugates σ(ζ) for σ∈G, so f(x)=Π σ∈G (x-σ(ζ)). Hence f(x) is monic (leading coefficient 1). The coefficients of f(x) are symmetric functions of all conjugates of ζ, so the coefficients are all left fixed by all σ∈G. f(x) divides x n -1, so all its roots – the conjugates of ζ – are algebraic integers. So the coefficients are also algebraic integers (sums of products of powers of algebraic integers) – members of the ring of integers O ℚ(ζ) . They are also in the base field, since they're left fixed by G. A basic fact is that O ℚ(ζ) ∩ℚ = ℤ – any algebraic integer that lies in the base field is necessarily an integer of the base field. Hence f(x)∈ℤ[x]. Suppose that for any a∈ℤ relatively prime to n, i. e. (a,n)=1, ζ a is also a root of f(x): f(ζ a )=0. Since these ζ a with 1≤a<n are distinct primitive n th roots of unity if ζ is, and there are φ(n) of them, the degree of f(x), and hence |G|, is ≥ φ(n). But we already showed |G|≤φ(n), hence |G|=φ(n). Since G is isomorphic to a subgroup of (ℤ/nℤ) × , we must actually have an isomorphism: G ≅ (ℤ/nℤ) × . So all we have to show is f(ζ a )=0 for 1≤a<n and (a,n)=1. The first thing to note is that it suffices to prove this just for primes p with (p,n)=1. For suppose we had that. For general a with (a,n)=1, let p be a prime that divides a. Then (p,n)=1. Consider ζ a/p . Since (a/p,n)=1, ζ a/p is a primitive n th root of unity with one fewer prime divisor in the exponent than ζ a . So by induction on the number of prime divisors of the exponent f(ζ a/p )=0. But if the result is true for prime powers of primitive n th roots of unity that satisfy f(x)=0, then f(ζ a )=0 since ζ a =(ζ a/p ) p . Alternatively, you can recall that (according to a theorem of Dirichlet ), there are infinitely many primes p in the arithmetic progression a+nk for (a,n)=1 and k∈ℤ. Since ζ n =1, ζ a =ζ p for all such p. So let p be prime and (p,n)=1. Then note that f(x) p -f(x p )∈pℤ[x] for any f(x)∈ℤ[x]. This can be proved by induction on the degree of f(x). Suppose the highest degree term of f(x) is Ax m , with p∤A. Then (Ax m ) p -Ax mp ∈pℤ[x] because A p ≡A (mod p), because (ℤ/pℤ) × is cyclic of order p-1 ( Fermat's theorem ). So if h(x)=f(x)-Ax n , then we just have to show h(x) p -h(x p )∈pℤ[x]. But that can be assumed true by induction, unless the degree of h(x) is 1. In the latter case, if h(x)=Ax+B, we need (Ax+B) p -(Ax p +B)∈pℤ[x]. But all the coefficients in (Ax+B) p except the first and last contain binomial coefficients divisible by p, and the remaining terms are handled with Fermat's theorem as before. Finally, then, suppose the opposite of what we want to show, namely that there is a prime p with p∤n and f(ζ p )≠0. By what we just showed, f(ζ p ) is divisible by p in O ℚ(ζ) . We have f(x)=Π i∈I (x-ζ i ) for I={i∈ℤ: 1≤i<n and (i,n)=1}. So f(ζ p ) divides a product of nonzero factors ζ p -ζ i . By a lemma we'll prove in a moment, if J={(i,j): i,j∈ℤ, 0≤i,j<n, i≠j}, Π (i,j)∈J (ζ i -ζ j ) = (-1) n-1 n n . Hence f(ζ p ) divides n n and p|n, contrary to assumption. This contradiction means f(ζ p )=0, as required. We've now shown f(x) has at least φ(n) roots, hence G(ℚ(μ n )/ℚ) ≅ (ℤ/nℤ) × . Now for the last lemma: We have x n -1=Π 0≤i<n (x-ζ i ). Equating the constant terms gives (-1) n-1 =Π 0≤i<n ζ i . And by taking derivatives of both sides, nx n-1 =Σ 0≤i<n Π 0≤j<n, j≠i (x-ζ j ). Substituting x=ζ k , nζ k(n-1) =Π 0≤j<n, j≠k (ζ k -ζ j ). Taking products of this for 0≤k<n gives, with the set J as above, Π (i,j)∈J (ζ i -ζ j ) = n n (Π 0≤k<n ζ k ) n-1 . But the last product on the right side was evaluated above, so finally we are left with (-1) n-1 n n on the right (since n-1 has the same even/odd parity as its square). Well, that was a bit of work, wasn't it? But nothing too esoteric, apart from a little Galois theory and some classic number theoretical facts. (Thanks to [1, pp 96-8] for the bulk of the proof.) Actually, it is possible to do this without the lemma, using the theorem on primes in an arithmetic progression. Suppose f(x) is any polynomial in ℤ[x] such that f(ζ)=0 when ζ is a primitive n th root of unity. Then for any a∈ℤ with (a,n)=1, since f(x) p -f(x p )∈pℤ[x] for any prime p∈ℤ, we have 0=f(ζ) p ≡f(ζ p ) mod pO ℚ(ζ) . But there are infinitely many primes p≡a mod n, and for such p, ζ p =ζ a . Consequently, f(ζ a ) is a member of an infinite number of distinct prime ideals, which is possible only if f(ζ a )=0. Hence f(x) has degree ≥φ(n), which is the crucial fact we found before. We can now define the cyclotomic polynomial Φ n (x)=Π 0<i<n, (i,n)=1 (x-ζ i ), for any primitive n th root of unity ζ. From the foregoing, we know a lot about Φ n (x): its roots are precisely all the primitive n th roots of unity (in ℂ), its degree is φ(n), it is irreducible (over ℚ), its coefficients are in ℤ, and it is the minimal polynomial of ζ. The notation Φ n (x) is on account of its relation to the Euler function φ(n). We also have this factorization of x n -1 in ℤ[x]: x n -1 = Π d|n Φ d (x). This holds, since the roots of each Φ d (x) are precisely the roots of unity in the cyclic group μ n that have exact order d for each d that divides n. (Each root has one and only one exact order d satisfying d|n.) This relation is occasionally useful, and it yields interesting facts such as Σ d|n φ(d) = n (by taking degrees of polynomials on both sides). It turns out that the irreducibility of Φ n (x) is relatively easy to prove for certain n, namely those that are powers of a single prime. So let p be prime and q=p r for an integer r≥1. Let f(x)=Φ q (x). The roots of f(x) are primitive q th roots of unity, namely ζ∈μ q such that ζ has order q. There are φ(q) of these and φ(q)=q-q/p=q(1-1/p)=(p-1)p r-1 (because every p th element of the set {0,1,...,q-1} is divisible by p). So clearly f(x)=(x q -1)/(x q/p -1). Let g(x)=(x p -1)/(x-1) and h(x)=g(x+1)=((x+1) p -1)/x=x p-1 +Σ 0<j<p ( p j )x j-1 , where ( p j ) is a binomial coefficient , which is divisible by p if 0<j<p. Finally, consider the polynomial h(x q/p )=g(x q/p +1). Suppose f(x) splits in ℚ[x]. Then since f(x)=g(x q/p ), the latter splits, and consequently g(x q/p +1)=h(x q/p ) does too. But h(x q/p ) is what's known as an Eisenstein polynomial , because the leading coefficient is not divisible by p, the constant term is p (not divisible by p 2 ), and all other nonzero coefficients (the binomial coefficients) are divisible by p. However, Eisenstein polynomials are irreducible over ℚ. This contradiction means f(x) must be irreducible over ℚ. QED. The fact that Φ q (x) is irreducible if q=p r , and hence G(ℚ(μ q )/ℚ)≅(ℤ/qℤ) × , can be used as the basis for yet another proof of this isomorphism for arbitrary n, by considering prime power divisors q of n, the corresponding extensions ℚ(μ q )/ℚ, and their Galois groups in building up the full extension ℚ(μ n )/ℚ and its Galois group. But we won't go into that now. In the next installment, we'll discuss many more fun facts about cyclotomic fields. References: [1] Goldstein, Larry Joel - Analytic Number Theory"], "link": "http://scienceandreason.blogspot.com/feeds/1580553276143109467/comments/default", "bloglinks": {}, "links": {"http://scienceandreason.blogspot.com/": 3, "http://en.wikipedia.org/": 4}, "blogtitle": "Science and Reason"}, {"content": ["A Great Ball of Stars (10/25/10) The NASA/ESA Hubble Space Telescope has turned its sharp eye towards a tight collection of stars, first seen 174 years ago. The result is a sparkling image of NGC 1806, tens of thousands of stars gravitationally bound into a rich cluster. Commonly called globular clusters, most of these objects are very old, having formed in the distant past when the Universe was only a fraction of its current age. NGC 1806 lies within the Large Magellanic Cloud, a satellite galaxy of our own Milky Way.  NGC 1806 – click for 1280×788 image"], "link": "http://scienceandreason.blogspot.com/feeds/4000508438918410387/comments/default", "bloglinks": {}, "links": {"http://www.spacetelescope.org/": 2}, "blogtitle": "Science and Reason"}, {"content": ["M87 (Messier 87), also known as NGC 4486, is a giant elliptical galaxy , located about 53.5 million light-years away. It is noteworthy for several reasons, including the presence of an unusually large supermassive black hole (SMBH) in its active galactic nucleus , with an estimated mass of about 6.4×10 9 times the mass of the Sun (M ⊙ ), two plasma jets that emit strongly at radio frequencies and extend at least 5000 light-years from the SMBH (although only the jet pointed more towards us is readily detectable), and a population of about 15,000 globular clusters . The total mass of M87 is difficult to estimate, because elliptical galaxies like M87, and unlike spiral galaxies, do not tend to follow the Tully-Fisher relation between intrinsic luminosity and total mass calculated from rotation curves – which therefore includes dark matter . Estimates of the total mass of M87, including dark matter, come in around 6×10 12 M ⊙ within a radius of 150,000 light-years from the center. This compares with about 7×10 11 M ⊙ for the Milky Way , but M87 could be more than 10 times as massive. In other comparisons, the Milky Way has only about 160 globular clusters, and a central black hole ( Sagittarius A* ) with a mass of about 4.2×10 6 M ⊙ . So M87's central black hole is about 1500 times as massive as the Milky Way's. Pretty impressive difference.  M87 – click for 640×480 image Besides the recent research listed below, I've written about earlier research on M87 in these articles: Galactic black holes may be more massive than thought , Stellar birth control by supermassive black holes , Black holes in the news . You might also be interested in some articles from the past year on the general subject of active galaxies: Active galaxies and supermassive black hole jets , Where the action is in black hole jets , Quasars in the very early universe .  Feedback under the microscope: thermodynamic structure and AGN driven shocks in M87 (6/29/10) – arXiv paper  Feedback under the microscope II: heating, gas uplift, and mixing in the nearest cluster core (3/28/10) – arXiv paper Activity of the SMBH in M87 has a significant effect not only on the host galaxy, but also on the Virgo cluster of galaxies in which M87 is near the center. Energetic outflows of matter from near the black hole force plumes of gas out of the galaxy into the hotter intergalactic medium. The mass transported in this way represents about as much gas as is contained within 12,000 light-years of M87's center. (However, that's only about 2.5% of M87's 500,000 light-year radius.) If it had not been expelled, the gas could have formed hundreds of millions of stars. The first paper reports on studies using the Chandra X-ray Observatory to measure gas temperatures around M87's center. The findings include detection of 2 distinct shock wave fronts about 46 thousand light-years and 10 thousand light years from the center. This indicates that explosive events occurred about 150 million and 11 million years ago, respectively. The second paper uses observations from Chandra, XMM-Newton , and optical spectra to distinguish different phases of the hot gas surrounding M87's SMBH. Refs: • Galactic 'Super-Volcano' in Action (8/20/10) – Science Daily (press release) • Galactic Supervolcano Erupts From Black Hole (8/20/10) – Wired.com • Galactic 'Supervolcano' Seen Erupting With X-Rays (9/6/10) – Space.com  A correlation between central supermassive black holes and the globular cluster systems of early-type galaxies (8/13/10) – arXiv paper A study of 13 galaxies, including M87, has found a correlation between the size of a galaxy's SMBH and the number of the galaxy's globular clusters. The types of galaxies studied included nine giant ellipticals (like M87), a tight spiral, and 3 galaxies intermediate in type between spiral and elliptical. The smallness of the sample is due to the exclusion of open spiral galaxies and the further limitation to cases where good estimates of the number of globular clusters and mass of the central black hole existed. The correlation, in which the number of globular clusters is proportional to the black hole mass, is actually stronger than correlations between black hole mass and other galaxy properties previously studied for correlation, such as stellar velocity dispersion (an indicator of total mass), and luminosity of the galaxy's central bulge or whole galaxy (for ellipticals). In some cases the correlation of black hole mass with total luminosity was especially weak, but better with number of globular clusters. For instance, Fornax A ( NGC 1316 ) is a giant lenticular galaxy with luminosity comparable to that of M87. Yet its central black hole has a mass of 1.5×10 8 M ⊙ , 2.3% that of M87's black hole. It has 1200 globular clusters, 8% of M87's count. Clearly this is not a linear relation. Rather, the study found that the best fit was a power law with M • ≈ (1.7×10 5 )×N 1.08±0.04 , where M • is black hole mass in units of M ⊙ and N is number of globular clusters. This relation predicts a SMBH mass of 5.5×10 9 M ⊙ for M87, which is very close, and 3.6×10 8 M ⊙ for the SMBH mass of NGC 1316, which is high – but the SMBH mass of NGC 1316 is also unusually low in comparison with its luminosity and velocity dispersion. By contrast, the relation predicts that the Milky Way with a SMBH mass of 4.2×10 6 M ⊙ should have only about 20 globular clusters, while the actual number is about 160. However, the Milky Way is a loose spiral, not one of the types that was studied, which may account for the much worse correlation. The fit is much better if only globular clusters associated with the central bulge (about 30) are considered. The obvious question is about why this relation between SMBH mass and number of globular clusters exists. Presumably it has much to do with the typical history of a large galaxy, which is expected to include frequent mergers with other galaxies. The existence of the relationship should provide clues to galactic history, and especially how this may be different for loose spirals like the Milky Way, in comparison with more compact galaxies. Refs: • A correlation between central supermassive black holes and the globular cluster systems of early type galaxies (8/11/10) – The Astrophysical Journal • Supermassive black holes reveal a surprising clue (5/25/10) – Physicsworld.com  A Displaced Supermassive Black Hole in M87 (6/16/10) – arXiv paper It has generally been assumed that a galaxy's central SMBH is very close to the actual center of mass of the galaxy, because that is (by definition) the gravitational equilibrium point. This central point should be essentially the same as the photometric center of the galaxy, since the galaxy's stars should be distributed symmetrically around the center. Consequently, astronomers have not carefully searched for cases where a SMBH is not very near the galactic center. This lack of extensive investigation is also a result of the fact that the SMBH is often hidden inside a dense cloud of dust, so its exact position is difficult to determine. M87's SMBH (more precisely, the accretion disk around the SMBH), however, is clearly visible, and the research reported in this paper finds it is actually located about 22 light-years from the apparent galactic center. There are various possible reasons for this much displacement from the center, and not a lot of evidence to identify the most likely reason. Possible reasons include: (1) The SMBH is part of a binary system in which the other member is not detected. (2) The SMBH could have been gravitationally perturbed by a massive object such as a globular cluster. (3) There is a significant asymmetry of the jets. (4) The SMBH has relatively recently merged with another SMBH, subsequent to an earlier merger of another galaxy with M87. The displacement of the SMBH is in the direction opposite the visible jet, so the last two possibilities are more likely than the others. However, possibility (3) depends on the jet structure having existed at least 100 million years and the density of matter at the center of M87 being low enough to provide insufficient restoring force. Possibility (4) is viable if the SMBH is still oscillating around the center following a galactic merger within the past billion years. Refs: • A Displaced Supermassive Black Hole in M87 (6/9/10) – The Astrophysical Journal Letters • Black Hole Shoved Aside, Along With 'central' Dogma (5/25/10) – Science News • Black Hole Found in Unexpected Place (5/25/10) – Wired.com • Supermassive black holes may frequently roam galaxy centers (5/25/10) – Physog.com (press release) • Bizarre Behavior of Two Giant Black Holes Surprises Scientists (5/25/10) – Space.com • Galactic Black Holes Can Migrate or Quickly Awaken from Quiescence (5/26/10) – Scientific American   M87 jet  Radio Imaging of the Very-High-Energy γ-Ray Emission Region in the Central Engine of a Radio Galaxy (7/24/09) – Science Energetic plasma jets, in which matter is accelerated close to the speed of light, combined with intense electromagnetic emissions, especially at radio frequencies, are prominent in about 10% of active galaxies, including M87. However, little has been well established about what processes are responsible for the emissions, or more generally how the jets are powered, accelerated, and focused into narrow beams. Because of the relative proximity of M87 and the fact that the jet we observe is angled from 15° to 25° to our line of sight, M87 is one of the best objects to study in order to learn more about how jets work. Gamma rays, because of their very high energies (greater than 100 keV per photon), are not continuously produced in active galaxy jets, but are occasionally observed in short bursts lasting only a few days. One such event occurred in M87 in February 2008. At the same time, the intensity of radiation at all other wavelengths increased substantially. Such flares, at lower energies, are not unusual, since the energy output of most jets is somewhat variable in time. The flare persisted for much longer at energies below the gamma-ray band, indicating that the disturbance continued to propagate along the jet even after the gamma-ray flare subsided. However, although we don't know what the cause was, the coincidence in time of the gamma-ray emissions and the beginning of the extended flare makes it very likely that the events had the same source. This is significant information, because our technology for detecting gamma-ray events has very poor angular resolution (~0.1°), since gamma rays can be detected on the ground only by secondary effects that a gamma ray produces in our upper atmosphere. More than 6 orders of magnitude finer resolution can be achieved at radio frequencies, using very long baseline interferometry . With that technology, it was possible to locate the origin of the disturbance that caused both gamma ray and lower energy flaring to a region within about 100 Schwarzschild radii (R s ) of the SMBH. Since R s = 2G×M • /c 2 , R s for the M87 SMBH is about 1.9×10 10 km, or more than twice the radius of the solar system. So 100R s is about 70 light-days – which is pretty small compared to the 53.5 million light-year distance to M87. It's also significant that the gamma-ray event occurred so close to the SMBH, because the cause must be unlike whatever is responsible for the flaring described in the following research. Refs: • VLBA locates superenergetic bursts near giant black hole (7/2/09) – Physorg.com (press release) • Mysterious Light Originates Near A Galaxy's Black Hole (7/2/09) – Space.com • A Flare for Acceleration (7/24/09) – Science • High Energy Galactic Particle Accelerator Located (9/14/09) – Science Daily (press release)  Hubble Space Telescope observations of an extraordinary flare in the M87 jet (4/22/09) – arXiv paper Electromagnetic radiation from SMBH jets is fairly variable in both time and location along the jet. In the case of M87, high-resolution images at various wavelengths have shown the existence of many regions of enhanced emissions within the jet. One of the most prominent of these even has a name: HST-1, so-named because it was discovered by the Hubble Space Telescope. It occupies a stationary position on the jet, about a million Schwarzschild radii from the center, i. e. about 2000 light-years from the SMBH. HST-1 has been observable for some time, but until February 2000 it was relatively dormant. After that it began to flare more brightly across the electromagnetic spectrum up to X-rays. In 2003 it became more variable, and it reached its greatest brightness in May 2005, when the flux in near ultraviolet was 4 times as great as that of M87's central energy source, the SMBH accretion disk. This represents a brightness increase at that wavelength of a factor of 90. The X-ray flux increased by a factor of 50, and similar, synchronized changes occurred at other wavelengths. The synchronization indicates that one mechanism is responsible for the variability at all wavelengths. What the actual cause of the disturbance may be is not clear. Because of the great distance of HST-1 from the SMBH, its basic energy source must not be the central accretion disk itself. More likely HST-1 is a result of constriction of magnetic field lines, resulting in further acceleration of the particles making up the jet. Acceleration of charged particles causes radiation by the synchrotron process, and is evidenced by polarization of the emitted photons. Constriction of the jet may be a result of passage through a region of higher density of stars. The increased variability could mean that the jet has encountered a region of higher but varying stellar density. Alternatively, the jet may be passing through a patch of thick gas or dust, with excess radiation produced by the resulting particle collisions. These results could explain the variability of light from other, more distant active galaxies, at least those which have strong jets, given that it's possible for a small region of the jet far from the SMBH to outshine the central source. However, another source of variability occurs when a jet is viewed at a very low angle to our line of sight, in which case any slight change of direction could cause an apparent change of brightness. Refs: • Hubble Space Telescope observations of an extraordinary flare in the M87 jet (3/6/09) – The Astronomical Journal • Hubble Witnesses Spectacular Flaring in Gas Jet from M87's Black Hole (4/14/09) – Physorg.com (press release) • Black Hole Creates Spectacular Light Show (4/14/09) – Space.com • Black hole jet brightens mysteriously (4/15/09) – New Scientist • Black hole spews out impressive light show (4/20/09) – Cosmos Magazine"], "link": "http://scienceandreason.blogspot.com/feeds/4631500952933661352/comments/default", "bloglinks": {}, "links": {"http://www.sciencenews.org/": 1, "http://apod.nasa.gov/": 2, "http://www.sciencedaily.com/": 2, "http://www.wired.com/": 2, "http://www.newscientist.com/": 1, "http://www.sciencemag.org/": 2, "http://www.space.com/": 4, "http://iopscience.iop.org/": 3, "http://arxiv.org/": 5, "http://scienceandreason.blogspot.com/": 6, "http://physicsworld.com/": 1, "http://en.wikipedia.org/": 20, "http://www.physorg.com/": 3, "http://www.scientificamerican.com/": 1, "http://www.cosmosmagazine.com/": 1}, "blogtitle": "Science and Reason"}, {"content": ["Pinwheel of Star Birth (10/19/10) This face-on spiral galaxy, called NGC 3982, is striking for its rich tapestry of star birth, along with its winding arms. The arms are lined with pink star-forming regions of glowing hydrogen, newborn blue star clusters, and obscuring dust lanes that provide the raw material for future generations of stars. The bright nucleus is home to an older population of stars, which grow ever more densely packed toward the center. NGC 3982 is located about 68 million light-years away in the constellation Ursa Major. The galaxy spans about 30,000 light-years, one-third of the size of our Milky Way galaxy.  NGC 3982 – click for 984×1000 image More: here"], "link": "http://scienceandreason.blogspot.com/feeds/864426024244770907/comments/default", "bloglinks": {}, "links": {"http://hubblesite.org/": 1, "http://www.nasa.gov/": 1, "http://imgsrc.hubblesite.org/": 1}, "blogtitle": "Science and Reason"}]