[{"blogurl": "http://www.seewhatyoumean.blogspot.com\n", "blogroll": [], "title": "Seewhatyoumean"}, {"content": ["The illustrations of James Burlinson are fantastic, unique and make my eyes happy. Currently looking for work James has created a great C.V. which has a nod to 8 bit art and an infographic feel to it. If it landed on your desk/inbox it would be hard to ignore."], "link": "http://seewhatyoumean.blogspot.com/feeds/1652736293928534570/comments/default", "bloglinks": {}, "links": {"http://burlisaurus.co.uk": 1, "http://25.tumblr.com/": 1, "http://www.co.uk/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["One in a series of great animated videos from Google to promote their Chrome Web Lab at the Science Museum, London. The experiments include a robot that draws your portrait taken from your web camera in sand, as well as universal orchestra, teleporter, data tracer and lab tag explorer. See them all in action on the Chrome Web Lab website."], "link": "http://seewhatyoumean.blogspot.com/feeds/8316088289478218285/comments/default", "bloglinks": {}, "links": {"http://www.chromeweblab.com/": 2}, "blogtitle": "Seewhatyoumean"}, {"content": ["Font awesome is a typeface of icons designed to be used with twitter bootstrap . The typeface comprises of 220 icons which are free to use commercially. A great resource for designers and especially web designers due to the CSS integration. A very useful font to add to your arsenal."], "link": "http://seewhatyoumean.blogspot.com/feeds/2743067472152409149/comments/default", "bloglinks": {}, "links": {"http://twitter.github.com/": 1, "http://fortawesome.github.com/": 2}, "blogtitle": "Seewhatyoumean"}, {"content": ["This is a pretty cool animation created by visualisation specialist Jo Wood . It shows the first 5 million journeys pedaled in the Barclays Cycle Hire scheme."], "link": "http://seewhatyoumean.blogspot.com/feeds/5804133247341713572/comments/default", "bloglinks": {}, "links": {"http://www.ac.uk/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["One for all you web devs, a great tutorial on how to create an iPhone using a single element and CSS3. What's really great is being able to play around with the code at any point during the tutorial."], "link": "http://seewhatyoumean.blogspot.com/feeds/4632119120865008895/comments/default", "bloglinks": {}, "links": {"http://cssdeck.com/": 2}, "blogtitle": "Seewhatyoumean"}, {"content": ["Grid app from Binary Thumb Corporation looks set to make spreadsheets simple, clean and collaborative. Watch the video about to see it in action."], "link": "http://seewhatyoumean.blogspot.com/feeds/6257647940883671857/comments/default", "bloglinks": {}, "links": {"http://grid.binarythumb.com/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["Branch describe their experience as the online equivalent of a conversation across a dinner table. Branch allows users to grab something from online, whether its an article, a tweet or a photo and 'branch' a conversation from it.  Head of Product Josh Miller says, \"Between articles, blog posts, and tweets, the internet is dominated by monologues. So we want to build a home for dialogues online, by combining the intimacy of a dinner table conversation with the power of the internet.\" Attempting to create an experience that's more human? Gets the thumbs up from us!"], "link": "http://seewhatyoumean.blogspot.com/feeds/8940563912894534181/comments/default", "bloglinks": {}, "links": {"http://branch.com/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["As a child who grew up on a diet of Nes & Master system I'm a sucker for some 8-bit animation. The animation is from Fraser Davidson and promotes The Alternative Rugby Commentary."], "link": "http://seewhatyoumean.blogspot.com/feeds/8317550248074263432/comments/default", "bloglinks": {}, "links": {"http://fraserdavidson.co.uk/": 1, "http://arcrugby.co.nz/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["Google is launching high speed fiber internet (in America) and have made a video that shows the evolution of the internet. It's a cute video with some nice touches and plenty of charm. See the Google fiber site for some more videos."], "link": "http://seewhatyoumean.blogspot.com/feeds/5859250566166339894/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Seewhatyoumean"}, {"content": ["To celebrate the Olympics Studio AKA have put the LOVESPORT animations online! The animations are fantastically simple but highly effective. There will be a new animation daily so keep visiting www.studioaka.co.uk"], "link": "http://seewhatyoumean.blogspot.com/feeds/6262429442250019147/comments/default", "bloglinks": {}, "links": {"http://www.co.uk/": 2}, "blogtitle": "Seewhatyoumean"}, {"content": ["This Exquisite Forest is a new take on the classic game of exquisite corpse. In the exquisite forest each tree represents an animation, and each branch takes the animation in a new direction. Users can create their own animations to build from the previous animation all based on a set theme. The project was conceived by Chris Milk and Aaron Koblin , and produced by Google and Tate."], "link": "http://seewhatyoumean.blogspot.com/feeds/6637995640229331436/comments/default", "bloglinks": {}, "links": {"http://www.aaronkoblin.com/": 1, "http://portfolio.chrismilk.com/": 1, "http://www.exquisiteforest.com/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["Ford have developed an app to make logging in to all your online accounts effortless. The app allows you to enter your passwords one last time, your smart phone then acts as a key to unlock the accounts. Clever stuff, and I for one would love not to have to remember all my passwords. It works via bluetooth, which raises some security concerns, but if they can get it secure then this could be amazing. Love the animation style in the video too."], "link": "http://seewhatyoumean.blogspot.com/feeds/6855698516458000251/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Seewhatyoumean"}, {"content": ["One new feature I liked in the forthcoming OS X Mountain Lion release is the AirPlay mirroring. Mirroring allows you to show your desktop on your Apple TV. But what about Windows users? Well, AirParrot from Squirrels fills the gap. Once installed you can share your desktop to your Apple TV with ease, hurrah!"], "link": "http://seewhatyoumean.blogspot.com/feeds/8872259851044110169/comments/default", "bloglinks": {}, "links": {"http://airsquirrels.com/": 2, "http://airparrot.com/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["infogr.am is a service that allows you to create web based infographics in your browser. You simply pick a design you like, add your data then share or embed infographic. Looks like a great tool to build quick infographics on the fly. Check out the samples on the infogr.am website."], "link": "http://seewhatyoumean.blogspot.com/feeds/8251410688886452533/comments/default", "bloglinks": {}, "links": {"http://infogr.am/": 3}, "blogtitle": "Seewhatyoumean"}, {"content": ["Ayotle in partnership with Digitas Labs have developed Any Touch - A tactile object prototype. Using a DSLR camera and a 3D depth sensor the software can detect object and gestures. This allows the user to interact with digital experiences. Check the video to see it in action."], "link": "http://seewhatyoumean.blogspot.com/feeds/5442348384313616529/comments/default", "bloglinks": {}, "links": {"http://www.digitas.fr/": 1, "http://www.ayotle.com/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["Microsoft is developing a ‘zoom’ based presentation tool called ChronoZoom . It allows you to have an almost infinite page. Fill the screen with a 24hr timeline, and zoom out in stages until you have 13.7 billion years in view. And you can add text, image and video to the timeline at any point. The Economist (June 2nd – Prophets of zoom) asks will this catch on? And quotes an evolutionary neurobiologist saying that zooming is similar to the way we experience moving through open spaces, through undergrowth and looking at distant vistas. It’s perhaps a more natural way to communicate. At ‘See what you mean’ we’ve developed a similar flexible presentation structure. It allows zoom and a branch like structure. So a presenter can unfold freely; not limited to a fixed order of slides. Your business on one page, as we say."], "link": "http://seewhatyoumean.blogspot.com/feeds/8697116818456965106/comments/default", "bloglinks": {}, "links": {"http://www.youtube.com/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["Randy Krum from coolinfographics.com is collecting a pinterest board of infographic resumes . A great resource, and if you know of some to suggest send them to @rtkrum on twitter."], "link": "http://seewhatyoumean.blogspot.com/feeds/9157247371297413885/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 1, "http://www.coolinfographics.com/": 1, "https://twitter.com/": 1, "http://pinterest.com/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["Inspired by typewriter ribbon tins I created some social media themed tins. There is one for YouTube and one for Twitter, hopefully I'll make some more soon. Free to download and use."], "link": "http://seewhatyoumean.co.uk/downloads/social-ribbons.zip", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "https://www.google.com/": 1, "http://seewhatyoumean.co.uk/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["Douglas Coupland has unveiled the V-Pole at the New Cities Summit in Paris \"The V-Pole (‘V’ for Vancouver) is a slim, modular utility pole connected to underground optical wiring. In a simple Lego-like manner, it can be installed in urban settings and provides neighbourhoods with wi-fi and mobile wireless, LED street lighting, electric vehicle charging, parking transactions and can act as an electronic neighbourhood bulletin board.\" Read more on the V-pole website."], "link": "http://seewhatyoumean.blogspot.com/feeds/8614015345565326050/comments/default", "bloglinks": {}, "links": {"http://1.blogspot.com/": 1, "http://www.v-pole.com/": 1}, "blogtitle": "Seewhatyoumean"}, {"content": ["Clever use of hacked LCD screens and polarised glasses by Lynx to create an invisible advert. By removing the LCD screens polarising film the images are invisible to the naked eye, but get a pair of polarised glasses and it is visible once more. Simple hack but effective use from Lynx."], "link": "http://seewhatyoumean.blogspot.com/feeds/6945387264936576629/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Seewhatyoumean"}, {"content": ["Just watched this cute video from Antonio Vicentini, great pixel style and the transitions work really well. See how many cameras you can identify."], "link": "http://seewhatyoumean.blogspot.com/feeds/4962613880527193216/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Seewhatyoumean"}, {"content": ["This article in The Wall Street Journal is right on the money. Doodling, or creating rich pictures as we call it, is a sure-fire way to open up discussion and encourage participation. Ideas can be complex, and words are exact. People will argue about their meaning and lose sight of the bigger picture. As John Heggarty said ‘words are a barrier to communication’. Pictures are more immediate, universal, and most importantly they carry emotion. When you tell someone a story, or show them a sketch plan, they’re much more likely to become engaged and say ‘I see what you mean’. We’ve been developing rich pictures for many years for top companies including BBC Worldwide, Capgemini, Cognizant, Gartner, KPMG and Shell. We use this doodling style to gain a profound understanding of your company or ideas. But it’s much more than just doodling to record what’s said. It’s the discussion and challenging of ideas. The dialogue moves the group’s common understanding along quickly towards agreement. But to leave it as a set of sketchnotes is less than half the job. The ideas need to be distilled and restructured, to create a picture - a journey that resonates. And then it has to be presented; unfolded by a ‘human’, in a conversational way. Left alone, a viewer will guess at the story and the meanings. You are the guide, the storyteller to bring the picture to life. As the viewer watches and listens, the insight in the picture becomes clear, and it helps to keep the whole story in mind. As we say, ‘it’s your whole business on one page’. Clients really value the clarity this process brings. It’s been described as ‘almost magic’ and ‘genius!’. Take a look at some case studies on seewhatyoumean.co.uk and check out what our client’s say about it. You’ll be amazed how easy it is to develop and present your ideas through this process."], "link": "http://seewhatyoumean.blogspot.com/feeds/627984493091074988/comments/default", "bloglinks": {}, "links": {"http://online.wsj.com/": 1, "http://www.co.uk/": 2}, "blogtitle": "Seewhatyoumean"}, {"content": ["Great follow up campaign from Tip-Ex, Hunter and bear’s 2012 birthday party goes allows you to take hunter and bear to various times through history and continue their party. There are quite a lot of videos to find, with lots of famous points in history to seek out. Watch the video on YouTube"], "link": "http://seewhatyoumean.blogspot.com/feeds/4761320073450889863/comments/default", "bloglinks": {}, "links": {"http://www.youtube.com/": 2}, "blogtitle": "Seewhatyoumean"}, {"content": ["Great talk from John Cleese on creativity and what you can do to foster creative thoughts."], "link": "http://seewhatyoumean.blogspot.com/feeds/1951916920082125324/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Seewhatyoumean"}, {"content": ["The kid should see this is a fantastic blog that collects interesting videos from around the web. \"There's just so much science, nature, music, art, technology, storytelling and assorted good stuff out there that my kids (and maybe your kids) haven't seen.\" The content is collected by Rion Nakaya and her four year old co-curator. The mix of content works really well and every video is worth watching once if not twice. You can also follow them on twitter"], "link": "http://seewhatyoumean.blogspot.com/feeds/3474415807521078036/comments/default", "bloglinks": {}, "links": {"http://thekidshouldseethis.com/": 2, "https://twitter.com/": 2}, "blogtitle": "Seewhatyoumean"}]