[{"blogurl": "http://seqonomics.blogspot.it\n", "blogroll": [], "title": "Seqonomics"}, {"content": ["Things are going to change around here.  Until now, this blog has been about the business of genomics. From next week, the scope of Seqonomics will be wider and also include topics associated with personalised medicine other than genomics. Expect posts on electronic health record systems, health IT, pharmacogenomics, and metabolomics. But don't worry if you liked my previous genomics-and-business posts: There'll be plenty more of those as well.      Welcome on board  Why this change? I have come to the conclusion that it is a mistake to consider genomics in isolation without taking into account all the other disruptive changes that are happening in medicine. Working in genomics, it is easy to misjudge how, and how much, genomics impacts medicine compared to other innovations. This is why from now on, Seqonomics will not just be about genomics, but about personalised medicine in general.  The one thing that is not going to change is that I'll keep approaching all topics from a business angle. To reflect this, the tagline of Seqonomics is going to change from The Economics of Genome Sequencing to The Economics of Personalised Medicine ."], "link": "http://seqonomics.blogspot.com/feeds/1865423899877227730/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["The Ultimate Generation Sequencer. Click on picture to enlarge."], "link": "http://seqonomics.blogspot.com/feeds/4961832712760627711/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["Earlier this week, the world's leading sequencing services company BGI announced a takeover bid for its competitor Complete Genomics. That Complete Genomics is being acquired could have been expected, but that the buyer is the BGI may come as a surprise.  Complete Genomics' technology is well regarded , and their business model is unique in the industry. Rather than building sequencing machines and selling them, they offer sequencing as a service. This means that researchers, and potentially clinicians as well, send their samples to the company and receive the sequence data back without ever having to enter a lab.  The reason why Complete Genomics has chosen this path is probably that their technology benefits from economies of scale, which would not be applicable otherwise.  Complete Genomics charges around $5,000 to sequence a human genome, which is a fair price considering that researchers save the capital cost associated with purchasing a sequencing machine, and the hassle of acquiring the expertise to run them.    Nevertheless, Complete Genomics has been struggling financially for some time. They have not been profitable in any period since they were formed , and instead they incurred significant quarterly losses that showed no sign of improvement. This depressed their share price, and as a result made it more likely that they would eventually be taken over.  Why is Complete Genomics doing this?  The advantage for Complete Genomics of being bought by the BGI is that they're not going to go bust. Understandably, the board of Complete Genomics decided against playing hard to get and has accepted BGI's offer of £3.15 per share, which is 18% more than the share's closing price the previous business day. Not all shareholders are happy about this . Some strongly feel that $3.15 is not enough , although most analysts seem to disagree with that.  Why is the BGI doing this?  If Complete Genomics' motivation for this deal is clear, there are at least two potential motivations for the BGI. The first one is that they are currently dependent on Illumina's sequencing technology. Access to Complete Genomics technology will ease that dependency, and enable them to offer additional value to their current customers.  Secondly, although they are the market leader in research services , their presence in the United States is not as strong as it could be. Access to Complete Genomics' customer list will help them to expand their presence in that crucial market.  Is this good or bad for the market as a whole?  Considering that Complete Genomics in the medium term would have kept struggling, and in the long run may well have gone out of business, this deal is probably beneficial to customers. It means that Complete Genomics technology will still be available , as the company is likely to continue its operations based at its current Silicon Valley headquarters.  Thanks to Joshua Randall at the Sanger Institute for his insights on this."], "link": "http://seqonomics.blogspot.com/feeds/8202779429617325289/comments/default", "bloglinks": {}, "links": {"http://seqonomics.blogspot.com/": 1, "http://www.bio-itworld.com/": 1, "http://seekingalpha.com/": 1, "http://omicsomics.blogspot.com/": 2, "http://2.blogspot.com/": 1, "http://biz.yahoo.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["State-owned enterprises make up most of the market capitalisation of China’s stock markets and account for some of the country's largest companies, according to the Economist magazine . State capitalism has also been particularly good at producing national champions that can compete globally.  The BGI , formerly known as Beijing Genomics Institute, is a great example of this. It is by far the largest sequencing centre in the world, and it is busy expanding overseas. It is currently establishing subsidiaries in Copenhagen , Sacramento, and Philadelphia, and it has deals with companies and research centres around the world.  One reason for its success is that it can sequence more economically that others. This is probably due to economies of scale, but also because it benefits from government subsidies such as a $1.6bn line of credit from the China Development Bank .    The BGI dominates Chinese genomics. According to Omics Maps , there are 201 next generation sequencing machines in the country. 83 percent of those are owned by the BGI.  Which is not to say that there aren't any other genomics companies. Shanghai Biochip, also trading as Shanghai Bio Corporation , is one of them. It offers diagnostic products, research supplies, and research services that include DNA sequencing. Its English website also has a section on personal genetic testing, although this is still under construction.  A second example of a Chinese genomics company is Beijing Berry Genomics , which performs pre-natal diagnosis by sequencing. It is financed by Legend, a Chinese venture capital firm that is also a controlling shareholder of the computer manufacturer Lenovo . The company develops technology that can detect trisomy 21 and other chromosomal abnormalities in foetuses during pregnancy. It seems that it is using a sequencing-based method that is similar to that of market leader Sequenom .  Overall, there is plenty of government investment in genomics and in particular in sequencing in China, and at least for the BGI, the investment seems to pay off for the time being. The ultimate test of this will however be whether the BGI will be able to pay back its $1.6bn loan when it is due in 2020.  Update On September 17th, the BGI agreed to buy the sequencing company Complete Genomics for $118, affirming its dominance of the sequencing services field.  Other countries, other genomics  This post is a part of a series on genomics in different countries, which has already covered Canada , France , Germany , and Japan ."], "link": "http://seqonomics.blogspot.com/feeds/4574672158113258523/comments/default", "bloglinks": {}, "links": {"http://www.economist.com/": 2, "http://www.shanghaibio.com/": 1, "http://www.omicsmaps.com/": 1, "http://www.sciencemag.org/": 1, "http://seqonomics.blogspot.com/": 5, "http://www.lenovo.com/": 1, "http://www.completegenomics.com/": 1, "http://www.hgbiochip.com/": 1, "http://en.wikipedia.org/": 2, "http://www.genomics.cn/": 1, "http://4.blogspot.com/": 1, "http://www.bgisequence.com/": 1, "http://www.com.cn/": 1, "http://www.bloomberg.com/": 1, "http://www.berrygenomics.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["The battle of the 'omes is on, and the winner is decided by Google and PubMed, the biomedical publication database:     'Ome sweet 'ome   The victory of the genome is of course a foregone conclusion. Besides that, it's surprising that the reactome gets so many Google hits, although a PubMed search returns less than a hundred publications containing the term.  I might compile the same figure in a year or so to see if the ranking has changed. In the meantime, have a look here for a critique of 'omics that goes a bit deeper."], "link": "http://seqonomics.blogspot.com/feeds/3391281080111537152/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://www.gigasciencejournal.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["For someone like me it's easy to forget that personalised medicine isn't just about genomics.  Eric Topol's The Creative Destruction of Medicine is a book for genomicists who want to know what's going on in health care innovation outside of genomics. It's also a book for everyone else working in a health-related field who wants to understand the changes that are happening in medicine right now outside of their specialisation.  The central thesis of the book is that there are several areas of innovation in medicine - genomics, wireless sensors, health IT, social networking, and novel ways of assessing drug efficacy - that could each have a large impact, but that together they could change medicine beyond recognition.  There are many parts of The Creative Destruction of Medicine that are excellent. The section on large clinical trials as an out-dated way of assessing drug efficacy and safety is one of them. Topol thinks that conditional approval would be a better alternative: Drugs that can reasonably be assumed to be safe are initially tested on a small group of patients under strictl regulation. The regulatory agency has the right to withdraw the conditional approval at any time, and only once a reasonably large dataset has been collected does the drug gain full approval.  Topol clearly loves his medical gadgets. I was amazed by some of the ones he describes, like a pocketable ultrasound device that allows imaging the heart in real time and that may soon replace that symbol of the medical profession, the stethoscope. My biggest complaint is that parts of the book are not entirely relevant to its central topic and have probably only been included because they are of interest to the author. For example, Topol is clearly passionate about the dangers posed by the ionising radiation that come with excessive use of medical imaging technology such as CT scans, but two chapters on this are too much.     If you wonder whether The Creative Destruction of Medicine is for you, here are the most important facts:  Areas covered: The convergence of wireless sensors, genomics, information systems, mobile connectivity, internet, social networking, and computing power. Basically anything that has to do with personalised medicine  Who it is for: Doctors and anyone else working in healthcare, including researchers. As someone working in genomics, I felt that the book did an excellent job of putting genomics into perspective  Who it is not for: This book is not a guide for patients to personalised medicine. Some of topics, such as the challenges of compatibility between different proprietary Health IT systems, will be less applicable to Europe than to the United States  How much it costs: The recommended retail price for the hardcover is $27.99, but online the book is available for $15.58. The Kindle edition is a bit more expensive and costs $15.73.  If you think you're going to buy this book, do so sooner rather than later: The rate of progress in medicine means that it'll be out-dated in a year.  Again, thanks to the Sanger Institute Library for ordering this book following my suggestion."], "link": "http://seqonomics.blogspot.com/feeds/7758925930582350297/comments/default", "bloglinks": {}, "links": {"http://www.amazon.com/": 1, "http://3.blogspot.com/": 1, "http://www.blogger.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["According to a report by Ernst & Young , the professional services firm, and EuropaBio , an industry association, American biotech companies attracted four times as much venture capital than European ones. Does this pattern hold for genomics as well?      Click on the figure to enlarge. Number of investments in genomics companies, average genomics investment, and total genomics investment in California, Massachusetts, the rest of the USA, Europe, and Canada for the period 2005-2012   When I analysed data from Crunchbase , an online database, it became clear that the imbalance in biotech investment between the old and the new world is even more pronounced when it comes to genomics: In the period between 2005 and 2012, the United States attracted $1.7bn in funding, whilst Europe attracted only $213m.   Within the United States, it is striking that the money goes to the two states where most of the research is done: California and Massachusetts. The dominance of California is particularly remarkable: It's not just IT startups that rule in the Golden State.   These figures should be taken with a pinch of salt. Crunchbase may be biased towards listing more Silicon Valley and American companies (Genomics companies from outside of North America and Europe don't figure at all). Even so, the average genomics investment figure is still likely to be representative, and that is also much lower in Europe than in the United States or in Canada."], "link": "http://seqonomics.blogspot.com/feeds/8737405497693970226/comments/default", "bloglinks": {}, "links": {"http://www.crunchbase.com/": 1, "http://www.europabio.org/": 2, "http://www.ey.com/": 1, "http://1.blogspot.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["Funding for biotech startups is hard to get right now . And if biotech funding is down, surely genomics funding must be down as well? After all, genomics is just a subcategory of biotech.  To get a better understanding of this, I downloaded data on investment in genomics firms between 2006 and 2012 from Crunchbase and did some data crunching of my own.     Click on the figure to enlarge. Number of investments in genomics companies, average investment value, and total genomics investments, 2006-12. Bright green in 2012 bars for numbers extrapolated to the end of the year.   Whilst it is true that the number of investments in genomics companies for 2012 is probably going to be the lowest since 2008, the average amount invested is higher than in any previous year. Overall, it seems likely that there will be more than $400m in new genomics investments this year, which would be the highest on record.  For genomics startups this means that it may be harder to get funding, but that once you get it, it will be generous.  Methodology  I used Crunchbase to compile a list of 73 genomics companies and the funding they have received since 2006. I only included companies that did receive venture capital, private equity funding, or similar. This means that my sample set does not represent all genomics companies, but I am confident that it is representative at least for US companies. Estimates for 2012 totals are based on the assumption that funding will be similar September-December to what it was January-August.  Coming up next week: Funding of genomics companies in Europe versus the United States.  Update (24 August 2012)   As I already mentioned, the possibility that 2012 could be a good year for genomics investment is in contradiction with other reports, which paint a bleaker picture. A good overview and links to further sources are provided by Genomeweb in A Banner Year ."], "link": "http://seqonomics.blogspot.com/feeds/7023507710225465999/comments/default", "bloglinks": {}, "links": {"http://www.fiercebiotech.com/": 1, "http://www.crunchbase.com/": 1, "http://3.blogspot.com/": 1, "http://www.genomeweb.com/": 1, "http://www.genomeweb.com/blog": 1}, "blogtitle": "Seqonomics"}, {"content": ["If you want people to be creative, putting pressure on them is counterproductive. The threat to fire someone unless they have some brilliant ideas is unlikely to motivate them in the desired way.  When it comes to the commercialisation of genomics, there is a lot of pressure to come up with new things. Those working in the field feel that genomics has enormous potential. For those observing genomics from the outside, there is often a vague sense that so far it has failed to deliver.  For both those within the field and outside of it there seems to be a consensus that if genomics is to become an ubiquitous technology, it will be because of its widespread adoption in healthcare.  I would like to suggest that most progress in the commercialisation of genomics may come from somewhere else entirely. Possibly from somewhere unexpected where there is less pressure to deliver and less competition, allowing for more creativity. Besides that, healthcare is one of the most strictly regulated industries, making innovation even less likely.    There are several applications of genomics outside of healthcare that show great promise. One of them, forensics, I reviewed in a blog post two week ago .  An even more harmless area is what could be called the genomics of irrelevance: There are plenty of genetic variants that predict things that no-one cares about. Examples include whether your pee smells differently after you eat asparagus, whether you earwax is runny, or whether you feel the urge to sneeze when looking into the sun. The website of 23andMe lists dozens more.  Could it be that for most people, including potential hobbyists, exploring the genomics of such harmless traits holds more appeal than learning about their risk for Alzheimer's?"], "link": "http://seqonomics.blogspot.com/feeds/7771241880404914046/comments/default", "bloglinks": {}, "links": {"https://www.23andme.com/": 1, "http://seqonomics.blogspot.com/": 1, "http://1.blogspot.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["I like reading popular science books, and go through quite a lot of them. However, recently I have become increasingly picky. Due to overconsumption, I now tend to avoid books on cognitive biases , behavioural economics and such like. I am probably victim of an inverse mere exposure effect .  Another area that I avoid due to overexposure is genomics. As I spend my days working in the field, I prefer to spend my nights reading about other things. This means that I have not read a popular science book on genomics since Matt Ridley's fantastic Genome .  For Elizabeth Finkel's The Genome Generation I made an exception, and I do not regret it. Finkel writes beautifully, knows the subject, and is never boring - in other words, she is a good science writer.  Where she really excels is at covering the areas of genomics less explored by other s, such as agrigenomics and immunogenomics .   Finkel is clearly and unapologetically enthusiastic about genomics. There is not a lot of mention in The Genome Generation of the ethical questions that a lot of science journalists seem to be obsessed with. If this is what you are looking for, then this is not the right book for you. However, if you are interested in the science itself, then it may be.   My only complaint are the figures: Although they are clear and get the message across, they are also ugly and look a lot like clip art.    If you wonder whether The Genome Generation is for you, here are the most important facts:  Areas covered: Epigenetics, Personal Genomics, Immunogenomics (especially AIDS), Agrigenomics, Ancestral Genomes.  Who it is for: If you want a clear primer to genomics and its diverse applications. If you want something more readable than an academic textbook.  Who it is not for: If you have had recent training in biology or biochemistry, you will already be familiar with most of the material. If you are looking mainly for entertainment, and if you are interested only in Personal Genomics, you will be better served with My Beautiful Genome by Lone Frank.  How much it costs: For reasons I do not understand, Finkel chose Melbourne University Press as her publisher, and they are not cheap. They recommended retail price is $32.95, but online the book is available for $21.75.  Thanks to the Sanger Institute Library for ordering this book following my suggestion."], "link": "http://seqonomics.blogspot.com/feeds/3279721861498348982/comments/default", "bloglinks": {}, "links": {"http://www.amazon.com/": 2, "http://2.blogspot.com/": 1, "http://www.co.uk/": 1, "http://en.wikipedia.org/": 2}, "blogtitle": "Seqonomics"}, {"content": ["Between 2007 and 2009 police in Germany were frantically looking for a criminal. Although her identity was not known, it was clear that she was dangerous: DNA evidence from 40 crime scenes, including several murder scenes, could be linked to her.  Despite immense efforts lasting more than two years, they did not succeed. Eventually, they had to admit that the reason why they had found DNA from the same woman in all those crime scenes was that the cotton swabs used in the investigation were all contaminated by the same cotton swab factory worker .  This episode of forensic history illustrates how much law enforcement has come to rely on DNA evidence. The centrepiece of this effort are national DNA databases, which have acronyms like CODIS (USA), NDNAD (UK), or FNAEG (France). Each of those databases contains millions of unique DNA profiles. Whilst DNA is central to modern forensics, DNA sequencing is not: The profiles in the databases are obtained using capillary electrophoresis of polymorphic loci called VNTRs . Is this likely to change with the arrival of more affordable sequencers?     Arthur Eisenberg, who established one of the world's first forensics labs, thinks so. In a recent interview published on Genomeweb , he envisages a future where all forensic DNA testing is done using sequencing.  More widespread use of sequencing in forensics could have a number of benefits. Firstly, sequencing would return information on DNA polymorphisms other than just VNTRs. This includes SNPs , which are much more common than VNTRs. SNPs are informative of traits like eye colour, hair colour, and race, and could be used for facial composites (although this would not be legal in some countries, including Germany).  Another advantage of sequencing is that it can be applied to a wider range of forensic samples than VNTR profiling. Shed hair is recovered from a lot of crime scenes, but cannot be analysed using VNTR profiling because it usually does not contain nuclear DNA. It does however contain mitochondrial DNA , which is already used for forensic investigations.  A major challenge for sequencing is backwards compatibility. Existing VNTR-based forensic databases already have millions of entries, which are not easily comparable to the output of most next generation sequencing (NGS) machines. The reason is that NGS sequencers can typically only read 100-200 bases at a time, whilst for gaining reliable information on VNTRs read lengths of 400 bases or more are required. This is likely to become less of a problem in the next few years, as read lengths increase.  Another remaining challenge is that NGS is not sufficiently reproducible to be admitted as evidence in a court of law. The same barrier exists for the widespread adoption of NGS in the clinic, where reproducibility is essential as well, but cannot yet be demonstrated for NGS-based tests either. In summary, the hurdles for the widespread adoption of DNA sequencing in forensics seem to be technical, and solvable.  If you have a view on whether sequencing has a future in forensics, please do not hesitate to post your comment below."], "link": "http://seqonomics.blogspot.com/feeds/4517213583399337929/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://en.wikipedia.org/": 6, "http://www.genomeweb.com/": 2}, "blogtitle": "Seqonomics"}, {"content": ["For DNA sequencing to fulfil its promise, it has to be become more than a tool of academic research. It has to enter the clinic, and eventually other areas where it can prove its worth, such as forensics or hygiene monitoring . How far along this path is it?  The graph below partly answer this question. It shows the twelve for-profit companies with the largest number of next generation sequencers.     The twelve for-profit companies with the most next generation sequencers. BGI has aspects both of a for-profit business and an academic research centre. Data from Omics Maps   Compared to the large academic sequencing centres like the Broad Institute with its 101 sequencers or the TGI with its 62 devices, the private sector is far behind in terms of sequencing capacity. The only exception is the BGI , which is somewhere in between a for-profit business and an academic sequencing facility.  To me, the encouraging thing in the graph above is the diversity of business models behind the companies. Although businesses providing sequencing services dominate (the BGI, Macrogen , DNAVision , Shanghai Biochip , Beckman Coulter Genomics , GATC , Takara , and Genotypic fall into this category), there are also agribusiness companies ( Monsanto and Keygene ) and health care providers (the Mayo Clinic and SAIC-Frederick ). This indicates that sequencing is well on its way to leave its academic cradle and move on.  Note  The graph above is based on Omics Maps data from January and the figures have changed since then. Specifically, Source Bioscience (UK) and Fasteris (Switzerland) also have four sequencers and should therefore be shown alongside Genotypic. Expression Analysis (USA), which is owned by Quintiles, may have 12 NGS devices, and DNAVision may have sold two of their sequencers (see comments below)."], "link": "http://seqonomics.blogspot.com/feeds/235083734278874801/comments/default", "bloglinks": {}, "links": {"http://www.macrogen.com/": 1, "http://seqonomics.co.uk/": 1, "http://www.dnavision.com/": 1, "http://www.keygene.com/": 1, "http://www.co.in/": 1, "http://www.omicsmaps.com/": 1, "http://www.hgbiochip.com/": 1, "http://www.gatc-biotech.com/": 1, "http://www.monsanto.com/": 1, "http://genome.wustl.edu/": 1, "http://www.beckmangenomics.com/": 1, "http://www.bgisequence.com/": 1, "http://2.blogspot.com/": 1, "https://www.saic-frederick.com/": 1, "http://www.takara-bio.com/": 1, "http://www.broadinstitute.org/": 1, "http://www.mayoclinic.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["Of the 8 million inhabitants of the Canadian province of Quebec , 6 million can trace their ancestry back to a founder population of only a few thousand settlers who arrived from France in the 17th century. This means that Quebec has a relatively homogeneous population, making it an exciting place for anyone trying to find genes associated with disease.  However, the only commercial attempt to capitalise on this founder population was by a company called Genizon, which failed last year. Genizon's approach resembled that of DeCODE, whose discovery of a variant apparently protecting against Alzheimer's disease made headlines this week. Whether this success is enough to rekindle interest in Quebec's founder population is questionable.  So what about the state of genomics in Canada as a whole?     In other countries, they paint their flag on pickup trucks and airplanes  Academic research in the field is relatively well financed . A lot of the funding comes from Genome Canada , a federal organisation that was established in 2000. It pays for numerous large-scale sequencing projects carried out in Canada, often via one of its regional centres such as the the McGill University and Génome Québec Center in Montreal.  Around half of the funding of Genome Canada comes from the federal government. The other half comes from the provincial governments, international funding bodies, and other sources. Since its inception, Genome Canada has received around C$1bn in federal funding, which is equivalent to C$90m per year. According to the recently announced federal budget, it will have to make do with much less soon: For the next two years, it will only receive annualised funding of C$30m.  How about the private sector? According to Omics Maps , there are currently no businesses running next generation sequencers in Canada. This means that despite large investments in genomics, no large for-profit sequencing service providers have emerged yet.  This does not mean Canada is a desert when it comes to genomics businesses: For example, GenoLogics produces laboratory information management systems (LIMS) specifically for sequencing and genomics, SQI develops diagnostics based on microarrays, and DNA LandMarks supplies genomics research services to the agricultural industry.   There will be more  This post is a part of a series on genomics in different countries, which has already covered France , Germany , and Japan . In the next few months, I will also cover Britain, China, and, if I am brave enough, the United States."], "link": "http://seqonomics.blogspot.com/feeds/3994113242068967503/comments/default", "bloglinks": {}, "links": {"http://www.dnalandmarks.ca/": 1, "http://blogs.discovermagazine.com/": 1, "http://www.gqinnovationcenter.com/": 1, "http://www.sqidiagnostics.com/": 1, "http://www.genomecanada.ca/": 2, "http://genologics.com/": 1, "http://www.bio-itworld.com/": 1, "http://www.nature.com/": 1, "http://seqonomics.blogspot.com/": 3, "http://en.wikipedia.org/": 1, "http://2.blogspot.com/": 1, "http://www.nytimes.com/": 1, "http://www.omicsmaps.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["There are plenty of examples of two organisations dominating a market: Airbus and Boeing in passenger aircraft, Pepsi and Coca Cola in soft drinks, Microsoft and Apple in operating systems, Democrats and Republicans in American politics.  In this post, I ask how close the next generation sequencing (NGS) market is to being dominated by the Illumina and Life Technologies duopoly.    The size of the NGS market in 2011 was around $1bn, according to several industry sources. There are six companies that are currently active in the market. In decreasing order of NGS revenues, these are Illumina, Life Technologies, Roche , Complete Genomics , Pacific Biosciences , and Intelligent Bio-Systems / Qiagen .  Three of those companies - Complete Genomics, Pacific Biosciences, and Intelligent Bio-Systems - have revenues that are negligible compared to the size of the overall NGS market. Their combined sales amount to less than 3% of the total, and current trends do not indicate rapid growth for any of them.  Estimating the market share of the other three companies is trickier, as they also have business outside of sequencing. Neither of them breaks out its NGS revenues in its financial statements.  Based on the financial information that is available, Roche probably earned revenues of less than $100m from its 454 sequencing technology in 2011. This would be equivalent to 10% of the market or less, and is set to decline even more if recent trends are anything to go by.  This leaves Illumina and Life Technologies commanding at least 87% of the market together. Illumina is the clear leader with a market share of around 60% , which leaves around 27% for Life Technologies.  Nevertheless, the dominance of Illumina and Life Technologies looks precarious. As I mentioned two weeks ago , there are a dozen companies scrambling to enter the market, and some of them are working on rather disruptive technology ."], "link": "http://seqonomics.blogspot.com/feeds/4027756740315349279/comments/default", "bloglinks": {}, "links": {"http://seqonomics.co.uk/": 2, "http://www.completegenomics.com/": 1, "http://intelligentbiosystems.com/": 1, "http://www.pacificbiosciences.com/": 1, "http://www.qiagen.com/": 1, "http://www.genomeweb.com/": 1, "http://realmoney.thestreet.com/": 1, "http://www.illumina.com/": 1, "http://www.roche.com/": 2, "http://4.blogspot.com/": 1, "http://www.lifetechnologies.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["Lawyers seem to like direct-to-consumer (DCT) genetic testing. On the Genomics Law Report blog, which I highly recommend, there were no fewer than 23 entries that mentioned or were relevant to DTC in 2011.  Although my interests rarely overlap with those of lawyers, this is an exception. DTC genetic testing comes in many forms, such as carrier tests for genetic disease, ancestry tests, and nutrigenomic tests. At first glance it appears that consumers should be able to purchase these tests and gain information about themselves and their genomes in any way they like.  However, many DTC tests have not been validated by medical professionals. This means that in the best case quality cannot be assured, and in the worst case, that they could be bogus. Wrong test results could have a large impact, and therefore most experts call for more regulatory oversight of how and by whom these tests can be provided.  In the United States, although the regulatory position of DTC genetic testing varies between states, there is also relevant federal legislation, such as the Genetic Information Nondiscrimination Act .    Regulation of genetic testing in Europe. Source: Borry et al . 2012, European Journal of Human Genetics  Less so in Europe. In a recent publication in the European Journal of Human Genetics , Pascal Borry and coworkers discuss the regulatory framework in seven European countries.  DTC genetic testing is not an area that is directly legislated by EU. Instead, each country draws up its own laws, and there is hardly any harmonisation between them. The result is that in some countries, such as Belgium or the United Kingdom, there is hardly any regulation of DTC genetic testing, whilst in others, it is strongly regulated - sometimes to the extent that non-medical and non-research genetic testing is explicitly banned.  The result is that European companies providing DTC genetic testing would have a hard time taking advantage of the EU's common market. Could this be a reason why there are no large European DTC genetic testing companies that I am aware of?"], "link": "http://seqonomics.blogspot.com/feeds/1253869647636280281/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://www.nature.com/": 2, "http://en.wikipedia.org/": 1, "http://www.genomicslawreport.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["There are at least a dozen companies that claim to develop new DNA sequencing technology. How many of them will actually release commercially viable products in the next few years?  Oxford Nanopore Technologies clearly leads the pack and has announced that it will release its sequencing devices later this year.  The company that seems to be second closest in terms of releasing a sequencer is Genia , whose technology is also nanopore-based. It has attracted more than $10m in funding, and is expected to market its technology in 2013.  Companies that have not yet made a public announcement on a potential release date but have attracted substantial investment are Nabsys ($17m funding), GnuBio ($8m funding), Stratos ($7m funding), and possibly LaserGen ($5m funding).    Companies that are thought to develop sequencing technology but that have attracted less investment, or whose finances are unknown, are Noblegen , Base 4 Innovation , Electron Optica , Halcyon , Lightspeed Genomics , and ZS Genetics . Of these, clear signs of activity only come from Noblegen, with a rumoured 2014 release data, and Base 4, which has recently started a recruitment drive.  Whether Base 4 is actually developing sequencing technology is not entirely clear. Their website only hints at single-molecule detection platforms, whilst at least one third-party website also mentions solid-state DNA sequencing.  If only half of these companies are successful in developing a commercially viable product and join the six companies that are already sell next generation sequencers (Illumina, Life Technologies, Roche, Complete Genomics, Pacific Biosciences, Intelligent BioSystems), it is going to be a crowded marketplace.  The really interesting question will be whether there is demand for that many different technologies. Will they all be able to find their own niche?"], "link": "http://seqonomics.blogspot.com/feeds/4349500098925876103/comments/default", "bloglinks": {}, "links": {"http://nanoporetech.com/": 1, "http://3.blogspot.com/": 1, "http://www.electronoptica.com/": 1, "http://www.halcyonmolecular.com/": 1, "http://www.co.uk/": 2, "http://seqonomics.co.uk/": 1, "http://www.blueseq.com/": 1, "http://nabsys.com/": 1, "http://www.lsgen.com/": 1, "http://gnubio.com/": 1, "http://www.stratosgenomics.com/": 1, "http://www.zsgenetics.com/": 1, "http://lasergen.com/": 1, "http://www.noblegenbio.com/": 1, "http://geniachip.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["It has gone quiet around DeCODE Genetics , once a poster child for the commercialisation of genomics. Until around five years ago, the Icelandic company was once one of the hottest firms in the field. Then, in 2009, it made headlines by spectacularly going bust. Nowadays, a company with the same name still exists, but not very much is being said or written about it.  DeCODE was founded in 1996 to find the genetic causes of diseases. Soon it started publishing its results in high-profile papers, and its future looked bright enough for an IPO on the NASDAQ stock exchange in 2000. However, it never made a profit, and after some years DeCode was delisted from the NASDAQ again. A few months after that, in November 2009, it declared bankruptcy.     What went wrong? One examplanation is that DeCODE was a victim of the financial crisis that started in 2008. It did not help that $33m of DeCODE's money was managed by Lehman Brothers , and that the company was headquartered in Iceland, which was particularly hard hit by the crisis.  However, DeCODE had already struggled financially before the crisis. The bigger contributor to DeCODE's downfall was probably that is has turned out harder than expected to monetarise the company’s excellent science. It developed a few drug leads, but the most promising lead was suspended in 2006 due to manufacturing problems.  What is DeCODE currently up to? In January 2010, it was purchased by a consortium that includes Polaris Ventures and ARCH Venture Partners , two investors specialising in the life sciences.  The company now focuses exclusively on research . Their website sporadically announces the discovery of variants linked to disease, often in collaboration with other organisations. One such collaboration is with Pfizer , which seems to provide DeCODE with some income. Other sources of income are grants from the NIH  and the European Union.  The morale? First-class science is not enough to make a genomics company successful.  Disclaimers   As always, please note that everything I write on this blog is my personal opinion and is not endorsed by the Sanger Institute or the Wellcome Trust. Please also note that I will be away until the 19th of July and cannot answer to your comments until then."], "link": "http://seqonomics.blogspot.com/feeds/3374412586988743645/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1, "http://www.blogger.com/": 3, "http://www.pfizer.com/": 1, "http://www.archventure.com/": 1, "http://www.nature.com/": 2, "http://www.decode.com/": 2, "http://www.polarisventures.com/": 1, "http://www.nytimes.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["This now has happened to me once too often: I meet someone at an event, they tell me they work for genomics company such-and-such near Cambridge, and I have to admit that I have never heard of that company before.  Below is my attempt to remedy that.    A map of the Cambridge biotech cluster, specifically for genomics. Click on the picture to enlarge.   If you have any ideas how I could improve the map, please leave a comment below. Please note that I will be travelling until the 19th of June and cannot reply to your comments until then."], "link": "http://seqonomics.blogspot.com/feeds/536583238362311139/comments/default", "bloglinks": {}, "links": {"http://3.blogspot.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["France has a new president and a new cabinet. An excellent reason for me to continue a series on genomics in different countries, which has already covered Japan and Germany .   In June 2000, the first draft of the human genome was completed. The contribution of France was 3% of the total . That was little, but still more than the contribution of any other country except the United States and the UK. At the time, all of the sequencing in France was done by its national sequencing centre, the Genoscope near Paris.    According to Balzac, political liberty, the peace of a nation, and science itself are gifts for which fate demands a heavy tax in blood     Since then, genomics has become even less of a national priority, and other countries have overtaken France. In terms of sequencing infrastructure, France lags behind its European peers Germany and the UK. According to Omics Maps , there are 38 sequencing machines in France, compared to Germany's 135 and the UK's 138.   There are some signs that this could change. Last year, French genomics, including the Genoscope sequencing centre, received a funding boost of €60m ($77m) as a part of a €260m package to promote research infrastructure. It is too early to tell whether this has been a one-off, or whether there is a long-term commitment by French policymakers to invest more in genomics. Doing a quick press search, I could not find any indication what the views of France's new minister of Higher Education and Research on genomics are.   How about the private sector? France has biotech giants such as Biomérieux and Eurofins that are also involved in sequencing. However, the core business of both companies is not genomics. That is unlikely to change: In a recent interview , Eurofins senior vice president Bruno Poddevin expressed the opinion that it will take at least another 10 years until Sanger sequencing is replaced by next generation sequencing (NGS), and that until then, NGS will not be a priority for his company.   Overall, it seems that sequencing is not a priority for either the public or the private sector in France. If you have any comments that confirm or refute this view, please share them below. Please note that I will be travelling until the 19th of June and that I will not be able to reply to your messages until then."], "link": "http://seqonomics.blogspot.com/feeds/161679788922993567/comments/default", "bloglinks": {}, "links": {"http://www.genevieve-fioraso.fr/": 1, "http://www.omicsmaps.com/": 1, "http://seqonomics.blogspot.com/": 2, "http://www.genomeweb.com/": 1, "http://www.histrecmed.fr/": 1, "http://www.nature.com/": 1, "http://www.eurofins.com/": 1, "http://www.biomerieux.com/": 1, "http://4.blogspot.com/": 1, "http://www.cns.fr/": 1}, "blogtitle": "Seqonomics"}, {"content": ["The price tag attached to sequencing a human genome is likely to decrease to a level comparable to other complex clinical tests such as computed tomography (CT) scans , which cost around $1,000 .  In an excellent article appearing together with the publication I discussed last week , Isaac Kohane and Jay Shendure argue that the cost of whole genome sequencing per year is only $13, and that any health benefits derived from it that are worth more than $13 per year would therefore make sequencing a good investment. They arrive at $13 by dividing the $1,000 that sequencing someone may cost by the life expectancy of the average American , which is 78 years.     However, this does not take into account all the other things you could do with the $1,000 you spend on sequencing, like investing it. Corrected for that , the real cost is more like $61 per year.  It is not at all obvious that for most people, and for the foreseeable future, the best way to spend $61 a year will be to get sequenced. For the same money, you could get a lot of other regular checkups that have a greater utility .  In any case, my calculation may be besides the point: Right now, it is unclear whether having your genome sequenced and analysed will eventually cost the same than a CT scan, or a multiple, or a fraction of that.  How do I arrive at $61 per year?  Like Kohane and Shendure, I assume that having your genome sequenced and analysed in a meaningful way will be around $1,000. Investing this money at a conservative rate of 6% after inflation for 78 years, which is the life expectancy of an average American, means that the equivalent of $1,000 now is $61 (plus inflation adjustments) for the next 78 years, and not $13."], "link": "http://seqonomics.blogspot.com/feeds/4915091890972047676/comments/default", "bloglinks": {}, "links": {"http://seqonomics.blogspot.com/": 1, "http://www.annals.org/": 1, "http://en.wikipedia.org/": 3, "http://stm.sciencemag.org/": 1, "http://2.blogspot.com/": 1, "http://www.co.uk/": 1}, "blogtitle": "Seqonomics"}, {"content": ["Like everyone else, public health insurances only have a limited amount of money, and therefore constantly need to make decisions which treatments to fund, and which are too expensive . That way, some treatments, although they have a health benefit, do not get funded, because they cost too much, and the money instead goes to treatments with a higher utility .  This applies to drugs, but also to diagnostic tests. From the point of view of insurers, genome sequencing is just another such test. The question then is, is it the best way to spend health insurance money?    A new door may be a better way to spend your money   In a recent publication in the journal Science Translational Medicine , Nicholas Roberts and coworkers partially address this question. They estimate the potential of whole genome sequencing to provide clinically useful information on the disease risk of people who are currently healthy.  Their result: Even in the best of circumstances, for most people sequencing will be uninformative about their risk for the majority of common diseases.  However, they also find that there is also a good chance that sequencing will provide useful information about at least one disease. This means that if you are particularly concerned about getting a specific disease, sequencing will probably not tell you anything new. On the other hand, it might well warn you about your risk of developing a disease you never even thought of before. But even then, the predictive value is likely to be quite limited.  This is interesting, but as the authors acknowledge, it comes with some caveats. Firstly, it covers only common diseases. For diseases that are caused by single genes, sequencing is much more likely to give useful results. Also, it assumes that people are sequenced after their birth, whilst some of the value of sequencing lies with prenatal diagnosis . It also ignores the possibility of sequencing only those people who are most likely to benefit, such as those that already show certain symptoms.  In summary, Nicholas Roberts and his colleagues pour cold water on the idea that sequencing everyone is going to have a large impact on how disease risks for common diseases are assessed for asymptomatic patients. On the more important question of whether sequencing everyone will be worth the cost in clinical practice, the jury is still out.  In next week's post, I will attempt to answer the related question of what the utility of sequencing needs to be in order to offset its cost."], "link": "http://seqonomics.blogspot.com/feeds/7340637954885831069/comments/default", "bloglinks": {}, "links": {"http://stm.sciencemag.org/": 1, "http://seqonomics.co.uk/": 1, "http://www.wisc.edu/": 1, "http://en.wikipedia.org/": 3, "http://1.blogspot.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["This week, I take another look at venture capital (VC) investments in genomics. As suggested by Daniel , I ask which VCs invested in a panel of representative genomics companies, and what these investments looked like.    The result: The most active VCs in genomics are Alloy , Google Ventures , and Mohr Davidow , which each invested in three genomics companies from the panel. They are followed by InterWest , Invus , and OrbiMed , which each invested in two.  On average, the companies in the panel raised a total of $32m from four different investors in three funding rounds. The median individual investment was $5.8m. The median investment per round was $11.7m, which is twice the 2001-2010 VC industry average of $5.9m per round .  The panel  The panel for the above analysis consists of all those genomics companies that I mentioned on this blog in the last few months: 23andMe, BioNano, Complete Genomics, DNAnexus, Fluidigm, Foundation Medicine, GenomeQuest, Good Start Genetics, Nabsys, Natera, Oxford Nanopore, PathoGenetix, PrimeraDx, RainDance, and Verinata.  For each company, I checked which VCs invested in it using Crunchbase . Not included are companies that have gone public, did not receive VC money, or for which no data is available on Crunchbase.  Having assembled this panel, I am wondering how I could improve it and which other interesting questions I could address with it. Any suggestions?"], "link": "http://seqonomics.blogspot.com/feeds/4081542305855353405/comments/default", "bloglinks": {}, "links": {"http://seqonomics.co.uk/": 2, "http://3.blogspot.com/": 1, "http://mdv.com/": 1, "http://www.alloyventures.com/": 1, "http://www.nvca.org/": 1, "http://www.orbimed.com/": 1, "http://www.crunchbase.com/": 1, "http://www.googleventures.com/": 1, "http://www.interwest.com/": 1, "http://www.invus.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["Lots of venture capital firms (VCs) are active in the biotech sector, but are there any that preferentially invest in genomics companies? To find out, I looked at the portfolios of some of the most prominent biotech VCs in the world. The resulting list is below.  Most (12 out of 16) of the VCs on my list currently have at least one investment in a genomics company, but none has more than two. This implies that genomics companies form part of a healthy VC investment portfolio, but that they do not consider it sensible to invest into this area too much.  I can think of two reasons for this: Either VCs consider genomics companies risky compared to other biotechs, or there are not enough promising genomics startups out there to make such a specialisation sensible.  Does anyone have any views on this?    List of venture capital firms, by investments in genomics companies  2 genomics investments  MPM Capital , (48 life sciences  investments, of which in genomics: 23andMe and PrimeraDx  Alta Partners (56 life sciences  investments, of which in genomics: Genedata and VitrOmics )  OrbiMed Advisors (52 life sciences  investments, of which in genomics: Complete Genomics and Good Start )  1 genomics investment  Domain Associates (57 life sciences  investments, of which in genomics: BioNano )  HealthCare Ventures (39 life sciences investments, of which in genomics:  PathoGenetix )  ARCH Venture Partners (44 life sciences  investments, of which in genomics: Illumina )  Flagship Ventures (46 life sciences  investments, of which in genomics: Helicos)  SV Life Sciences (74  life science investments, of which in genomics: Good Start )  Kleiner Perkins Caufield  & Byers (50 life sciences  investments, of which in genomics: Foundation Medicine )  InterWest Partners (48 life sciences  investments, of which in genomics: PrimeraDx )  New Enterprise Associates (82 life sciences investments, of which in genomics:  23andMe )  Quaker BioVentures (43 life sciences  investments, of which in genomics: RainDance )  No genomics investments  Polaris Venture Partners (40 life sciences  investments)  Sanderling Ventures (23 life sciences  investments)  Sofinnova Ventures (18 life sciences investments)  Burrill & Company (29 life sciences  investments)   Approach  I downloaded a list of top biotech VCs . Visiting the websites of those firms, I counted the their total number of current investments in the life sciences and healthcare, and the number of those investments that are specifically in companies that are active in genomics. I excluded firms whose main business is drug discovery, even if they use genomics-based approaches, from this definition. Obviously, I could not include investments that the VCs chose not to disclose on their websites either."], "link": "http://seqonomics.blogspot.com/feeds/6651886404980446040/comments/default", "bloglinks": {}, "links": {"http://www.polarisventures.com/": 1, "http://4.blogspot.com/": 1, "http://www.kpcb.com/": 1, "http://sofinnova.com/": 1, "http://www.bionanogenomics.com/": 1, "https://www.23andme.com/": 2, "http://www.nea.com/": 1, "http://www.vitromics.com/": 1, "http://www.mpmcapital.com/": 1, "http://www.genedata.com/": 1, "http://www.raindancetechnologies.com/": 1, "http://www.domainvc.com/": 1, "http://www.completegenomics.com/": 1, "http://www.flagshipventures.com/": 1, "http://www.sanderling.com/": 1, "http://www.quakerbio.com/": 1, "http://www.helicosbio.com/": 1, "http://www.svlsa.com/": 1, "http://www.foundationmedicine.com/": 1, "http://www.goodstartgenetics.com/": 2, "http://www.altapartners.com/": 1, "http://www.fiercebiotech.com/": 1, "http://primeradx.com/": 3, "http://www.orbimed.com/": 1, "http://www.illumina.com/": 1, "http://www.burrillandco.com/": 1, "http://www.archventure.com/": 1, "http://www.interwest.com/": 1, "http://pathogenetix.com/": 1, "http://www.hcven.com/": 1}, "blogtitle": "Seqonomics"}, {"content": ["Don't worry, this is not that post where I start asking existentialist questions. Instead, I ask what I should have asked when I started Seqonomics half a year ago: What is my motivation for writing this blog?  A few weeks ago, I had a conversation with someone working in public relations. He asked me exactly that question. I had not thought about it before, so I could not answer him adequately. He suggested that there are only two reasons why people in the life sciences blog: Either they want to become science journalists, or they enjoy the attention.  I am sure that I do not want to become a journalist of any kind, and I think I know better ways to attract attention than to blog about a subject as dry as the economics of DNA sequencing. So what drives me?     Recently, I read two books on motivation, one awful and the other one pretty good . They got me thinking, and I now know that the ultimate reason why I write this blog is that I believe that there is a deficit in making science useful. Academia produces so many good ideas, yet so few make it out there and become genuinely useful to non-academics. I believe that the best way to change that is by commercialising those ideas. Despite having worked in management consulting for some time, I do not share the naïve cynicism of many of my academic colleagues concerning private business.  One of the things that need to happen for science to be commercialised is that ideas from the world of business and the world of science mix. That is what Seqonomics is about. There may be better ways to make science useful than to blog about it. But they take time, and until then, I'll keep writing."], "link": "http://seqonomics.blogspot.com/feeds/3454039733019963524/comments/default", "bloglinks": {}, "links": {"http://www.amazon.com/": 2, "http://seqonomics.co.uk/": 1, "http://3.blogspot.com/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Seqonomics"}, {"content": ["If you enjoy this blog, you may also like the sites below. What they all have in common with Seqonomics is that they cover the interface between sequencing and business. You will notice that I have excluded sites that exclusively cover the technical or scientific aspects of genomics.      Genomics business news  Bio-IT World : My personal favourite.  The Bio-IT World website acts as a news aggregator that pulls together  some of the most interesting articles on next generation sequencing, big  data, and personalised medicine, often from a business point of view.  Genome Web is broader in scope than  Bio-IT World and also covers arrays, PCR, pharmacogenomics, proteomics,  and gene silencing. They write their own articles, which are often  strongly inspired by the press releases of companies in the field. The  website is updated at least once a day . A subscription is  required for most articles.  Blogs  Genomics Law Report : This excellent blog, as  you may expect from its name, covers the legal  questions that come with genomics in a thoughtful manner. New posts appear around twice a week on  average. The majority of posts are relevant to the United States  only.  Omics! Omics! and CoreGenomics : Although these fantastic  blogs mostly covers the scientific aspects of sequencing, their authors  sometimes also writes about business matters.  Biotech Marketer covers the marketing  strategies of sequencing companies. I am not sure if this blog is still  active, as there is no new post since December 2011.  Sites that cover biotech in  general  The Medicine Show : This excellent and much  tweeted-about blog by Forbes ' Matthew Herper covers a  wide range of life science topics and often offers insights into issues  related to genomics.  Xconomy 's Life Sciences Channel is a technology and  start-up resource that also covers genomics. It is US-centric.  Genetic Engineering &  Biotechnology News does what its name  suggests. They have an 'omics section , which does not get  updated very often.    I am sure that there are sites that are missing from this list. Especially the blog section is bound to be incomplete. If you know about a site that is relevant and that I have forgotten, please post your link below. I will update this list in a few weeks and include all relevant sites that have been brought to my attention."], "link": "http://seqonomics.blogspot.com/feeds/3414932136719859002/comments/default", "bloglinks": {}, "links": {"http://www.xconomy.com/": 2, "http://blogs.forbes.com/": 1, "http://www.blogger.com/": 1, "http://www.genomicslawreport.com/": 1, "http://www.genengnews.com/": 2, "http://www.forbes.com/": 1, "http://core-genomics.co.uk/": 1, "http://www.genomeweb.com/": 1, "http://www.bio-itworld.com/": 1, "http://omicsomics.blogspot.com/": 1, "http://biotechmarketer.co.uk/": 1, "http://2.blogspot.com/": 1}, "blogtitle": "Seqonomics"}]