[{"blogurl": "http://www.serialmapper.com\n", "blogroll": [], "title": "Serial Mapper"}, {"content": ["La rencontre café Carto 2.0 organisée par l'association MetaCarto et dédiée à la représentation du temps dans la cartographie de l'information promet d'ores et déjà d'être un succés !    Ne tardez donc pas à réservez votre soirée du mardi 23 octobre et à vous inscrire. Vous serez ainsi assuré de partciper à cet évenement unique  Le temps est désormais pluriel…et de plus en plus rare. Quels impacts sur sa représentation ? Comment désormais dire, dessiner, cartographier le temps ?  Venez réflechir, discuter, dessiner, débattre avec nous sur la représentation du temps et la cartographie d’information.  N'hésitez à faire suivre ce rappel"], "link": "http://www.serialmapper.com/archive/2012/10/16/rappel-cafe-carto-2-0-cartographie-d-information-et-represen.html", "bloglinks": {}, "links": {"http://www.metacarto.fr/": 2}, "blogtitle": "Serial Mapper"}, {"content": ["Je relaie bien volontiers le billet  \"Ouvrez la cage aux oiseaux\"  d' Isabelle Jacob formatrice en créativité et dirigeante du centre Iris . Je ne suis pas forcément d'accord sur tout mais il fallait que cela soit dit qui plus est par une praticienne qui voit passer beaucoup de monde.     \"De nos jours sous la pression de la crise, beaucoup d’entreprises clament haut et fort que, pour s’en sortir , il va falloir innover. Et de rajouter l’innovation comme une valeur clef de l’entreprise. (...) Or tant de témoignages de ces cadres nous disent pourtant leur paralysie totale dans l’action. D'un côté il reçoivent de la part de leur top management des injonctions très pressantes à l’innovation ; mais chaque fois qu’ils viennent avec des propositions de changement, des idées un peu neuves, ils se voient rétorquer de la part de ce même top management que ce n’est pas le moment de changer, que cela ne va pas dans la bonne direction, que..., que... Les voilà en pleine injonction paradoxale : innovez mais surtout ne changez rien!! (..)  On tourne en rond , on n’avance pas . Chacun se réfugie derrière sa peur de trancher, sa peur de déranger l’ordre existant, se peur de déplaire, ou derrières les normes, règles et procédures....  J'aimerais que quelque chercheur en sciences sociales s’amuse un jour à calculer le nombre d’heures de travail improductives passes dans les réunions du lundi matin, dans les séminaires d’équipe « animés » de façon top Down, dans le remplissage d’états , de statistiques que personne ne lira , n’analysera mais pourtant nécessaires pour répondre à telle certification , telle norme, telle législation. Les procédures de gestion de projets ( exemple : CMMI) mises en place dans nombre d’entreprises aboutissent le plus souvent à ne fabriquer que de l’activité administrative.(..)\""], "link": "http://www.serialmapper.com/archive/2012/10/10/prov.html", "bloglinks": {}, "links": {"http://www.centre-iris-creativite.com/": 1, "http://www.echarpe-d-iris.com/": 1}, "blogtitle": "Serial Mapper"}, {"content": ["Ces derniers mois j'ai crée une méthode visuelle d'aide à la décision.  A la fois méthode de conduite de projet (il y a 3 étapes Brouillard, Brouillon, Communication d'où BBC) c'est également une méthode de conception visuelle. Je mets à disposition à chaque étape une boite à outils visuels ce qui me permet d'aller bien au délà du mind mapping.  C'est ludique, intutif et facile à mettre en oeuvre. J'ai utilisé la métaphore du cerf volant pour metre en scène cette méthode (vous en saurez plus d'ici quelques jours).    C'est Signos qui, dans le cadre de son programme Manager 10 , m'héberge pour cette formation qui aura le 24 et 25 octobre dans le centre de Paris (Saint Augustin) , une journée de tutorat à distance est également prévue. Le programme se trouve ici.  Il reste quelques places profitez en ! Remarque : Les tarifs sont ceux du marché pour la formation inter- entreprise donc \"c'est cher\""], "link": "http://www.serialmapper.com/archive/2012/10/09/et-si-vous-preniez-un-peu-d-altitude-avec-la-methode-bbc-cub.html", "bloglinks": {}, "links": {"http://www.signos.fr/": 5}, "blogtitle": "Serial Mapper"}, {"content": ["En raison d'un double booking je vends une place à moitié prix (soit 45 euros) pour le TEDxParis qui se déroule à l'Olympia ce samedi (toute la journée). A noter que cet évenement est complet. Merci de me contacter ici"], "link": "http://www.serialmapper.com/archive/2012/10/05/urgent-place-a-ceder-tedxparis.html", "bloglinks": {}, "links": {"http://tedxparis.com/": 1}, "blogtitle": "Serial Mapper"}, {"content": ["Alain Joannés est décédé le 21 septembre.dernier. Je l'avais rencontré notamment il y a 1 an quand Il avait été membre du jury du concours Google où avec Christophe Tricot et 2 autres larrons nous avions participé avec Partie de Campagne . Il y a quelques mois j'avais eu le privilége de déjeuner en tête à tête avec lui. Grand moment pour un gars comme moi passionné de presse depuis l'age de 14 ans. C'était un puit d'histoire il avait été de beaucoup d'aventures journalistiques (France Info ...) et pendant 35 ans (!) éditorialiste du télégramme de Brest (il y tenait).  Il avait surtout trouvé le moyen avec quelques complices d'imposer le thème du data journalisme en France (ce qui est un sacré exploit) alors qu'il était déjà à la retraite.  Il ne reste plus qu'à reprendre le flambeau. Pour ce faire je ne peux que conseiller son ouvrage   PS : merci à Philippe Niewbourg de nous avoir alerté sur cette triste nouvelle"], "link": "http://www.serialmapper.com/archive/2012/10/03/a-l-heure-du-data-journalisme-les-mauvaises-nouvelles-vont-l.html", "bloglinks": {}, "links": {"http://www.letelegramme.com/": 2, "http://www.amazon.fr/": 1, "http://www.serialmapper.com/": 1}, "blogtitle": "Serial Mapper"}, {"content": ["Je relaie bien vlolontiers l'annonce de cet évenement dédié en partie à la cartographie de l'information :  \"Aujourd’hui l’information est essentiellement numérique et avec l’essor des réseaux sociaux elle est devenue une denrée essentielle et stratégique pour les entreprises et organisations qui savent la maîtriser. A l’heure de l’émergence du « Big Data » et de « l’opendata » ce phénomène ne fait que se renforcer.  C’est pourquoi nous vous proposons de découvrir ou d’approfondir les dernières innovations en matière d’extraction et de capitalisation des données textuelles, ainsi que des dernières évolutions en matière de cartographie de ces informations.   Search est organisé par Veille Magazine (www.veillemag.com) en alliance avec Knowledge Consult et l'Institut du Pôle Léonard de Vinci \"  Vous trouverez le programme ici avec notamment une intervention de Yves Simon.  Mon emploi du temps ne me permet pas d'assiter à cette journée mais vous me raconterez !"], "link": "http://www.serialmapper.com/archive/2012/10/01/search-2012-jeudi-18-octobre-au-pole-leonard-de-vinci.html", "bloglinks": {}, "links": {"http://www.search2012.info/": 1}, "blogtitle": "Serial Mapper"}, {"content": ["“ Assoifés de temps mais noyés sous les temporalités” La cartographie d’information peut-elle nous aider ?   Le temps est désormais pluriel…et de plus en plus rare. Quels impacts sur sa représentation ? Comment désormais dire, dessiner, cartographier le temps ? Venez réflechir, discuter, dessiner, débattre avec nous sur la représentation du temps et la cartographie d’information.  MetaCarto, l’association dédiée à la mise en scène de l’information, est heureuse de vous inviter à son édition 2012 du Café Carto 2.0 qui aura pour thème “Cartographie d’information et représentation du temps”  Rendez-vous le mardi 23 octobre de 19 h 15 à 22 h 30 à la Mutinerie 29 rue de meaux 75019 Paris Métro : Stalingrad, Colonel Fabien, Jaurés Inscriptions : http://fr.amiando.com/cafecartodutemps.html   Le programme de la soirée :  une séance de World Café pour échanger, débattre un buffet pour se restaurer et réseauter un Carto Lab où chacun, seul ou associé à d’autres, pourrait proposer une mise en scène à partir des idées exprimées lors du World Café mise en ligne des productions de la soirée sur le site de MetaCarto Tarifs : 10€ pour les adhérents et 20€ pour les non adhérents Inscriptions : http://fr.amiando.com/cafecartodutemps.html"], "link": "http://www.serialmapper.com/archive/2012/09/18/annonce-cafe-carto-2-0-cartographie-d-information-et-repres.html", "bloglinks": {}, "links": {"http://www.metacarto.fr/": 1, "http://fr.amiando.com/": 2}, "blogtitle": "Serial Mapper"}, {"content": ["Après bien des année d'errances je suis devenu fan absolu de I Mind Map 6 ! Il faut dire que ce logiciel a été crée sous la houlette de Tony Buzan himslef. Je retrouve enfin le plaisir des faire des mind map sur écran comme avec la version 2002 (!) de Mind Manager :  attention ce CV date de 2006 ... Cette dernière version de Imind map (cf image ci dessous) a été nettoyé de quelques buzaneries (on peut maintenant créer des branches avec un nombre de mots + importants). On peut même importer du Mind Manager.  L a roue de manipulation en bout de branche est devenu très mature. C'est une belle interface. On a enfin un feeling \"tablette\" sur nos engins laptop dont la conception remonte largement au siècle dernier Le rendu visuel est impecable et fait vraiment la différence. Une petite astuce pour lutter contre une coquetterie commune à bien des logiciels de mind mapping. On est souvent décu à l'impression ou à l'export des cartes car les mots sur les branches sont peu lisibles. En fait il suffit de \"pousser\" vigoureusement la taille des polices. Par exemple pour IMindmap la police des branches est de 28 par défaut alors qu'à partir de 36 c'est beaucoup plus confortable hors écran. Une fois vos customisation effectuée n'oubliez de sauvegarder un squelette de votre map comme modéle (voir enregistrer sous).  Aucune raison de ne pas l'essayer pusique la version basic est en téléchargement libre.    Sus à mind manager devenu une usine à gaz bureautique !  Pour compléter mon avis vous pouvez utilement consulter le billet du pape( malheureusement trop discret ) de la carte heuristique à savoir Denis Rebaud"], "link": "http://www.serialmapper.com/archive/2012/09/04/i-mind-map-apres-bien-des-annee-d-errances.html", "bloglinks": {}, "links": {"http://www.petillant.com/": 3, "http://www.thinkbuzan.com/": 2, "http://www.serialmapper.com/": 1}, "blogtitle": "Serial Mapper"}, {"content": ["Il y a au moins 3 choses, si j'en crois ma propre expérience, que l'on ne sait pas enseigner en France: les langues, le sport et \"l'éducation artistique\".  Pour vous permettre de rattraper le temps perdu sur l'éducation du regard voici donc une vidéo extraordinaire de 38 minutes qu'il faut prendre le temps de regarder intégralement.     Ce court métrage extrémement bien fait propose une vraie didactique de l'apprentisage de la vision à travers l'approche de Inge Druckrey . Il est basé sur des interviews de ses anciens éléves et met en scène une galerie de leurs travaux.  \"And it pays off….Suddenly you begin to see wonderful things in your daily life that you never noticed.\"  Inge est né en 1940 en Allemagne, a travaillé jusqu'au milieu des années 60 en Suisse et a continué sa carrière dans les grands institutions américianes. Elle forme avec Edward Tufte LE couple de la mise en scène de l'information.  \"This very fine film has a wonderful contemplative quality. It floats above the compromises and sometime mundane requirements of praxis.\" Chris Myers Designer, Educator, Graphic Design ChairvThe University of the Arts, Philadelphia  source : A 40-Minute Crash Course In Design Thinking"], "link": "http://www.serialmapper.com/archive/2012/09/03/cadeau-de-rentree-le-corus-d-une-grand-dame.html", "bloglinks": {}, "links": {"http://www.fastcodesign.com/": 1, "http://en.wikipedia.org/": 1, "http://www.edwardtufte.com/": 1}, "blogtitle": "Serial Mapper"}, {"content": ["Dans le cadre d' Expoviz David McCandless a lancé la conférence \"l a datavisualisation aujourd'hui et demain\" pendant plus d'une heure. Il a notamment expliqué la genése de son ouvrage :    Pour accoucher de cet ouvrage majeur il a su laisser le temps au temps . Une fois une longue période de doute après l'idée initiale il s'est enfin attelé à la production en commençant par ... réfléchir pendant 2 ou 3 mois \" pas de recherche, pas de croquis, pas de design\" juste \"vider son cerveau avec un tableur excel\" ;-((  Une datavisualisation ne doit jamais commencer par les données. I l faut au préalable \"avoir jeter toutes les idées sur la table\" . En effet une datavis c'est comme une phrase, elle doit avoir du rythme et ce tempo dépend à la fois du concept et du story telling (1) qui a été choisi.  On ne peut pas atteindre ce niveau si on n'a pas respecté cette phase de brouillard au début du processus.  Lorsqu'il avance dans le temps de la conception David peut alors \" jouer avec les données \" de façon à favoriser \"une prise de recul \" et \" s'éloigner du caractère formel des données\" .  Comme l'a fort bien résumé lors de la table ronde sur le datajournalsime Karen Bastien de Wedodata \"il s'agit de transposer une réalité abstraite en une fiction concrète\".  Au final \"en jouant avec les données on apprend en s'amusant\" ce qui est beaucoup plus intelligent et efficace que de s'instruire en s'écoutant parler comme beaucoup font (ou en se relisant ce qui revient au même).  David nous parlait essentiellement des data visualisation mais ses observations rejoignent tout à fait mes intuitions. Je suis d'ailleurs en train de synthétiser tout ça dans une méthodologie en 3 étapes. Rendez vous dans quelques mois.   (1) On a souvent une vision caricaturale du story telling compte tenu de ses liens avérés avec les spins doctors\" mais ce n'est parce que ces derniers ont redécouverts le pouvoir des métaphores qu'il faut jeter ces métaphores avec l'eau du bain."], "link": "http://www.serialmapper.com/archive/2012/06/24/david-mccandless-a-paris.html", "bloglinks": {}, "links": {"http://expoviz.fr/": 1, "http://wedodata.fr/": 1, "http://www.amazon.fr/": 1, "http://www.davidmccandless.com/": 1}, "blogtitle": "Serial Mapper"}]