[{"blogurl": "http://sharpstatistics.co.uk\n", "blogroll": [], "title": "Sharp Statistics"}, {"content": ["Here is part 2 of my guide to using ggplot2. Scales Following on directly from the previous notes you can manually adjust the colours and shapes used in the chart if you don’t like the defaults, as shown in figure 1. … Continue reading →"], "link": "http://sharpstatistics.co.uk/r/ggplot2-notes-part-2/", "bloglinks": {}, "links": {"http://sharpstatistics.co.uk/": 1}, "blogtitle": "Sharp Statistics"}, {"content": ["During the time I have used R the base graphics package has met my needs, although I have been aware of ggplot2 but found learning it a bit of a struggle so have pretty much ignored it until now. Most … Continue reading →"], "link": "http://sharpstatistics.co.uk/r/ggplot/", "bloglinks": {}, "links": {"http://sharpstatistics.co.uk/": 1}, "blogtitle": "Sharp Statistics"}, {"content": ["As the name suggests method comparison is the process of comparing the results from 2 different methods to see if one method produces results consistent with a previous method. The techniques are designed to allow for the uncertainty that is present … Continue reading →"], "link": "http://sharpstatistics.co.uk/stats/method-comparison/", "bloglinks": {}, "links": {"http://sharpstatistics.co.uk/": 1}, "blogtitle": "Sharp Statistics"}, {"content": ["Standard linear regression assumes that each observation has equal importance, but this may not always be the case. If the observations have different uncertainties associated with them it is possible to weight the regression to the observations that are more … Continue reading →"], "link": "http://sharpstatistics.co.uk/stats/weighted-least-squares/", "bloglinks": {}, "links": {"http://sharpstatistics.co.uk/": 1}, "blogtitle": "Sharp Statistics"}, {"content": ["Although nothing to do with statistics Dockpanel suite  is a rather good library that adds a window system similar to that in visual studio to any application. I’ve used it for different projects for some years, and never had any major … Continue reading →"], "link": "http://sharpstatistics.co.uk/csharp/dockpanel-suite/", "bloglinks": {}, "links": {"http://sharpstatistics.co.uk/": 1}, "blogtitle": "Sharp Statistics"}, {"content": ["The motivation for the K-Means clustering code in the previous post was to have a look at spectral clustering. Spectral clustering can deal with data sets that K-Means can’t as the following plot shows. Spectral clustering relies on some linear … Continue reading →"], "link": "http://sharpstatistics.co.uk/stats/spectral-clustering/", "bloglinks": {}, "links": {"http://sharpstatistics.co.uk/": 1}, "blogtitle": "Sharp Statistics"}, {"content": ["As I have been studying artificial intelligence it seems appropriate to have a go at some of the methods, so here is my C# code to do K means clustering. This simple algorithm automatically assigns data into groups of similar values, … Continue reading →"], "link": "http://sharpstatistics.co.uk/csharp/k-means-clustering/", "bloglinks": {}, "links": {"http://sharpstatistics.co.uk/": 1}, "blogtitle": "Sharp Statistics"}, {"content": ["Non-Linear Iterative Partial Least Squares (NIPALS) is an algorithm for calculating principal components, and unlike the SVD method it allows only the required number of components to be calculated, which is useful for large data sets as typically only the … Continue reading →"], "link": "http://sharpstatistics.co.uk/stats/pc-using-nipals/", "bloglinks": {}, "links": {"http://sharpstatistics.co.uk/": 1}, "blogtitle": "Sharp Statistics"}, {"content": ["Principal Component Analysis (PCA) is widely used in many data analysis methods as it can reduce the complexity of large interrelated data sets. The easiest way to calculate PCA is by a eigenvalue decomposition namely singular value decomposition (SVD). Even … Continue reading →"], "link": "http://sharpstatistics.co.uk/stats/principal-components/", "bloglinks": {}, "links": {"http://sharpstatistics.co.uk/": 1}, "blogtitle": "Sharp Statistics"}, {"content": ["If you use R and haven’t discovered Sweave then go and find out about it. It enables R code and plots to be incorporated into a document so the analysis and report can be combined together in a single document. … Continue reading →"], "link": "http://sharpstatistics.co.uk/r/using-sweave/", "bloglinks": {}, "links": {"http://sharpstatistics.co.uk/": 1}, "blogtitle": "Sharp Statistics"}]