[{"blogurl": "http://dustingmixon.wordpress.com\n", "blogroll": [], "title": "Short, Fat Matrices"}, {"content": ["Last week, I was in Austria for a workshop on phase retrieval at the Erwin Schrodinger Institute, University of Vienna. The workshop, organized by Karlheinz Grochenig and Thomas Strohmer, started with three days of very interesting talks, and the rest of the week was devoted to open discussions and collaborations. This was my first workshop, [...]"], "link": "http://dustingmixon.wordpress.com/2012/10/14/esi-2012-phase-retrieval/", "bloglinks": {}, "links": {}, "blogtitle": "Short, Fat Matrices"}, {"content": ["Sorry it took so long to update this blog. Boris will be the first to tell me that I’m in violation of the law, but I assure you I have been rather busy. I started teaching today, so I used the last couple of months to knock out some research before it was too late! [...]"], "link": "http://dustingmixon.wordpress.com/2012/10/01/group-theoretic-constructions-of-erasure-robust-frames/", "bloglinks": {}, "links": {}, "blogtitle": "Short, Fat Matrices"}, {"content": ["Lately, my life has been consumed with the arduous process of writing grant proposals. Since I’m new to this process, I might be doing it wrong, but I took the opportunity to take a step back and look at my field of research from a different perspective. “The funder’s perspective,” I hear you thinking. Well, [...]"], "link": "http://dustingmixon.wordpress.com/2012/08/07/variations-on-a-theme-three-open-problems-in-short-fat-matrices/", "bloglinks": {}, "links": {}, "blogtitle": "Short, Fat Matrices"}, {"content": ["Last week, I was at Texas A&M for David Larson’s 70th birthday conference.  Bernhard Bodmann was also there, and we talked a little about phase retrieval.  He pointed me to this fantastic paper: Quantum tomography under prior information Teiko Heinosaari, Luca Mazzarella, Michael M. Wolf It’s all about determining a positive semidefinite matrix from measurements of the [...]"], "link": "http://dustingmixon.wordpress.com/2012/07/24/quantum-tomography-under-prior-information/", "bloglinks": {}, "links": {}, "blogtitle": "Short, Fat Matrices"}, {"content": ["Continuing an apparent recent theme on this blog, I’d like to discuss a particular application of phase retrieval, also known as phaseless reconstruction or reconstruction without phase. Specifically, I wish to discuss a relationship with a particular problem in quantum mechanics, but this requires a brief introduction to the field of study. Luckily, I’ve read [...]"], "link": "http://dustingmixon.wordpress.com/2012/07/10/quantum-mechanics-and-phase-retrieval/", "bloglinks": {}, "links": {}, "blogtitle": "Short, Fat Matrices"}, {"content": ["In the post before last, I reviewed a paper that showed that almost all ensembles of vectors in produce injective phaseless measurements. In the present post, I’ll describe a phaseless reconstruction technique about which I’m currently writing a paper with Boris Alexeev, Afonso Bandeira and Matt Fickus. Here, I’ll specifically address the noiseless case; we’ve modified [...]"], "link": "http://dustingmixon.wordpress.com/2012/06/26/phaseless-reconstruction-with-polarization-the-noiseless-case/", "bloglinks": {}, "links": {}, "blogtitle": "Short, Fat Matrices"}, {"content": ["Before I started this blog, I got a helpful blog-writing tip from Boris Alexeev. We’ve been friends since I started studying at Princeton, so I try to live up to his advice: Boris’s Law of Blogging The time between any two consecutive blog posts should be between 1 and 2 weeks. In fact, his advice [...]"], "link": "http://dustingmixon.wordpress.com/2012/06/12/boriss-law-of-blogging/", "bloglinks": {}, "links": {}, "blogtitle": "Short, Fat Matrices"}, {"content": ["Frame theory is chiefly concerned with measuring a signal by taking inner products with an ensemble of vectors, called a frame. From these inner products, various features of the signal can be analyzed, and the signal can be reconstructed. In some applications, only the magnitudes of the inner products are available. The following paper gives [...]"], "link": "http://dustingmixon.wordpress.com/2012/05/30/on-signal-reconstruction-without-phase/", "bloglinks": {}, "links": {}, "blogtitle": "Short, Fat Matrices"}, {"content": ["Last time, I blogged about constructing harmonic frames using difference sets. We proved that such harmonic frames are equiangular tight frames, thereby having minimal coherence between columns. I concluded the entry by conjecturing that incoherent harmonic frames are as good for compressed sensing as harmonic frames whose rows were randomly drawn from the discrete Fourier [...]"], "link": "http://dustingmixon.wordpress.com/2012/05/19/a-variant-on-the-compressed-sensing-of-yves-meyer/", "bloglinks": {}, "links": {}, "blogtitle": "Short, Fat Matrices"}, {"content": ["Equiangular tight frames (ETFs) are of particular interest throughout frame theory, and they are used in various sparse signal processing applications such as compressed sensing. The following paper describes how to build what are called harmonic ETFs: Achieving the Welch bound with difference sets Pengfei Xia, Shengli Zhou, Georgios B. Giannakis Let denote the discrete [...]"], "link": "http://dustingmixon.wordpress.com/2012/05/12/achieving-the-welch-bound-with-difference-sets/", "bloglinks": {}, "links": {}, "blogtitle": "Short, Fat Matrices"}]