[{"blogurl": "http://www.iq.harvard.edu/blog/sss\n", "blogroll": [], "title": "Social Science Statistics Blog"}, {"content": ["We hope you can join us this Wednesday, October 24, 2012 for the Applied Statistics Workshop . Chad Hazlett , a Ph.D. student from the Department of Political Science at MIT, will give a presentation entitled \"Kernel Regularized Least Squares: Moving Beyond Linearity and Additivity Without Sacrificing Interpretability\" (this is joint work with Jens Hainmueller from MIT). A light lunch will be served at 12 pm and the talk will begin at 12.15. \n\n \"Kernel Regularized Least Squares: Moving Beyond Linearity and Additivity Without Sacrificing Interpretability\" \nChad Hazlett and Jens Hainmueller \nDepartment of Political Science, MIT \nCGIS K354 (1737 Cambridge St.) \nWednesday, October 24th, 2012 12.00 pm \n\n Abstract: \n We propose the use of Kernel Regularized Least Squares (KRLS) for social science modeling and inference problems. KRLS borrows from machine learning methods designed to solve regression and classification problems without relying on linearity or additivity assumptions. The method constructs a flexible hypothesis space that uses kernels as radial basis functions and finds the best fitting surface in this space by minimizing a complexity-penalized least squares problem. We provide an accessible explanation of the method and argue that it is well suited for social science inquiry because it avoids strong parametric assumptions and still allows for simple interpretation in ways analogous to OLS or other members of the GLM family. We also extend the method in several directions to make it more effective for social inquiry. In particular, we (1) derive new estimators for the pointwise marginal effects and their variances, (2) establish unbiasedness, consistency, and asymptotic normality of the KRLS estimator under fairly general conditions, (3) develop an automated approach to chose smoothing parameters, and (4) provide companion software. We illustrate the use of the methods through several simulations and a real-data example."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/10/app_stats_hazle.shtml", "bloglinks": {}, "links": {"http://web.mit.edu/": 3, "http://www.harvard.edu/": 1}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["We hope you can join us this Wednesday, October 17, 2012 for the Applied Statistics Workshop . James Scanlan , an Attorney-at-Law, will give a presentation entitled \"The Mismeasure of Group Differences in the Law and the Social and Medical Sciences\". A light lunch will be served at 12 pm and the talk will begin at 12.15. \n\n \"The Mismeasure of Group Differences in the Law and the Social and Medical Sciences\" \nJames Scanlan \nAttorney-at-Law \nCGIS K354 (1737 Cambridge St.) \nWednesday, October 17th, 2012 12.00 pm \n\n Abstract: \n This paper addresses the problematic nature of efforts in the law and the social and medical sciences to appraise the comparative circumstances of advantaged and disadvantaged groups on the basis of standard measures of differences in outcome rates, given that such measures tend to be systematically affected by the prevalence of an outcome. The rarer an outcome the greater tends to be the relative difference in experiencing it and the smaller tends to be the relative difference in avoiding it. Thus, for example, as mortality declines relative differences in mortality of advantaged and disadvantaged groups tend to increase while relative differences in survival tend to decrease; as procedures like immunization and cancer screening become more common, relative differences in rates of receipt of those procedures tend to decrease while relative differences in rates of failing to receive them tend to increase; relaxing mortgage lending criteria tends to increase relative differences in mortgage rejection rates while reducing relative differences in mortgage approval rates. Similarly, among subpopulations where adverse outcomes are comparatively rare (e.g., persons with high education or high income, British civil servants), relative differences in adverse outcomes tend to be larger, while relative differences in favorable outcomes tend to be smaller, than among subpopulations where adverse outcome are more common. Absolute differences between outcome rates and differences measured by odds ratios are unaffected by whether one examines the favorable or the adverse outcome. But such measures tend also to be affected by the overall prevalence of an outcome, though in a more complicated way than the two relative differences. Broadly, as uncommon outcomes become more common absolute differences tend to increase; as already common outcomes become even more common, absolute differences tend to decrease. Differences measured by odds ratios tend to change in the opposite direction of absolute differences as the prevalence of an outcome changes. The paper will explain these patterns and the misinterpretations of data on group differences arising from the failure to understand them. It will also describe a method for appraising the size of the difference in circumstances reflected by outcome rates of advantaged and disadvantaged groups that is theoretically unaffected by the prevalence of the outcome. \n\n References: \n \n\t Scanlan J.P. \"Race and Mortality\" (Society, Jan/Feb 2000) \n Scanlan J.P. \"Can We Actually Measure Health Disparities?\" (Chance, Spring 2006) \n \n Scanlan, J.P. \"Disparate Impact?: Regulators Need a Lesson in Statistics\" (American Banker, June 5, 2012)"], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/10/app_stats_scanl.shtml", "bloglinks": {}, "links": {"http://www.americanbanker.com/": 1, "http://www.jpscanlan.com/": 3, "http://www.harvard.edu/": 1}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["We hope you can join us this Wednesday, October 10, 2012 for the Applied Statistics Workshop . Thales Teixeira , Assistant Professor of Business Administration at the Harvard Business School , will give a presentation entitled \"Viral Video Advertising\". A light lunch will be served at 12 pm and the talk will begin at 12.15. \n\n \"Viral Video Advertising\" \nThales Teixeira \nHarvard Business School \nCGIS K354 (1737 Cambridge St.) \nWednesday, October 10th, 2012 12.00 pm \n\n Abstract: \n To become viral, online video ads need to be viewed and then shared. Yet, what works for one decision may not work for the other. In this research we propose a novel consumer-centric model of viral advertising consisting of viewing and sharing decisions. We apply the model to assess the role of humor, present in 91% of viral ads, by teasing out the differential impact that type of humor (pure or shocking) has on each decision. In the lab, we record the facial expressions of consumers as they watch online ads containing either pure (i.e., smile, laughter) or shocking humor (e.g., shock from profanity), and examine its impact on their decisions. The video data is processed using face tracking software and used to calibrate a dynamic sequential model that accounts for both within and cross-decision dynamics. We find that shocking humor increases viewing but reduces sharing compared to no humor at all. Yet, content isn't the only factor of viral ad success; individual traits also matter. We also find that highly extraverted and self-directed consumers share humor ads more often and to a broader group of people each time. The magnitude of the effects of these two novel findings is then measured in a viral field study in which we selectively sent ads to participants and tracked views derived from sharing. We find that extraverted people garnered 300% more total views by sharing non-shocking humor ads than introverted people sharing ads low in humor."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/10/app_stats_teixe.shtml", "bloglinks": {}, "links": {"http://www.hbs.edu/": 2, "http://www.harvard.edu/": 1}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["We hope you can join us this Wednesday, October 3, 2012 for the Applied Statistics Workshop . Maximilian Kasy , Assistant Professor of Economics from the Department of Economics at Harvard University, will give a presentation entitled \"Identification in General Triangular Systems\". A light lunch will be served at 12 pm and the talk will begin at 12.15. \n\n \"Identification in General Triangular Systems\" \nMaximilian Kasy \nDepartment of Economics, Harvard University \nCGIS K354 (1737 Cambridge St.) \nWednesday, October 3rd, 2012 12.00 pm \n\n Abstract: \n This paper discusses identification in continuous triangular systems without restrictions on heterogeneity or functional form. In particular, we do not assume separability of structural functions, restrictions on the dimensionality of unobservables, or monotonicity in unobservables. We do maintain monotonicity of the first stage relationship in the instrument. We show that under this condition alone, and given rich enough support of the data, we can achieve point identification of potential outcome distributions, and in particular of the average structural function. If the support of the continuous instrument is not large enough potential outcome distributions are partially identified. If the instrument is discrete identification fails completely. The setup discussed in this paper covers important cases not covered by existing approaches such as conditional moment restrictions (c.f. Newey and Powell, 2003) and control variables (c.f. Imbens and Newey, 2009). It covers, in particular, random coe\u000efficient models, as well as models arising as the reduced form of a system of structural equations."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/09/app_stats_kasy.shtml", "bloglinks": {}, "links": {"http://scholar.harvard.edu/": 1, "http://www.harvard.edu/": 2}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["We hope you can join us this Wednesday, September 26, 2012 for the Applied Statistics Workshop . Luke Miratrix , Assistant Professor of Statistics in the Department of Statistics at Harvard University, will give a presentation entitled \"Random Weight Estimators: Adjusting Randomized Trials Without Using Observed Outcomes\". A light lunch will be served at 12 pm and the talk will begin at 12.15. \n\n \"Random Weight Estimators: Adjusting Randomized Trials Without Using Observed Outcomes\" \nLuke Miratrix \nDepartment of Statistics, Harvard University \nCGIS K354 (1737 Cambridge St.) \nWednesday, September 26th, 2012 12.00 pm \n\n Abstract: \n To increase the precision of a randomized trial, experimenters often adjust estimates of treatment effects using baseline covariates thought to predict the outcome of interest. In a previous paper, we proved that even under the Neyman-Rubin model, if the covariates and the method for adjustment are determined before randomization, this process can increase precision in a manner quite similar to a comparable blocked experiment. Typically, however, experimenters wish to adjust for the covariates that are most imbalanced between treatment and control, given the realized randomization. This leads to a much vexed variable selection problem that depends on the observed treatment assignment. To understand the issues behind this process, we examine a class of estimators we call \"Random Weight Estimators\" that adjust treatment effect estimates by weighting units with weights depending on a function on treatment assignment and covariates. While similar in spirit to blocking, these estimators can be applied \"after the fact,'' i.e., after randomization has occurred, allowing them to naturally adapt to the observed treatment assignment. They can also adjust for many different covariates at once, including continuous ones. This class is quite general, and it includes traditional methods such as ordinary linear regression. Using our framework, we show, under the Neyman-Rubin model, how one can easily introduce potential bias using what would seem to be legitimate and simple approaches, especially in small and midsize experiments. Care must be taken with many forms of adjustment, even if an approach is selected without regard to any actual outcomes. We also extend this methodology to survey experiments, giving an appropriate and near-unbiased estimator for the treatment effect of a parent population. Throughout the talk, we illustrate this overall framework."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/09/app_stats_mirat.shtml", "bloglinks": {}, "links": {"http://statistics.berkeley.edu/": 1, "http://www.harvard.edu/": 2}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["We hope you can join us this Wednesday, September 19, 2012 for the Applied Statistics Workshop . Rich Nielsen , a Ph.D. candidate from the Department of Government at Harvard University, will give a practice job talk entitled \"Jihadi Radicalization of Muslim Clerics\". A light lunch will be served at 12 pm and the talk will begin at 12.15. \n\n \"Jihadi Radicalization of Muslim Clerics\" \nRich Nielsen \nGovernment Department, Harvard University \nCGIS K354 (1737 Cambridge St.) \nWednesday, September 19th, 2012 12.00 pm \n\n Abstract: \n This paper explains why some Muslim clerics adopt the ideology of militant Jihad while others do not. I argue that clerics strategically adopt or reject Jihadi ideology because of career incentives generated by the structure of cleric educational networks. Well-connected clerics enjoy substantial success at pursuing comfortable careers within state-run religious institutions and they reject Jihadi ideology in exchange for continued material support from the state. Clerics with poor educational networks cannot rely on connections to advance through the state-run institutions, so many pursue careers outside of the system by appealing directly to lay audiences for support. These clerics are more likely to adopt Jihadi ideology because it helps them demonstrate to potential supporters that they have not been theologically coopted by political elites. I provide evidence of these dynamics by collecting and analyzing 29,430 fatwas, articles, and books written by 91 contemporary clerics. Using statistical natural language processing, I measure the extent to which each cleric adopts Jihadi ideology in their writing. I combine this with biographical and network information about each cleric to trace the process by which poorly-connected clerics become more likely to adopt Jihadi ideology."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/09/app_stats_niels_1.shtml", "bloglinks": {}, "links": {"http://people.harvard.edu/": 1, "http://www.harvard.edu/": 2}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["The NYT just alerted me to a paper by Joan Serra and coauthors demonstrating what we can learn about popular music with a big data approach. I'll leave it to you to interpret the trends they identify (music is getting louder, also more similar), but it was interesting and gave me a lot of ideas for how I could borrow some of this technology for my own research."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/09/pop_music_is_ge.shtml", "bloglinks": {}, "links": {"http://arxiv.org/": 1, "http://www.nytimes.com/": 1}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["We hope you can join us this Wednesday, September 12, 2012 for the Applied Statistics Workshop . Jamie Robins , Professor of Epidemiology from the Harvard School of Public Health , will give a presentation entitled \"A Simple Unification of the Potential Outcome and Causal Graph Approaches to Causal Inference\". A light lunch will be served at 12 pm and the talk will begin at 12.15. \n\n \"A Simple Unification of the Potential Outcome and Causal Graph Approaches to Causal Inference\" \nJamie Robins \nHarvard School of Public Health \nCGIS K354 (1737 Cambridge St.) \nWednesday, September 12th, 2012 12.00 pm \n\n Abstract: \n Potential outcomes are extensively used within statistics, epidemiology, and political science for reasoning about causation. Directed acyclic graphs are another formalism used to represent causal systems. They are extensively used in computer science, bioinformatics, sociology and epidemiology. It is natural to wish to unify them. \n \nWe present a simple approach to this unification. The approach is based on the idea of splitting nodes to construct graphs whose nodes are potential outcomes. The resulting graph can be used to read off counterfactual independencies. These independencies are satisfied by all previously proposed graphical and nongraphical causal models. We review many examples to illustrate the power of this approach. \n\n This is joint work with Thomas Richardson at the University of Washington."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/09/app_stats_robin_1.shtml", "bloglinks": {}, "links": {"http://www.harvard.edu/": 3}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["We hope you can join us this Wednesday, September 5, 2012 for the first Applied Statistics Workshop of the Fall 2012 semester. Michael Grubb , an Assistant Professor of Applied Economics from the MIT Sloan School of Management , will give a presentation entitled \"Cellular Service Demand: Biased Beliefs, Learning, and Bill Shock\". A light lunch will be served at 12 pm and the talk will begin at 12.15. \n\n \"Cellular Service Demand: Biased Beliefs, Learning, and Bill Shock\" \nMichael Grubb \nMIT Sloan School of Management \nCGIS K354 (1737 Cambridge St.) \nWednesday, September 5th, 2012 12.00 pm \n\n Abstract: \n By April 2013, the FCC's recent bill-shock agreement with cellular carriers requires consumers be notified when exceeding usage allowances. Will the agreement help or hurt consumers? To answer this question, we estimate a model of consumer plan choice, usage, and learning using a panel of cellular bills. Our model predicts that the agreement will lower average consumer welfare by $2 per year because firms will respond by raising monthly fees. Our approach is based on novel evidence that consumers are inattentive to past usage (meaning that bill-shock alerts are informative) and advances structural modeling of demand in situations where multi-part tariffs induce marginal-price uncertainty. Additionally, our model estimates show that an average consumer underestimates both the mean and variance of future calling. These biases cost consumers $42 per year at existing prices. Moreover, absent bias, the bill-shock agreement would have little to no effect."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/09/app_stats_grubb.shtml", "bloglinks": {}, "links": {"http://www.mit.edu/": 2, "http://mitsloan.mit.edu/": 1, "http://www.harvard.edu/": 1}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["Ok, maybe not, but I was just introduced to kaggle , which is sort of like oDesk and a lot like topcoder : people post a problem and other people compete to win a prize by solving it most effectively. Kaggle is devoted to data analysis problems. For example, there is currently a contest to win 3 million if you can \" Identify patients who will be admitted to a hospital within the next year, using historical claims data .\" Another contest is to \" Identify people who have a high degree of Psychopathy based on Twitter usage ,\" for $1000. Even at those low stakes, there 113 teams competing. \n \n   If it's like topcoder, it will be a remarkably cheap way to get great solutions to data problems. I'm not sure why (I guess competing analysts overestimate the probability of winning?), but this is what Karim Lakhani tells me. I'm already working on a paper using topcoder, but I'm now wondering -- half seriously -- if I could outsource my data analysis as well. I probably couldn't, but only because I enjoy this kind of work myself and I'd miss it. \n\n If you work with data, will Kaggle eventually take your job? Well, it makes it easier for people with data to find the best analysts out there. I'm not directly in competition with these folks, since none of these companies would come to me with their consulting gigs anyway. But it does suggest that the consulting market for quantitative social scientists is on the verge of being restructured. I'm excited about that -- I'm willing to bet that we'll learn more this way."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/07/kaggle_is_going.shtml", "bloglinks": {}, "links": {"https://www.odesk.com": 1, "http://www.heritagehealthprize.com/": 1, "http://www.kaggle.com/": 2, "http://community.topcoder.com/": 1, "http://www.topcoder.com/": 1}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["A while a ago Rich posted about chartsnthings , the blog written by Kevin Quealy of the New York Times graphics department. One thing that stood out to both Rich and myself was that a couple of the NYT folks do sketches in R and then post-process the sketches with Adobe Illustrator. A good example is Kevin's post on Mariano Rivera's career. \n\n Today, on the R-help mailing list, Michael Friendly pointed to a tutorial on the practicals of how to, you know, actually do post-processing with Illustrator."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/06/post-processing.shtml", "bloglinks": {}, "links": {"http://www.yorku.ca/": 1, "http://chartsnthings.tumblr.com": 1, "http://blogs.harvard.edu/": 1, "http://chartsnthings.tumblr.com/": 1, "http://twitter.com/": 1, "http://www.datavis.ca/": 1}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["Ever wondered how to get twitter data? I spent much of today listening to a great presentation on this subject by Derek Ruths at the 2012 Computational Social Science workshop hosted at IQSS and conveniently broadcast on the web . I'm not sure if video of the presentation will be available, but the code is all available and is extremely well done. For the most part, it worked \"out of the box\" while I was sitting there listening to the lecture, which is incredible. More incredible, it seemed like it worked for most of the people there. I've never seen a live scripting demonstration go so smoothly. \n\n The code is up on the interwebs so I assume it is fair game. Go get yourself some tweets and get published in Science . (Really, there's a demo that shows you basically how to do that paper!!)"], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/05/do_you_haz_teh.shtml", "bloglinks": {}, "links": {"http://networkdynamics.org/": 2, "http://video.harvard.edu/": 1, "http://blogs.harvard.edu/": 1, "http://events.harvard.edu/": 1}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["I just ran across chartsnthings (h/t to Gelman ). Kevin Quealy at the New York Times graphics department shows the progression from initial sketch to final graphic. \n\n Thoughts: \n\n 1) I love seeing other people's first sketches. I sketch first too, and I find that the quality of any graphic can mostly be determined by how good the idea was when I first sketched it. \n\n 2) This reminded me that rather than using R to make my final figures, I really need run them through Illustrator. Nathan Yau's book Visualize This gives some awesome worked examples of how to clean up R graphics in Illustrator. (And for Harvard folks, the book is available online through Widener library!)."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/05/from_sketch_to.shtml", "bloglinks": {}, "links": {"http://chartsnthings.tumblr.com/": 1, "http://andrewgelman.com/": 1, "http://lms01.harvard.edu/": 1, "http://book.flowingdata.com/": 1}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["We hope you can join us this Wednesday, April 25, 2012 for the final session of the Applied Statistics Workshop this semester. Felix Elwert , Assistant Professor from the Department of Sociology at the University of Wisconsin-Madison, will give a presentation entitled \"Endogenous Selection\". A light lunch will be served at 12 pm and the talk will begin at 12.15. \n\n \"Endogenous Selection\" \nFelix Elwert \nDepartment of Sociology, University of Wisconsin-Madison \nCGIS K354 (1737 Cambridge St.) \nWednesday, April 25th, 2012 12.00 pm \n\n Abstract: \n Selection bias is a central problem for causal inference in the social sciences. Quite how central a problem it is, however, is often obscured by ambiguous terminology, needlessly technical presentations, and narrow rules of thumb. This paper uses directed acyclic graphs (DAGs) to advance a precise yet intuitive global definition of endogenous selection bias and argue its theoretical and practical centrality for causal inference. The paper clarifies the fundamental structural difference between confounding and endogenous selection, shows that nearly all non-parametric identification problems relate to either confounding or endogenous selection, and argues that the problem of endogenous selection is indifferent to timing. Perhaps most importantly, we illustrate the importance of endogenous selection bias with numerous and varied examples from empirical social research. \n\n This is joint work with Chris Winship."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/04/app_stats_elwer.shtml", "bloglinks": {}, "links": {"http://ssc.wisc.edu/": 1, "http://www.wisc.edu/": 1, "http://www.harvard.edu/": 1}, "blogtitle": "Social Science Statistics Blog"}, {"content": ["We hope you can join us this Wednesday, April 18, 2012 for the Applied Statistics Workshop . Omar Wasow , a Ph.D. candidate from the Department of Government and the Department of African and African American Studies at Harvard University, will give a presentation entitled \"Violence and Voting: Did the 1960s Urban Riots Reshape American Politics?\" A light lunch will be served at 12 pm and the talk will begin at 12.15. \n\n \"Violence and Voting: Did the 1960s Urban Riots Reshape American Politics?\" \nOmar Wasow \nGovernment Department, Harvard University \nCGIS K354 (1737 Cambridge St.) \nWednesday, April 18th, 2012 12.00 pm \n\n Abstract: \n Between 1964 and 1971, more than 750 riots flared up in black neighborhoods across the United States. Scholarship on how the American polity respond to these violent protests is contested. Some scholars argue that urban riots produced a conservative ``backlash'' among white voters, while other scholars find little or no effect. Using a measure that incorporates the location, timing and severity of urban riots between 1964 and 1971, I examine whether increased exposure to urban riots is associated with decreased support for the Democratic party. In the 1964, 1968 and 1972 presidential elections, I find a strong negative relationship between exposure to civil unrest and the county-level Democratic vote share. I find a similar negative relationship between exposure to riots and Democratic vote share in congressional elections between 1968 and 1972. Finally, I find that in counterfactual scenarios of fewer riots the Democratic presidential nominee, Hubert Humphrey, would have beaten the Republican nominee, Richard Nixon, in the 1968 election. As African Americans were strongly identified with the Democratic party in this time period, my results suggest that, in at least some contexts, political violence by a minority group may contribute to a backlash among segments of the mass electorate and encourage outcomes directly at odds with the preferences of the protestors."], "link": "http://www.iq.harvard.edu/blog/sss/archives/2012/04/app_stats_wasow.shtml", "bloglinks": {}, "links": {"http://aaas.harvard.edu/": 1, "http://www.omarwasow.com/": 1, "http://www.harvard.edu/": 2}, "blogtitle": "Social Science Statistics Blog"}]