[{"blogurl": "http://spectralholes.blogspot.com\n", "blogroll": [], "title": "Spectral Holes"}, {"content": ["My dissertation examination took place a couple of weeks ago. Happily I passed... Now I can say that one of the unexpected problems of doing a PhD is to decide \"what is enough\". In some cases you can decide it based on the number of publications, but you probably have a lot of unfinished work which would be nice to include. In my case, somehow \"luckily\", I had a fixed deadline to finish the writing. However, I still have the feeling that something is left. There is always more to know. One more book to read. One more case to simulate. But as the quote says, perfection is the enemy of completion . \n \nHence, these days I've been updating my webpage to include my (imperfect) thesis. The title of the dissertation \" Interference and Network Management in Cognitive Communication Systems \" [V11] was chosen at some early stage of the work, however, it covers the two-parts of the developed work: \n \n \"On the one hand, using game theoretical tools, we analyze a framework for interference management in which certain interaction is allowed between primary and secondary systems. On the other hand, we address the problem of primary user monitoring using novel spectrum sensing schemes which exploit multiple antennas, wideband processing, and the available knowledge about primary transmissions.\" \nFor more details please refer to the section Cognitive Radio in my webpage, which gives an overview of the content of the thesis and includes a link for download. \n \n \n [ V11 ] Gonzalo Vazquez-Vilar Interference and Network Management in Cognitive Communication Systems Doctoral Thesis, Signal Processing and Communications Dept., University of Vigo, Jun 2011"], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/GKUWh_7VHig/phd-thesis-interference-management-in.html", "bloglinks": {}, "links": {"http://www.gonzalo-vazquez-vilar.eu/": 2, "http://blog.gonzalo-vazquez-vilar.eu/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["Some time ago I wrote a post about the standard IEEE 802.16h [802.16h] . I was curious about the differences between IEEE 802.16h and the Wireless Regional Area Network (WRAN) standard IEEE 802.22 [802.22] . \n \nThe standard 802.16h further extends the already complex specifications of 802.16 with coexistence mechanisms to allow the transmission in licensed bands. On the other hand, IEEE 802.22 pretends to be a lightweight standard with simple specifications focused on the task it is designed for: provide wireless network connectivity with up to 100km coverage (mostly targeted at rural and remote areas) in the VHF/UHF TV frequency spectrum. Hence the main difference between the two standards is the simplicity of [802.22] opposed to the generality of [802.16h] , which supports different frequency bands, several mobility scenarios, a variety of access schemes, multiple antennas... \n \nA comparison between the physical layer specifications of [802.22] versus the specifications of Wimax (subset of IEEE 802.16) follows: \n \n  \n Architecture IEEE 802.22 specifies a hierarchical point-to-multipoint architecture. A central base station manages its own cell and all associated consumer nodes. The base station controls the medium access in its cell and transmits in the downstream direction to the the different nodes, which respond back to the base station in the upstream direction. \n \nThe coverage of IEEE 802.22 is considerably larger than the one of 802.16 because of the propagation characteristics of the VHF/UHF band. Note that in this band the physical size of a multiple antenna structure is of the order of meters, and hence, non-practical. Therefore multiple antenna specifications (such as beamforming or spatial multiplexing) are not supported in the 802.22. \n \n Spectrum sensing However, IEEE 802.22 requires two separate antennas at each particular user: one directional and one omni-directional. The directional antenna is pointed towards the base station and is used for communication purposes, while the omni-directional antenna is required for sensing purposes. \n \nThe base station asks the different nodes to perform sensing in certain television channels. It determines which user must measure which channels, and which is the desired probability of detection and false alarm (depending on the detection algorithms implemented at each consumer equipment, measurements can take different amount of time). \n \nThis monitoring can be both in-band and out-of-band. In-band sensing refers to the actual channel that is being used by the 802.22 network, while out-of-band sensing consist in monitoring the rest of the channels. Additionally, the nodes have the capability of performing coarse/fine two steps sensing. A coarse sensing estimation will be done at speeds of under 1ms per channel, while the fine sensing is slower (more than 25 ms per channel) and it can be used or not based on the outcome of the coarse monitoring. \n \n Coexistence mechanisms IEEE 802.22 introduces certain coexistence mechanisms for the case of having multiple secondary networks (based on 802.22 or of other nature) sharing the same spectrum within its coverage range (which can go up to 100 Km). For example, the standard allows different 802.22 networks to \nsynchronize their superframe structure. \n \n References : \nThe content of this post is mainly based on the overview of the core technologies of the standard [802.22] presented here and here . Additionally, a good introductory paper to 802.22 is [C+06] . \n \n \n \n [ 802.22 ] IEEE Std. 802.22.1 Base Standard (Sponsor Ballot Draft v2.0).   \n [ 802.16h ] IEEE Standard for Local and metropolitan area networks Part 16. Air Interface for Broadband Wireless Access Systems Amendment 2: Improved Coexistence Mechanisms for License-Exempt Operation. IEEE Std 802.16h-2010 (Amendment to IEEE Std 802.16-2009). July 30 2010.   \n [ C+06 ] Carlos Cordeiro, Kiran Challapali, Dagnachew Birru, Sai Shankar N IEEE 802.22: An Introduction to the First Wireless Standard based on Cognitive Radios. Journal of Communications, Vol 1, No 1 (2006), 38-47, Apr 2006."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/89WgDCJN414/80222-wran-standard-using-white-spaces.html", "bloglinks": {}, "links": {"http://spectralholes.blogspot.com/": 2, "http://www.ieee802.org/": 3, "http://blog.gonzalo-vazquez-vilar.eu/": 1, "http://ojs.academypublisher.com/": 1, "http://ieeexplore.ieee.org/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["Yesterday I received an email informing that the videos of ICASSP 2011 talks have been made available. In the website you can watch the videos, slides and text of the speeches. Additionally you can share comments with other visitors (haven't tried this yet). Here the list of posts in Spectral Holes covering this year's ICASSP: \n ICASSP's technical program overview \n Compressive Sampling and Sparse Reconstruction at ICASSP 2011 \n Spectrum sensing \n Cooperative spectrum sensing and resource allocation \n More hints on compressed sensing at ICASSP 2011"], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/MhgAJl2i53w/icassp-2011-talks.html", "bloglinks": {}, "links": {"http://superlectures.com/": 2, "http://spectralholes.blogspot.com/": 5}, "blogtitle": "Spectral Holes"}, {"content": ["In the last weeks I discovered some interesting articles related to the transition it is happening in the field of cognitive radio . It becomes apparent that the focus on cognitive radio is changing from theory to more practical and regulatory considerations . Here is my recommended reading: \n \nThe article \"Cognitive radio: Ten years of experimentation and development\" [P+11] by P. Pawelczak et al. makes an extensive review on the hardware and system development for cognitive radio. It describes the main implementation platforms and systems that can be used for testing and performance evaluation of theoretical algorithms related to cognitive radio. From the most popular GNU radio to other composite hardware/software frameworks. Some relevant conclusions: \n There are practically no comprehensive CR demonstration platforms \n Open SDR platforms dominate the research market \n Many testbeds are not DSA in the strict meaning of the term \n OFDM is tipically the design choice for waveforms \n Energy detection is the most popular signal detection method \n Geolocation and sensing are needed for maximum reliability but at a cost \n Lack of appropiate RF front ends \n Small and centralized systems are the design choice for most of the platforms \n No dramatic increase in the number of available CR and network prototypes \n Only one third of the presented demos are from the US \n Universities dominate the demonstration market \n More emphasis is needed in reporting failures \n Each demonstration is developed by a small number of people \n Absence of IEEE 802.22 demonstrations \n On the other hand I include here two links. The first summarizes the state of the work involved in the ECC Report 159 , while the second presents an interesting discussion on the intended mix of policy and technology at DySPAN conference. \n \n Cognitive Radio in the ECC: Where we are now and where we are going \n \"The ECC set up a Project Team, PT SE43, to look at the compatibility issues between the relevant services using 'white spaces' in the UHF TV bands. After 19 months' work, SE43 delivered ECC Report 159 in January 2011. Its conclusions about the technical and operational requirements of WSDs are not so different from those of the FCC in the US (the FCC has already approved operators of databases for cognitive WSD devices). [...]\" \n Linda Doyle: Should we let DySPAN die? \n \"... the policy and technology mix is working as well as it could. At the plenary sessions the keynotes and papers reflect the mix as intended by the founders of DySPAN. But in the afternoons we split into policy and technology tracks. In the main policy people go to policy tracks and technology people go to technology tracks. [...]\" \n \n [ P+11 ] Pawelczak, P.; Nolan, K.; Doyle, L.; Ser Wah Oh; Cabric, D.; Cognitive radio: Ten years of experimentation and development. IEEE Communications Magazine, vol.49, no.3, pp.90-100, March 2011."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/fmGIxpgbDmk/some-reading-to-keep-up-with-cognitive.html", "bloglinks": {}, "links": {"http://spectralholes.blogspot.com/": 2, "http://ledoyle.wordpress.com/": 1, "http://www.wonderlandwpa.com/": 1, "http://ieeexplore.ieee.org/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["Last post closed the series devoted to ICASSP 2011 . Today I want to refer to an article I read some time ago, \"Is the PHY Layer Dead?\" [DH+10] , coauthored by M. Dohler, R. W. Heath Jr., A. Lozano, C. Papadias and R. A. Valenzuela. The origins of this paper go back to a discussion held at IEEE VTC Spring 2009 about the relevance of current research in physical layer (PHY). The article is really interesting and worth reading to any researcher working in the field. \n \nSome of the questions raised there can be particularized to cognitive radio. Here a couple of thoughts: \n \nCognitive radio research community has developed an extensive set of detectors for multiple system models. Have we achieved a detection performance close to what we can expect from a Cognitive Radio device? \n \nAs James Neel argued in one of his posts , \n \"that there’s waaay too many signal classification / detection papers and effort would be better spent on other aspects of learning about a radio’s environment.\" \nIn my opinion the answer is not so clear. First, in most practical detection problems there exists no clear performance limit that can be used as a reference for the available improvement margin. The optimal detector, given by the Neyman-Pearson detector, could in principle be used as a benchmark. However it is not implementable in the presence of nuisance parameters, and this its performance cannot be guaranteed to be achievable. \n \nSecond, in certain scenarios the analysis of \"good performing\" detectors, such as the GLRT, may offer insights in the information a learning algorithm requires. One simple example, if the GLRT detector is a function only of the largest eigenvalue of the empirical covariance matrix, this parameter is a good input to a learning algorithm. Hence the algorithm does not need to process the whole data set, what may be computationally unfeasible. \n \n \nCognitive radio community has focused mainly in clean and ideal problems, which conducted to an extensive set of algorithms and mathematical tools. Can these be translated to more sophisticated system problems, such as the ones one expect to find in real environments? \n \nAs Volkan pointed out , WiFi can always deal with simple scenarios. However when there are 570 Wi-Fi base stations operating in one room all these uncoordinated networks crash. In my opinion this \"worst case\" should be taken always into account when thinking about cognitive radio algorithms. Moreover, the empirical results using test-beds are so far quite limited and should be promoted. \n \nThese are just some ideas. Several other questions come to my mind, for example, if we are focusing too much in a specific application ( why cognitive radio? ), connections between academia and industry (is there already an industry around cognitive radio? )... what do you think? \n \n \n [ DH+10 ] M. Dohler, R.W. Heath Jr., A. Lozano, C. Papadias, R.A. Valenzuela, Is the PHY Layer Dead? IEEE Communications Magazine, 2010."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/rVIbPpRJux8/is-phy-layer-dead.html", "bloglinks": {}, "links": {"http://crtwireless.com/blog": 1, "http://spectralholes.blogspot.com/": 4, "http://www.cttc.es/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["The last of this series of posts about ICASSP 2011 is about compressed sensing . Here's a bunch of compressed sensing related papers from different sessions: \n \n \"THE VALUE OF REDUNDANT MEASUREMENT IN COMPRESSED SENSING\" ; Victoria Kostina, Princeton University, US; Marco Duarte, Duke University, United States; Sina Jafarpour, Princeton University, US; Robert Calderbank, Duke University, US \n \nThe conference room was completely full during the presentation of this paper, in my opinion because of its evocative title. However the scenario studied in this work is much more particular as one could think from the title. The authors study the performance of a particular family of measurement matrices (weakly democratic) under the assumption that the CS quantizer has the choice to reject some measurements from the ones initially acquired. An overall bit budget for quantization is divided between (i) a set of bits to encode the set of indices for the rejected measurements, and (ii) the remaining bits that encode the values of the preserved measurements. Under these assumptions the paper concludes that throwing away certain measurements improves recovery SNR, i.e. it is better to have certain measurements quantized over a finer grid than a lot of coarse measurements. \n \n \"COMPRESSIVE SENSING MEETS GAME THEORY\" ; Sina Jafarpour, Princeton University, US; Volkan Cevher, Ecole Polytechnique Fédérale de Lausanne, Switzerland; Robert Schapire, Princeton University, US \n \nAnother paper with an evocative title. This work proposes a new reconstruction algorithm (MUSE) from compressed measurements corrupted with noise. This algorithm, which presents guarantees on the infinity-norm of the reconstruction error, can be formulated as a two-player game (and hence the title), which is equivalent to an alternating optimization scheme. \n \n \nAn interesting work on the fundamentals of estimation of parameters with underlying sparsity: \n \n \"PERFORMANCE BOUNDS FOR SPARSE PARAMETRIC COVARIANCE ESTIMATION IN GAUSSIAN MODELS\" ; Alexander Jung, Vienna University of Technology, Austria; Sebastian Schmutzhard, University of Vienna, Austria; Franz Hlawatsch, Vienna University of Technology, Austria; Alfred O. Hero III, University of Michigan, US \n \nThis paper studies the performance bounds on the problem of estimating the covariance matrix of a Gaussian random vector under the assumption that this covariance matrix can be modeled as a sparse expansion of known \"basis matrices\". The authors have derived lower bounds on the variance of both biased and unbiased estimators for a certain family of covariance matrices of interest. The analysis shows that in the low SNR regime the sparsity does not help, while in the high SNR regime the performance of an oracle estimator can be achieved. Between these two extreme cases the bound presents a transition phase polynomical in the SNR. This work studies a more involved scenario than the one by Ben-Haim et al. in their last year paper . \n \n \nICASSP will soon have to create a special session just for Yonina C. Eldar. This year she figures as coauthor of six papers. I won't go over all of them, just a couple of hints: \n \n \"SHANNON MEETS NYQUIST: CAPACITY LIMITS OF SAMPLED ANALOG CHANNELS\" ; Yuxin Chen, Stanford University, United States; Yonina C. Eldar, Technion / Israel Institute of Technology, Israel; Andrea Goldsmith, Stanford University, US \n \nThis preliminary work explores how capacity is affected by a sampling mechanisms below the channel's Nyquist rate. Under the Gaussianity assumption, the problem is formulated as a joint optimization over the input distribution and the receiver filter for a given set of uniform samplers. In the case of having a single receiver chain it is shown that the optimal transmission strategy avoids aliasing at the output, i.e. receiver filter not always corresponding to the classical matched filter. On the other hand, for multiple receiver chains sufficient conditions to obtain Nyquist capacity at a total rate equal to Landau rate are derived. My opinion is that the journal version of this work (\"Shannon meets Nyquist: capacity limits of sampled analog channels\", Y. Chen, Y. C. Eldar, and A. J. Goldsmith, in preparation) will give the first steps towards a rigorous analysis of the capacity achievable by compressed sampling schemes. \n \n \"SUB-NYQUIST SAMPLING OF SHORT PULSES\" ; Ewa Matusiak, University of Vienna, Austria; Yonina C. Eldar, Technion, Israel \n \nThis work applies the ideas of the modulated wideband converter to the time domain. Here it is assumed that the transmitted signal is composed by a series of narrow pulses with unknown shapes and unknown delays. In order to reduce the required sampling rate the proposed approach exploits the sparsity of the signal in the \"Gabor frames\" domain yielding to a similar result as in the case of the modulated wideband converter."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/j1m3MnkyDXs/more-hints-on-compressed-sensing-at.html", "bloglinks": {}, "links": {"http://spectralholes.blogspot.com/": 2}, "blogtitle": "Spectral Holes"}, {"content": ["After spending the weekend in Vienna, I continue today the series of posts devoted to ICASSP 2011. Here I will present some works related to cognitive radio from a couple of sessions. In the session SPCOM-L4 ( Cooperative Spectrum Sensing ) we could find different collaborative schemes (several of them relying in compressed sensing) for primary user monitoring/detection: \n \n \"BASIS PURSUIT FOR SPECTRUM CARTOGRAPHY\" ; Juan Andrés Bazerque, Gonzalo Mateos, Georgios B. Giannakis, University of Minnesota, US \n \nThis paper proposes a sparsity-aware spline-based method for field (RF power in space and frequency) estimation from a set of measurements provided by a set of sensors distributed on the region under investigation. The authors propose the adoption of an overcomplete set of basis functions, together with a sparsity-promoting regularization term, which endows the estimator with the ability to select a few of these bases that “better” explain the data. The algorithm results into a group-Lasso estimator of the spline basis expansion coefficients. Results from empirical measurements are provided. \n \n \"BEP WALLS FOR COLLABORATIVE SPECTRUM SENSING\" ; Sachin Chaudhari, Jarmo Lunden, Visa Koivunen, Aalto University, Finland \n \nThis works investigates the performance limitation of collaborative spectrum sensing in cognitive radios with imperfect reporting channels. The authors study the problem of hard decision based cooperative sensing, in which each secondary node sends a one-bit binary decision over a binary channel with errors and the fusion center applies a K-out-of-N fusion rule, trying to find a similar result to the SNR walls under noise uncertainty. If the bit error rate of the reporting channel is above a wall value, the authors show that constraints on the cooperative detection performance cannot be met at the fusion center irrespective of the received signal quality and sensing time. My point here is that if sensing time is allowed to grow without bounds one could also allow better error correction codes, couldn't one? \n \n Update: Sachin Chaudhari commented that indeed their work emphasizes the need of using correction codes in the transmissions to the fusion center. Here his comment: \n \n \"Please note that the constraints on the cooperative detection performance cannot be met at the fusion center irrespective of the received signal quality 'or' the sensing time. So even for the case when the sensing time is short and the SNRs on the listening channel are very good, the performance constraints cannot be met. The whole point of the paper was to show that you may need the error correction codes while using the counting rules.\" \n \"DECENTRALIZED SUPPORT DETECTION OF MULTIPLE MEASUREMENT VECTORS WITH JOINT SPARSITY\" ; Qing Ling, University of Science and Technology of China, China; Zhi Tian, Michigan Technological University, US \n \nThis paper considers the problem of finding sparse solutions from multiple measurement vectors with joint sparsity. To this end the authors propose a decentralized row-based Lasso (DR-Lasso) algorithm in which a penalty term is introduced to enforce joint sparsity of the solution. In order to exchange information between neighbors the algorithm relies in a consensus based iterative procedure. \n \n \"COOPERATIVE SPECTRUM SENSING BASED ON MATRIX RANK MINIMIZATION\" ; Yue Wang, Beijing University of Posts and Telecommunications, China; Zhi Tian, Michigan Technological University, US; Chunyan Feng, Beijing University of Posts and Telecommunications, China \n \nThis paper develops a new cooperative spectrum sensing technique based on matrix rank minimization. A nuclear norm minimization problem is formulated to jointly identify the nonzero support of the monitored wide spectrum (featuring possibly multiple primary signals). \n \nThe session SPCOM-L3 ( Resource Allocation and Game Theory ) featured some works with different approaches to resource allocation and to scheduling of the transmission/sensing instants. In general they study the problem from a network level perspective, for example by assuming slotted transmissions: \n \n \"NON-CONVEX UTILITY MAXIMIZATION IN GAUSSIAN MISO BROADCAST AND INTERFERENCE CHANNELS\" ; Marco Rossi, New Jersey Institute of Technology, US; Antonia Maria Tulino, Bell Laboratories (Alcatel-Lucent), US; Osvaldo Simeone, Alexander M. Haimovich, New Jersey Institute of Technology, US \n \nIn this work two algorithms are proposed to sum-rate (and other utilities) maximization for multiantenna broadcast and interference channels (non-convex problem). The first finds the global optimum by performing a suitably designed branch-and-bound method (as you can imagine fairly complex). The second approach is a suboptimal iterative algorithm that converges to a stationary point fulfilling the KKT conditions, however, its final performance depends on the initial parameters and hence does not guarantee global optimality. \n \n \"STOCHASTIC ANALYSIS OF TWO-TIER NETWORKS: EFFECT OF SPECTRUM ALLOCATION\" ; Wang Chi Cheung, Tony Quee Seng Quek, Agency of Science, Technology And Research, Singapore; Marios Kountouris, Supélec, France \n \nThis work proposes a two-tier network modeling a macrocell/femtocells scenario. The scheme reserves a certain amount of resources for exclusive use of macrocell, a different set of resources for exclusive use of femtocells, and the remaining are left open for both tiers, hence generating cochannel interference. \n \n \"DISTRIBUTED MULTIACCESS IN HIERARCHICAL COGNITIVE RADIO NETWORKS\" ; Shiyao Chen, Lang Tong, Cornell University, US \n \nThis work presents a high level approach to the problem of scheduling the transmission/sensing instants among different secondary users under a global primary-user collision constraint. If secondary users are assumed to sense/transmit in a single channel each time slot the optimum policy under certain conditions is shown to be a round-robin policy in which each secondary user cycles through all the channels in the band."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/gLRgFgKlHgw/cooperative-spectrum-sensing-and.html", "bloglinks": {}, "links": {"http://blog.gonzalo-vazquez-vilar.eu/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["As I promised at the end of the post about the session on compressed sensing and sparse reconstruction , here my impressions on the papers presented in my session ( SPCOM-L2 : Spectrum Sensing for Cognitive Radio ). This year's ICASSP presentations have been recorded in video and after the talk I was asked to sign a consent form for the recorded material. Then I assume that it (when allowed by the authors) will be made publicly available in the future. Nice! \n \n \"DETECTION DIVERSITY OF MULTIANTENNA SPECTRUM SENSORS\" ; Gonzalo Vazquez-Vilar, Roberto Lopez-Valcarce, University of Vigo, Spain; Ashish Pandharipande, Philips Research, Netherlands \n \nThis paper applies to multiantenna spectrum sensing the concept of diversity order first proposed by Daher and Adve in the radar community. This diversity order corresponds to the slope of the average probability of detection vs. SNR curve at the point at which the average probability of detection equals 0.5, and tightly characterizes the minimum operational SNR at which a sensing scheme begins to work \"well\" and how fast this happens. \n \n \"THE NON-BAYESIAN RESTLESS MULTI-ARMED BANDIT: A CASE OF NEAR-LOGARITHMIC REGRET\" ; Wenhan Dai, Tsinghua University, China; Yi Gai, Bhaskar Krishnamachari, University of Southern California, US; Qing Zhao, University of California, US \n \nNot so much into the topic. The idea is quite similar to the one presented by the authors last year's ICASSP: to gain knowledge of an underlying stochastic process by scheduling the sensing and transmissions. Here the abstract: \n \"In the classic Bayesian restless multi-armed bandit (RMAB) problem, there are N arms, with rewards on all arms evolving at each time as Markov chains with known parameters. A player seeks to activate K ≥ 1 arms at each time in order to maximize the expected total reward obtained over multiple plays. RMAB is a challenging problem that is known to be PSPACE-hard in general. We consider in this work the even harder non-Bayesian RMAB, in which the parameters of the Markov chain are assumed to be unknown a priori. We develop an original approach to this problem that is applicable when the corresponding Bayesian problem has the structure that, depending on the known parameter values, the optimal solution is one of a prescribed ﬁnite set of policies. In such settings, we propose to learn the optimal policy for the non-Bayesian RMAB by employing a suitable meta-policy which treats each policy from this ﬁnite set as an arm in a different non-Bayesian multi-armed bandit problem for which a single-arm selection policy is optimal. We demonstrate this approach by developing a novel sensing policy for opportunistic spectrum access over unknown dynamic channels. We prove that our policy achieves near-logarithmic regret (the difference in expected reward compared to a model-aware genie), which leads to the same average reward that can be achieved by the optimal policy under a known model. This is the ﬁrst such result in the literature for a non-Bayesian RMAB.\" \n \"ON AUTOCORRELATION-BASED MULTIANTENNA SPECTRUM SENSING FOR COGNITIVE RADIOS IN UNKNOWN NOISE\" ; Jitendra Tugnait, Auburn University, US \n \nThis work presents a spectrum sensing scheme for spatially rank-1 primary signals in spatially uncorrelated noise with unequal noise variances across antennas. Unlike in the paper we presented at CIP'10 the method is not based on the GLRT. The proposed method uses the properties of the autocorrelation function of the received signal. Additionally, an asymptotic analysis of the statistic distribution under both hypothesis is provided. At the end of the talk J. Tugnait presented an sketch of the extension of the algorithm to consider spatial correlation between the noise process observed at each of the antennas, similarly to the work by Stoica and Cedervall in ”Detection tests for array processing in unknown correlated noise ﬁelds,” 1997, IEEE Trans. Signal Process. \n \n \n \"MULTIANTENNA DETECTION UNDER NOISE UNCERTAINTY AND PRIMARY USER'S SPATIAL STRUCTURE\" ; David Ramirez, University of Cantabria, Spain; Gonzalo Vazquez-Vilar, Roberto Lopez-Valcarce, University of Vigo, Spain; Javier Vía, Ignacio Santamaría, University of Cantabria, Spain \n \nThe model considered in this work is the same as the one of the previous paper except for the fact that now primary user's signal may present a spatial rank larger than 1 and which is assumed known at the receiver. Hence, assuming a generic diagonal noise covariance matrix, the authors propose a GLRT based detection scheme. Although asymptotic in the low SNR regime, the proposed detector offers good performance even for moderate SNR values. This work is part of a journal paper accepted for publication in IEEE Trans. Signal Process. \n \n \"TONE DETECTION OF NON-UNIFORMLY UNDERSAMPLED SIGNALS WITH FREQUENCY EXCISION\" ; André Bourdoux, Sofie Pollin, Antoine Dejonghe, Liesbet Van der Perre, IMEC, Belgium \n \nIn this work the authors perform narrowband signal detection from a set of compressed measurements using a modified basis pursuit algorithm. At first I couldn't get the point of this algorithm. However now I think I understand it: the basis pursuit is applied in the spectral domain so that there exists an important leakeage of the signal power that increases the noise floor. Once the largest frequency component is identified, the modied algorithm estimates its corresponding phase before subtracting it in the original domain . Hence in the next iteration the noise floor has been reduced noticeably. A pity I haven't though about the \"small detail\" of the phases last year. \n \n \"A UNIFIED FRAMEWORK FOR GLRT-BASED SPECTRUM SENSING OF SIGNALS WITH COVARIANCE MATRICES WITH KNOWN EIGENVALUE MULTIPLICITIES\" ; Erik Axell, Erik G. Larsson, Linköping University, Sweden \n \nThe last paper of the session also focuses on multiantenna spectrum sensing. The authors compute the GLRT for a general model that comprises several practical scenarios as a special case, namely spectrum sensing of signals which have covariance matrices with known eigenvalue multiplicities (all other parameters are assumed unknown and need to be estimated). Nice presentation."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/ssYpkUl3QU0/spectrum-sensing-icassp-2011.html", "bloglinks": {}, "links": {"http://spectralholes.blogspot.com/": 1, "http://www.cmsworldwide.com/": 1, "http://www.gonzalo-vazquez-vilar.eu/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["In first place I want to make a short comment about the Xampling seminar by Yonina Eldar and Moshe Mishali. Some colleagues pointed out that the seminar's start was too basic, intended for people not familiar at all with compressed sensing. In my opinion Yonina presented a nice framework (the subspace union model ) where several problems involving sparsity fit in. In this sense the first part of the presentation was quite general. However, at the end there was not much time left for commenting the main hardware implementation issues before the welcome reception. A pity. \n \nToday's compressed sensing oral session ( SPCOM-L1 ) was intense: \n \n \"EIGENSPACE SPARSITY FOR COMPRESSION AND DENOISING\" ; Ioannis Schizas, Georgios B. Giannakis, University of Minnesota, US \n \nThis paper exploits sparsity in the eigenspace of signal covariance matrices for both compression and denoising. To this end it presents an iterative algorithm which starting from the standard PCA solution converges to a sparse PCA. In this sparse PCA solution some of the principal components are zeroed, hence the compression. The noise reduction comes from the fact that if data are noisy the proposed sparsity-aware eigenspace estimator recovers a subset of the unknown signal subspace basis support, hence reducing the variability of the signal. Nice presentation by Giannakis. \n \n \"BASIS PURSUIT IN SENSOR NETWORKS\" ; João Mota, Carnegie Mellon University / Institute of Systems and Robotics, US; João Xavier, Pedro Aguiar, Institute of Systems and Robotics, Portugal; Markus Püschel, ETH Zürich, Switzerland \n \nThis paper exploits some of the structure of the Basis Pursuit (BP) algorithm in order to derive a distributed algorithm in a sensor network based on the dual of the original optimization problem. The novelty of this work is to use an optimal first-order method to solve an augmented Lagrangian reformulation. \n \n \"ESTIMATING SPARSE MIMO CHANNELS HAVING COMMON SUPPORT\" ; Yann Barbotin, Ali Hormati, Ecole Polytechnique Fédérale de Lausanne, Switzerland; Sundeep Rangan, Polytechnic Institute of New York University, United States; Martin Vetterli, Ecole Polytechnique Fédérale de Lausanne, Switzerland \n \nThis work proposes an algorithm to estimate multipath channels with Sparse Common Support based on Finite Rate of Innovation sampling. This algorithm presents two main advantages: on the one hand it exploits sparsity in domain of \"received paths\", and on the other it uses that in practical setups the support of this sparse signal can be considered equal accross multiple antennas. This last points closes the gap to the Cramer-Rao lower bound in the medium SNR regime (the mismatch of the model given the existing distance between the receiver antennas is exhacerbated in the high SNR regime). \n \n \"APPLYING CSISZAR'S I-DIVERGENCE TO BLIND SPARSE CHANNEL ESTIMATION\" ; Feng Wan, Urbashi Mitra, University of Southern California, US \n \nIn this work the authors propose a semi-blind, iterative, sparse channel estimation method based on minimizing Csiszar’s I-divergence. The proposed semi-blind method accurately estimates the significant tap locations of a sparse channel, and their corresponding magnitudes. The phase ambiguity of each of the channel contributions must be estimated through the use of additional pilots. \n \n \"COMPRESSIVE TRACKING OF DOUBLY SELECTIVE CHANNELS IN MULTICARRIER SYSTEMS BASED ON SEQUENTIAL DELAY-DOPPLER SPARSITY\" ; Daniel Eiwen, University of Vienna, Austria; Georg Tauböck, Franz Hlawatsch, Vienna University of Technology, Austria; Hans Georg Feichtinger, University of Vienna, Austria \n \nThe idea behind this work is that the channel support in a practical system changes slowly. Then the domain \"differences in the support between one time instant and the next\" presents a certain sparsity which can be exploited for channel estimation. To this end the authors employ a modified version of the orthogonal matching pursuit. \n \n \"ADDITIVE CHARACTER SEQUENCES WITH SMALL ALPHABETS FOR COMPRESSED SENSING MATRICES\" ; Nam Yul Yu, Lakehead University, Canada \n \nThis work proposes a deterministic construction of the compression matrix via additive character sequences. While this construction shows good properties in terms of recovery performance, it does not introduce further structure for efficient reconstruction. \n \nThis afternoon I gave my talk in the spectrum sensing session, but this will have to wait until I have some time."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/HvgEv7N-eJ0/compressive-sampling-and-sparse.html", "bloglinks": {}, "links": {"http://www.cmsworldwide.com/": 1, "http://blog.gonzalo-vazquez-vilar.eu/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["Today I've been checking ICASSP's technical program looking for sessions related to cognitive radio and compressive sensing. Compared to last year's ICASSP , we can see an important reduction in the number of cognitive radio related papers while compressive sensing continues its rising trend . Here a quick selection (to guide me through the conference). \n \n SPCOM-L2: Spectrum Sensing for Cognitive Radio \n \n DETECTION DIVERSITY OF MULTIANTENNA SPECTRUM SENSORS  \n   Gonzalo Vazquez-Vilar, Roberto Lopez-Valcarce, Ashish Pandharipande \n \n  THE NON-BAYESIAN RESTLESS MULTI-ARMED BANDIT: A CASE OF NEAR-LOGARITHMIC REGRET \n   Wenhan Dai, Yi Gai, Bhaskar Krishnamachari, Qing Zhao \n \n  ON AUTOCORRELATION-BASED MULTIANTENNA SPECTRUM SENSING FOR COGNITIVE RADIOS IN UNKNOWN NOISE \n   Jitendra Tugnait \n \n  MULTIANTENNA DETECTION UNDER NOISE UNCERTAINTY AND PRIMARY USER'S SPATIAL STRUCTURE  \n   David Ramirez, Gonzalo Vazquez-Vilar, Roberto Lopez-Valcarce, Javier Vía, Ignacio Santamaría \n  TONE DETECTION OF NON-UNIFORMLY UNDERSAMPLED SIGNALS WITH FREQUENCY EXCISION \n   André Bourdoux, Sofie Pollin, Antoine Dejonghe, Liesbet Van der Perre \n \n  A UNIFIED FRAMEWORK FOR GLRT-BASED SPECTRUM SENSING OF SIGNALS WITH COVARIANCE MATRICES WITH KNOWN EIGENVALUE MULTIPLICITIES \n   Erik Axell, Erik G. Larsson \nSPCOM-P3: Resource Allocation and Game Theory \n \n OPTIMAL TRANSMISSION STRATEGIES FOR CHANNEL CAPTURE MITIGATION IN COGNITIVE RADIO NETWORKS \n   Yingxi Liu, Nikhil Kundargi, Ahmed Tewfik \n \n  RESOURCE ALLOCATION FOR OFDMA COGNITIVE RADIOS UNDER CHANNEL UNCERTAINTY \n   Seung-Jun Kim, Nasim Soltani, Georgios B. Giannakis \n \n  POWER ALLOCATION OPTIMIZATION IN OFDM-BASED COGNITIVE RADIOS BASED ON SENSING INFORMATION \n   Xiaoge Huang, Baltasar Beferull-Lozano \n \n  STOCHASTIC RESOURCE ALLOCATION FOR COGNITIVE RADIO NETWORKS BASED ON IMPERFECT STATE INFORMATION \n   Antonio Marques, Georgios B. Giannakis, Luis Lopez-Ramos \n \n  DYNAMIC SPECTRUM MANAGEMENT IN DSL WITH ASYNCHRONOUS CROSSTALK \n   Rodrigo Moraes, Paschalis Tsiaflakis \n \n  DESIGN OF DIGITAL PREDISTORTERS FOR WIDEBAND POWER AMPLIFIERS IN COMMUNICATION SYSTEMS WITH DYNAMIC SPECTRUM ALLOCATION \n   Sungho Choi, Eui-Rim Jeong, Yong Hoon Lee \n \n  GAME-THEORETIC RESOURCE ALLOCATION IN RELAY-ASSISTED DS/CDMA SYSTEMS WITH SUCCESSIVE INTERFERENCE CANCELLATION \n   Alessio Zappone, Eduard Jorswieck \n \n  OPTIMAL RADIO ACCESS IN FEMTOCELL NETWORKS BASED ON MARKOV MODELING OF INTERFERERS' ACTIVITY \n   Sergio Barbarossa, Alessandro Carfagna, Stefania Sardellitti, Marco Omilipo, Loreto Pescosolido \n \n  CONVERGENCE OF THE ITERATIVE WATER-FILLING ALGORITHM WITH SEQUENTIAL UPDATES IN SPECTRUM SHARING SCENARIOS \n   Bhavani Shankar M. R, Peter von Wrycza, Mats Bengtsson, Björn Ottersten \n \n  RATE CONTROL FOR PSD LIMITED MULTIPLE ACCESS SYSTEMS THROUGH LINEAR PROGRAMMING \n   Amir Leshem, Ephraim Zehavi \nSPCOM-L3: Resource Allocation and Game Theory \n \n NON-CONVEX UTILITY MAXIMIZATION IN GAUSSIAN MISO BROADCAST AND INTERFERENCE CHANNELS \n   Marco Rossi, Antonia Maria Tulino, Osvaldo Simeone, Alexander M. Haimovich \n \n  STOCHASTIC ANALYSIS OF TWO-TIER NETWORKS: EFFECT OF SPECTRUM ALLOCATION \n   Wang Chi Cheung, Tony Quee Seng Quek, Marios Kountouris \n \n  DISTRIBUTED MULTIACCESS IN HIERARCHICAL COGNITIVE RADIO NETWORKS \n   Shiyao Chen, Lang Tong \n  NEW RESULTS ON ADAPTIVE COMPUTATIONAL RESOURCE ALLOCATION IN SOFT MIMO DETECTION \n   Mirsad Cirkic, Daniel Persson, Erik G. Larsson \n \n  JOINT BANDWIDTH AND POWER ALLOCATION IN COGNITIVE RADIO NETWORKS UNDER FADING CHANNELS \n   Xiaowen Gong, Sergiy Vorobyov, Chintha Tellambura \n \n  CLT FOR EIGEN-INFERENCE METHODS IN COGNITIVE RADIOS \n   Jianfeng Yao, Romain Couillet, Jamal Najim, Eric Moulines, Mérouane Debbah \n \n SPCOM-L4: Cooperative Spectrum Sensing \n \n BEP WALLS FOR COLLABORATIVE SPECTRUM SENSING \n   Sachin Chaudhari, Jarmo Lunden,Visa Koivunen \n \n  COOPERATIVE SENSING WITH SEQUENTIAL ORDERED TRANSMISSIONS TO SECONDARY FUSION CENTER \n   Laila Hesham, Ahmed Sultan, Mohammed Nafie, Fadel Digham \n \n  BASIS PURSUIT FOR SPECTRUM CARTOGRAPHY \n   Juan Andrés Bazerque, Gonzalo Mateos, Georgios B. Giannakis \n \n  DECENTRALIZED SUPPORT DETECTION OF MULTIPLE MEASUREMENT VECTORS WITH JOINT SPARSITY \n   Qing Ling, Zhi Tian \n \n  COOPERATIVE SPECTRUM SENSING BASED ON MATRIX RANK MINIMIZATION \n   Yue Wang, Zhi Tian, Chunyan Feng \n \n  COOPERATIVE SENSING IN COGNITIVE NETWORKS UNDER MALICIOUS ATTACK \n   Mai Abdelhakim, Lei Zhang, Jian Ren, Tongtong Li \n \n SPCOM-L1: Compressive Sampling and Sparse Reconstruction \n \n EIGENSPACE SPARSITY FOR COMPRESSION AND DENOISING \n   Ioannis Schizas, Georgios B. Giannakis \n \n  BASIS PURSUIT IN SENSOR NETWORKS \n   João Mota, João Xavier, Pedro Aguiar, Markus Püschel \n \n  ESTIMATING SPARSE MIMO CHANNELS HAVING COMMON SUPPORT \n  Yann Barbotin, Ali Hormati, Sundeep Rangan, Martin Vetterli \n \n  COMPRESSIVE TRACKING OF DOUBLY SELECTIVE CHANNELS IN MULTICARRIER SYSTEMS BASED ON SEQUENTIAL DELAY-DOPPLER SPARSITY \n   Daniel Eiwen, Georg Tauböck, Franz Hlawatsch, Hans Georg Feichtinger \n \n  ADDITIVE CHARACTER SEQUENCES WITH SMALL ALPHABETS FOR COMPRESSED SENSING MATRICES \n   Nam Yul Yu \n SPTM-P3/4: Compressive Sensing and Sparsity I and II \n \n ROBUST NONPARAMETRIC REGRESSION BY CONTROLLING SPARSITY \n   Gonzalo Mateos, Georgios B. Giannakis \n \n  COMPRESSIVE POWER SPECTRAL DENSITY ESTIMATION \n   Michael Lexa, Michael Davies, Janosch Nikolic, John Thompson \n \n  ADAPTIVE COMPRESSIVE SENSING AND PROCESSING FOR RADAR TRACKING \n   Ioannis Kyriakides \n \n  SPARSE VARIABLE REDUCED RANK REGRESSION VIA STIEFEL OPTIMIZATION \n   Magnus Ulfarsson, Victor Solo \n \n  THE ROTATIONAL LASSO \n   Alexander Lorbert, Peter Ramadge \n \n  CAUSAL SIGNAL RECOVERY FROM U-INVARIANT SAMPLES \n   Tomer Michaeli, Yonina C. Eldar, Volker Pohl \n \n  ESTIMATION AND DYNAMIC UPDATING OF TIME-VARYING SIGNALS WITH SPARSE VARIATIONS \n   M. Salman Asif, Adam Charles, Justin Romberg, Christopher Rozell \n \n  RECOVERY OF SPARSE PERTURBATIONS IN LEAST SQUARES PROBLEMS \n   Mert Pilanci, Orhan Arikan \n \n  COMPRESSIVE SAMPLING WITH A SUCCESSIVE APPROXIMATION ADC ARCHITECTURE \n   Chenchi Luo, James McClellan \n \n  ITERATIVE REWEIGHTED ALGORITHMS FOR SPARSE SIGNAL RECOVERY WITH TEMPORALLY CORRELATED SOURCE VECTORS \n   Zhilin Zhang, Bhaskar D. Rao \n \n  USING THE KERNEL TRICK IN COMPRESSIVE SENSING: ACCURATE SIGNAL RECOVERY FROM FEWER MEASUREMENTS \n   Hanchao Q, Shannon Hughes \n \n  SUB-NYQUIST SAMPLING OF SHORT PULSES \n   Ewa Matusiak, Yonina C. Eldar \n \n SPTM-P6: Sparsity, Sampling and Reconstruction \n \n SPTM-L4/7: Compressed Sensing: Theory and Methods I and II \n \n THE VALUE OF REDUNDANT MEASUREMENT IN COMPRESSED SENSING \n   Victoria Kostina, Marco Duarte, Sina Jafarpour, Robert Calderbank \n \n SPTM-P11: Sampling and Reconstruction \n \n SS-L11: Compressed Sensing and Sparse Representation of Signals \n \n BEATING NYQUIST THROUGH CORRELATIONS: A CONSTRAINED RANDOM DEMODULATOR FOR SAMPLING OF SPARSE BANDLIMITED SIGNALS \n   Andrew Harms, Waheed U. Bajwa, Robert Calderbank \n \n  SPARSE SPECTRAL FACTORIZATION: UNICITY AND RECONSTRUCTION ALGORITHMS \n   Yue Lu, Martin Vetterli \n \n  RAND PPM : A LOW POWER COMPRESSIVE SAMPLING ANALOG TO DIGITAL CONVERTER \n   Praveen Yenduri, Anna Gilbert, Michael Flynn, Shahrzad Naraghi"], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/2J1KoBXI-_w/cognitive-radio-at-icassp-2011.html", "bloglinks": {}, "links": {"http://spectralholes.blogspot.com/": 2, "http://www.cmsworldwide.com/": 13, "http://www.gonzalo-vazquez-vilar.eu/": 2}, "blogtitle": "Spectral Holes"}, {"content": ["It's been a long time since my last post. In my defense I have to say that it was just because I entered the wormhole of \"writing a PhD thesis\". Now I'm almost finished, and since there are only a few days left before ICASSP 2011 (I will be posting from Prague) I want to catch up with the blog. \n \nA couple of days ago, Volkan, a first year PhD student, wrote a shrewd comment in the blog. And since it raises some interesting issues I decided to answer it in a separate post. Here the comment and my response. \n \n \"Hi Gonzalo, I just have found your blog and its really informative and helpful. I study CRs as well, and this is my first time getting introduced to the internals of the wireless communication technologies. \n \nThe more I study about the history of wireless standards and its evolving nature, the less I believe in the future of CRs. (No offense! I need to fulfil the requirements of a PhD about CRs as well.) Let me put it this way: There are various technologies (IEEE 802.11, 802.15.1, 802.15.4, 802.16, 802.22, etc.) working on the ISM band in an uncoordinated and non-cooperative manner. Consider a case where there are 3 WiFi APs operating in the ISM band and we all know that they are almost oblivious to each other and incapable of fully utilizing the available ~80MHz of spectrum. You might say that there are various industrial WiFi providers providing a centrally managed network of WiFi APs for such scenario. Yes, there are, but they don't work that well as advertised. Think about what happened in the presentation of iPhone 4 in 2010. (\"Because there are 570 Wi-Fi base stations operating in this room. We can't deal with that.\" -- Steve Jobs) At TechCrunch 2008, RailsConf 2010, Web 2.0 Expo 2010. These giant conferences and public events are equipped with centrally managed and professionally placed >500 WiFi APs, and they just didn't work. On the other hand, take look at GSM. We are not capable of making a stupid WiFi network work in ~80MHz, but a GSM operator is able to serve \"millions\" of its customers in just ~25MHz. \n \nTo sum up, my prevision is that: When we manage to finalize a standard for CRs and in the progress of introducing it into the market, GSM will be serving up to %90 of the internet connectivity market in a much more effective and successful manner. (Please, make me wrong.) It just seems to me that we are trying to clean up the mess of a bunch of uncoordinated big-brother company activities, which will just inevitably get lost in the dusty pages of the history in a near future. Here is another example: For decades people worked on sensing and now FCC tell us that let's forget about that sensing and use a GPS database. Sorry but.. WTF! I really would like to hear your opinions on these matters.\" \nFirst I would like to thank Volkan for sharing his opinion. In fact, I have to say that I agree with him in several points. For example, I believe that Wifi and probably CR based standards will never be able to completely substitute centralized GSM-like technology (in fact I even believe that GSM is already serving the 90% of the mobile internet connectivity ;) ). And so much effort has been put into developing a true dynamic spectrum access and the first approach is just to check a database with information about vacant channels ? Completely agree. \n \nHowever, I think that Volkan's view about the services a cognitive radio network can provide is quite limited. While Bluetooth/Wifi/Wimax cannot deal with certain situations (as he pointed out), they showed to be a great success in offering certain services that otherwise would not exist. In most of the homes there exists today at least one Wifi hotspot connecting different devices, such as TV, printer, laptop… or when you get into a car equipped with a Bluetooth headset the mobile phone automatically recognizes it and gets connected. My point here is that none of these (and many other) services would be possible by using a standard centralized GSM network. Moreover, while I do not have the actual data I would bet that just Wifi networks worldwide move more information than the sum of all the 2G-3G data. That is the power of decentralized / low range communications. I believe that the availability of additional spectral resources, such as opening certain licensed bands , will create an environment in which other unexpected services can be born. \n \n And why requiring a geolocated database? Let’s think a little bit about the reason for that: just time. The first studies on the spectral efficiency of conventional static access schemes date back before 2002 (see e.g., “Report of the spectrum efficiency working group”, FCC, 2002). After that the FCC showed interest in allowing a dynamic spectrum access in certain licensed bands… and almost 10 years after, this access scheme was not implemented yet. Even worse, other countries catching up the initial advantage of US in this matter. That is, the FCC is now in a hurry to have something in the market as soon as possible, hence the database aided approach . \n \nTo sum up, on the one hand I believe that CR will facilitate a series of new services/applications, and on the other, I hope that future versions of CR technology will incorporate sensing as a requirement… even if it is only to give some sense to my past research ;)"], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/RYeprhlehcQ/is-research-in-cognitive-radio-useless.html", "bloglinks": {}, "links": {"http://spectralholes.blogspot.com/": 3}, "blogtitle": "Spectral Holes"}, {"content": ["One year after the proposals by TV-Band white-spaces database providers the FCC released recently the next steps in this matter. As it was expected the FCC opted for license the spectrum database to multiple providers: \n \n \"While the operation of multiple database administrators may present some coordination challenges, we find it is in the public interest to have multiple parties developing business models for this new mechanism.\" \nIt results that all the proposals from last year have been \"conditionally\" selected: \n Google \n CommSearch \n FrequencyFinder \n KB Enterprieses/LS Telcom \n Key Bridge \n NeuStar \n Spectrum Bridge \n Telcordia \n WSdB \n The details of the database architecture are not complete. To this end, database providers have to complete their proposals to address the new rules and attend the following OET Workshops. As I commented before, the providers were conditionally selected. From the announcement: \n \n \"we are designating the database administrators subject to a number of conditions, including that they attend workshops to be conducted by OET and perform real-world testing of their databases to ensure they provide accurate results before they are made available for use by TV bands devices\""], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/cExDi4MYY-Y/tv-band-white-spaces-database-providers.html", "bloglinks": {}, "links": {"http://spectralholes.blogspot.com/": 2, "http://www.fcc.gov/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["In this post I include a list of papers recently published on the topic of wideband detection in cognitive radio . This post complements and updates the survey I did some time ago on wideband spectrum sensing . \n \n A Class of Spectrum-Sensing Schemes for Cognitive Radio Under Impulsive Noise Circumstances: Structure and Performance in Nonfading and Fading Environments , by HG Kang, I Song, S Yoon, YH Kim. This paper exploits a nonlinear diversity-combining strategy together with the generalized likelihood ratio test detectors on each of the antenna branches. \n \n A Parallel Cooperative Spectrum Sensing in Cognitive Radio Networks . In this work S. Xie, Y. Liu, Y. Zhang and R. Yu propose a sensing scheme in which several secondary users are selected to perform sensing in different channels. They present an analytical model to investigate the tradeoff between the transmitted data and the sensing overhead, which results into a throughput maximization problem. \n \n Multiantenna spectrum sensing: The case of wideband rank-one primary signals . In this work D Ramırez, J Via and I Santamaria derive multiantenna detector based on the asymptotic likelihood under the asumptions of a wideband rank-one signal under spatially uncorrelated noise with equal or different power spectral densities. \n \n Distributed Compressive Spectrum Sensing in Cooperative Multihop Cognitive Networks . In this paper F Zeng, C Li, Z Tian present a cooperative approach to wideband spectrum sensing. Their scheme utilizes a compressive sampling mechanism which exploits the signal sparsity induced by network spectrum under-utilization by enforcing consensus among local spectral estimates. \n \n A Wideband Spectrum Sensing Method for Cognitive Radio using Sub-Nyquist Sampling . In this preprint M Rashidi, K Haghighi, A Owrang and M Viberg present a wideband spectrum sensing scheme that utilizes a sub-Nyquist sampling in order to reconstruct the correlation matrix. This method does not require the knowledge of signal properties mitigating the uncertainty problem. Also by Moslem Rashidi is this long preprint (maybe a book chapter?): Non-uniform sampling and reconstruction of multi-band signals and its application in wideband spectrum sensing of cognitive radio . It may be an useful introduction to the topic. \n \n \n On the use of Compressive Sampling for Wide-band Spectrum Sensing by D. Sundman, S. Chatterjee and M. Skoglund. For wideband signals sampling at the Nyquist rate is a major challenge. In this work they propose a wideband detection scheme of multiple simultaneous signals using sub-Nyquist sampling rates. This work is extended to incorporate memory from previous slots in slow varying scenarios. \n \n \n Evidence Theory Based Cooperative Spectrum Sensing with Efficient Quantization Method in Cognitive Radio . In this work N. Nguyen-Thanh and I. Koo study an enhanced scheme for cooperative spectrum sensing based on efficient quantization and the Dempster-Shafer Theory of Evidence. They propose an effective quantizer for the sensing data which takes advantage of special properties of the statistic distribution for different signal-to-noise ratios of the primary signal, hence reducing the required bandwidth for the reporting channel occupancy. \n \n Adaptive Spectrum Sensing and learning in Cognitive Radio Networks by A. Taherpour, S. Gazor and A. Taherpour. This paper proposes an iterative primary user activity detection algorithm for a wideband frequency range using a Markov Model (MM) with two states to model the activity of the primary users. \n \nIf you know any additional paper related to wideband sensing which has been recently published you can leave a comment with the link."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/D9M5mjAea_I/recent-papers-on-wideband-spectrum.html", "bloglinks": {}, "links": {"https://eeweb01.kth.se/": 1, "http://arxiv.org/": 2, "http://ieeexplore.ieee.org/": 3, "http://scholar.google.es/": 2, "http://spectralholes.blogspot.com/": 1, "http://www.eurasip.org/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["At the beginning of the year I wrote a post about the companies with most patents on cognitive radio . In that 1st quarter of 2010 the three leading companies in number of patents were 1 Motorola (14%), Samsung (14%) and Qualcomm (8%). \n \nA recent survey shows the patent scenario for the last quarter, now focused on cognitive radio patents for the television band (TVWS). The results are very similar to the previous post and only the order of the three leading companies has changed. Samsung Electronics leads in number of patents related to cognitive radio over TVWS, followed by Motorola, and Qualcomm . While the quality of several of these patents is doubtful , it is true that usually exists certain correlation between the number of patents and the actual innovations developed by a certain company."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/2Q1_0B18S7Q/patents-on-cognitive-radio-over-tvws.html", "bloglinks": {}, "links": {"http://spectralholes.blogspot.com/": 2, "http://techipm-innovationfrontline.blogspot.com/": 2}, "blogtitle": "Spectral Holes"}, {"content": ["Some time has passed since my last post. Two reasons for that, first that I've working in a preliminary report of my work here in Cambridge and secondly I also spent some free time travelling around ;). Now, in this post I make a review on the companies which already have cognitive radio commercial products . I started to write this post some time ago, but I just found a post in CRTWireless blog commenting that James Neel will be speaking about this at the ICO-COST 902 meeting November 23-25 in Bologna . From his post: \n \n \"I take the position that CR is already a commercial product (e.g., xG’s cellular stuff, Cisco’s CleanAir, the CRC WiFi system, 802.11 h,y, self-organizing networks in 3GPP, Cambridge’s stuff)\" \nNice to see that I'm not the only one thinking this way. I will start the review with xG Technology, since their product is in my opinion the closest to market. In fact they have already signed a contract with a military contractor to license the technology xMax . \n \n xG Technology: xMax With xMax xG Technology translates the concept of mobile phones to the (unlicensed) band of 900MHz. The core of xMax technology is it capability of sensing for other systems in the band and determine if interference has reached unacceptable levels, and in such case change band. This process can be carried out up to 33 times a second. The main practical problems a product of this kind has to deal with are synchronization issues and robustness of the detection scheme. \n \nWhile xG Technology webpage mainly offers a high level description of this cognitive radio technology, it also points out some characteristics of the physical layer: \n Handover decisions are made by fussing multiple samples and measurements. This allows the system to avoid unnecessary band switches due to a temporary interference or degraded network conditions. \n Compared to this the modulation is very simple: xMax uses a conventional single carrier modulation with BPSK modulation. However it allows the bonding of multiple of these single carriers channels working in different bands. Then, while the technology supports up to 1Mbps per channel with BPSK modulation, it allows the use of 18 RF channels simultaneously, and thus it can achieve up to 18Mbps. Higher rates could be achieved by employing adaptive modulation instead of BPSK. \n \n Spectrum Bridge / Microsoft: Occupancy Database Solutions Other companies, like Spectrum Bridge, have a different focus. They offer database solutions which will be required in order to implement the unlicensed access using geolocation devices. However this is yet to come . In the mean time we can already play searching the spectrum for white holes . \n \n CRC: CORAL The Communications Research Centre Canada has developed a commercial WiFi-based cognitive radio development platform : \n \n \"The world's first commercial WiFi-based cognitive radio development platform is available from the Communications Research Centre Canada (CRC). The system will be of interest to both researchers and wireless Internet service providers building multipoint relay and other types WiFi networks. Called CORAL, the system can undertake radio interference sensing and autonomously adapt to the sensed interference.\" \n Cisco: CleanAir Technology \n Cisco's CleanAir Technology allows the wireless nodes to build an interference map and reconfigure the network to optimize the performance. This technology applies even for the widely used unlicensed 802.11n networks. However, while the resulting systems are self-healing and self-optimizing, this process is probably not agile enough to be used with licensed bands. \n \n IMEC: Cobra IMEC is a research company focused in nano-electronics. Recently they launched a cognitive baseband radio ( COBRA ) high performance architecture targeting 4G requirements at up to 1Gbit/s throughput and multiple asynchronous concurrent streams. \n \nNote however that this project is just a reconfigurable physical layer chip and it is in wireless prototype stage. Hence, if successful it could be used in the future to build actual 4G cognitive radio systems. \n \n Adapt4 Adat4 commercializes proprietary data transmission systems in the 217-220 MHz band which can be used for surveillance, monitoring... Adapt4's products claim to be pioneer in implementing practical, cognitive radios . \n \n \"The XG1's and frequency management feature enables the radios to constantly scan the entire band to look for and avoid interference from other users (including other secondary or primary licensees). Should a frequency in use by the XG1 suddenly become interfered with, the radio will instantly select a free channel from its constantly updated Free Channel List. Each of the radio's 1 to 45 channels is individually managed in this way, so that segments of bandwidth throughout the entire band can be used. And to minimize further the possibility of extended interference, the radio will constantly change its frequency even without interference to minimize its profile in the band.\" \nHowever, they offer low data rates (30 to 180 kbps of data throughput) and they do not specify how sensible and agile this detection process is. Note that most of current systems already implement a \"dynamic channel selection\" in the configuration process. \n \n \nHere I covered just a few of the companies working on projects related to cognitive radio. A more exhaustive list can be found on the Wireless Innovation forum Member list . \n \n \n Cognitive Radio Standards for unlicensed access We have seen different the approaches to Cognitive Radio by different companies. However, there exits an important standardization effort to avoid finishing with many proprietary non-interoperable systems. Here one slide of the talk by James Neel and Jeff Reed at the Atlantic Council (Oct 29, 2010) \"Second Wave of Wireless Communications\" that summarizes some of these efforts. \n \n  \nI already wrote about the 802.16h (the cognitive Wimax) in a previous post . I will also try to go over the main points of the remaining standards, with special focus on 802.11af and 802.22 . Since the intended market for the last one noticeably overlaps with 802.16h, I'm specially curious about the differences between these two."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/K8Dtnr1dFvM/cognitive-radio-products.html", "bloglinks": {}, "links": {"http://www.adapt4.com/": 1, "http://urgentcomm.com/": 1, "http://www.spectrumbridge.com/": 2, "http://crtwireless.com/blog": 1, "http://www.wirelessinnovation.org/": 1, "http://crtwireless.com/": 1, "http://www.xgtechnology.com/": 2, "http://www.cisco.com/": 1, "http://www.cost2100.org/": 1, "http://blog.gonzalo-vazquez-vilar.eu/": 1, "http://spectralholes.blogspot.com/": 3, "http://www.gc.ca/": 2, "http://www2.imec.be/": 3}, "blogtitle": "Spectral Holes"}, {"content": ["Recently I moved to Cambridge, UK, in order to join the Signal Processing and Communications Lab for three months. Here I started to work in some topics related to information theory . Reading Gallager's book [G69] I discovered a quite different view of information theory to the one taught at Stanford, based on Cover and Thomas's book [CT06] . Here is why. \n \nStanford courses EE376A (taught by Cover ) and EE479 (course on Multiuser Information Theory taught by El Gamal ) offer a clean view of Information Theory. While the first course is more about the intuition behind information theory, developing some basic tools to deal with simple channels, the second constructs a solid framework useful to asses the achievability and converse proofs of most of the capacity problems. However both courses are the result of several years of iterations, at each of them cleaning the proofs and the concepts to make everything simple and elegant . In fact the notion of typicality, while useful to derive capacity in an elegant way, hides many concepts and machinery behind it. \n \nOf course simple proofs allow to solve complicated problems. However it exists the risk that the students are not aware of the concepts hidden behind. For example, I got the impression that typicality arguments in a random coding communications scheme arise naturally when trying to derive capacity. It was surprising to find in [G69] that capacity is also the outcome when applying Maximum Likelihood decoding to a point to point communication scheme. Although a couple of apparently magic bounds are used in the derivation, it shows the concept of the error exponent which links the pure theoretical results to more practical schemes. \n \nTo complete this post I have to mention [H03] , a book that tries to generalize many aspects of the classical information theory through the concept of information spectrum . While I did not have to read it in depth, the approach followed also gives interesting insights into the problem. \n \n \n [ CT06 ] Thomas M. Cover, Joy A. Thomas Elements of Information Theory, 2nd Edition. Wiley. 2006.   \n [ G69 ] Robert G. Gallager Information Theory and Reliable Communication. Wiley. 1969.   \n [ H03 ] Te Sun Han Information-Spectrum Methods in Information Theory. Springer. 2003. (Original Japanese edition published by Baifukan, Tokyo, 1998)."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/JmLYI2ABADs/comments-on-information-theory.html", "bloglinks": {}, "links": {"http://www.springer.com/": 1, "https://ccnet.stanford.edu/": 1, "http://www.stanford.edu/": 2, "http://blog.gonzalo-vazquez-vilar.eu/": 1, "http://www-sigproc.ac.uk/": 1, "http://eu.wiley.com/": 2, "http://isl.stanford.edu/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["While in the US the FCC pushed the \"final\" rules for unlicensed access of the television band in Europe the ECC approved a similar report, although in a preliminary phase. This report, published as ECC Report 159 , can be downloaded from the CEPT meeting documentation area (by selecting group 43 , year 2010 , folder SE43#7-1009-Biel>>Minute s and document number SE43(10)126-Annex 3 ). In this report the working group SE43 studies both the protection requirements of the licensed users of the 470-790MHz band (and its neighboring bands) and the operational characteristics of the unlicensed devices, in the document referred as white space devices . \n \nThe document studies three candidate techniques to be implemented by the cognitive radio devices, namely sensing , geo-location database and beacon . However in a similar line to the FCC conclusion the report indicates that the current technology is not adequate for sensing based standalone systems: \n \"The sensing thresholds were derived for a limited number of scenarios using the methodology developed within this report and taking into account a range of potential DTT receiver configuration. Some of the values so obtained (being in the range from -91 to -165 dBm depending on the DTT planning scenario) appear to be too low to be implemented using the current technology. Moreover, in some scenarios, even these low values for the detection threshold do no guarantee a reliable detection of the presence/absence of the broadcasting signals at the distance corresponding to the interference potential of a WSD.\" \nWhile the ECC Report 159 also studies the combination of sensing and geolocation database to assure the required protection to primary users, the ECC will probably conclude that geolocation based devices offer enough protection without additional sensing. This may look as bad news for the companies which invested in spectral sensing research. However, as Roberto points out in a comment of the last post spectrum sensing devices may be useful to build and keep up to date the information present in the database."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/tQZgPOorOKc/ecc-report-159-european-white-space.html", "bloglinks": {}, "links": {"http://www.cept.org/": 1, "http://spectralholes.blogspot.com/": 3}, "blogtitle": "Spectral Holes"}, {"content": ["In the previous post I presented the situation in both the US and Europe regarding the use of unlicensed white space devices in the television band. As it was expected, the FCC released the \"final\" rules for the cognitive use of TV white spaces in the US ( press release , report FCC-10-174 ). \n \nThis solution is based on a database architecture only . That is, the white space devices must have geolocation capabilities and download from a database the occupancy tables while they are not required to perform additional sensing before transmitting. Moreover, as opposed to 2008 rules, the low power devices which could relay only on sensing are banned: \n \"Eliminating the requirement that TV bands devices that incorporate geo-location and database access must also listen (sense) to detect the signals of TV stations and low power auxiliary service stations (wireless microphones). As part of that change we are also revising and amending the rules in several aspects to reflect use of that method as the only means for determining channel availability. While we are eliminating the sensing requirement for TVBDs, we are encouraging continued development of this capability because we believe it holds promise to further improvements in spectrum efficiency in the TV spectrum in the future and will be a vital tool for providing opportunistic access to other spectrum bands.\" \nNote that the final rules encourage further research in cognitive radio sensing techniques, since this may be useful for other spectrum bands. However the final rules discard the idea of cognitive radios: is it cognitive to download from a database a list of free channels? \n \nOn the other hand, wireless microphones , low-power dumb devices that cannot be guaranteed to be registered in the database, will have two channels for exclusive use . Extra channels can be temporarily reserved in the database during special events for the use of these devices. \n \nTo finish with, note that the central part of the architecture is still missing . While the FCC already received different proposals for the database architecture, interface and specifications of the database need to be defined yet. \n \nAll these issues motivate the use of quotation marks when I write FCC \"final\" rules ."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/UTl6TG24hjU/final-fcc-rules-cognitive-radio-or-just.html", "bloglinks": {}, "links": {"http://spectralholes.blogspot.com/": 1, "http://www.fcc.gov/": 2}, "blogtitle": "Spectral Holes"}, {"content": ["The FCC is expected to release today the final rules for the use of TV white space spectrum in the US . The previous version of these rules, published almost two years ago , generated several protests by (both aerial and cable TV) broadcasters and raised additional technical issues seeking reconsideration of the 2008 rules. However during these two years the FCC authorized several tests and trials in order to evaluate the benefits and possible problems the unlicensed access to the TV band. The FCC also received database proposals from different companies to enable the use of geolocation based devices, and allowed the time for the digital transition process to complete. \n \nWhile this happens in the US, Europe is still a step behind . Recently the CEPT SE43 workgroup, which is developing recommendations for the unlicensed use of 470-790 MHz in Europe, participated in the 57th WG SE meeting. A final version of the Draft rules for European White Space Devices (draft ECC Report 159) has been approved for public consultation (see pages 17-18 of this document ). After a two weeks pre-consultation period within administration, the public consultation will start on the 30th of September. However, from the documents currently available, additional studies will be probably required before the definitive report is published. \n \nIn the (hopefully) near future I will go over the FCC decision and the ECC Report . \n \n Edit: Here my comments on the FCC decision ."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/omr0b3DLQhU/final-fcc-rules-for-unlicensed-use-of.html", "bloglinks": {}, "links": {"http://www.cept.org/": 1, "http://spectralholes.blogspot.com/": 5, "http://www.commlawblog.com/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["The International Workshop in Cognitive Information Processing (CIP) is a small conference focused on Cognitive Radio . This year's conference was on Elba Island, Italy. While it took place a while ago (in June) I did not have the opportunity to write over it yet. Surveys and comparisons of spectrum sensing strategies The works included in this review will present a slightly different classification to the previous ones ( ICASSP , ICC ). I will start discussing four works that either survey or compare different spectrum sensing techniques: In \" Overview of Spectrum Sensing for Cognitive Radio \", Erik Axell, Geert Leus and Erik G. Larsson present a survey of state-of-the-art algorithms for spectrum sensing. The algorithms discussed range from energy detection to feature detectors exploiting some known structure of the transmitted signal (cyclostationarity properties, known eigenvalue structure of the signal's covariance...), including cooperative detection schemes. A more involved review on cooperative detection schemes is presented by Luca Bixio, Marina Ottonello, Mirco Raffetto, Carlo S Regazzoni and Claudio Armani in the paper \" A Comparison among Cooperative Spectrum Sensing Approaches for Cognitive Radios \". This paper compares the three main fusion rules in cooperative spectrum sensing, i.e. OR, AND and optimal, in terms of required processing capabilities at the fusion center and at the secondary terminals, and required control channel capacity. In \" Multiantenna spectrum sensing for Cognitive Radio: overcoming noise uncertainty \" Roberto López Valcarce, Gonzalo Vazquez-Vilar and Josep Sala propose a novel multiantenna spectrum sensing paradigm for detection of rank-1 primary signals with uncalibrated multiantenna detectors. However this paper also includes in the discussion most of the previously proposed multiantenna detectors derived under several assumptions for both calibrated and uncalibrated receivers. In \" Performance Comparison for Low Complexity Blind Sensing Techniques in Cognitive Radio Systems \" Bassem Zayen, Wael Guibène and Aawatif Hayar classify and compare different low complexity sensing strategies. Specifically, two blind sensing algorithms: the distribution analysis detector and the algebraic detector, which are compared with the energy detector as reference algorithm. Mixing topics Estimating the rank of the covariance matrix of a given random process is a recurrent topic in the literature. However it received limited attention in the context of Cognitive Radio systems. In \" Estimating the Number of Signals Observed by Multiple Sensors \" Marco Chiani and Moe Win show how the exact (non asymptotic) distribution of the eigenvalues of the empirical covariance matrix can be used to find the ML estimate of the actual eigenvalues. However, since this procedure presents a high complexity, they finally propose a rank estimator based on the usual eigenvalue estimate. Erik Axell and Erik G. Larsson (authors of the overview previously commented) also present \" Optimal and Near-Optimal Spectrum Sensing of OFDM Signals in AWGN Channels \". In this work they derive the OFDM signal GLR detector for unknown noise and signal powers, which exploits the non-stationary correlation structure of the OFDM signal. Additionally they discuss the optimality of Energy Detection when the noise level is known. In every conference focused on Cognitive Radio there are some papers on Compressed sensing. In \" Compressive sampling based MVDR spectrum sensing \" Ying Wang, Ashish Pandharipande and Geert Leus use the minimum variance distortionless response (MVDR) estimator to perform detection from a set of compressed measurements. As opposed to other works they derive the probability distribution of the CS MVDR spectrum estimate, which can be used to determine the detection thresholds. Finally, Miguel López-Benítez and Ferran Casadevall explore in \" On the Spectrum Occupancy Perception of Cognitive Radio Terminals in Realistic Scenarios \" the perceived spectrum occupancy in different practical scenarios via empirical measurements. Nice to see that things work in practice. Cooperative Spectrum Sensing To finish with, just a list of the works presented in the session on cooperative spectrum sensing for cognitive radio networks: Sensor Fusion by Two-Layer Conflict Solving . Volker Lohweg, Uwe Mönks. Approach to data fusion which provides a stable conflict scenario handling, extendable to fuzzy classification. On Multi-Step Sensor Scheduling via Convex Optimization. Marco Huber. Two efficient multi-step sensor scheduling approaches are proposed in this paper for optimization over long time horizons. Bayesian Joint Recovery of Correlated Signals in Distributed Compressed Sensing . Pablo Viñuelas-Peris and Antonio Artés-Rodríguez. Distributed Compressed Sensing (DCS) of sparsely correlated signals. A Robust Approach for Optimization of The Measurement Matrix in Compressed Sensing Vahid Abolghasemi, Delaram Jarchi and Saeid Sanei. Optimized matrices can improve the quality of reconstruction and satisfy the conditions for efficient sampling. A novel adaptive algorithm for diffusion networks using projections onto hyperslabs . Symeon Chouvardas, Konstantinos Slavakis and Sergios Theodoridis. A new diffusion based algorithm to implement cooperation among neighboring nodes and the corresponding analysis. Node Localization and Tracking Using Distance and Acceleration Measurements . Benjamin R. Hamilton, Xiaoli Ma, Robert John Baxley and Brett Walkenhorst. Algorithm to combine acceleration measurements with RSS readings to achieve accurate localization of a distributed sensor network. While the CIP is just a small workshop compared to the main conferences on signal processing, we have seen that the CIP 2010 proceedings include very trendy papers."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/QptgZxQF7Xs/spectral-sensing-at-cip-2010.html", "bloglinks": {}, "links": {"http://www.isip40.it/": 1, "http://www.eurecom.fr/": 1, "http://www.unipi.it/": 1, "http://spectralholes.blogspot.com/": 2, "http://www.gonzalo-vazquez-vilar.eu/": 1, "http://liu.diva-portal.org/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["The final 802.16h IEEE Standard was recently published [802.16h] . This extension aims for license-exempt operation of 802.16 networks, that is, [802.16h] defines a set of cognitive radio capabilities for Wimax networks . \n \nThe proposed global framework is divided in two separated profiles. The first one provides uncoordinated coexistence mechanisms (WirelessMAN-UCP), i.e., without requiring much interaction among the different systems and hence adequate for heterogeneous systems, while the second provides coordinated coexistence mechanisms (WirelessMAN-CX), which addresses the required coordination of neighboring systems in order to reduce the interference generated to each other. \n Uncoordinated coexistence mechanism In an real scenario a Wimax network may coexist with licensed users (denoted in the amendment as specific spectrum users) and other unlicensed users (denoted as non specific spectrum users) sharing the same frequency band. In such case the interference that the Wimax system may cause to each of the users can be different. [802.16h] defines three possible levels of interference: \n Acceptable interference: This level of interference does not cause degradation in the receiver performance for a given choice of modulation and/or coding. This interference is admissible for both licensed and unlicensed users. \n Harmful interference: Strong interference that decreases the link performance in terms of modulation/coding. While this interference must be avoided in licensed links, some amount of communication is still possible and thus could be acceptable for unlicensed users. \n Destructive interference: The receiver is not capable of decoding the received signal for any available modulation at the transmitter. It must be avoided. \n \nIn order to achieve these acceptable interference levels, both to licensed users and unlicensed users, the standard provides a set of mechanisms. These include: \n Testing channels for other users. \n Discontinuing operations after detecting channel activity. \n Detecting other users. \n Scheduling for channel testing. \n Requesting and reporting measurements by different nodes. \n Selecting and advertising a new channel. \n \nWhile all these procedures are described in detail in the standard, the timing and threshold parameters used are left open and must be specified by each regulatory administration. In the case of unlicensed users the proposed procedures are still valid with minor variations. For example, instead of performing a search for channels free of licensed users, the cognitive network looks for the best set of channels for operation either when certain unlicensed users are present. \n \nThe standard [802.16h] , in the uncoordinated profile, permits distributed architectures for the radio resource management within the network formed by one 802.16 base station (BS) and its associated subordinated nodes. Each BS has a Distributed Radio Resource Management entity to execute the spectrum sharing policies of 802.16h and to build up a database for sharing information related to actual and intended future usage of radio spectrum. This database can be recovered from a master entity with the required information or from different devices (e.g. using the GPS, IP address, operator information, radio signature scheduling info...). \n \nIn order to avoid the regulation infringement the different interferers must be identified by their radio signature, which can be a short preamble, peak power, relative spectral density... Every transmitter will send the radio signature \nduring an interference-free slot. The time position of this slot (frame_number , sub-frame, time-shift) will be used for identification. \n \nOnce the environmental data is available the Radio Resource Management entity performs a real-time, adaptive scheduling, which can be done in terms of channel or even interference free regions within a MAC frame. \n Coordinated coexistence mechanism When multiple secondary networks coexist in the same region, they can collaborate in order to coordinate their transmissions and build a neighbor relationship. In the standard [802.16h] the following three basic mechanisms for achieving coexistence are provided: \n MAC Frame Synchronization, including Tx and Rx intervals, for separating transmissions and enabling operation in synchronized zones. \n Dynamic Channel Selection (DCS) and Adaptive Channel Selection (ACS) for finding a less interfered or less used frequency (similar to the uncoordinated case). \n Separation of the remaining interference in the time domain, by using a Coexistence Frame, coordinated scheduling, and a fairness approach, thus allowing the usage of a frequency channel by more than one system. \n \nNote the high degree of awareness and cooperation required for implementing these mechanisms. To this end the standard defines a Coexistence Control Channel based on a series of globally synchronized time-slots and used for inter-network coordination. \n \nIn this post I tried to summarize the main capabilities supported by the IEEE 802-16h amendment. In my opinion this standard on the one hand address the FCC rules for unlicensed access to unused television spectrum and on the other hand is flexible enough to allow inter system collaboration and future regulations, hence the title of the post: cognitive Wimax . \n \n \n [ 802.16h ] IEEE Standard for Local and metropolitan area networks Part 16. Air Interface for Broadband Wireless Access Systems Amendment 2: Improved Coexistence Mechanisms for License-Exempt Operation. IEEE Std 802.16h-2010 (Amendment to IEEE Std 802.16-2009). July 30 2010. doi: 10.1109/IEEESTD.2010.5538195"], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/F2cjpePXm5w/ieee-80216h-cognitive-wimax.html", "bloglinks": {}, "links": {"http://ieeexplore.ieee.org/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["As you have noticed I took a one month vacation of \"blog-posting\". Now I'm back and I'll try to keep posting regularly again. These days I was curious about the kind of jobs companies are offering related to cognitive radio . While there exist several research positions for PhD students and postdocs , there are not so many open positions from private companies. Academy is looking for a profile oriented to pure research: knowledge in stochastics, random graph theory, advanced signal processing, optimization... together with an important mathematical background and programming skills. Some of the topics the candidates will work on include: Information networks. Cross-layer optimization. Dynamic Spectrum Allocation Algorithms. Throughput analysis for complex wireless networks. Reconfigurable MAC-layer. Application of cognitive radio techniques to embedded networks. Development of Cognitive Engines. Network security. ... On the other hand, companies like Qualcomm , Motorola , Mitre Corporation , General Electric or Sabre Systems are looking for a more \"practical\" profile. Knowledgeable in digital signal processing, experienced in statistical detection and estimation techniques, familiar with PHY and MAC system-level design... tasks offered are for instance: Development and evaluation of spectrum management capabilities. Development of spectrum sensing techniques. Simulations based based on captured signals. Integration of complete wireless systems. Evaluation of Software Defined Radio (SDR) based technology. ... As we could expect, in the private world the work is much more product oriented than in the academy world, where the practical considerations of implementation and integration are put in a second place. However I find interesting that the profiles required in both industry and academy are somehow similar in terms knowledge and experience. To finish with, it was unexpected to me the number of openings related with the Department of Defense of the US. While I understand that cognitive radio is a technology with major military applications (reconfigurability, signal detection, adaptability to harsh environmental conditions...), I thought that all these capabilities were already implemented in the military field long time ago."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/oVeLlfOTZWg/cognitive-radio-jobs.html", "bloglinks": {}, "links": {"http://www.qualcomm.com/": 1, "http://www.motorola.com": 1, "http://www.mitre.org": 1, "http://www.sabresystems.com/": 1, "http://www.ge.com/": 1, "http://www.google.es/": 2}, "blogtitle": "Spectral Holes"}, {"content": ["Sometimes I wonder how research could be done before the Internet era. I can imagine how long it would take to get something published: after finished, the article had to be submitted by post to the associated editor, then to the reviewers, comments and responses back and forth, back and forth and so on. When the article is finally accepted it would take a couple of months before the research community had access to the printed journal. \n \nWhile the publishing time got drastically reduced with the invention of the email and electronic documents, it can still be considered slow compared to the current pace of the research. Since this may hinder the interaction between different groups working in the same topic, some researchers choose to submit an early (non peer-reviewed) electronic version of their work to e-print repositories, such as arXiv.org . \n \nIn this repository there exists no section dedicated exclusively to signal processing articles. Nevertheless, many of them are archived under the Information Theory (cs.IT) tag. If we search arXiv.org for \" cognitive radio \" we can find some related papers. \n \nPresented at CrownCom'10 last June, the paper \" Binary is Good: A Binary Inference Framework for Primary User Separation in Cognitive Radio Networks \" by Huy Nguyen, Rong Zheng and Zhu Han poses the problem of distinguishing and characterizing primary users when we have a large number of collaborating secondary users. The observations by secondary users are modeled as boolean OR mixtures of underlying binary vectors. I had not seen before this approach, kind of \"binary processing\". \n \nIn the paper \" Spectrum Sensing in Cooperative Cognitive Radio Networks with Partial CSI \" Chong Han, Ido Nevat, and Jinhong Yuan develop an algorithm for cooperative spectrum sensing in a relay based cognitive radio network. To this end they use a bayesian expectation maximisation to approximate the solution of the non-convex problem resulting from a simplification of the likelihood. Beats the energy detector. From almost the same authors is the paper \" Blind Spectrum Sensing in Cognitive Radio over Fading Channels and Frequency Offsets \", which studies the effect of frequency offsets due to oscillator mismatch and Doppler effect. A novel approach to approximate the Likelihood Ratio Test (LRT) using a single point estimate using a low complexity Adaptive Notch Filter (ANF). \n \nOther papers present the key word compressive in their title, such as \" Compressive Wideband Spectrum Sensing for Fixed Frequency Spectrum Allocation \" and \" Robust Compressive Wideband Spectrum Sensing with Sampling Distortion \" by Yipeng Liu and Qun Wan. These papers attempt to use compressive sensing techniques to wideband spectrum reconstruction. \n \nHowever, I want to finish this post with two of Yonina Eldar's papers about the modulated converter entitled \" Xampling \", which made me discover arXiv. \n \nP.S. Congratulations Spain!"], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/23V8diu-_H4/cognitive-radio-in-arxivorg.html", "bloglinks": {}, "links": {"http://arxiv.org/": 8, "http://www.fifa.com/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["Recently Dr. Sudharman K. Jayaweera from the University of New Mexico visited the University of Vigo to present a short course on Cognitive Radio and Dynamic Spectrum Sharing. One of his introductory slides tried to deepen into the definition of Cognitive Radio , that results to be different depending on which area people are working on. \n \nFor example, by looking at the landmark paper by Joseph Mitola III we realize that his view stresses the reasoning capabilities of the network. This particular definition was taken mainly by the Computer Science (CS) community. \n \n  \nJayaweera's slide summarizes the definitions of Cognitive Radio used by different research communities: \n Hardware community : Cognitive Radio (CR) is essentially an extension of software defined radio (SDR). \n PHY-layer researchers : Cognitive Radio is synonymous with dynamic spectrum sharing (DSS), that is, just a medium access paradigm. \n Computer Science view : for computer and IT personell a device/system with machine learning capabilities. \n Networking community : a device that performs cross-layer optimizations. \n Information theorists : CR reduces to an interference channel with side information. \n \nThat is, while the Cognitive Radio paradigm may include all these concepts each area completely identify CR with their particular interests. It is not clear to me how the definition will evolve as CR becomes a mature technology or which are the capabilities a CR node will include. Probably, as Jayaweera points out, a CR system will include a combination of all mentioned capabilities (and maybe even more). \n \n Credit: The picture on the top is a view of the Sedona National Park through a Sierpinski Tetrahedra. It is part of the photographic Math-Art essays \"of a Fractal Nature\" by Gayla Chandler."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/_r3_iA1Ye30/what-is-cognitive-radio-different-views.html", "bloglinks": {}, "links": {"http://www.asu.edu/": 1, "http://spectralholes.blogspot.com/": 1, "http://blog.gonzalo-vazquez-vilar.eu/": 1, "http://www.unm.edu/": 2, "http://www.uvigo.es/": 1}, "blogtitle": "Spectral Holes"}, {"content": ["A group of students of the ECE Illinois won the 2010 Qualcomm Cognitive Radio Contest. While the 3rd Smart Radio Challenge consisted in developing an integral framework for detection and tracking of different radios on an emergency scenario, the 2010 Qualcomm Cognitive Radio Competition required students to develop and implement algorithms that detect wireless microphone signals within a spectrum band . \n \nWhile detecting digital television signals using the ATSC (American standard for digital television broadcasting) is not a big deal (given their embedded pilot tones), detecting 200 KHz wide wireless microphone signals with the detection performance required by the FCC proposal becomes a challenge. Qualcomm provided the different teams with training data , consisting on both signal sets with a wideband of 6 MHz and information on the frequencies where microphone signals were located. Contestants had to use this data to find a fitting model for the microphone signals and develop algorithms to detect them. The algorithm was judged based on its performance, novelty and implementation complexity. \n \nThe approaches followed by the 14 participating teams were fairly different. For example, the ECE Virginia Tech team : \n \"The students developed a fairly robust solution. They determined a baseline noise correlation matrix from a data set with no wireless microphone signals. To see if a signal is present in a new environment, they compare the new correlation matrix with the baseline matrix using singular value decomposition. If their algorithm determines there is a signal, it calculates the center frequency from the measured auto correlation of the signal.\" \n The winning team (ECE Illinois) , advised by V. V. Veeravalli , commented that the key problem was learning to distinguish wireless microphone signals from narrowband interference caused by other electrical devices. They addressed this problem by characterizing the unique features of this narrowband interference. \n \nCongratulations to the winners! \n \n Edit: In the CRT blog appears a link (that I missed) to a presentation by Stephen J. Shellhammer about this contest. Since it includes some technical details I decided to include it here ."], "link": "http://feedproxy.google.com/~r/SpectralHoles/~3/OFACzg31z5A/2010-qualcomm-cognitive-radio.html", "bloglinks": {}, "links": {"http://crtwireless.com/blog": 1, "http://spectralholes.blogspot.com/": 2, "http://www.illinois.edu/": 3, "http://www.vt.edu/": 1, "http://www.ieee-ctw.org/": 2}, "blogtitle": "Spectral Holes"}]