[{"blogurl": "http://www.statschat.org.nz\n", "blogroll": ["http://thestatsblog.wordpress.com"], "title": "Stats Chat"}, {"content": ["Despite all the media coverage of Hurricane Sandy, I found it hard to get a sense of the scale of the storm and the destruction it caused – there’s plenty of noise, but hard to find the signals. A few sources of information I’ve found useful are: A map in yesterday’s NZ Herald giving useful [...]"], "link": "http://feedproxy.google.com/~r/StatsChat/~3/swxklYCz2Eg/", "bloglinks": {}, "links": {}, "blogtitle": "Stats Chat"}, {"content": ["According to Stuff, a Japanese research study has found that sugary drinks cause strokes. In women, not men (they found a weak association in the opposite direction in men).  And only strokes, not heart disease. And when they say “sugary”, this isn’t based on the sugar content, since 100% fruit juices were excluded.   The [...]"], "link": "http://feedproxy.google.com/~r/StatsChat/~3/oV6_87uRBEQ/", "bloglinks": {}, "links": {}, "blogtitle": "Stats Chat"}, {"content": ["On Ezra Klein’s blog at the Washington Post, Dylan Matthews has published one of the least convincing scary climate change graphs I’ve even seen.  The graph purports to show that weather fatalities are increasing in the USA, and this is  attributed to climate change. The most obvious feature of the graph is the decrease in [...]"], "link": "http://feedproxy.google.com/~r/StatsChat/~3/FKGD5HuZ3aw/", "bloglinks": {}, "links": {}, "blogtitle": "Stats Chat"}, {"content": ["The Guardian has a map (also with animated thingies) of all the hurricanes since 1851. d One of the most dramatic features is the semicircle of hurricanes in the Southern Hemisphere.  That’s because the ocean isn’t warm enough in the other half: see this graph from NOAA Since the oceans are getting warmer, you might [...]"], "link": "http://feedproxy.google.com/~r/StatsChat/~3/hVkANZz55d8/", "bloglinks": {}, "links": {}, "blogtitle": "Stats Chat"}, {"content": ["After teaching an online course “Computing for Data Analysis” to 50,000 people through Coursera, Roger Peng has decided to do it all again on his blog next month. Think of it as an Advent calendar for aspiring DIY statisticians."], "link": "http://feedproxy.google.com/~r/StatsChat/~3/8AAtapmqQHc/", "bloglinks": {}, "links": {}, "blogtitle": "Stats Chat"}, {"content": ["A list of 20 from NetMagazine, via BetterPosters. Yes, I did check that R was on the list before passing it on.  "], "link": "http://feedproxy.google.com/~r/StatsChat/~3/FP_3ENqNRRM/", "bloglinks": {}, "links": {}, "blogtitle": "Stats Chat"}, {"content": ["The Herald is enthusing about the new worlds of chocolate, and the boom in consumption in various parts of the world. Japan aside, chocolate sales are also growing 30 per cent year on year in China, while in India – even though one in two Indians have never tasted chocolate – growth is 20 per [...]"], "link": "http://feedproxy.google.com/~r/StatsChat/~3/_hLsnyjrJuw/", "bloglinks": {}, "links": {}, "blogtitle": "Stats Chat"}, {"content": ["That’s Britomart and Newmarket. I just thought it was an interesting statistic, in the Herald’s coverage of the new “integrated” ticketing system (it works on trains, and also on trains.)"], "link": "http://feedproxy.google.com/~r/StatsChat/~3/8R_1lql3Ca4/", "bloglinks": {}, "links": {}, "blogtitle": "Stats Chat"}, {"content": ["Stuff, this time: Auckland teenagers had the highest number of convictions for drink-driving, with 1553 in the past two years. Christchurch teenagers weren’t far behind, with 1383, while 793 Hamilton teenagers were convicted and 728 Wellingtonians. That’s out of a national total of about 9700 per two years (so this could also have been in [...]"], "link": "http://feedproxy.google.com/~r/StatsChat/~3/7LLnaTOxn88/", "bloglinks": {}, "links": {}, "blogtitle": "Stats Chat"}, {"content": ["Each week, we would like to invite readers of Stats Chat to submit nominations for our Stat of the Week competition and be in with the chance to win an iTunes voucher. Here’s how it works: Anyone may add a comment on this post to nominate their Stat of the Week candidate before midday Friday [...]"], "link": "http://feedproxy.google.com/~r/StatsChat/~3/KgU8lX7zySw/", "bloglinks": {}, "links": {}, "blogtitle": "Stats Chat"}]