[{"blogurl": "http://statisfaction.wordpress.com\n", "blogroll": [], "title": "Statisfaction"}, {"content": ["Hello, \n After this long and idle summer, here’s a little update of my research life™. \n After having completed my PhD ( Xi’an and Robin kindly blogged about it there and there ) in France, I am now a Research Fellow at the National University of Singapore (NUS), in the Department of Statistics and Applied Probability . I’m going to work mostly with Ajay Jasra on Sequential Monte Carlo theory and methodology. NUS seems like the perfect place to work long hours: there’s space, whiteboards, printers, air conditioning, food courts and even a gym. There’s also a bunch of very prestigious statisticians here but I still don’t know how much interaction I can expect with them. I still plan to blog here about conference, papers, software, etc. \n It seems like a good time to give my final impressions about getting a PhD in France, before I forget. All in all, I can’t complain about my personal case: it was a wonderful time for me, mostly thanks to Xi’an . \n \n However my case is pretty rare, and many other PhD students I’ve met often were feeling stressed about their job and sometimes thought about quitting (or did it). The main reasons seemed to be: \n \n the late discovery that the topic of the PhD is stupid / not fruitful / outdated; \n the development of personal hostility between the student and his/her advisor; \n the student realizes that he/she wants to have an easier life than what universities have to offer, either in terms of salary of in terms of working hours/holidays. \n \n It seems to me that points 1. and 2. are hard to predict and to avoid for undergrad students applying for PhD. The only thing to do is to get in touch with former PhD students of the targeted PhD advisor, if any. Also make sure that you’re applying for a place that hosts various talented and benevolent researchers, so that if your advisor turns out to be a dick difficult to deal with, you can rely on other people. Point 3. is avoidable by grabbing a minimum amount of information about academic careers, which are always kind of similar regardless of the field of research. Indeed I was once astonished to hear from a desperate PhD student that he thought getting a PhD was supposed to be easy. Why not investigating a bit before committing to a +3 years job? \n To be fair I think France is a pretty good place to do a PhD, because people have a lot of liberty in their research and not a lot of counterproductive pressure (compared to the US for instance). After the PhD, academic positions in France are not very attractive with a lot of teaching and not a lot of money (at least there’s still not a lot of pressure but that’s currently changing for the worse), which is why a lot of young French academics move abroad after the PhD… like me! \n Next time I’ll blog about statistics, for a change!"], "link": "http://statisfaction.wordpress.com/2012/10/04/new-job-same-blog/", "bloglinks": {}, "links": {"http://robinryder.wordpress.com/": 1, "http://xianblog.wordpress.com/": 3, "http://feeds.wordpress.com/": 1, "http://www.edu.sg/": 2}, "blogtitle": "Statisfaction"}, {"content": ["Hello, \n This blog is not dead! And it’s gonna get more active soon. \n These last few days, a workshop on Sequential Monte Carlo methods was held in the University of Warwick ( link to the webpage ). It was a very exciting meeting, efficiently organised by Arnaud Doucet , Adam Johansen , Anthony Lee and Murray Pollock and hosted by CRiSM . For those who couldn’t attend, here’s a little summary of my experience (or more exactly, just a bunch of links). Since SMC methods are at the core of my research, I was logically interested by all the talks (which is exceptional for 3 days of workshop, filled with 30 talks!). It was probably a good time for a workshop on SMC, since there’s a lot of recent activity in the field. My impression is that this renewed interest is mainly due to: \n \n the Particle MCMC framework, which inspired other algorithms (like our SMC^2 that Nicolas Chopin presented, or the Particle Gibbs with ancestral sampling ), renewed interest in the normalising constant estimate in particle filters, and more generally made it possible to estimate parameters in a broad class of time series models with plenty of diverse applications ( probably more than 200 citations already ); \n theoretical advances, with recent papers from Pierre Del Moral , Nick Whiteley , Ajay Jasra , and many others; \n a new class of exact algorithms for simulating continuous time processes without any discretisation error, based on sequential importance sampling, in a fascinating work by Paul Fearnhead , Krzysztof Łatuszyński and colleagues. \n parallel computing, including the recent GPU trend, which makes SMC all the more attractive compared to purely iterative algorithms like MCMC. \n \n The last point was illustrated at this workshop by a recent work from Alexandre Bouchard-Côté and colleagues called “Entangled Monte Carlo”, as well as by my own presentation: I talked about a new resampling scheme that avoids global interactions between all the particles, and resorts only to multiple pair-wise interactions. This is an on-going work with Pierre Del Moral , Anthony Lee, Lawrence Murray and Gareth Peters , that I might talk about again with more details in the future! \n Cheers!"], "link": "http://statisfaction.wordpress.com/2012/09/21/recent-advances-in-sequential-monte-carlo-warwick-2012/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www2.ac.uk/": 7, "http://www.indii.org/": 1, "http://scholar.google.com/": 1, "http://www.ac.uk/": 4, "http://arxiv.org/": 5, "http://www.u-bordeaux1.fr/": 1, "http://www.crest.fr/": 1, "http://nips.cc/": 1, "http://www.ubc.ca/": 1}, "blogtitle": "Statisfaction"}, {"content": ["Hello, \n Following my previous post on e-readers , where I was pretty enthusiastic about it, I feel compelled to tell the sad ending of this story. My device broke during ISBA 2012 , without anything particular happening to it, as far as I know. I can’t believe that a ISBA participant kicked my device like a madman without me seeing it (maybe because he thought my talk wasn’t good enough?), although I can’t be sure. Anyways the screen is broken as you can see on the picture. \n Then  the constructor ( http://www.onyxboox.com/ ) and the vendor ( http://ereader-store.de/ ) both won’t replace the screen even though there was supposed to be a 1 year warranty. The reason is that they believe the screen cannot be broken unless the user really did not take care of it. \n My experience is that a normal use of the thing can kill it, so I would strongly advise against buying one of those, unless you’re willing to pay a few hundred dollars every six months to fix it. I’d wait a few years and would go for the safer, bigger companies. \nToo bad! \n Pierre"], "link": "http://statisfaction.wordpress.com/2012/07/17/e-ink-readers-are-pissing-me-off/", "bloglinks": {}, "links": {"http://www2.ac.jp/": 1, "http://feeds.wordpress.com/": 1, "http://statisfaction.wordpress.com/": 1, "http://ereader-store.de/": 1, "http://www.onyxboox.com/": 1}, "blogtitle": "Statisfaction"}, {"content": ["Hi, \nour group of R users from  INSEE , aka FL R, meets monthly in Paris. Next meeting is on Wed 13 (tomorrow), 1-2 pm, room 539 (an ID is needed to come in,   map  to access INSEE  R), about ggplot2 and parallel computing. Since the first meeting in February, presentations have included hot topics like webscrapping, C in R , RStudio , SQLite databases or cartography  (most of them in French). See you there!"], "link": "http://statisfaction.wordpress.com/2012/06/12/next-r-meeting-in-paris-insee-ggplot2-and-parallel-computing/", "bloglinks": {}, "links": {"http://www.insee.fr/": 2, "http://www.slideshare.net/": 1, "http://feeds.wordpress.com/": 1, "http://fltaur.wordpress.com/": 2, "http://statisfaction.wordpress.com/": 1}, "blogtitle": "Statisfaction"}, {"content": ["Hi, \n for the next GTB meeting at Crest, 3rd May, I will present Peter Orbanz ‘ work on Projective limit random probabilities on Polish spaces . It will follow my previous presentation about Bayesian nonparametrics on the Dirichlet process . \n The article provides a means of constructing any arbitrary prior distribution on the set of probability measures by working on its finite-dimensional marginals. The vanilla example is the Dirichlet process, which is characterized by its Dirichlet distribution marginals on any finite partition of the space (other examples are the Normalized Inverse Gaussian Process and the Pòlya Tree). The figure above illustrates the projective property of the marginals. \n Peter will speak at ISBA 2012 Kyoto session : On the uses of random probabilities in Bayesian inference , along with Ramses Mena and Antonio Lijoi. I’ll write more about that later on!"], "link": "http://statisfaction.wordpress.com/2012/04/24/priors-on-probability-measures/", "bloglinks": {}, "links": {"http://arxiv.org/": 1, "http://statisfaction.wordpress.com/": 2, "http://feeds.wordpress.com/": 1, "http://mlg.ac.uk/": 1, "http://www2.ac.jp/": 2}, "blogtitle": "Statisfaction"}, {"content": ["Hey, \n Last week there was a workshop on Confronting Intractability in Statistical Inference , organised by the University of Bristol and the SuSTain group. It was hosted at the Goldney Hall (picture above). It turned out to be a succession of fascinating talks about the recent developments and the future of statistical methods used in very challenging inference problems. What I appreciated above all was the ambition of many talks, and the generosity of the speakers in giving many ideas to the audience. \n Among the things I’ve learned there, the following were the most ambitious in my opinion. \n \n \n Scott Schmidler from Duke gave an introductory presentation of how complexity is defined and analysed in computer science, classifying the problems in terms of the time needed to solve them in the worst case (polynomial or exponential?). The main message there was: don’t spend too much time trying to solve a problem that computer scientists already classified as “impossible”, and use some tools from computer science to analyse the difficulty of statistical inference problems. \n In another analogy, Christian L. Müller from ETH Zürich gave a talk comparing recent optimization methods (like variable-metric algorithms) with adaptive MCMC; they’re similar methods even though they’re expressed in different terms, and the efficiency assessments are necessarily quite different (sampling from a distribution is not exactly like finding the maximum of its probability density function). In this analogy, he proposed to think about benchmark test suites for sampling problems, just as there are test suites for optimization problems. That could be very nice, since many articles already used very similar problems, e.g. mixture models, banana-shape distributions, etc. as toy examples illustrating multi-modality and ridges in the target distribution. \n Sebastian Reich from Universität Potsdam gave a talk about the links between sampling problems and optimal transport in measure theory, which are related to Bayesian optimal maps and implicit particle filters . It’s mainly about alternatives to standard Monte Carlo (e.g. importance sampling) when “moving” a sample from distribution f_1 to distribution f_2, relying on deeper arguments connecting two closely-related probability distributions, but still at an experimental level in practice from what I understood. Probably something to keep a careful eye on! \n Cédric Ginestet from King’s College London presented a poster about Fréchet means , and his results on the topic (see here and here for his articles). The idea is that on a general metric state space some classic results in statistics can be extended (for instance to test the difference between two means ); it sounds purely theoretical, but it’s actually driven by many applications: your data can not only consist in numbers but also in images, trees, networks (for instance the data describing patient in a hospital). Then how to define a mean? To what does the mean converge when the sample size grows? How to test the difference between two groups? \n Geoff Nicholls from the University of Oxford gave a very inspiring talk on variations of the Metropolis–Hastings when the target density function cannot be evaluated point-wise. In this setting, the pseudo-marginal approach applies when one can get unbiased estimates of the density; Nicholls deals with the case where one can get (essentially) normally distributed estimates of the log density (instead of the density itself), relying on recent articles in the physics literature. This could lead to massive improvements in applications where the data set is very large and log likelihood can be written as a sum of independent terms (such as for many regression models). Really looking forward to see the forthcoming paper on this! \n \n I can’t get into too much details since it’s mostly unpublished work, but I just wanted to give an overview for those who couldn’t attend the workshop. \n Pierre"], "link": "http://statisfaction.wordpress.com/2012/04/24/awesome-bristol/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.duke.edu/": 1, "http://www.pnas.org/": 1, "http://www.ac.uk/": 5, "http://arxiv.org/": 4, "http://jcp.aip.org/": 1, "http://people.ethz.ch/": 1, "http://en.wikipedia.org/": 2, "http://users.uni-potsdam.de/": 1}, "blogtitle": "Statisfaction"}, {"content": ["In an invited contribution to the last ISBA Bulletin , Larry Wasserman discusses the  “almost 350 years old” peer review system ( paper ). Have a look on it, it’s quite thought provoking! \n We should think about our field like a marketplace of ideas. Everyone should be free to put their ideas out there. There is no need for referees. Good ideas will get recognized, used and cited. Bad ideas will be ignored. This process will be imperfect. But is it really better to have two or three people decide the fate of your work? \n A world where you put your work on arXiv or on your web page, where you save so much time, isn’t it tempting?"], "link": "http://statisfaction.wordpress.com/2012/04/10/a-world-without-referees/", "bloglinks": {}, "links": {"http://www.cmu.edu/": 1, "http://arxiv.org/": 1, "http://feeds.wordpress.com/": 1, "http://statisfaction.wordpress.com/": 1, "http://bayesian.org/": 1}, "blogtitle": "Statisfaction"}, {"content": ["Hey, \nLast week I attended  Rochebrune workshop for the second time. The genius organizers’ idea (Liliane Bel and Eric Parent from AgroParisTech, Jean-Jacques Borreux from Liège University) is to mix ski, stats and spirits (mostly Genepi and Chartreuse) around a remote alpine chalet on top of Megève ski resort. \n Most of the attendees are (young) Bayesians working in applied fields, ranging from biology, ecology and epidemiology, to meteorology and climatology. We had great talks about fishes, trees, birds (Joël’s busard cendré), drugs and avalanches. More methodological talks dealt with extremes, Bayesian model averaging, and simulations: variational approximations, INLA, ABC, and MCMC in general. We had a tutorial about JAGS and WinBugs/OpenBugs as well (and how to interface them with R using rjags and R2WinBUGS ). I presented my work about Multidimensional covariate dependent Dirichlet processes  (all presentations here ). \n In addition to the 10 talks per day, a sacrosanct 5-hour skiing slot was reserved in the afternoon, with lessons from crazy Mégevan instructors. They must be really good: Pierre, don’t be afraid, I jumped and felt significantly less than two years ago. Have a Chartreuse , cheers!"], "link": "http://statisfaction.wordpress.com/2012/04/09/rochebrune-workshop-2012/", "bloglinks": {}, "links": {"http://www.agroparistech.fr/": 3, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1, "http://cran.r-project.org/": 2}, "blogtitle": "Statisfaction"}, {"content": ["Hey hey, \n Here I’m going to advertise a project of Eva Vivalt from the World Bank, who wants to write a book on meta-analysis of aid programs. \n The project is hosted there: \n http://www.kickstarter.com/projects/972584134/what-works-in-development-10-meta-analyses-of-aid \n It’s on kickstarter.com , which means that if (and only if) enough people pledge to give money to the project (here at least 10,000 US$), then Eva Vivalt and her colleagues will write the book and print it and everything. It’s an innovative model, which reminds me of MyMajorCompany . \n More about the project itself. Meta-analysis is the art of combining multiple, heterogeneous studies and aggregate them to get an overall answer to a given problem. It’s especially popular in epidemiology: suppose that a lab has run a clinical trial on many people and that another lab has done a similar study in a different country, how does one combine both studies to get more precise results, while still taking into account the specificity of each study? Which study is contributing the most to the results? What differences are there between the two studied populations?  Meta-analysis allows to answer such questions. Statistically speaking it usually amounts to some kind of hierarchical model , for instance a mixed model . \n Eva’s project is about using this statistical machinery to assess the effectiveness of aid programs. It seems meaningful to me, because there might be many studies studying each particular aid program, but for the good Samaritan the problem is really about choosing who to give money to. Meta-analysis seems able to help him out in this dilemma. Why this research project is hosted on the Internet and is not funded by a large public research agency, I’m not sure but the project description page answers that to some extent. If you have any opinion on this funding system leave a comment! \n They have to collect 10,000USD during the next 27 days, so if you readers can talk about it to your data-friendly friends, it’d help them for sure. Good luck to them!"], "link": "http://statisfaction.wordpress.com/2012/04/02/meta-analysis-of-aid-programs/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.evavivalt.com/": 2, "http://www.co.uk/": 1, "http://en.wikipedia.org/": 3, "http://www.kickstarter.com/": 3}, "blogtitle": "Statisfaction"}, {"content": ["Hey, \n A few weeks ago I got fed up with printing, carrying around, losing, and reprinting papers, and decided to go for a 10″ e-reader .  I like to be able to write annotations on papers, so I went for one with a stylus. \n I’m enthusiastic about it so far: you can read pretty well, 12 or 13 inches would have been better but 10 inches is big enough to read scientific articles. The device automatically removes the margins so you can have an entire page on the screen, so there’s no need to scroll all the time (at least for most papers). You can even click on the hyper links with the stylus, search in the text, put bookmarks etc, so there’s no particular issues when handling long documents like books. The only disappointing feature is the web browser, that I find quite close to unusable, except for briefly connecting to arXiv to see the most recent entries . \n One thing that you don’t get with an e-reader is the satisfaction of seeing your papers getting old, torn, coffee stained etc. If you’re really nostalgic you can still add coffee stains on your documents using this LaTeX package . \n On a more geeky note, the device I chose runs linux and the manufacturer seems to support open source software; and hence there is a SDK to add more applications. The device seems even capable of running python ! I’m eager to see what’ll come out of this. \n Pierre"], "link": "http://statisfaction.wordpress.com/2012/03/29/e-ink/", "bloglinks": {}, "links": {"https://github.com/": 1, "http://arxiv.org/": 1, "http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1, "http://hanno-rein.de/": 1, "http://ereader-store.de/": 1, "http://www.mobileread.com/": 1}, "blogtitle": "Statisfaction"}]