[{"blogurl": "http://substratumseries.com\n", "blogroll": [], "title": "Substratum Series"}, {"content": ["Real intellectual power comes from being able to access the diversity of human intelligence that is asking radically different questions that an individual could never have thought of. It’s people recognizing different things and interpreting them that lets us in that way triangulate on an understanding. \n   When do you first remember thinking of yourself as a designer/artist? How did you end up doing what you do today? \n\n   I’ve never been comfortable with either term. I’m not really interested in the problems or role of an artist, so I’ve come up with using xDesign – experimental design –, which is really what I’m interested in: I explore technologies for their opportunities for social and environmental change. There are some really interesting things about an artist, however. Particularly in a techno-scientific context, no one trusts an artist, no one believes an artist. Artists have no authority, artists don’t get paid. So when it comes to complicated technical, political, social or environmental issues, the artist then stands in for the everyman. Not having to set expectations about expertise I think is the greatest advantage of saying “artist.” And also accountability: artists are not doing it for a job, which very much differs from designers in that designers do it for money. They call that prostitution, right? \n\n   Designers don’t form the problem; someone else forms the problems for them. Designers the little problem solvers and artists that no one will pay to do anything … As an artist, you really have direct accountability for why you’re doing something and do the problem forming and the problem solving. Working as an academic it’s a similar thing: it’s your authorship, you’re responsible for how good the data is, how the data is analyzed, what you do with it, how you make sense of it. \n\n   I went to engineering school because I thought, “Ooh, I’ll get to build stuff.” That’s what you do in engineering school. You have problem sets and you make algorithms and you put yourself ahead with a two-by-four. As opposed to really thinking “This is an important and interesting problem and it’s worth me spending time working on and thinking through.” No one asked me to do that. The role of what I call xDesign is very much in the tradition of experimental film, which is not about formulaic Hollywood success designed to make money and pay a lot of people, but is about finding ways to explore and understand and think through all kinds of material. \n\n   What I do is socio-ecological systems design. That’s what I care about, that’s what I think about. I’m not really interested in art for art’s sake, but I do subscribe to this idea that life is art, art is life. So I’ve done a lot of work in the tradition of institutional critique to reframe and give a framework for what it is I do. In order to avoid preconceptions about what an artist or designer or engineer or technologist is, I’ve developed this framework called the Environmental Health Clinic, because everyone agrees about health being a good thing. There are a lot of people who are anti-development, pro-development. People who are are anti-free market, pro-free market, anti-globalization, pro-globalization. All these issues really produce polarizations, but there’s no one anti-health. There’s no one who says “Let’s make sure everyone’s collective environmental and human health gets worse.” That’s just not a viable position. It’s a way of creating a shared goal that we can agree on because you’ve got to have some form of creating consensus. Everything I do has its own particular rationale, but also must improve environmental health, as the environmental commons is fundamental to what we’re about. And I think technology is part of the environmental commons. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   I’m trying to produce spectacles in order to create a shared public memory of a possible future. I investigate, I test, I figure out the social and environmental opportunities for change that new technologies provide. That’s a very open ended problem because technology is always moving, always providing new opportunities. \n\n   What really keeps me going is pleasure and wonder. My foray into hacking food and food systems that I’ve been doing recently is because it’s a participatory medium: we all eat, and we often do so driven by pleasure and wonder. My foray into flight and flight systems is because I’m fascinated with the magic of flight and I think that we all know that wonder. I’m fascinated by complex technical systems and find pleasure in figuring out how to use these technical opportunities for finding some interesting and specific and wonderful opportunity. \n\n   I think what has driven the last thirty years of environmentalism is strategically exhausted: the idea of suing deep pockets, suing the big polluters. The real fear of what we’re doing creates an urgency, but it also creates a sense of hopelessness and despair. What I’m very interested in – and what to me is pleasure, wonder, fascination –, is the irreducible complexity of natural systems. That’s what drives me. \n   What do you think is your most important skill, and why? \n\n   I think it’s query driven. All I do is ask questions: “How can I use this to do this?” or “How can we improve water quality?” Asking good questions is a fundamental skill and I would argue that it’s the way to cut through a lot of disciplinary divides. Intellectuals I admire have just asked generally interesting questions. It’s something you develop over years and years and years and I’m hoping to move towards mastery of this skill to ask questions clearly and simply. \n   Tell us about the community you’re working in. \n\n   My effort is to define the Environmental Health Clinic framework as a way for anyone to come in as an inpatient and collaborate and co-produce a project, which might also be their own experiment. That’s a way to collaborate. \n\n   In the arts community it’s invaluable to work with curators and arts administrators who know how to facilitate and frame things so they are digestible. These arts producers are a creative and incredibly entrepreneurial community of people. They make things happen with one thousandth of the budget of corporate movers and shakers and with so little support and so many obstacles. That’s a really invaluable community to me in terms of sheer production skills. Business people get all this credit for being entrepreneurial, even though everything’s in their favor. They get paid huge salaries to do the obvious thing. Whereas arts producers often start with zero support, a great deal of skepticism, no funding and no teams – and they can have a cultural impact in that way. \n\n   Then the students who come in very much through the Environmental Health Clinic framework. And also my academic peers: I’ve known a lot of these people for twenty years and in a way that’s a long term community of practice. We have radically different practices but often similar questions and processes. \n   In what ways does working within a community influence your work? \n\n   I feel accountable to them. What’s different about working in an arts context compared to a science context is legibility issues. In technical and scientific communities you have to be legible to that specific community and there are formats, and ways to cite, and developed standards of evidence, and ways to look at things. I learn a lot from these peers in the arts world where you’re accountable to a public, which is much more amorphous. In an anonymous peer review you know who those people are because those communities are small and you know who everyone is. Whereas when you produce an exhibition for diverse people that’s a completely different legibility requirement. \n   What role does collaboration with others play for your projects? \n\n   It’s critical. I have this saying that credit must be widely shared, no matter what, but blame must be tightly focused. \n   What do you wish to achieve with your work? \n\n   Improvements in environmental health, improvements in biodiversity, engagement through wonder and pleasure and fascination. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   Constraints are enormous and trying to get anything done and trying to actually really change the condition of the world … enormous. With our work we introduce technical issues and by that basically scare most of the population away. As soon as you start talking about scientific or technical issues and ideas – and particularly how they are political –, it intimidates people and is very anti-participatory. Science tends to act as an authority, it’s “Scientists say it’s global change.” No one says, “Artists say that …” Science has an authority that tends to dissuade people from asking their own questions. \n\n   With my OneTrees project I wanted to understand a multi-parameter space with many people asking many interesting questions. “Why do the birds land in that tree, not that tree?” or “Why do these trees look different?” Real intellectual power comes from being able to access the diversity of human intelligence that is asking different questions that I could never have thought of, even though I designed the experiment. It’s people recognizing different things and interpreting them that gives us this robust understanding. It’s not, “I have comprehensive knowledge of how these trees are growing,” but that we can develop an understanding because we’re all asking radically different questions and in that way triangulate on an understanding. \n\n   It’s an anarchistic approach to knowledge production, which I feel is powerful. What prevents us from really accessing that intellectual power is authority. Most people don’t think they can make a truth claim or have authority. This whole idea that experiments are the realm of professional scientists requires that each one of us have a skeptical waiver to explore and understand independently and that’s a big constraint. \n   How has your work changed over the years? How did your goals change? \n\n   My work has radically transformed. I’ve always been interested in tangible and physical computing ideas, which is now called the Internet of Things. I did a very early piece called “Live Wire” to visualize network traffic. It basically plugged into the local area network and it just wiggled a string when there was data traffic. When there was more, it wiggled more, and when there was less, it wiggled a bit less. That was back in ’94, when the Worldwide Web was just around and Mosaic was the browser and no one understood what this Internet actually was. So to materialize that data was interesting and really important. \n\n   What I’ve moved from is the idea that understanding and representing data effectively is a good thing, I now care less about that. What I really care about now is how that informs action. \n\n   My first neuroscience work was on mapping the entire olfactory cortex of the immediate early gene expression in rats, which became a small part of the rat brain atlas. For the visualization I did for a Master’s degree in visualization I was looking at the temporal bone and the auditory cortex. I used data from cochlear implants and from histological slides of the same area to build complex 3-D models. I spent a year and a half on this and I thought, “Wow. This is really going to change things,” because it’s a very complex bone and the surgeons have to navigate it to put the cochlear implants in and the neuroscientists are really into the anatomical structure. I thought, “Okay, I can take this CT scan data and I can take this histological slides data and create a better understanding.” More is better, right? Wrong. \n\n   In my model, the neuroscientists were saying, “I’m glad she’s doing that,” but they would continue to look at their histological slides because they knew how to read that. And the surgeons would continue to look at their CT scans slice by slice because that’s how they develop their literacy. With the 3-D model they could cut and twirl and do all these cool things, which was nice, but was used mostly for one reason: to show to potential students and to journalists and to funders. It was shown to the naïve because it really looked cool and high tech – and yet it’s not what the experts really used. So, being able to visualize things in new and interesting ways was not built on the literacy traditions of that practice and their long term commitments to understanding things. \n\n   This is why my work has very much shifted into how we use the data. I think it’s necessary – but radically insufficient – to produce a visualization. It’s important how you then act on that knowledge and use the data and the visualization to validate your theories. The most useful metric I used to measure the success of a project was the appearance of Aaron’s Skipper. This butterfly is critically dependent on the sage grass that only grows in particular brackish water and I knew that if the animal volunteers to be there, then I’ve done a good job. All of the water quality measurements and real time monitoring gets integrated into the autonomous decision of this butterfly to be there. This is legible for everyone. I can show people water quality data and they couldn’t care less – even if it were a beautiful visualization. But to have a butterfly as a metric – or what I would call visualization – is much more believable than an EPA person saying, “The water quality’s good, we’ve done ecological restorations.” It’s the independence of that butterfly, it’s autonomy, it’s agency to say, “I’ll hang out here” that really validates what I’m trying to do. \n\n   That’s the kind of measures and representations that I’m looking for now. I’m not really interested in data literacy or even the politics of data anymore. I’m interested in fluency: being able to use the data to really act and change the world and to know that – even within this context of irreducibly complex socio-ecological systems – there’s always incomplete information. We can do something, we can make it good. Because if I know it’s good for the butterfly, it’s good for many other organisms and it’s good for you and it’s good for me – and environmental health is at stake. The capacity to find legible representations like that is really what has shifted in my work. And the belief that somehow an image by itself will lead to action, we know that’s just not true … We have all the information we need about global warming and it hasn’t led to much action. So I think it’s about changing who produces the evidence, how it’s represented, how it’s interpreted, where, why. It’s not just about beautiful visualizations, it’s about how that couples into producing viable, doable actions that can aggregate into real systems change. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   Structuring participation in social and environmental change is important to me. I don’t think there is one big problem, I think it’s a complex – irreducibly complex – set of many interrelated issues like how do we produce food or how do we use technologies. Therein we have some power to experiment with our own lifestyles, to figure out how we can structure participation and produce a desirable future. A desirable, biodiverse future. \n   Natalie Jeremijenko is an artist whose background includes studies in biochemistry, physics, neuroscience and precision engineering. With her projects she explores socio-technical change. She directs the xDesign Environmental Health Clinic to develop and prescribe locally optimized and often playful strategies to effect remediation of environmental systems. \n   \n The Environmental Health Clinic \n   Natalie on TED: The art of the eco-mindshift \n   OneTrees Project"], "link": "http://substratumseries.com/issues/collective_responsibility/natalie_jeremijenko", "bloglinks": {}, "links": {"http://www.environmentalhealthclinic.net/": 1, "http://www.ted.com/": 1, "http://www.nyu.edu/": 1}, "blogtitle": "Substratum Series"}, {"content": ["New York is such a specific, driven, heterogeneous world where people themselves are so different and so varied and diverse that it really constantly informs you how humble and how small any of our individual marks are – because nothing takes over in New York. No matter how big a project you’re doing, you’re never going to be that big.\n   \n   When do you first remember thinking of yourself as a designer/artist? How did you end up doing what you do today? \n\n   I always thought I wanted to be a doctor. But then – I was in my mid-twenties and had a day job designing museum exhibitions – the firm that I was working for sent me to live in Africa for two months to work with the scientists there to design an exhibition around biodiversity. The whole time I had been doing these classes to become a doctor and it wasn’t until the moment when I was actually in Africa – and I remember it totally clearly, I was in a little Cessna plane flying over the rainforest – that it occurred to me that it was a so much bigger opportunity to be able to explore all of this undiscovered country, both literally and figuratively, versus being a doctor, which is really important, but very procedural and very repetitive. \n\n   It really was that sense of undiscovered potential that made me stay and decide to quit any thoughts of medical school. But it was a big decision because I had not seen the sort of practical utility in being a designer and I was quite frustrated with it. It wasn’t until that moment that I thought that you can really do impactful work with design, and – more to the point – you can actually have all these incredible experiences while you’re doing it, which is really important to me. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   I’m excited for design in general and then I’m also excited for me personally, which is kind of two different things. I think design in general has a lot of potential – arguably the most potential it’s ever had because of all the impact the so called design thinking has on influencing business, or government, or commerce. That’s a phenomenal landscape of potential impact. \n\n   From my own little personal world within that, what’s really exciting is that we’re getting approached to think about all these problems we had never really considered before. We started doing these small storytelling experiences in theatres and museums and all of a sudden we’re being asked about policy, we’re being asked about architecture, we’re being asked about large scale archives and legacy experiences in cities and knowledge bases. It’s a really amazing experience to have started with something very small and specific and then to suddenly have that turn into really large, unfamiliar opportunities. \n   What do you think is your most important skill, and why? \n\n   I don’t know if it’s a skill per se – I think there are a couple –, but if I had to choose one, it would be the ability to synthesize in a creative way. Taking a lot of disparate opportunities that overlap simultaneously and finding the specific twist or the specific opportunity that’s going to be the most ambitious and crazy. It seems obvious to say, but a lot of people – in data visualization specifically – talk about “inside-out” and “looking at the data” and “being honest with the data”. And that’s really important. \n\n   On the other hand, for me as more of a story teller and as somebody who makes large or creative systems, a lot of it is the opposite. Given a specific condition, a space, a story, an audience, a budget or a timeline, it’s more like, “What’s the weirdest, craziest thing that we could do?” It’s a giant war for people’s attention and to make an actual honest impact you really need to think creatively and assertively. There’s a whole army of people in marketing and in advertising and that’s all they think about: how to dominate our attention for things that don’t deserve it. \n\n\t\t\t\t I mean, I love advertising. It’s so beautiful, it’s so gorgeous and so compelling and cool, but it’s just trying to sell you stuff at the bottom end of it. It’s really not – regardless of what many advertising agencies will tell you – at its base it’s not actually functional. It helps our economy and buying stuff helps our economy. So at the highest level it’s true, buying stuff does help. But just communicating, “Buy me, buy me, buy me,” is not a particularly relevant value. And yet the creative services industry is all centered around that and that’s literally their competition. So if you’re interested in social justice, or collective memory, or heritage, or any of these more enduring – and I would argue even more nourishing – values outside of commercialism, you have to fight. You have to know it’s a fight. \n   Tell us about the community you’re working in. \n\n   It’s depends on how you define it. Artistically or creatively it’s a mixture of architecture, design, and interaction design. It’s really important to be able to have those different contexts on a personal level, to know a lot of people who are doing interesting work, who you respect, and who you like, and who you share your work with. It’s important to have peers and potential collaborators, but mostly just peers who are on the same race as you are. \n\n   The other community is New York City. I’m in New York, a lot of our projects are in New York, and being situated within that community is really important because New York is such a specific, driven, heterogeneous world where people themselves are so different and so varied and diverse that it really constantly informs you how humble and how small any of our individual marks are – because nothing takes over in New York. No matter how big a project you’re doing, you’re never going to be that big. So both in terms of scale and in terms of how different the people are, it really reminds you all the time that you’re doing your small little thing within such a big context. \n   In what ways does working within a community influence your work? \n\n   In a lot of ways. When we build work, we often test it. We literally test it through Craigslist, where we just ask people – random strangers – to come to our studio. This way we have access to a very wide and divergent group of people who are looking at our work, which is critical because we build so much in public spaces. If we just tested it with our friends or if we held a party and just brought people who are like us, the chances are they would “get” our work too easily. But if we build these systems and test them on strangers who know nothing about digital systems, we’re a lot closer the general public. Those are the people who are going to go to our museums or our installations, so situating our practice in the midst of all of this crazy diversity is really important. \n   What role does collaboration with others play for your projects? \n\n   Collaboration is super critical for what we do because the jobs and the skill sets that are required for the work that we develop is much bigger than any individual could handle. Even artists like Olafur Eliasson have a studio. He has a group of people with diverse skills. It’s not just about the quantity of work, it’s literally about the skill sets themselves. We have everybody: we have film makers, we have artists, we have 3-D designers, 2-D designers. We have motion graphics people, we have content people, we have writers and researchers, interaction designers, front end programmers, backend programmers – all these different skills, and yet we work in a big room with just a big table that everyone sits at together. \n\n   We often hold – even as much as people are in individual projects – giant studio wide brainstorms where everyone comes together and you have sound designers pitching ideas about programming, and you have programmers talking about their favorite story or movie, and you have motion graphics people talking about physical design. So both in terms of crowd sourcing people’s skills and insights, and also in terms of keeping people creatively engaged and motivated, collaboration is supercritical. We get a lot of refugees, essentially, from bigger firms that are burnt out on just producing stuff within a very, very narrow band of their considered expertise and who want to be able to be involved in a larger set of problems and issues. \n\n   What do you wish to achieve with your work? \n\n   It depends on the projects specifically, but in general we look for a sense of awe and wonder in terms of how people relate to what we’re creating. It’s both the recognition of the individual stories or narratives we’re working with and then the viewers’ individual relationship to them. Part of it is an innovative or a new way to engage viewers in stories that are inherently social and emotional, but in a larger sense – whether we’re tracking sea turtles around the world with these GPS locators for Sea World, or whether we gather stories for the 9/11 Memorial Museum, or whether we’re igniting different civic activities through Change By Us –, we want people to be both engaged, but also have a sense of the bigness that they’re being connected to for our projects. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   There are big limitations with specific cultural institutions and also with specific narratives. But we’ve been really amazed at how, when you start to scale up your work in terms of the types of stories you engage with, how many more people will really engage with the project. When we launched Make History, the 9/11 Memorial Museum, we got a quarter of a million people around the world looking at it on the first day, which was just phenomenal. That was really just a function of the fact that, as we theoretically know, a third of the world watched 9/11 live and connected with 9/11 itself. When you launch a project with so much interest to it, you see the level of engagement in the depth of connections. So that opportunity is really incredible. \n\n   On the other hand, there are very small projects that make a very deep impact on people. One of the things that I’ve been really heartened by is that, when you build a small project that lasts for many years, you actually end up having a really big impact. We built Timescapes for the Museum of the City of New York, a small city museum in New York City. It’s a three-screen film which tells the history of New York in twenty minutes through cartography. It’s very beautiful with a lot of information design. The theatre is very small – maybe for fifty people –, but if you multiply fifty people by the fact that it’s been up for eight years and that it runs like sixteen times a day every day, that’s millions of people watching it. So there’s something really important about not just doing something big, but doing something very, very good. If you build something really good people will protect it and people will connect with it on an ongoing basis and it will endure. \n\n   That’s the amazing thing you see often in really successful temporary exhibits: people don’t want to let them go and they’ll turn it into physical permanent exhibitions. So that’s the big takeaway, it seems totally self obvious, but if you want to do something that scales really large, whether that’s in time or in space, you just have to do it really, really well and make it work, and then people will care for it and it will get bigger, and bigger, and bigger. \n   How has your work changed over the years? How did your goals change? \n\n   A couple of things have changed over the years. We’ve always been interested in storytelling and connecting people, both to each other and to individual stories. But we started being interested in larger and deeper engagements, and also engagements that move across multiple contexts. So for example, the Sea World exhibit that tracks sea turtles around the world and argues for sustainability and sustainable practices is really important to us. We also started doing work on a large organic farm helping them to tell the story about how they grow food and how people can get involved in this sort of farm-to-table movement by actually buying local greenery in groceries. Essentially, we try to expand that capacity and scope to involve all the different stories that are really important to us. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   Definitely sustainability. The reason why is that sustainability is essentially a communications problem, it’s not a science problem. The science is done. All the scientific community around the world has reached a consensus that global warming – climate change – is real, it’s damaging, and it’s definitely moving forward. \n\n   It’s all about communicating that in a way that feels urgent and relevant and unassailable to the world, particularly to America. America is the largest contributor to greenhouse gases and it has the biggest problem with deniers. I mean, England has some problems too, and Europe has some problems, and China is its own issue, but America’s clearly the biggest culprit and it’s also the worst enemy of the truth. That’s why I think I would want to tackle sustainability, because it’s really a communications problem that the American public basically doesn’t believe in – or doesn’t know specifically what to do about – and it doesn’t take the problem seriously. \n\n   At least this administration with President Obama came in specifically promising to do something about climate change, but there’s no will from the American public. In fact there’s antagonism towards it. Obama has too many other fights to fight, so people hold him accountable – and it’s true, he’s done a really poor job –, but it’s not really him that’s done a poor job, it’s the American public. And why has the American public done a poor job? It’s because we haven’t communicated the situation accurately or with any real force or strength. \n\n   In America the press has a very bad habit of thinking that balanced reporting involves asking both sides of the argument all the time. So what happens is – instead of just stating flatly over and over again that climate change is real – that they’re constantly asking scientists and then they’ll ask some other yahoo who basically says, “No, climate change isn’t real, it’s all overblown,” and that becomes the story. If you look at the numbers, less people believe in climate change now than they did five years ago – it’s getting worse not better. All of that is paid for by the coal industry and by the oil industry. It’s a horrible, cynical problem where you have groups of people who are paying money to discredit science. \n\n   We’ve actually done this in America before with denying cancer being linked to cigarettes. It took a whole generation to definitively argue and to prove within the scientific community absolutely that – no questions asked – cigarettes lead to cancer. Anybody who smokes cigarettes knows it’s fucking bad for you, right? You cough up black stuff from your lungs, you don’t need a scientist to tell you that it’s bad. But if you’re smoking and you see all these images that say, “Doctor’s say that smoking is good for your throat,” you believe it. People are just not that savvy that they can outthink public messaging. And the public message right now is that climate change is a liberal agenda that’s being put forward by green industries to make money and people believe that, and that’s the problem. \n  \n   The scientific community isn’t aggressive enough, the government is waiting for the general population, and the communications industry – which is us! – are absent. There’s nothing aggressive in pointing out that the earth is going to get really bad, really fast. Some people are basically trying to convince us not to save the environment that we live in and that’s really stupid. I don’t know what these people are thinking. I guess they’re thinking that they’re just going to make money in the short run and then, in a generation, they’ll be able to geo-engineer their way out of it. These people are very short sighted. They are the people who are smart enough to know the science is real, but dumb enough to continue to be anti-climate change or sustainability efforts. That’s another communications problem. \n\n   People just don’t get those messages. It’s a very grim scenario and I basically frame it all as a communications scenario. Scientists aren’t really to be blamed for it. It’s really journalists and the communications industry who haven’t been able to create a sense of anxiety. \n   Jake Barton is founder and principal of Local Projects, an award-winning media design firm for museums and public spaces. Jake is recognized as a leader in the field of interaction design for physical spaces, and in the creation of collaborative storytelling projects where participants generate content. \n   \n Local Projects \n   9/11 Memorial \n   Timescapes"], "link": "http://substratumseries.com/issues/collective_responsibility/jake_barton", "bloglinks": {}, "links": {"http://localprojects.net/": 3}, "blogtitle": "Substratum Series"}, {"content": ["My observations shouldn’t interfere with my life – I want to be able to live my life and then in the end have this bucket of data to play with, I don’t want to be like “Oh, I can’t cross this street because my phone’s battery is dead and I can’t write it down.” \n   When do you first remember thinking of yourself as a designer/artist? How did you end up doing what you do today? \n\n   I was on a scientific track for a long time as a child, and I thought I was going to be a marine biologist. But I had this one friend whose dad was an artist in all sorts of media and had an Amiga with which we could tinker and do Paint Box stuff. This friend was naturally super artistic, whereas my dad was an engineer, and my mom – as artistic as she was –, she only, like, doodled on our lunch bags. So I think it was this friend, and the way he was always involved in arts, who really pushed me towards that. We were quite precocious kids and did a little bit of stalking in the Bay Area, like, we weaseled our way into Pixar and we weaseled our way into Industrial Light and Magic when we were just young teenagers. And so we always had this idea of wanting to pursue design and video. My friend could draw really well, but I couldn’t, so for me computers were a way of overcoming those creative limitations. \n\n   In high school I had an internship at a video post-production place, where I would just hang out with their Paint Box – which was for making animations – and would play with that. One time I skipped a family vacation and got money from my parents instead so I could get my first Macintosh. I just started tinkering and helped this friend make a comic book in high school. I did all the graphic design that went with it, and the production work, and ultimately I came to this sort of fork in the road where I was doing college visits. \n\n   My parents weren’t really sure what I was going to do, and I wasn’t sure if I should go to design school. I visited RISD and talked to someone there and I was like, “Here’s what I’ve been doing. I’m not sure if this is the school for me, but if you think it is, will you let me in?” So I did my application, and they surprisingly accepted me. Because it was a design school, thinking was so much more valued than I had expected it would be. And I actually did well in my first year at art school and convinced my parents that this was a viable route. Even though my dad was skeptical I’d ever make a living, that was probably when it clicked for me that this was something I had a capability at, and I was going to be a graphic designer. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   I think it comes back to it being a thinking profession. Surface design is interesting for a moment and it’s nice to hang on your wall, but it’s really when you have to think your way into solutions for problems that totally inspires me. And I think the science thinking comes into it as well; everybody here at the Eyeo Festival 2011 would probably make great scientists, as well as designers, because they have a capacity to understand problems and figure out methodologies for solving them. \n   What do you think is your most important skill, and why? \n\n   Stubbornness or obsessiveness. A lack of patience for things that are not rigorous, wanting to make things that are solid and supported and repeatable. That’s something that comes up sometimes when I’m thinking about my work, wanting to make sure that I’m treating the data or treating the artifacts that I’m working with in a way that, if it was handed off to someone else, they could repeat the same processes and get the same results. Otherwise, it is just invention. \n   Tell us about the community you’re working in. \n\n   What I do is definitely something that I wouldn’t be able to without the work of and on Processing. And my most recent report was made possible by the Mesh library by Lee Byron. I wish I could contribute on those levels. I’ve taught kids how to use Processing, but I won’t be adding to the code base anytime soon. But the diffusion of these skills is really important, and learning that they’re not proprietary, and that there are things to be passed on. Like in session at the Eyeo Festival, where he and Jer Thorp were just riffing on his code and produced the visualizations that you saw onscreen. They weren’t precious about it and gave their knowledge to everyone – that’s the beauty of this community. \n   In what ways does working within a community influence your work? \n\n   Definitely some of the storytelling approaches that I’ve taken have been maybe broader than this community, but I think this is expansive to the art community as a whole – people sticking stubbornly to one way of doing a thing until they’ve created a beautiful work of art. I’ve definitely taken from a random person talking about something like “Oh, I’m going to catalog every object in my house.” That feeds into my brain and I start thinking about things and I’m like “I don’t want to do that, but maybe there’s something there,” and then I just start testing it. My personal work definitely benefits from having a year in between execution, so there’s a lot of time to absorb new technologies, absorb new ideas and hone them into an idea that I’m going to follow. \n   What role does collaboration with others play for your projects? \n\n   I’m not a good collaborator, unfortunately. I’ve almost always worked alone. I’m learning to work with other people at Facebook because the standard of talent there is really high. But it’s not something I’ve typically pursued unless it’s been on the content side, where someone else has been producing content. Maybe I’m a control freak in that regard. \n   What do you wish to achieve with your work? \n\n   In some respects, my Annual Report is really personal and I mainly do it for myself. But now I’ve also built up an audience who looks forward to it ever year and so I’m also doing it for them, but unless it was good enough for me I would never put it out there. I definitely see my work as the hard work that I hope won’t be required in the future, so that – five years from now – this beer will say, “I was drunk by Nicholas Felton at this location.” \n\n   And I seriously think that’s only, like, five years away. I’m trying to play in that space where the data is free and do the experimentation before it becomes possible. In some ways that’s easy because there are only, like, twenty people or so doing this. I guess it’s a cozy space I’ve built for myself, because it’s gonna be a very crowded space very, very quickly. Any contributions I can make right now are fun and I’m excited to see what other people do in the future. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   There are definitely some problems I’ve tackled that have just been too complicated to continue. For example tracking all the streets that I walked down was a pain in the ass. I could do it for a year, but I didn’t want to do it any further than that because it started to interfere in my activities – and that is something I always want the observation to not do. I want to be able to live my life and then in the end have this bucket of data to play with, I don’t want to be like “Oh, I can’t cross this street because my phone’s battery is dead and I can’t write it down.” \n\n   To some extent, this is something that’s possible now with GPS, but you lose a lot of context. There’s got to be some next step there that I’m looking forward to that ties more context into where you are, like the beer saying, “I’m being drunk after you rode your bike thus far to this place.” Smart GPS essentially, smart sensors. That’s my limitation: I’m only capable of remembering three or four things at a time before I have to enter them in my phone. But it’s just a matter of waiting for sensors to catch up. \n\n   Do you see any limitations that go beyond technological limitations? \n\n   I might have had a different answer a couple years ago because I wasn’t sure how popular the forms that I work in might become. Back then I thought people liked these graphs I created because they’re like Excel with nice typography. But then I had to change that, because suddenly graphic designers were my audience and they really liked what I did. Today I’m at the point where I’m like, wow, a 70-year-old friend of my dad’s can read this thing and enjoy it. So, in terms of an audience for the medium, I think that’s unlimited. \n   How has your work changed over the years? How did your goals change? \n\n   My goals are changing, but they’re still the same. I want to tell bigger and bigger stories and become more complete with the sort of coverage that I have of my life and of my experiences. Like the mood question, that was a huge one. That was something where I wish I had a sensor that would just tell me, “This is what this person thinks your mood is right now,” or “This guy thinks you’re an asshole.” \n\n   Doing eighty-one years of my dad’s life was definitely the biggest story I’ve managed to do so far. I didn’t feel like I was doing a good job for a really long time. I thought, “This is not memorializing my father in a complete way,” and it took a month of working on it to get it the point where I thought, “This is good enough to put out into the world, and will not do him a disservice.” The challenge is definitely on me next year to come up with something that’s bigger. But, I don’t know, maybe it’ll just be one number next year. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   The big problem that I’m hoping to tackle in a lot of the more public works that I’ve done is just to give people tools for understanding the data that they have access to. I want to find answers to how we can deal with the data problem. One answer is more data, but I think that the answer is more tools, more literacy for people to be able to question what’s going on, what they’re seeing, to re-interrogate it. And I think that’s a goal that a lot of us work towards and is starting to happen. If you have location data, keep it, learn how to use it, and make sense of it. \n   Nicholas Felton spends much of his time thinking about data, charts and our daily routines. He is the author of several Personal Annual Reports that weave numerous measurements into a tapestry of graphs, maps and statistics that reflect the year’s activities. \n   \n Nicholas Felton \n   The 2010 Feltron Annual Report \n   Nicholas on Daytum"], "link": "http://substratumseries.com/issues/revealing_stories/nicholas_felton", "bloglinks": {}, "links": {"http://daytum.com/": 1, "http://feltron.com/": 2}, "blogtitle": "Substratum Series"}, {"content": ["I'm thinking a lot about how we can stop using the same information that’s already on the Internet and just remix that. I want to start working with more, deeper information, information that’s harder to surface. \n   When do you first remember thinking of yourself as a designer/artist? How did you end up doing what you do today? \n\n   I think never, really. I come from a statistics background and my formal title at the New York Times is “Graphics Editor”. When I think of it in, like, simple speak, it could be called “Chart Maker”, which maybe sounds too derogatory for some, but I don’t think it is. I know it can be respected and it’s what I do. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   I really like the work that we do. We get to respond and react to a lot of different things and there’s quite some conceptual thinking involved. When you can help to clarify something complicated, that’s a worthwhile endeavor and that’s the part that I think is the most fun. \n   What do you think is your most important skill, and why? \n\n   Sketching with data. The idea to make five hundred charts and then choose the best one. I’m really quick at making those five hundred charts and I think making stuff we throw away is my most important skill. Making stuff that doesn’t work and not being so attached to it that it’s disappointing to get rid of it. \n   Tell us about the community you’re working in. \n\n   That’s mostly the Graphics Department at the New York Times, which is full of people who are good at different things; people who are excellent designers, people who are excellent programmers, people who are excellent at many other things. What I get out of that is the teamwork, the ability to work with other people which is super valuable. \n\n   Then, within the larger organization, it’s hundreds of journalists who have excellent reporting skills. Some people in the Graphics Department do as well, but the idea that people can surface interesting information and want to share that with the world, that kind of journalism community is where my work is grounded. \n   In what ways does working within a community influence your work? \n\n   It made me understand how important reporting is and how important good reporting is. That’s sort of an obvious thing, right? If you don’t have content you can’t make anything. But I think there’s a fundamental difference between things that matter and things that are just amusing or whatever. The impact of solid reporting and how much work solid reporting actually is has become really clear to me from the New York Times. \n   What role does collaboration with others play for your projects? \n\n   It’s largely an inspirational role, as we don’t really formally collaborate often with very many people. We collaborate often with sources, but they tend to be subject matter experts and not necessarily design experts. There’s a lot of collaboration within the New York Times, but I don’t know that so much, other than being inspired by work that we see, and being encouraged by people who are doing interesting things. \n   What do you wish to achieve with your work? \n\n   Our department motto – if we have one – is “clear and compelling.” What that can mean varies in a lot of different situations. Some days the goal is just to find the right data. Some days that goal is more ambitious, like “Can I change people’s thinking about this?” or “Can I do something interesting?” \n\n   It’s not useful to people to pick up a newspaper and have it be filled with things that they already know, right? It’s not advocacy, it’s more like, “Can I introduce you to new things?” or “Can I cause you to think about old things in a different way?” or “Can I give you a sense of scale about something?” I mean, informing people is our real, primary goal. It’s no fun for a reader to be like, “Yes, I know this. Yes, I know this,” flip the page. So, I think that maybe it’s not to change thinking so much as it’s presenting new knowledge or new information or new ways of looking at things. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   We certainly have readers who react in different ways. The pinnacle of journalism, when people apply for their Pulitzer prizes, has a section about “How did this matter to the world?” It’s not something like that in the Graphics Department. I don’t think we’ve reached that yet regularly, but I think to aspire to the idea that if we print a million copies of this that it might affect someone’s life. I think that’s a reasonable idea. \n\n   I don’t have a good case study, but I trust that our visualizations in some ways make people aware of things that they were not otherwise aware of. You can see that from reader comments and from how they share our articles. I’ve been through phases where I checked those comments regularly, like two or three month periods where I was just addicted to them and read all of them. Sometimes they’re not the most well-intentioned and you have to filter that out, but often they’re thoughtful. \n   How has your work changed over the years? How did your goals change? \n\n   At one point – I call it my impressionist phase –, I was really interested in making things abstract but interesting and beautiful. And then I had a “curves are fun” phase for a while where I was really into curved things. And then I had an “intentional simplicity” phase for a while, like, how stripped down can you make something and have it still be interesting? I don’t know what my current phase is, but it’s kind of an “aspirational reporting” phase. I’m not that great of a reporter yet, but I'm thinking a lot about how we can stop using the same information that’s already on the Internet and just remix that. I want to start working with more, deeper information, information that’s harder to surface. \n\n   There have been different phases in my career and also different goals. When you have to respond to breaking news it’s very different from when you’re working on the feature story or when you’re working in the Sunday styles section, which is certainly not the same as the foreign section. So, that sort of topical variety certainly changes and influences me as well. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   It’s an interesting question for us because – in certain ways – we do have that chance, right? We’re an international newspaper. You can largely work on whatever you want to. And so I think the problem that I’d like to tackle would be something not obvious but important. At the same time, I don’t quite know what that is. Important in the way that budget debates are important or health care debates are important, but something that is not obvious at the same time. That would be my ideal project, but I don’t have a precise definition about what that is. \n   Amanda is a graphics editor at the New York Times, where she creates charts and maps for the print and web versions of the paper. Before joining the Times in 2005, she received a Master’s degree in statistics. With a focus on data visualization and a fondness for slightly conceptual pieces, her work with colleagues has won several awards, including top honors at Malofiej, the largest international infographics contest. \n   \n Amanda Cox on Tumblr \n   The New York Times Graphics Department on Twitter"], "link": "http://substratumseries.com/issues/revealing_stories/amanda_cox", "bloglinks": {}, "links": {"http://amandacox.tumblr.com/": 1, "https://twitter.com/": 1}, "blogtitle": "Substratum Series"}, {"content": ["I like to give people this experience of discovering their own potential as creative actors. I like to allow them to discover something new that’s creative in themselves, which means presenting an interactive condition that suddenly they can find some way of expressing themselves within. \n   When do you first remember thinking of yourself as a designer/artist? How did you end up doing what you do today? \n\n   I’m going to really have to keep myself from making fun of all these categorizations! At this moment in time, I’m really no longer interested in these terms. The thing that I’ve found the greatest relief in was the idea that I could just do what I’m interested in. If some people called it art or design or research or activism – or whatever it would be –, I was quite happy that at least they would find it interesting, and that this was the pleasure. If people say, “That’s art,” or something like that, they have some preconception about what art is. I don’t necessarily know if I want to participate in that. So I’m not too worried about those terms. \n\n   I have a few realizations about myself as a creative person. I mean, I know I have to make stuff – if I don’t, I go crazy, and I’ve known that for at least twenty-five years or more, since I was an early teenager. I know that I don’t have a lot of ability to tolerate client work. A lot of client work makes me really sad, so I guess that means I’m an artist, because I like making the problems for myself. But I have done design work, and I do take client work. It’s just when the match is right for who I am and what I’m interested in. So I would say that I’ve been doing arts since I was a child. My mom’s an artist. My dad’s a craftsman. So I always knew I was working in the arts somehow. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   I like to provoke, I like to share, and I like to explore. So those are three of the main motivations behind what I do. Sometimes I try to do all three. When I say share, I mean it’s because either I like to educate or I like to enjoy the collaborative experience of making something. Sometimes it doesn’t even matter what we’re making, so much as the enjoyable quality of making stuff together. It’s really more important that we make things together. \n\n   I like to provoke, and I have some mischievous ideas about making mischief in the world that I think would make the world a more interesting place. I think, “Ah, the world would be a more interesting place if I did this hack and it would provoke people.” So sometimes I do it that way. \n\n   And I like to explore. I mean, I’m curious about a lot of things. There are a lot of new possibilities that the technology has obviously made possible, that the networked condition has made possible. So I like to explore those. \n   What do you think is your most important skill, and why? \n\n   I wish I had more of it than I do, but I like to think that it’s sticking with problems and not letting them go. Finding a way to solve things, even if it means the answer is a kludge. \n   Tell us about the community you’re working in. \n\n   Half of my collaborators are right here at Eyeo Festival 2011. My community are people who make things in ways that are similar but complementary. People who are making, who are using code to make art, or whatever you call it. To intervene in cultures is almost a better way of saying things. To change things, hopefully for the better. \n   In what ways does working within a community influence your work? \n\n   It has a big influence, of course, because we’re all sharing things together. We’re sharing ideas, sharing materials, tools, techniques, everything. \n   What role does collaboration with others play for your projects? \n\n   For me, it’s central because it makes doing this whole stuff much more interesting. I don’t like doing it all on my own. Collaboration takes many different forms, from working side by side with somebody, to just sharing code online in a very indirect, nonlinear, and sometimes delayed way. I make an improvement to a library, and they make an improvement to a library, and after years it gets better. \n   What do you wish to achieve with your work? \n\n   That’s changing over time. I like to give people this experience of discovering their own potential as creative actors. I like to allow them to discover something new that’s creative in themselves, which means presenting an interactive condition that suddenly they can find some way of expressing themselves within. I like to explore new modes of form, and new kinds of form, and new kinds of creative expression. I also like playing on culture in ways, to talk about new ways of communicating by inventing new media. What that means, new media, to me is not working within new media, but rather inventing new media, inventing new modes of communication, so that people can enjoy new ways of having a dialogue with each other. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   I wish I understood mathematics better than I do. I really regret not taking linear algebra in college. I dropped out. I thought, “I’m an artist, why would I ever need to take linear algebra?” And now it’s the fundament of all computer vision, the fundament of all computer graphics, both of which I do a lot of. I really should’ve taken matrix algebra, linear algebra – I mean, my limitation’s there. I took calculus, which was lucky, and differential equations, but I didn’t take linear algebra, and I’m always paying for it. \n   How has your work changed over the years? How did your goals change? \n\n   My goals are continually changing. I’m shifting to a place in my life right now, as director of a laboratory, where I’m more about enabling other people. And as a parent, I’m also now enabling some young people to grow, and this is different than the slightly more selfish project of making my own shit. That’s good too, but it’s not quite what it used to be. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   I feel helpless like a lot of other people with the problems I’m really concerned about and that I don’t feel I have a terrific capacity to influence. I just read an article this morning or yesterday about precipitous and almost near-catastrophic ocean death, like overfishing, and the acidification of the seas, and the over-harvesting of fish, and so on. I think we’re killing the oceans. I mean, I would love to do something about this, but I can’t. I can’t just snap my fingers and say, “Fix it.” I’m quite concerned about the Earth right now. And I don’t have a lot of faith in art or other kinds of communication to work as propaganda to change people’s attitudes. The answer isn’t, “Oh, well then, why don’t you do some kind of propaganda campaign to convince people to change their environmental behavior?” I mean, it just comes off as propaganda. So the problems I feel best equipped to personally address are not the problems that I’m the most concerned about. That is creating a tension in me that I haven’t resolved yet. \n\n   I try and fix it to a certain extent by being an educator and helping people learn things that maybe can help them address things. I believe in the capacity of software to help fix a lot of problems that exist right now, ranging from energy use to optimizing and economizing so many different things about the way we live. \n   Golan Levin develops artifacts and events which explore supple new modes of reactive expression. Through performances, digital artifacts, and virtual environments, often created with a variety of collaborators, Levin applies creative twists to digital technologies that highlight our relationship with machines, make visible our ways of interacting with each other, and explore the intersection of abstract communication and interactivity \n   \n Flong – Golan Levin and Collaborators \n   Tmema – Golan Levin and Zachary Lieberman \n   Art && Code"], "link": "http://substratumseries.com/issues/algorithms/golan_levin", "bloglinks": {}, "links": {"http://www.flong.com/": 2, "http://www.tmema.org/": 1}, "blogtitle": "Substratum Series"}, {"content": ["A long-term goal of ours is creating a more organic way of actually making goods. We design things using generative algorithms, which is very separate from the way they are actually produced. We might design products by growing them, but to make them we have to cut a million and a half panels that are all unique and then assemble them. \n   When do you first remember thinking of yourself as a designer/artist? How did you end up doing what you do today? \n\n   Jessica I guess neither of us was really on a track to become an artist or a designer, but sometime during my undergraduate studies at MIT I became interested in potentially pursuing art. So I took an art class where – for the first time – I was asked to produce something as art. So I guess it was really through the structure of school, where suddenly somebody was asking me to do art, that I realized this is the category of thing that I’m working on. But not ever before that. I was not particularly artistically inclined or creative in that aspect of my life. I made some websites when I was in high school and maybe played with Play-Doh or Sculpey or something, but nothing where I considered myself to be an artist or designer. Before that, I was a biology major. \n\n   Jesse Sometimes I still wonder if I consider myself an artist or a designer or more of a technician. I sort of walked into this even more accidentally than Jessica. \n\n   Jessica He sort of walked into it because he was dating me! I got him excited about the things that I was excited about. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   Jesse We’re excited about a lot of different aspects of what we do. I’m really excited about the technical aspects, like studying natural phenomena and figuring out how they can be simulated, and what is the latest contemporary research on topics of things that we encounter, like weird formations in geothermal areas. I’m also really excited about how things get made and making things. When you look at stuff around you in the world, you pretty much don’t know how anything gets made and it’s pretty exciting to learn the processes behind the scenes and then being able to use some of those. \n\n   Jessica I’m a little bit less involved in the really mathematically hard portion of what we do, that’s really Jesse’s specialization. I’m completely fascinated by natural systems, I love how what we do allows us to explore the world and learn more about it, and then let’s us take that and really play with it and find things that we wouldn’t have necessarily set out to find. But we find them because they emerge from the systems we’re working with, and we’re able to create things that we’ve never seen before or even imagined, which is always very exciting. \n\n   I also just love making things and I like that we can share that with other people because we make very affordable things. If I make something that costs $10 to $20, then I can sell that to basically anyone. I can get it in stores where a wide range of people who never found me on the Internet or in person can find out about what we’re doing. They can get excited about it, too. It can slightly change the way they look at the world when they look at our products and I think that’s exciting. \n   What do you think is your most important skill, and why? \n\n   Jessica It’s hard to say what’s most important. It’s easy for me to think about skills that I’m not very good at and that I’d like to be better at, and skills I think I’m really great at. I guess one of the things that’s been important in the formation of our design practice and business has been our ability to work with the sorts of systems we’re interested in and to see how to leverage those systems to actually create real things that can go outside and have a life of their own and that other people respond to. I don’t know whether that has to do with our sense of aesthetics or the materials we’re working with or the processes we’re using, but it’s worked out well for us. \n\n   Jesse There’s certainly an amount of technical skills that go into our work that are sort of necessary, but not sufficient. There’s an element that goes beyond knowing how to get things done that makes things good. In general, we’ve been pretty flexible with what we do, so we’re constantly trying to do new things and things that we don’t know how to do. There isn’t necessarily one skill set or tool set that we rely on, but we constantly want to learn new things and do new stuff. \n\n   Jessica I guess one skill – if I was to boast about one thing – is that we’re really good at doing whatever we set our minds to. We’ve never let any technical issues get in our way because we’re both pretty industrious. Really the only limitation ends up being what we can imagine and think of doing, but we don’t have anything standing in our way, which is good. \n   Tell us about the community you’re working in. \n\n   Jesse Because we make physical products, which is unlike pretty much all people who work with computation and design, we’re sort of in this limbo world of lots of different communities. We started making jewelry, so we’re sort of in this jewelry world that we didn’t initially know anything about. They’re like this whole world on their own and have their own conferences and their own institutions and theories about jewelry. And then we’re also in this craft DIY world, because we make affordable objects on our own and manage our own business. We’re sort of in that world, even though we don’t make things with our hands. \n\n   Jessica I don’t really feel like we fall into one community, or that we’ve been that close to one. Actually, we’ve sort of isolated ourselves; we’ve moved around a lot, we’ve lived in Boston, upstate New York, Los Angeles, Boston again, and now western Massachusetts in a forest in the middle of nowhere, where there’s absolutely nothing. There’s no gas station. There are no stores. It’s very isolated, but through the Internet we’re connected with industrial designers, interaction designers, people working with Processing or openFrameworks or other creative coding tools, people who are on the manufacturing side of things, and we have a lot of connections with the 3-D printing industry, especially. We know a ton about that. But we’re not really super close to any of those communities. The thing that’s interesting about it is, that there are always new things to be looking at and new exciting angles on what’s happening in all these different communities that we can draw on. \n   In what ways does working within a community influence your work? \n\n   Jesse The biggest thing that’s influenced our work over the years has just been things that we find in nature while traveling. We’ve had the chance to go to lots of really interesting places like New Zealand and Iceland where they have all these different natural environments that have all these weird formations that occur. You can go see glaciers, you can go see geothermal formations, and you can go see rain forests. \n\n   Jessica I’m sure we’re influenced by all these things that we’re connected to. We both have an eReader, and we both use Twitter, so I see thousands of things everyday. It’s hard to say how that actually influences us. It’s not a direct influence, but I’m sure it does influence us. We try to keep up on current scientific research, which definitely plays a huge role in the directions we ended up going. If we read about a new technique for simulating leaf venation, which is what happened in 2008, then all of a sudden we got on this whole kick where we went in and really researched that for a long time. What’s going on in the scientific community has probably influenced us more than anything else. Of course, the 3-D printing as well, as that influences the making side of things and what we can actually realize. \n   What role does collaboration with others play for your projects? \n\n   Jessica Well, we collaborate together, but we haven’t really collaborated with other designers at all, ever. We’re not against it. It’s just that it hasn’t really come up. We’ve done designs for companies who contracted us to design a line of silicone tableware or something, but that’s not really collaboration. That’s more just getting hired to do something. \n\n   Jesse Basically we’re not very outgoing, so usually we just do whatever comes up. We’re not the sort of people who would go out and be like, “Hey, do you want to do a collaboration?” But if somebody would say, “Hey, I want to do a collaboration…” \n\n   Jessica Note to anyone reading this interview: if you’d like to do a collaboration with Nervous System, we’re very open to that. You have to ask us, because we’re very shy! \n   What do you wish to achieve with your work? \n\n   Jessica There are a lot of different things with many different aspects. It depends on how long-term we’re looking. In the short-term I’d like to make interesting, engaging products that make people think. I want to express what I’m interested in about nature and patterns and forms. And I’d like to do that affordably, so that we can start to replace the products that are on the market with more interesting ones that have more diversity, that bring people more pleasure, that make the environment less homogeneous and boring. Also I’m doing what I’m doing because I find it to be enjoyable. The number one goal is to make my life interesting and be happy, right? It’s very self-serving. \n\n   Jesse One of the things that I’m interested in is changing the structure of how things get made and how things get distributed, but I don’t really pursue that in any direct way except by making things and distributing things in different ways ourselves. It’s just this idea of people being more empowered to make things on their own and have successful small businesses. We don’t really need large institutions and big box stores in order to make and sell things efficiently now, we can have distributed production and distribution of our products. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   Jessica One thing that I definitely wish we could achieve with our work – and this is actually something I see as being more of a long-term goal – is having a more organic way of actually making goods. We design things using generative algorithms, which is very separate from the way they are actually produced. I might design it by growing it, but I can’t actually grow it. \n\n   So I’d like to see there be more biological, chemical, or physical methods for making things that take advantage of the advances that are happening in synthetic biology. We’re actually starting to be able to program bacteria to perform actions. Take bacteria that can excrete silica to make a shell, for example, and combine them with the behavior that we are studying in leaf venation. It’s a very simple set of rules that we are carrying out. If we can do those rules in a physical or biological manner, then we can actually start to construct things in a more ecological manner. \n\n   Right now, we can’t actually realize our organic designs in a good way, because we have to cut a million and a half panels that are all unique, and then assemble them, and they have to be labeled, and it just ends up being very not ecological at all to produce things that look organic. It’s sort of a double-edged sword: all these gorgeous sexy organic designs are actually very damaging to build because they are so wasteful. \n\n   One thing that is limiting us is the ability to realize the sorts of things that we grow or are interested in growing on the computer in real life. 3-D printing is okay, but it is very limited at the moment. \n   How has your work changed over the years? How did your goals change? \n\n   Jesse Well, we haven’t been doing this that long. Pretty much since 2007, so just four years now… \n\n   Jessica I wouldn’t say our work has really changed that much except in terms of the level of difficulty of the things that we are doing. When we first started out, we were really only doing two-dimensional things. We had these cool applets that we put online, where people could design their own pieces, which let them explore the core ideas behind what we do with a fun, generative system that they could play with and create real products inexpensively. But they were just two-dimensional applications that were actually very simple to program. A lot of the things we’re doing now are way beyond the level that we could have done four years ago. Just figuring out the math of how to do these things with these incredibly complicated structures and how to do them in 3-D and how to mesh them and how to fabricate them is way beyond what we could have done before. \n\n   Jesse Also, we’ve started to expand into making bigger things. When we started, we just made jewelry, primarily because it was very small and we could completely manage the design, fabrication, and distribution all on our own. Now that we’ve been doing that for a little while and we have a handle on it, we can expand into making larger objects. \n\n   Jessica The actual thing that we’ve done is make the software and the system. And that hasn’t really changed. But our ability to turn that into real things has gotten better. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   Jessica What I’m most worried about are the environmental issues, species going extinct and the effects of bad air quality and bad water quality on our health. All the things I’m inspired by are all these amazing natural things that I find when I go out hiking to remote places in the world – and those places are all disappearing. I think we all get incredible pleasure from going to these places, and it makes me very sad to think that they are going to be gone. \n\n   That’s something that we talk about sometimes. Our work is very formal, but I still think it affects people in a positive way. Sometimes I wonder if we could do more to address the sorts of issues that concern us globally. But as of yet, we haven’t done it. But I’m also very hard on myself and I always feel like our work isn’t doing nearly enough that it could be doing. \n\n   In terms of how I would tackle that, that’s definitely a very hard issue… Some people try to tackle it by raising awareness. If I tell people more about these issues, then maybe somehow they’ll magically get fixed. Other people go into research and they find some sort of crazy carbon-scrubbing bacteria that can live in the atmosphere, and suddenly there’s no more ozone depletion. I’m not in a position of being either of those sorts of people, so I’m not sure… \n\n   Some of the things that we talked about are things that could change the way our culture works, like if we could reduce wastefulness in terms of buying random stuff that is mass produced and then transported half way across the globe. That’s incredibly wasteful. So if our way of production is helping to reduce that, then that does have a role in that. It’s not a direct solution, but I guess there are no direct solutions. \n   Jessica studied Architecture and Biology. Jesse majored in Mathematics and previously worked in building modeling and design automation. They met during their studies at MIT and founded their design studio, Nervous System, in 2007. \n   \n Nervous System \n   Design your own generative jewelry"], "link": "http://substratumseries.com/issues/algorithms/nervous_system", "bloglinks": {}, "links": {"http://n-e-r-v-o-u-s.com": 1, "http://n-e-r-v-o-u-s.com/": 1}, "blogtitle": "Substratum Series"}, {"content": ["I think that it’s key that you don’t just consume the simplest, pre-digested factoids about something, but really start to ask some questions. \n   When do you first remember thinking of yourself as a designer/artist? How did you end \n  up doing what you do today? \n\n   That’s a difficult question… I think right after school. I first applied for art schools, but that was only because I didn’t know what contemporary art was like. If I had known, then I would have applied for a design school straightaway. But, luckily, they didn’t accept me, anyways. I found that outrageous at the time, of course, but in hindsight I don’t think that my application made much sense, either. \n\n   Then I learned how to work with Flash and Director, but at that time felt more like a developer, I didn’t consider myself a designer. I was always working with graphic designers, illustrators or art directors and I would be “the Flash guy”. After I had enough of the ad agency world, I started to study cognitive science – so a much more scientific career choice – with the goal of later designing better user interfaces in the back of my mind. But in the end, I developed my understanding of what it means to design and how to do it not before I started my interface design studies in Potsdam. \n\n   Still, I don’t care too much about the labeling. But when I read about great designers, quite often this resonates more with me than when I read about great scientists or great engineers. So, this is maybe somehow how I recognize where I belong. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   Design is all about making sense. It’s giving meaning to things, making sense out of things. It’s fabulous if you can do that every day. It’s the best thing. \n   What do you think is your most important skill, and why? \n\n   Persistence. Many people think design is mostly about creativity, about that genius spark, the one great idea that hits you one day while under the shower. But then, if you look at many designers’ works, you will notice that much of their success is due to the fact that they simply don’t give up until they know they found the best solution they can come up with. This is hard work. Look at Nicholas Felton’s annual reports, for instance. You can see how much work goes into the data gathering, but you can also see how he pushes style and concept of the reports year after year. A mediocre designer would have stopped after the first report. Nicholas is still looking for the report. And that’s part of the secret. \n   Tell us about the community you’re working in. \n\n   I used to work in agencies, and also as part of a small research team at Potsdam during my times as a research assistant. Over the last two years I worked freelance – and actually much on my own –, designing my own projects and also producing them myself. Lately, I started to do more collaborations again with some people on several projects, and I’m really happy about this. But these collaborations vary from project to project. \n  \n   Most of the substantial discussions and relationships with designers and people in information visualization have actually happened online over the last few years, using Twitter and our blogs to stay in touch and discuss what has been going on in the scene with the occasional meet-up at conferences. \n   In what ways does working within a community influence your work? \n\n   Well, as mentioned before, I do many project alone when it comes to the information visualization part, but I always enjoy working together with, for instance, good graphic designers or great programmers. There is always so much to learn! \n\n   I know that when I publish a new project, quite a few people will look at it online. So that certainly leads me to second guess my work. But I think it would be great if there were a more differentiated and balanced form of information visualization critique online. Some blogs like the do a great job of being respectful of the work, but also in pointing out problems and not just bashing or blindly praising anything new. There should be more of this kind of critique. Then again, I also know how time consuming it is to write a substantial critique… \n   What role does collaboration with others play for your projects? \n\n   I have always very much enjoyed collaborating with experts who do something completely different from what I do. For example the architects in the MACE research project. Or the physicist and the biologist I worked with for the well-formed.eigenfactor project who were totally into network analysis. Or, more recently, the collaboration with the economists and statisticians at the World Economic Forum and the OECD. By exploring and discussing a piece of the work together with these experts by means of data visualization has always taught me a lot about the different, but often also very similar, ways other professions see the world. \n   What do you wish to achieve with your work? \n\n   I hope that I can make statistics, and digging through data, and actively working with data, and second-guessing data, and hypothesizing – all of these actually rather scientific activities –, I hope I can make them more attractive to more people. Because I think that it’s key that you don’t just consume, like, the simplest, pre-digested factoids about something, but really start to ask some questions. And if your government gives out some numbers, you look them up yourself and actively engage with the data. I hope some of my work can demonstrate that actively consuming data doesn’t have to be dull or hard work, but that it can be joyful and interesting. \n\n   And relatedly, for people working in visualization, I hope I can set a good example for how to push the envelope in visualization and be innovative and brave, while at the same time not losing track of the meaning and stories behind the data. I want to provide some real value and not just the “illusion of information.” \n\n   What do you think you can actually achieve with your work, where are the limitations? \n\n   There is so much more to discover in how we can use information visualization and new forms of visualization. I am sure that in a few years we will look back to today and say we had no idea of what was possible. I started my blog, Well-formed Data, five years ago, and boy, have things changed in the meantime! \n\n   Regarding limitations, I am constantly hitting walls. Expressing really complex things in a compact visual form, and not lie about the data, and be accurate, and still provide some interesting and detailed stories while also showing the big picture – it’s a constant struggle with limitations. But this tension is what the field is driven by and what makes it interesting. \n   How has your work changed over the years? How did your goals change? \n\n   I’d say in the beginning I was more fascinated with the simple fact that you can turn data into images, and in a way I was just exploring different facets of that simple fact, or different systems that do this. This is still a very interesting field and I find some of the purely formal work of, say, really interesting. \n\n   But for visualization, the question should be: “Okay, now what can we do with it?” For me, over the last few years I tried to reflect on what visualization is good for, what it’s not so good for, who does what with it, where the whole field should head, and so on. I stopped thinking of just specific algorithms, and started questioning the role of visualization itself more. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   I think the biggest problem, generally, is the different speeds at which different parts of our society evolve. We have this very fast technological layer powering, for instance, global financial markets, which were totally, completely changed over the last few decades. They are much faster than the “normal” economy and again much, much faster than politics, culture and society. If algorithms are trading on Wall Street and companies have to be shut down because of some strange attractor in a complex system, in the end, this will affects us all. So, to tackle these issues, we all need to stay critical and make up our own minds, based on our own data explorations. And if visualization could help with that, that would be great. \n\n   Moritz Stefaner works as a freelance designer at the crossroads of data visualization, information aesthetics and user interface design. With a background in Cognitive Science and Interface Design, his work beautifully balances analytical and aesthetic aspects in mapping abstract and complex phenomena. \n   \n Moritz Stefaner \n   Well-formed Data \n   MACE research project \n   well-formed.eigenfactor project"], "link": "http://substratumseries.com/issues/truth_and_beauty/moritz_stefaner", "bloglinks": {}, "links": {"http://well-formed.eigenfactor.org": 1, "http://moritz.stefaner.eu/": 2, "http://well-formed-data.net/": 1}, "blogtitle": "Substratum Series"}, {"content": ["I don’t even try to say that I’m totally objective with the work that I do, but I try to be valid. I use data and I want to verify everything, I want it to be true to the word. \n   When do you first remember thinking of yourself as a designer/artist? How did you end \n  up doing what you do today? \n\n   That’s a really hard question, because a lot of my background was in economics. Here’s how I would explain that: I didn’t consider myself a designer in a visual sense until fairly recently, maybe within the last seven or eight years. Before that, the first time that I really found myself interested in the arts, like, abstract ideas, was when I was studying economics. I mean, there are all these abstract connections between the prediction of opium in New York and the price of bread in Afghanistan, or the relationship between the price of coffee beans in Brazil and how that affects the price of gasoline in Texas. So that, to me, is design, very abstract in our heads, and it’s something I always try to bring out to print so we can actually see what those connections are. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   I would say exactly that, this idea of everything being connected from … sometimes I get carried away and I try to say there’s a connection between my cat and a dog in China. For me it’s that fascination that there might actually possibly be a connection. Obviously, I don’t care that much whether or not my cat is related to a dog in Southern China, but it’s just the matter of all these connections that help define us and who we are and how this world was shaped. \n   What do you think is your most important skill, and why? \n\n   My crazy brain. I think it helps to be a little crazy sometimes. Stubbornness, too. People tell you very often what you can’t do and usually when someone tells me what I can’t do, or what I shouldn’t do, that’s exactly what I try to do. I grew up in Arkansas, and somehow in that whole mess I’ve managed to learn German and Croatian. And I lived in Europe for a quarter of my life, not because my family is from Europe. It’s literally my stubbornness to say “I want to do this. I want to achieve this.” \n   Tell us about the community you’re working in. \n\n   There are two communities. There’s the physical community, which is in Madison, and there’s the online community. The physical community in Madison is very weak as far as my field is concerned. I’m pretty much a loner in my community, because there are no groups. There are few people who do remotely what I do, which is kind of fine, at the same time, it doesn’t really bother me. There’s a peacefulness, because it’s a smaller town, but at the same time, it’s a town with a history in political activity. And a lot of what I do is actually politically motivated, so that makes it interesting. As far as online community, I’d consider that pretty strong. \n   In what ways does working within a community influence your work? \n\n   Mainly just feedback. There are influences in the sense that when Moritz Stefaner does something great, or Jer Thorp, or if someone posts something that’s really good on their blog, there’s that influence. And then there’s the constructive feedback. Some of us are trying to work right now in building sort of a forum where we can be a little bit more constructive with each other. \n\n   Moving forward, I see the community getting even stronger. What we’re trying to do is to give each other a little bit more feedback and just blunt candor with each other. “How do we feel about our works?” or “What’s successful?” We have a little bit more open space to actually discuss what we’re doing now. \n   What role does collaboration with others play for your projects? \n\n   Collaboration plays a critical role in all of our projects in the studio. Sharing ideas is crucial as well as the constructive feedback we give one another. There’s a lot of iteration with our work to bring it to a final state and with each iteration, the feedback and ideas we exchange justify the decisions we make. I also think collaboration with other professionals is important and the Processing workshop that Jer Thorp, Moritz Stefaner and myself gave at Eyeo 2011 demonstrated this. We were each able to add another layer to each other’s work to help teach and inspire people and this felt great. \n   What do you wish to achieve with your work? \n  \n   I think that it’s more of a form of expression – not so much artistic expression, but when we have beliefs. I don’t even try to say that I’m totally objective with the work that we do, but I try to be valid. I use data and I want to verify everything, I want it to be true to the word. But at the same time, I believe very much that as humans we’re subjective. We’re predispositioned to subjectivity at all times. \n\n   As far as what I would like to achieve is just to try to make the world a better place. I know that sounds really totally cliché, but it’s sort of the old saying, “What man is a man who doesn’t try to make the world a better place?” I’m not going around trying to save peoples’ lives with leukemia or something like that – which I think is an extremely noble thing to do –, but I do what I feel that I can do, and that is just to bring light on issues, especially political issues. \n\n   Politics drives human society in so many different ways. And that’s what creates nationalism, that’s what creates the twisted identities that people have, and I always feel that there’s this necessity to tell a bigger picture. Because the media and politicians like to can data results and tell you “Hey, this is what it is.” And I usually like to come back and say, “Well, there’s a bigger story here.” Like what we did with the Obama and McCain campaign donations project, where we were able to show that the proliferation of the Internet and small donations of $1 to $100 were Obama’s massive source of income for his campaign. It shows that the many, many fish together are much bigger than the one big fish. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   I see nothing but limitations. What can I achieve? I guess it’s just insight. That’s what I’m always trying to do, give people more insight. But the funny thing is the more I find, the more I find that there is to find. It’s sort of the old “The more you know, the less you know”, the idea that the more I know the more I realize I have to know. It opens up your world and you start to see more and more relationships. As far as limitations, it’s like, “Wow, this is a much bigger picture.” It’s always hard to be selective and find the right area to sort of crop around and say, “Okay, this is what we’re saying right now.” \n   How has your work changed over the years? How did your goals change? \n\n   I’d like to think my goals have been always true. I would say this started when I was studying economics and discovered this whole idea of finding connections. I had this dream when I first moved to Europe – I was about twenty at the time – of going around Croatia on a Vespa and recording prices of onions and getting average income of women for a village and then try to compare those. I had this notepad and I would go around Zagreb and mark the cars and where they were from, so that I could show that people in certain cities, or from different countries, have more Mercedes and things like that. \n\n   So I’d like to think I’m true to that, but sometimes I have to say that the sideswipe is that I also run a business. And as a studio, sometimes it gets really hard to focus just on what you’re passionate about when you have clients who come to you and say, “Hey, we’d really like to do this.” Then I try to convince myself that it’s a great idea to do this particular project, and then, when I’m done with it, realize that it wasn’t such a good idea after all. Even though this helps support us right now, it’s something that I’m constantly thinking about: I don’t want to do too much work for clients to help explain how their financial structures work, necessarily. I’d really like to stay true to my passion as much as possible. \n\n   Now as our name is growing – we’re in publications, we’re in books, we’re in museums –, we get contacted much more. There’s much more opportunities for us and I think right now for me it’s just this idea of finding that sweet spot – and there’s some trial and error with this, for sure. You know, one client contacts us and it’s like, “Oh, it’s this client. Like wow! Yes!” And then you do something and it’s like, “Oh, wait. No!” Then it’s like, “Retreat, let’s go back here and really rethink what it is that we’re doing.” I hate saying “no” to people. I always like to be very positive, and I always like to be the optimistic person there. But at the same time, you can’t say yes to everybody, and you really have to be selective at some point. That’s definitely a learning process for us right now. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   Something that always troubles me – and it has troubled me for as long as I can remember – is this idea of misinformation that causes people to do bad things. We can go back to World War II, we can look at the 1990s and the Balkan Wars. Emotionally, these drive me very much, this idea of how the Balkans split apart. I’m very interested in that time. And then look at America post 9/11 with this whole anti-Muslim movement and this complete misinformation. And it’s not necessarily because somebody thought, “I’m going to be evil and go out and lie.” They really believe what they are saying, and the people listening to them want to believe what they’re hearing. So this idea that the Quran is all about terror and violence makes me go like, “Wait. Look at the Old Testament. Look at Deuteronomy. It says you can stone your wife.” Our religious texts in the Western world are extremely violent, as well. \n  \n   This idea of people just listening to what they want to hear because of their upbringing, or their emotions, or their beliefs, and then using that to justify doing bad things to other people … that really bothers me. It sounds a little cliché, there, too, but it’s really something that drives me in many ways. I’m always trying to find the right way to help explain that. So sometimes I feel like attacking that situation directly is too much, too daunting. I don’t want to misinform somebody in that process. My wife is doing her Ph.D in German literature and she worked for a summer at the Holocaust Museum in Washington D.C. So for her, too, nationalism and identity is something she thinks about – it’s sort of an ongoing discussion that we have every morning for breakfast whenever we talk. \n   Wesley Grubbs is the founder of Pitch Interactive, a data visualization and interactive studio that focuses on new technologies to solve complex needs. With a mix of both creative talent and programming ability, Wesley and his team build visuals that are as fluid and artistic as they are statistically sound. Their designs engage and educate viewers in what would otherwise be daunting volumes of information. \n   \n Pitch Interactive \n   2008 Presidential Candidate Donations: McCain vs. Obama \n   The Holy Bible and the Holy Quran: A Comparison of Words"], "link": "http://substratumseries.com/issues/truth_and_beauty/wesley_grubbs", "bloglinks": {}, "links": {"http://www.pitchinteractive.com/": 3}, "blogtitle": "Substratum Series"}, {"content": ["I love the idea of there being a robot at a cocktail party that can help. Like, “See that guy in the striped shirt? Just so you know, he’s really into flyfishing too.” Maybe they won’t be the full-out social characters, but they certainly will have the capacity to make the connections that we’re not always so good at. \n   When do you first remember thinking of yourself as a designer/artist? How did you end up doing what you do today? \n\n   I’m an engineer first, but I still feel like an artist sometimes. As a robot designer, there’s so much technological knowledge required to do anything that’s even slightly interesting with robotics – and I’m very interested in actually moving the state of the art forward –, that I’m first and foremost an engineer. I really care about interactive systems, I’m really interested in what we can learn about being human from recreating the means of ourselves through social technology. One of the things that keeps me coming back and makes me so excited to be in the field that I’m in is definitely that I do get to be creative and that I do get to play with art and installation and theater in my work. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   “Artist” seems like such a [makes sound] sort of position – you can’t translate that into typing. I feel more comfortable thinking of myself as just being an engineer, because that’s my explicit training. I have a couple of degrees in engineering, and I’m working on another degree right now. I’m in an engineering school. \n\n   My paper’s titles are like “A Saavy Robot Standup Comic: Online Learning through Audience Tracking” or “Devilishly Charming Robots and Charismatic Machines.” My most recent one is “Eight Lessons Learned About Non-verbal Interaction Through Robot Theater.” So all of it is very heavily in the entertainment world. I’ve been making robots for about nine years, but since officially starting strongly with this robot theater project, everything I’m doing now really is at that intersection. It’s funny because I’m still explicitly in this engineering school. I’m going to have a harder time convincing people I’m not some kind of artist the more I do this work. \n\n   I’m very much of an ideas person. I really enjoy inspiring people. Obviously, I’m very excited about robots and I’m very excited about social technology. I like this idea that there is a possibility to transform technology into a space where it brings us together rather than pushing us apart or that it can empower people rather than replace them. A lot of times when you hear that someone designs or builds robots, you’re either thinking “Ooh, science fiction,” or “Oh, so you’re making something for a factory.” \n\n   I think that automation is like the old-fashioned robots. It’s not that there’s not still a place and utility for efficiently creating new technology. Obama’s really excited about this robotics initiative right now that could reduce the development time between the invention of a new technology and its implementation in society. Obviously, that requires a lot of machining etc., but I’m really excited about pushing the boundaries of what’s possible with technology and what we can do with technology and how we can really use it in our everyday life. I believe that making interfaces – like thinking about sociability as an interface, or like touch screens were a disruptive interface –, can make us be slightly more aware of how groundbreaking some of these new applications in that space could be. \n   What do you think is your most important skill, and why? \n\n   That’s a really good question. I’ll just start talking and see what happens. I don’t think I have a single answer, but something that has turned out to be really useful in several of my past projects is the fact that I’m a systems person. I’m really good at making a whole project come together, maybe because I’ve worked with the technologies for a while, but maybe also just because of how I’m wired. \n\n   I feel like I have a pretty good sense of what’s possible and how to bring pieces together. It often takes collaboration with other individuals, because robotics is one of the most interdisciplinary fields you can possibly be in. Even if you just keep it completely engineering, you need to be able to program, be an electrical engineer, and be able to physically construct the object. Whatever application space you throw it in to, you need to be able to build it. Whether it’s working with entertainment or whether it’s working with psychologists: it’s going to be in everyday life. Even if it’s just harvesting plants, you need to understand how agriculture works and what the state of farming is. No matter what you’re doing with robots, you always need to keep your eyes on many, many balls – it’s always a juggle. \n\n   I think the systems engineering perspective that I bring is one thing. But also – in terms of a unique skill set – my familiarity with social robots. There are not that many people that are thinking about that yet. I like the idea that perhaps I can spread knowledge of that possibility and bring in a lot of other talented people to co-create that future. \n   Tell us about the community you’re working in. \n\n   Right now, the community I’m working in is very interdisciplinary because I’m exclusively looking at the intersection between entertainment performance and robotics, particularly live but also filmmaking. I founded the Robot Film Festival, which took place for the first time on July 16 2011. We had over 70 submissions from filmmakers, animators, motion graphics people, hobbyists, and more art and technology people that were creating installations that were actually onsite at the event. So this year a lot of us have contributed our individual videos, but for the future, I’m really excited about getting them to meet each other. You could imagine it as speed dating for technologists and artists. I really believe that bringing people with different backgrounds together at the table will allow us to create new ideas and new technologies that would be impossible if we just keep those communities isolated. \n   In what ways does working within a community influence your work? \n\n   It totally has an influence. How, that’s a little bit harder. It’s maybe the exposure to the idea of what is possible. I think that it’s hard to really achieve dramatic things in your field if you’re not passionate. One thing that I really enjoy about spending time with designers and with artists and with performers, is that you get this perspective on passion, and “why”, and critique and really thinking about what actually matters. Not just what matters to you, but what matters to the people that you’re designing your objects for. \n   What role does collaboration with others play for your projects? \n\n   I feel like my number one collaborator right now is my robot, Data. It’s been really interesting to watch how that developed as I’ve been in this realm of exploring his character. It’s not like he’ll wake up at night and talk to me, that doesn’t happen. But he does have his own Twitter account. It’s been really interesting to hear as things have gotten more visible, like to be proposing ideas for performances or even writing content for my robot. I’m just like “Data would totally not say that. He just wouldn’t do that.” I started not just curating but actually trying to find a consistency within the robot. He has some motives, like he’s an aspiring celebrity, he’s a little pompous but he’s also like a born yesterday character. He doesn’t fully get it, and so he can make these ridiculous mistakes. It’s interesting. All of that character is obviously in the minds, but I really think it makes the work more coherent as well and how he can relate to different audiences and people. It’s been interesting to have a collaborator that is a consistent machine. \n   What do you wish to achieve with your work? \n\n   I’m really interested in enabling there to be everyday robots in our lives. More of the technologies already exist than we usually acknowledge, but I don’t think energy is necessarily being put in how to glue them together. The voice recognition is limited, but if there’s one thing I’ve learned, it’s about working within constraints. Say you’re talking computer vision and you’re just ensuring your installation is in a place where you have a clear background, so that you can actually see the person in front of it to create a visual – like a bird coming out of your hands or music formed by negative space and your silhouette –, you have to construct this space within the limitations of your sensing capabilities to make something really compelling that touches people. \n\n   That’s the kind of intelligence and talent that I would like to bring to my field. I feel like there is a lot of technology pre-existing. As engineers we are often perfectionists, we really think about making the technology absolutely the pinnacle of what it could possibly be before deploying it in to the general world. I think that designers and artists are really good at working within constraints to make something that is compelling, and I would like to start seeing that in my field as soon as possible. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   One thing that I always struggle with is speech technologies, where it can be hard for a robot to parse what you’re saying or for you to understand how it’s pronouncing something. I really think there’s a great space to incorporate tracks for emotion and modulation and timing into the voice which I haven’t seen from a technological standpoint. That has applications well beyond robotics, say for enabling people who have lost their voice to speak in a natural way. We have systems that can be trained off of their past voice samples, but it still doesn’t sound like them because you don’t have any of the natural modulation. That’s one of those cases where we actually have to do a lot more research about how we’re structured and better understand the social behavior of the voice before we can try to replicate that. \n\n   You really learn a lot about being human by trying to replicate some of our social capabilities like that. In my past work, I was thinking a lot about touch. If you had a robot teddy bear, there are some natural things it could start doing when speaking to you. If it’s doing a good job and you like it, you would give it a hug. How do you say hello? If it’s snoring, maybe you should wake it up. There are some gestures that you tend to use for that. Is it ticklish? Tickle Me Elmo is so successful, right? \n\n   Imagine if you could take that from being a one bit thing. If you could start scaling up the richness of things besides just vision, like with speech, touch, proximity, and the way we move. If you could start to parse in a much more complex way the way we are expressive and the way that we can interpret behavior. \n   How has your work changed over the years? How did your goals change? \n\n   It has changed a lot. It’s interesting because one thing that really bootstrapped my work in the field was that I started out at the very beginning working with a really awesome group of people and an awesome lab at MIT in the media lab run by Cynthia Breazeal with maybe twelve grad students. Cynthia Breazeal basically invented the field of social robots. She has this awesome robot Kismet that everyone should Google if you haven’t seen it already. It’s a social robot that responds to the tone of your voice because that’s the easiest way to track your emotional state. It’s easier than facial expressions because sometimes we smile when we’re not happy, but we tend to use the same voice profile when we’re angry versus sad or bored or whatever, there are less false positives and you have a more consistent mapping. That obviously had a huge influence on thinking about sociability. \n\n   Another great influence was also a member of that lab, Guy Hoffman. He’s now a professor in Israel. We had shared an office for a little while. He’s more of a software person, whereas I’m more of a sensors and physical person. I’m doing software now, but that’s not where I began. It’s not always where I’m most comfortable, but it’s necessary to make awesome behaviors happen. Machine learning is important too. Guy Hoffman did a thesis where he was thinking about a hybrid control system, a robot actor that was playing onstage with two human characters. It could do some things locally that were autonomous, like orient towards someone’s face or play through an animation. To make sure everything happened in order, to keep things timed and to make it feel like a real interaction, he would make sure things happened in sequence. It was a scripted play, which was a really helpful thing. That’s why theater’s great: it’s repeatable. It’s never exactly the same. Acting methodology includes the idea of reacting off the other actor’s face or off their actions rather than thinking about playing through the script because you can very easily sense that there’s a difference. There is a dyssychrony if you’re not making it real every time. That’s something that robots could learn that they’re not that great at right now. \n\n   He started thinking in that direction, and it’s interesting because he’s still doing some work there and now I’m doing work there as well. I’m kind of making that my central thing, but we still have such different takes on it and it’s so complementary because he really is thinking in the mind of the robot actor and I’m really thinking about the sensing. I’m really in the mind of the audience. I want to make this compelling experience for the people that are there. I still think very much in sensors, I can’t get away from my electrical engineering background. I really care about that interface where it seems a little bit more in the AI. Like, what is the meaning of all of this for me, as a robot? \n\n   Did your goals change? \n\n   Yeah, definitely. It’s interesting because I didn’t always know that I wanted to make robots. I started building some projects with this group and watched people engaged with the piece, seeing it impact people and feeling the way they cared got me addicted. I don’t think I admitted that to myself until later. My dad was an engineer and my mother was a Peace Corps volunteer in Brazil and worked with a lot of international non-profits. So I have this interesting culture and I have this interest in impacting the world. I always wanted my work to be able to translate to people. I think I’ve just gotten more and more explicit about that as my career path has gone forward. I have this very explicit interest in creating interdisciplinary work and intersecting fields that I didn’t necessarily have a long time ago. I feel like dialogues across different communities are super, super important, and I definitely care about the artistic application and larger reflection, even the ethics of what we’re doing in a way that wouldn’t have necessarily occurred to me as kind of a pure nerd back at the beginning. \n\n   Maybe I’m getting worse at being a nerd. I said that to Jer Thorp once. I said “I’m worried if I do too many cool things, maybe I’ll start losing my nerd street cred.” He was like, “Heather you make robots. You’re going to be fine.” \n\n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   There are issues that I think are most fundamentally important, and there are the issues that I feel like I’m most qualified to actually have a real impact on in a short time frame. I’m very conscious and care quite a lot about our relationship with nature and the environment in general. From my current technological capacity, I like the idea of empowering people through technology. It’s something that I’m most capable of and that actually impacts the way your life is structured and moves forward and what you’re capable of doing. \n\n   I had no idea that losing the ability to drive a car was a real marker for certain elderly people. A transition from independence to dependence. This idea that you can look at artifacts like that and think about how to make that break not so harsh or to make it so that people can be independent longer, I think that is really interesting. For people to be able to achieve more, to actually move around in their lives and not be stuck in front of their computers all the time, for us to be able to communicate with each other rather than always interfacing through technology. I love the idea of there being a robot at a cocktail party that can help. Like, “See that guy in the striped shirt? Just so you know, he’s really into flyfishing too.” Maybe they won’t be the full-out social characters, but they certainly will have the capacity to make the connections that we’re not always so good at. We’re not constantly connected to the cloud. We don’t have the chip in our heads yet. \n   Heather Knight is a roboticist who creates socially intelligent robot performances and sensor-based electronic art. She founded the Robot Film Festival to inject a sense of playfulness into traditional science and engineering and explore new frontiers for robotics before the technology is even possible. \n   \n Marilyn Monrobot \n   Data, the Robot in the Wild \n   Robot Film Festival"], "link": "http://substratumseries.com/issues/superhumans/heather_knight", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://www.marilynmonrobot.com/": 1, "http://robotfilmfestival.com/": 1}, "blogtitle": "Substratum Series"}, {"content": ["So he was playing Guitar Hero with some myoelectric sensors that were wired to the stump of his arm that he had trained based on the muscle memory of what it was like to press his fingers. For me, that was a pivotal moment of thinking that’s a superhero. That’s a superhero moment. Playing a video game with the arm that you’ve lost. \n   When do you first remember thinking of yourself as a designer/artist? How did you end \n  up doing what you do today? \n\n   I think maybe the first time that I thought of myself as an artist was in high school. I was drawing all the time and kind of obsessed with it, and I started to really learn about different mediums like pastel, painting, watercolor, and printmaking. The moment that I started to get into the different mediums beyond just drawing, it became really interesting to me. When I went to school I studied Fine Arts, basically printmaking. I knew I wanted to be making art. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   What excites me most are new projects and new opportunities. Really, doing things I’ve never seen before, doing things that I don’t know how to do, getting into these different situations. And collaboration is really exciting as well, the potential to work with different people. Maybe they are really good at what I do, and we can collaborate and share and jam together. Or working with people that are really good at something completely different. Or being able to take the work to different places and actually showing it to an audience. All of this is super motivating. \n\n   What do you think is your most important skill, and why? \n\n   Being able to survive by not sleeping. Long flights. Really, I do think that the work that I do takes a lot of work. Maybe my skill is really to just work, and sticking to it. Golan Levin once mentioned a quote that I thought was really nice, he was quoting John Cage, which is, “The only rule is work.” That I thought was pretty awesome. So yeah, that’s probably my biggest skill. \n   Tell us about the community you’re working in. \n\n   I’m one of the co-founders of openFrameworks, which is a C++ library and toolkit for creative coding. It’s really designed to take the things that we learn as artists and publish them in a reusable way to help other people make work. More than just the toolkit, it’s really a community of people who are sharing, collaborating, helping solve each other’s problems, and really kind of pushing the boundaries of what we can do with this tool. That’s extremely exciting and it leads to a lot of the collaborations that I find so motivating. \n   In what ways does working within a community influence your work? \n\n   The thing about the community that’s interesting is just the work, the things that they’re learning, the things that they’re making. I think it’s obviously really inspiring to me and to other people. That pushes me in different directions, for sure. \n\n   You also have many more people from whom you can get feedback. Posting your work on the openFrameworks forum, or on Flickr, or YouTube, or Vimeo, and getting this kind of feedback really helps inform what you’re thinking about and what you’re working on and also helps encourage you. If you have some simple sketch and you’re not totally sure what the meaning of it is yet, but you have the comfort to put it up, you get feedback, you get views, and you get comments, and it helps you understand what it is you’re making. \n   What role does collaboration with others play for your projects? \n\n   I really don’t like working alone. Part of the problem with programming – and just in general with a lot of the arts that involve technology –, is that you spend a lot of time sitting in front of computer screens. It’s not necessarily social. It’s not necessarily a good way to engage other people or communicate with other people. You can obviously communicate online by emails or chatting on Skype or getting into arguments on discussion forums, but it’s not a very public way of working. \n\n   Collaboration for me is really important because I think it just gets very lonely when you work on your own. And then you can get feedback and a couple of other beneficial things. For example, if you are working with people who are really good in the same domain as you, your ability to communicate is greatly enhanced. When I work with Golan Levin – we’ve worked together for almost ten years now – we can just use one word or mention one person’s work to describe an idea or project. It’s a shared vocabulary, which means we can communicate in a really high bandwidth way. On the other hand, working with somebody who doesn’t understand this medium at all is also really great, it helps you remember what it was like to be more naïve and unknowing of what’s possible. That’s really important. The more you see this stuff, the more jaded you can become. Working with people for whom this is completely new is really fascinating. Also working with people who are experts in their own domain is really interesting. You can figure out what’s common or not between what you do and what they do and try to play off each other’s strengths. \n   What do you wish to achieve with your work? \n\n   I think really creating situations and opportunities for wonder is what I want to achieve. \n\n   What do you think you can actually achieve with your work, where are the limitations? \n\n   I see limitations everywhere. On every project, I wish I could do much better than I had done. It’s hard. I think especially when you’re really motivated and passionate about what you do, it’s hard not to beat yourself up. You feel like you’ve failed because you have really high expectations for what you do. The proper way to use that is to use that as a motivating factor for the next project. The metaphor that I use, or the way I visualize making these projects, is a little bit like sailing a boat: you can’t really go in a straight line. You have to go in one direction, and then attack in another direction, and then another direction. You kind of know where you’re going to, but you don’t necessarily know how to get there. You make different adjustments. I feel like a lot of times you may not see the big picture in terms of what you’re making, but later on you can kind of see, “Oh, okay. I see that we were heading in this direction. Now we are heading in this direction.” That’s really interesting. \n\n   How has your work changed over the years? How did your goals change? \n\n   I’m not sure how my work has changed over time. I would say that the EyeWriter project for me was really interesting because it was a culmination of a lot of different things that I was thinking about and that other people were thinking about. I think it opened up a new line of research for me that represents a shift. \n\n   Early on in my career I mostly worked project-to-project or year-to-year. I really had a year that started with Ars Electronica in the fall, and I always feel like that’s sort of the start of the new year. You exhibit at Ars and then you get invited to other festivals, and there’s a circuit for the work that you’re doing. \n\n   It was through projects like openFrameworks that I started to see that there are much longer-term projects. You can have these short-term projects that you do every year, but something like openFrameworks is a project that takes multiple years. I think the same thing is true of something like the EyeWriter project, on which we have been working for multiple years and that we’ve been pushing in different directions. I think the longer that I’m doing this, the more I start to have an understanding for long-term research. \n\n   If I could describe a shift, it would be that. It’s almost like farming, it’s really a different time scale. You have no idea what you’re doing when you’re doing it, but then a year later you change the land, and you don’t know what it means. But a year later, and then you start to see, like, “Okay. The fact that I did this leads to that.” \n\n   The other thing that’s interesting to me – and I’m trying to figure out how to manage it –, is I wind up doing very similar activities year-to-year. For example, one year I might be setting up a couple installations in different locations. Another year I might be doing openFrameworks workshops. This last year I was giving talks. I gave a lot of talks. I don’t know why it happens, but it just seems to happen that way. What people want and what you do heads in one direction or another. This next year, I’m going to make a really conscious effort to try to not travel as much as I do and spend more time thinking and making. \n\n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   I’m really obsessed with this field of Assistive Technology, thinking about technology and how we can use it to level the playing field for everyone. I have this way of thinking about it which is almost like superheroes. What are modern-day superheroes? We think about Batman and Spiderman, and so on. These are the characters that we grew up with. But I think we’re really searching for what and who are the superheroes that really are living with us. \n\n   There is a project called Open Prosthetics from a guy that I saw in Canada. He is a veteran who lost his arm, I think in Iraq. They are building these open-source prosthetic limbs. Prosthetics technology is heavily patented and really old school, you get a prosthetic arm and it’s like a hook, it’s like this technology from 1915. But we know how to do this stuff, we know how to build robotic prosthetics, but we can’t do it cheaply. But we can do it as an open-source effort. Not by making a company, but by open-sourcing our ideas and our research. So he was playing Guitar Hero with some myoelectric sensors that were wired to the stump of his arm that he had trained based on the muscle memory of what it was like to press his fingers. For me, that was a pivotal moment of thinking that’s a superhero. That’s a superhero moment. Playing a video game with the arm that you’ve lost. \n\n   I think that’s one reason why the EyeWriter project gets people’s attention, because it’s also a superhero moment. A paralyzed graffiti artist drawing again with his eyes. And I think that there are lots of these people out there. People that are superheroes, people that could become superheroes. If there’s anything that really motivates me, I guess to answer your question, is to find them and to work on those projects. \n   Zachary Lieberman is an artist, researcher, hacker dedicated to exploring new modes of expression and play. He develops and co-founded openFrameworks, a C++ library for creative coding. He is working on the EyeWriter project, a lowcost/opensource hardware and software toolkit that helps people draw with their eyes. \n   \n The Systemis \n   The EyeWriter project \n   openFrameworks"], "link": "http://substratumseries.com/issues/superhumans/zachary_lieberman", "bloglinks": {}, "links": {"http://thesystemis.com/": 1, "http://www.openframeworks.cc/": 1, "http://www.eyewriter.org/": 1}, "blogtitle": "Substratum Series"}, {"content": ["Like most people who make things, I’m extremely excited about what I’m going to be doing tomorrow, and really kind of depressed about what I did yesterday. I think that’s what’s driving and what’s exciting. \n   When do you first remember thinking of yourself as a designer/artist? How did you end \n  up doing what you do today? \n\n   I knew that I needed to be doing something visual from an extremely young age, and drawing was my favorite thing to do. It was also what I was best at. I think the two are correlated, but I didn’t know in which way. I didn’t know if it would be art, design, or architecture; I think they were all possibilities. It wasn’t really until I was about nineteen, when I had studied for a year and happened to have the right professor, that I really understood what a visual design was and what that meant. I got extremely excited and motivated to pursue it. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   It’s these vague ideas that I have, the things that I’ve imagined and I want to realize. It’s about working through those and making them precise. The moments when I can finally see what I imagined are the most thrilling moments of my life. \n   What do you think is your most important skill, and why? \n   I think just noticing. I teach and have spent a lot of time teaching during the last ten years. I teach undergraduates and graduate students and there I have the chance to observe a lot of the different kinds of minds that we have. \n\n   Maybe the thing that I feel fortunate to have the ability of is just having a lot of ideas. I feel that the more ideas I have, the higher the possibility that one of them is a good one. So I just try and have as many ideas as I can. I believe a lot in sharing ideas with other people and I think that it’s through sharing and talking about these ideas, that I discover which are the interesting ones. Oftentimes they’re improved and enhanced by others. \n\n   So, the ability to imagine things, followed up with the ability to realize them is my most important skill. Like, over time, having developed enough technical proficiency and fluency to be able to complete that whole circle. \n   Tell us about the community you’re working in. \n   I work in a number of different communities. At UCLA, where I teach, I get a lot from sharing with faculty members and having them as peers, but also from the graduate students – we treat them as junior colleagues in a way –, where we discuss a lot of things in a really open and honest way. It’s very much an ongoing dialogue, so it’s really rich. \n\n   Within the Processing community, which I co-founded with Ben Fry, it’s been a decade-long dialogue with many, many people talking through ideas, a lot over different kinds of long-distance technologies, and then in person at these extraordinary conferences like the one we’re at now here at the Eyeo Festival 2011. \n   In what ways does working within a community influence your work? \n\n   I think everybody is deeply influenced by their environment, and I don’t think I am really conscious how that’s happening. One thing I’m really influenced by is the desire to be unique. So when I see other people moving or doing things in a certain way, I feel interested in moving in another way. Within the arts there’s this kind of dynamic system of ideas propagating, and then having new ideas and seeing those propagate. It’s continual, it’s not progress, but it’s sort of evolving in some way. I think in that general ecosystem, the community is always influencing and modifying my ideas and what I’m interested in making. \n\n   Within the Processing community, which Ben and I put a tremendous amount of energy into, we also get a tremendous amount back from, especially through the libraries being contributed by the community. I’ve been doing collaborations frequently as a way of expanding or pushing myself into other areas – collaborations with fashion designers, collaborations with architects, collaborations with people focusing on photo and video. It’s those collaborations that have forced evolution in a really positive way. Oftentimes when I’m doing these kinds of programs that are outside of my normal domain, the libraries that have been contributed to Processing have enabled that kind of work. Where before I’d have to spend maybe three months or six months sort of writing infrastructure, now I can just start doing prototyping immediately. So it’s given back an extraordinary amount of the energy that we put into it in the first place. \n   What role does collaboration with others play for your projects? \n\n   It plays many different roles in a lot of different kinds of work that I do. In teaching, collaboration is ongoing. Curriculum development is something I’m really obsessed with, so feedback includes the students and our colleagues. Within Processing, I think Ben and I make a very good team. At the beginning we had more of an overlapping skill set, but as time progressed, we have kind of been forced to specialize as the project ballooned and grew very quickly. I think we have a very good overlap of skills and background, but at the same time, we have very different sorts of complimentary skills right now. \n\n   In my opinion, collaboration is extraordinary because it allows me to do more than I can do on my own in a really healthy, positive way. I believe the really difficult discussions you often have in working on a project are what really push it forward. \n\n   With that said, I really love just doing things on my own as well. In my studio practice, I really am thrilled to just be able to sit in my room for hours and focus internally. I really like both modes very much. \n   What do you wish to achieve with your work? \n\n   I think if I knew that I might not do it, in the sense that I’m really searching for something profound that I haven’t reached but I’m kind of looking for. That’s partially true, partially not true because I work in a lot of different ways. With teaching, I know what I want and I go for it. With Processing, I think it’s pretty clearly outlined what it’s supposed to do; it’s supposed to be a catalyst to enable people to realize ideas they have for making software, to really lower the boundaries for getting into that field, but in a way that allows them to evolve their work. So if they’re working at a really high level, they can even move off into other environments that are more suitable for what they are doing. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   So many limitations. My own capacity to imagine is probably the biggest limitation, which I try to nourish and feed through reading, watching, and drawing, etc. I have this idea – well it’s not my idea, but it’s an idea that I love – that there are two kinds of technology. There’s hard physical technology, and conceptual technology. The alphabet is an example of conceptual technology. It could have existed before, it’s not really contingent on figuring out how to smelt a kind of metal. Conceptual technologies are kind of technology related on the ability to imagine, rather than the discovery of some process or patentable procedure. \n\n\n  \n   The limitation I’m most interested in is the failure of imagination. At this point I feel like I’m able to achieve any sort of technical solution within the current framework. I can learn what I need to in order to do it, and it took me years to get to that point. That was always the goal. Not to learn technology for technology’s sake, but to develop a general fluency and understanding so that I can tackle any sort of challenge to do what I imagine. \n\n   I’m also obsessed with this idea that the technology that we’re working with right now is just so limiting and primitive. I always try to keep that in mind by looking at old media, by working on the Commodore 64 Emulator from time to time, by going back and spending time with water drawings from the 1960s. I think it’s through looking at that work, that I can sort of deal with the constraints of the present. \n\n   Failure of imagination is one thing, but my imagination is already about twenty to thirty years beyond what computers can do right now. I’m obsessed with real time, things being generated immediately. I want to work with a quantity of elements that’s just not possible right now. So, limitations on a lot of fronts. \n   How has your work changed over the years? How did your goals change? \n\n   Like most people who make things, I’m extremely excited about what I’m going to be doing tomorrow, and really kind of depressed about what I did yesterday. I think that’s what’s driving and what’s exciting. I see the work that I did five years ago as being a stepping stone to what I’m excited about now, and I’m not so interested in it, but other people are. So yeah, it stays around. \n\n   As for my goals, yes they have changed lately. It’s so fuzzy and ambiguous right now, I feel foolish in stumbling through it. But really the last decade for me has been a time of raw exploration. Like, “I have a question, let’s see what happens if I do this or that.” It’s really largely about these very formal machines, these formal systems of making micro worlds where the goal was to explore emergence by making the smallest possible minimal machine and trying to push the maximum out of that. \n\n   As I’m getting older, as I now have a child, and as the world changes around me continually, I’m getting more and more focused on social and ethical problems. I’m really interested in the new work that I’m doing, pushing things in that direction. My hero in this endeavor is Hans Haacke. He was doing work in the '60s that was very much about systems, organic natural systems and exploring those through installations and objects. At some point – I don’t really know why yet –, he kind of flipped to working with socio-political systems, and I’m excited to try and pull the same move. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   I don’t think I’m up for tackling one big problem. I think I’m up for provocations in a hopefully thoughtful way. Change is affected in a lot of ways. Public policy is one way to affect change. I’m not built or able to do that, so I’m interested in trying to do it in other ways, with information, with graphics, and also in a sort of a mass distribution way. \n\n   It’s all really fuzzy right now. But maybe this is good that I now have it on tape, it’ll hold me to it. \n   Casey Reas is a professor and artist, whose ongoing Process series explores the relationship between naturally evolved systems and those that are synthetic. Together with he initiated Processing in 2001, an open source programming language and environment for creating images, animation, and interaction. \n   \n Reas.com \n   Process Compendium Presentation \n   Processing"], "link": "http://substratumseries.com/issues/visual_systems/casey_reas", "bloglinks": {}, "links": {"http://reas.com/": 2, "http://processing.org/": 1}, "blogtitle": "Substratum Series"}, {"content": ["I think the most important bit of data visualization is to actually care about the data and be interested in the data. Because a lot of times, if you approach it purely from the data side or even the programming side, that’s it – you can get caught up in the technical aspects of, you know, how big the data is and things like that. And, if you approach it too much from the design side you do too much just trying to wrangle the data into something that fits onscreen. \n   When do you first remember thinking of yourself as a designer/artist? How did you end \n  up doing what you do today? \n\n   Hmm, let’s see. I guess the first real project that was actually used somewhere was this school logo I did in the seventh grade and I was really interested in it at that age. That continued and I’d worked as a representative all through high school and then on throughout into college. \n   What excites you about being a designer/artist? Why do you keep doing it? \n\n   One of the really fun things for design is that you can actually apply it to any field that you’re actually curious about. I really love being able to jump between different types of fields or different domains. If you look at my work, one thing’s about genetics, one thing’s about literature, one thing’s about topography, another’s looking at health care, another’s looking at government data and social issues. I like to use a design approach and process and then being able to apply that to these different areas. \n   What do you think is your most important skill, and why? \n\n   Is there a way I can answer that without having to pat myself on the back or something? So maybe specifically looking at data visualization, I think the most important bit is to actually care about the data and be interested in the data. Because a lot of times, if you approach it purely from the data side or even the programming side, that’s it – you can get caught up in the technical aspects of, you know, how big the data is and things like that. And, if you approach it too much from the design side you do too much just trying to wrangle the data into something that fits onscreen. And so, there’s a real, qualitative difference between when somebody’s actually engaged with the data and what they design with it, if they actually understand and care about it, versus when they’re just trying to get everything in the right bucket and get everything in the right list. \n   That’s something that I try and do a lot of. I’m also trying to learn to teach that with others, say by hiring a designer who doesn’t have a lot of experience with data visualization. Their first inclination tends to be, “Okay. Quick, let’s organize it”. That’s like a no-no. You want to love the data first and then go from there. \n   Tell us about the community you’re working in. \n\n   I spent the last several years working solo and doing primarily freelance work. I did a post-doc after my PhD, which was mostly solo with some collaboration, and I did about five years of visual work. Last year I started hiring people so that I could start doing stuff at a larger scale. I’m not nuts about the size, you know, but it’s frustrating to see the size of things that you can make versus what’s in your head, so I’m trying to scale that up a bit. \n\n   I try to find people from lots of different types of domains so that they bring in different perspectives on things, as opposed to bringing in people who are, say, already data visualization experts or something like that. I think it makes for a better work environment if you have those different types of domains to bring to bear on what we’re doing. \n   In what ways does working within a community influence your work? \n\n   I think on a personal level, when being around and interacting with other people, that’s always going to influence your work. But, as for inspiration for projects, I tend to look outside of data visualization. If you look within visualization too much it’s too much of a feedback loop. \n\n   I’m more inspired by movies, books, or art. I love the work of Tim Hawkinson who’s an artist, but who does things that are extensively connected to data. Matthew Richie is another favorite of mine. They do things but they can address topics and sort of put them back together in a different way. \n\n   I really love the writing of Mark Twain or Jorge Luis Borges because they take these really complicated ideas and turn them on their head, express them instead in a really simple way. I’m always trying to find ways that I might be able to do that in visualization. That’s a kind of fundamental thing when you’re looking at a data-set with a hundred thousand points. You can either say, “Well, I’m going to try to show the data-set with a hundred thousand points,” and try and get that across. Or, if you think of somebody like Twain, he can take what all of that means and sum it up into a single sentence. I think I’m a long way from being able to do that kind of thing, but it’s an interesting and inspiring thing to actually try to work toward to effectively get things across that way. \n   What role does collaboration with others play for your projects? \n\n   There are maybe two answers to that. One is that it’s often the case where – especially if we’re doing domain-specific work – we’re doing a lot of collaboration with people inside of that domain and try to learn as quickly as possible about what they’re doing, and what’s important, and what’s relevant. I spent a lot of time working with people in the field of genetics when doing my PhD work. There I was doing things that were relevant to what they were thinking about and solving problems that were actually problems they had. \n\n   Another part of it is as a personal way of working: it’s helpful for me to have collaborators to talk through things that I’m not very good at working out in my head. Instead – and that’s kind of the part of visualization – you can work it out and look at it and fix it. Or when getting started on a project or stuck working on it, talking through it with somebody really helps. They have different perspectives, sometimes just listen and tell you you’re off or crazy or need to “Stop doing it, period.” \n\n   My Frankenfont project actually sat around for seven or eight years because it was just this thing about PDFs and fonts. It was so … you know, it was just the technology thing and I couldn’t figure out how to relate it to something that was actually a bit more expressive than just, like, “Isn’t it cool? Let me tell you about vector type and font file formats.” And so, a couple of Saturdays ago, pacing around the house and talking to my poor wife who was discussing with me about what’s the right hook for how you might turn it into something that engages and gets the idea across but can have a different story to it. So, it came out of that whole process and it wasn’t a specific kind of collaboration. It was just helpful to have others to go back and forth with them and who have ideas and can push on things. \n   What do you wish to achieve with your work? \n\n   I want to just be able to keep making things that I like or that I’m happy with and looking into stuff that I’m curious about. Really basic stuff, actually. I have interesting work, I want to get the stuff that’s in my head out of my head and into a project, and I want to work with people who I enjoy spending time with. I’ve been really pleased with how our studio has evolved over the last year and having a cast of people who enjoy working with one another. \n\n   With Processing, really one of the greatest joys has been watching people transform as they use it and also being able to watch the types of people who pick up doing coding and computation with it. One of my favorite lectures of the last couple of years was actually when I spoke at a girls’ school in New York for a seventh through twelfth grade assembly. I was showing a bunch of coding projects done by people with Processing and they were positively excited about what was going on. They were, like, “Wait, that’s computer science and programming? I thought it was math and this stuff, but that stuff I can relate to.” \n\n   After that lecture, I enjoyed spending time with a seventh grade class who was actually using Processing for their projects. I was just watching these girls sitting and the way that they would learn things. It was one long table with computers around on both sides of it. When somebody would learn something they’d be all excited and start making noise, and so then the two people next to them would lean in, see what they were doing, and then that would pass down to the next people and to next people. \n\n   In a way, because of their age and just how fired up they were, you could track ideas moving around the room and people picking stuff up. And that’s really gratifying and exciting. There aren’t enough women coders, and having people who can now approach coding from a different perspective than they might otherwise have – and I don’t think that’s specific to Processing only –, so that hopefully they’ll be more inclined to stay engaged in that kind of stuff and bring a really different perspective than just the straight computer science stuff is exciting. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   Well, that depends on the day. On actual client or paid work, I think the toughest thing is being able to address or reach people who don’t necessarily know that the visualization field exists or don’t understand what can be done with it and that there’s a considerable leap of faith for working on a particular project and what it takes to do that. I’m trying to get better at how we can actually articulate the types of things that we can do and what’s possible to do with data. That’s why part of us are doing our own personal projects, internally, to try and push that along further. \n\n   The Darwin project that I did is an example of that, where it’s really useful to have that project out there. Then other people can say, “Oh wait, I have this issue of comparing large amounts of documents,” and things like that. For them to understand how visualization can help, you have to make that and demonstrate it. Because if I said, “Hey, Darwin’s book changed over time, and it’s possible to actually make something that shows these comparisons,” then the picture that comes to their mind is much more of a “Oh, is it like a word plug-in or a tool?” It’s tough doing that, there’s only so much time in the day to create those things, but hopefully that will change a bit with having some staff. Darwin was all me, solo, but we’ll see how that changes over time. \n   How has your work changed over the years? How did your goals change? \n\n   I think it only varies in the sense of what I’m working on at a particular moment. I’ve learned a lot more about the context in which work is being done and that academic work is very different from public facing work, which is very different from an internal client tool or an internal commercial tool. Learning that is really quite interesting. But I think the thing that I’ve continued to change is how I work with other people and not lose the core of what I’m trying to get done, but be able to do enough listening to the person for what they’re telling me. \n\n   So let’s say I’m doing a piece with somebody who’s primarily a designer. How do I collaborate with them such that we keep the core idea but I can also let them be an expert in what they’re expert at. That’s a really difficult and very delicate balance to get right and it’s going to be something I’m trying to work on and that will be a focus as I learn to deal with managing. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n\n   Let’s see. The thing that comes to mind are a class of problems where – you see it in government and in health care and in elections and things like that – people gain by others not understanding the data or not really being able to understand or put together the issues. So, if you think about something like the current health care debate in the United States, by and large people don’t understand enough about the general economics of how all of it goes together and why they’re trying to reform health care and what it actually means and, if we don’t do that, what that actually does to our economy. \n\n   The terrifying thing is, for instance, what happened to our economy because we were just blowing trillions of dollars in a war while, at the same time, letting our infrastructure here fall apart while, at the same time, starting to do things like deny, you know, basic stuff like evolution. And the problem is that the scale on which the impact for that happens is much longer. In the case of education going backwards, we won’t see what that does for another twenty, thirty years and it’s going to be difficult to actually point back to “Guess what, when you started defunding teaching and education and all this stuff, that’s what made this mess.” \n\n   That is not so different from people in elections who don’t actually understand enough about how the issues work; who don’t realize how the person they’re voting for is actually counter to their livelihood. Because of the level of complexity of how all these issues relate, people shut off and switch over to the emotional side of “I don’t like this person, I do like this person, or I heard this person’s a bad person.” \n\n   And so, yes, I think there’s a whole class of problems like these that I find really frustrating or near impossible to actually try and grasp. But, how could you actually take some of these issues and put them back together and how would Mark Twain be able to take that sort of mess and turn it back into something that you could really understand? \n\n   If Mark Twain were visualizing that, or Samuel Clemens, or if it were Jorge Luis Borges, what would that look like? It sure wouldn’t be a “get the largest data base and collect absolutely all the data” and things like that. Instead it would be a “How can I meet people where they are and wrap this in a way that tells a story of what’s actually going on?” \n   Ben Fry is principal of Fathom, a design and software consultancy. He received his doctoral degree from the Aesthetics + Computation Group at the MIT Media Laboratory, where his research focused on combining fields such as computer science, statistics, graphic design, and data visualization as a means for understanding information. Together with he initiated Processing in 2001, an open source programming language and environment for creating images, animation, and interaction \n   \n BenFry.com \n   Fathom.com \n   The Frankenfont project \n   On Darwin’s “Origin of Species” \n   Processing"], "link": "http://substratumseries.com/issues/visual_systems/ben_fry", "bloglinks": {}, "links": {"http://benfry.com/": 2, "http://fathom.info/": 2, "http://processing.org/": 1}, "blogtitle": "Substratum Series"}, {"content": ["I think most artists have some core ideas that they are always exploring. Sometimes you revisit an exact project and sometimes you revisit an idea about a space or graphic form or whatever and you redo it. If you are successful, then no one will say that you’re repeating yourself. If you are unsuccessful, people will say, “Well, okay, you’re doing that thing again?” \n   When do you first remember thinking of yourself as a designer/artist? How did you end \n  up doing what you do today? \n   I do consider myself an artist, it’s not even a question anymore. Some people do things in both worlds and as a result, the question comes up. I’m an ex-designer, I would say. \n   I’ve worked in the design field in the '90s during the dot-com period, coming directly from high school and without a formal degree. I did design- and technology-related things, and then later I was doing computational experiments, always trying to fit them into a design practice. Then when the whole market crashed and I realized, “Well, I’m not getting paid working for other people, I might as well not get paid working for myself.” I moved to Berlin and said, “I have enough money for six months. If this works out then I’m going to be a full-time artist. If not, then I would have at least tried.” It has worked out. \n   There was a literal moment six months after I had moved to Berlin, where I realized, when I wake up in the morning and I go to my computer, I make art. Now if anyone asks – I don’t care who it is, a carpenter, another artist or whoever –, I’ll just say I’m an artist because that’s what I do. \n   What excites you about being a designer/artist? Why do you keep doing it? \n   First of all, the freedom to create something which starts in your mind as an interesting idea and to have the privilege and the indulgence to say, “This is an interesting idea to me, I’m going to make it and put it out in the world.” That is simply the best thing about being an artist. \n   There are a lot of very hard things about being an artist. It’s a really hard job that most people wouldn’t have the stomach for, but I actually like making a living as an artist. I often joke the definition of a successful artist is an artist who pays their bills. That’s hard, because for most people, they want to have children, they want to have a car, they want to have a house. But as an artist, a lot of people will just have to sacrifice that. You have no job security until you are maybe in your 40s, and most people just quit. Being an artist in that sense is really hard. \n   On the good days, however, when you are showing your work to other people and you’re receiving some kind of feedback and you are feeling like your work is actually making sense, then it’s a really great thing to be an artist. \n   What do you think is your most important skill, and why? \n   I think the most important skill, for me, is the ability to think in flexible terms, to have ideas and to think about them in terms of executability and ask “can this happen?” Also, sometimes being totally impractical and saying, “This makes no sense but I’m going to do it, and maybe it will be great, maybe it’ll be terrible.” It’s this thinking in ways that are surprising to yourself and other people, that’s a really important skill. \n   I saw a fantastic interview with Milton Glaser about failure in which he laid out the explanation that when you first become a success at something, you will tend to repeat that success. Most people are terrified of failure and it’s quite rational to be afraid of failure, but actually the ability to take risks and to risk failure is completely necessary in order to proceed with your work. Otherwise you will stagnate and you will not have any movement. \n   I would take some pride in the fact that sometimes I’ve done things which were quite risky; new directions and doing things that are not connected to things I’ve done before. To me, there is always a connection. I’ve done works that are projected on the screen and then I’ve done a lighting installation which has nothing to do with pixels but has everything to do with logic. Then I recently built a big plywood sculpture that’s just a physical object in the world and has no electronic components and that’s still mine. I think flexibility is a really important skill. \n   Is going from digital work into a physical medium important to you? \n   It has become important. When I started as an artist, I was very much interested in investigating software as a material in itself and really treating it as a material, seeing it as an object, which was practical because it’s a cheap thing to investigate. That was a good thing to be doing for a while. \n   I think now I’m a little tired of the screen. I’m a little tired of the cultural prejudice that comes with the screen. People see that it’s connected to a computer and there’s a lot of cultural prejudice against that. When I make an object out there in the world which is not connected to a computer and doesn’t necessarily have what most people would consider to be a digital aesthetic, it gets considered in other ways, which can be good and bad. My work is not about technology, but of course it’s best understood if you have some working understanding of its origin. I would say that my work is primarily about systems and interesting ways of articulating space. For me, making physical objects is a way of making objects that then exist in space without any mediation. There is no reason to explain why they exist, because they exist. That’s totally different with digital media. \n   Tell us about the community you’re working in. \n   I would say when I started around '94, there was absolutely no community. I was working and had the instinct that this is a really interesting thing to do. I didn’t know anyone else who did it and I didn’t know if it had any chance of surviving as a commercial thing to do. I dropped out of school. It seemed kind of risky, but I just had to follow my instinct. \n   Now, there is a fairly large community. Even though you won’t find a lot of people in any given city, there is an international community that you can rely on. You can find source code, you can find other people who think the same way, you can go to school and actually learn about computational aesthetics. The community is completely different now then it was when I started. \n   What happened in between was that people were making experimental websites and they were making just these things that didn’t have a role, that weren’t explained. It was like, “What is this? Is it a design? Is it art or whatever?” A lot of those people have now moved on to becoming actual fine artists, presenting their work in galleries; it’s an interesting development. I would say my community isn’t necessarily just in art, nor just in design, or nor just in technology. It’s a mixture of those things. When I meet someone who understands the principles of what I do and also maybe why I do it, then that’s my community. \n   In what ways does working within a community influence your work? \n   That’s an interesting one. Right now I’m not very influenced by the technology community. Maybe in terms of digital fabrications there’s a bigger influence. I do find myself hanging out with architects a lot, which is interesting because I used to hang out with architects and then, for a long time, I thought they were a little arrogant and you really think you have all the answers to the world. Now I find myself hanging out with architects again. \n   It’s interesting to now look at architecture through the prism of being an artist because you also realize that architects have to make a big statement about their work. And of course that’s why they use pretty big words. As an artist, that’s also how you sell yourself. In that sense, I can understand it now. \n   In terms of inspiration I would say that I am more inspired by tendencies in contemporary art than in technology specifically. I find artists who show properties that I’m interested in, people like Tara Donovan or John Powers who do work that has nothing to do with technology or explicit systems but they’re still showing some kind of principles of abstraction in a very contemporary way. Abstraction in art has many histories. If you go back to the '60s, it’s very different from the way that it is now. I find myself going to art galleries and being bored by a lot of work, but then occasionally I’ll see that one piece and I’ll go, “That’s fantastic.” So that and architecture are my main influences right now. \n   Maybe it’s also because I’ve been around art and technology for over fifteen years now. Of course there are new things happening all the time and I think there are interesting new developments in the field. There are people working more with physical installations where the installation is also an object. There’s some beautiful, beautiful work begin done there. Of course I also follow the fields that I’m inspired by. Right now, I find it more inspirational to see something that’s different from what I do myself. \n   What role does collaboration with others play for your projects? \n   I’m a terrible collaborator. I have collaborated in the past, mostly on design projects. The only times when it has really worked – and then it has really worked –, was when the people who were involved were mutual tyrants. When everybody is a tyrant, then it works; where it’s just understood that one person has great skill in one area and the other person has a great skill in another area, and then you bring that together. \n   I’m not very good at working in groups and then having to compromise. I’m terrible at that. I wonder sometimes why I am so bad at doing that. Also, sometimes it stops me from reaching out to people who might have skills that I need. At the same time, it has the benefit that if you’re creating your work in isolation, in a certain sense, it also makes your work more extreme in some respects. I think some of my work is coming out with that. I think maybe some of the extreme vision would be a little softened by collaboration. Then again, I know so many people who do fantastic things with collaboration. I’m not negative to it, I just don’t do it. \n   There are some situations – and I find myself doing that more recently –, that when I’m creating, for instance, physical installations, where I don’t have the skillset and need help to put the things together, then that’s closer to a collaboration. Still, it’s more about fabrication than it is about real collaboration. I would be totally willing to collaborate, for instance, with an architecture group to do something really interesting and to that I would be totally open. Again, the principle of tyranny is, I think, the best one. \n   What do you wish to achieve with your work? \n   That’s a question you ask yourself a lot as an artist. I wish to show or communicate some of the ideas that I have in my head which are not necessarily about things that can be verbally communicated. I think my work is a lot about nonverbal experiences: it’s about bodily experiences or optical experiences where I actually want the viewer to encounter the work before they really think about it or before they think, “Oh, that’s like the other thing.” That’s the immediate desire. \n   Then on a larger scale, my goal as an artist is to be able to continue being an artist and to make work and have the luxury of not having to choose between media, being able to make physical installations, maybe light installations, but also do things in print and screen, etc. That’s how I’ve always worked. I’ve never been picky about the medium. It’s the idea and the logic that’s interesting. For many artists, that’s something they don’t do. They stick to one medium or one idea and they explore that for sometimes their entire lives. I’m not saying that’s bad, but, to me, that kind of consistency has never been an option. I’ve always wondered what would happen if I worked with ceramics or whatever. I’m willing to work with just about anything if you ask me. \n   Is it because the medium also allows you to express yourself differently? \n   Exactly. I think it does actually have something to do with my background as a designer. As a designer, material qualities that you are working with also become a creative parameter. As an artist, the fear of the blank canvas is a very well-known proposition. You think, “I can do anything, oh my God!” Having just one restriction helps you already. I’ve literally thought, “Okay, I’m going to make a light installation. How would my work translate to that? What’s the logic?” It’s totally different than pixels, re-imagining your work in that form. So yes, the medium is a creative parameter. \n   What do you think you can actually achieve with your work, where are the limitations? \n   I’m not a fantastic coder, I know that. I dropped out of computer science. To me, computer science and chess have some similarities. In chess, you have the idea of rankings and you can immediately tell who is the better chess player. Among programmers, it’s very similar, you can usually tell quite quickly. They’re usually often very proud of it. I realize actually that in that particular pissing contest, I would do pretty okay. I’m better than most people. I’m certainty much more technical than your average person, but still I’m not the best coder and there’s really no point in me trying to be that. \n   What I have instead is a combination of skills that maybe doesn’t exist in so many people. How many coders have a great sense of color? How many coders have a great sense of composition? In some respects, I wish I was a better programmer, I wish I could just go and make a constructive geometry with Boolean operations. I wish I could just go and do that. I don’t and I can’t. At the same time, in my experience the community solves a lot of these problems for you, given enough time because someone will make a constructive geometry library and you can just plug yourself into it. There is always the limitation between tool building and art making. In technology, in particular, you often have to build tools in order make art. I would say I want it to be 20/80. I don’t want it to be 50/50. That’s too much. But sometimes it’s 60/40 or 70/30. \n   I have almost a phobia against working physically with my hands. Not because I’m afraid of working with them or of getting them dirty, but just because I don’t trust anything that I make with my own hands. I just assume it will fall apart or that it won’t have the right quality. I just don’t trust it. In that sense, when it comes to, for instance, making models or sketching, I need to sketch in code. That sometimes takes a lot of time. It means that the piece is half done by the time you have the sketch. That’s a limitation. \n   Sometimes I wish, well, if I could just pick up a pencil and just quickly sketch it out, then maybe that would be better. At the same time, my sketching process, which is in code, also leads me to discover forms in between that make me see that what I had in mind originally isn’t really that interesting, but this thing that happened by accident is really great. \n   How has your work changed over the years? How did your goals change? \n   I just had a solo show in Norway. A solo show is a wonderful and terrifying thing because it’s just you. There is no one to hide behind, you can’t pretend the curating was terrible or that they didn’t have the budget or whatever – it’s a case where you are really putting your ideas on display. What was different was, that in this show I had almost no software pieces but one, which was more or less an explanation of a tape drawing that I had done on the wall. This show was about the graphic quality and about bringing it out into the space. There is a strong connection to the graphic work in everything I do. I think anyone who looks at my work will see that the optical qualities are very central to what I do. \n   In a lot of the physical pieces that I do, color disappears because it’s just not practical or it’s just not the main thing about the piece. Also, color on the screen is so infinitely rich. You can vary it in so many ways that trying to do that in physical space would be really quite difficult. I am sacrificing one thing, which a lot of people would think was absolutely necessary, to get something else, which is physical presence, a sense of scale, making something that’s bigger than a human, and making it not in a way of just projecting. Good projections can be amazing. To me, being able to have something in the space, even if it’s a flat drawing on the wall done with tape, having it physically present is a different thing and that’s probably the newest aspect in my work. At the same time, I’m using some of those qualities to explore the same kind of graphic properties that I did a long time ago. I’m actually, in a way, revisiting old pieces but in a new format. It’s both changing and going back. \n   Is it remixing? \n   I think most artists have some core ideas that they are always exploring. Sometimes you revisit an exact project and sometimes you revisit an idea about a space or graphic form or whatever and you redo it. If you are successful, then no one will say that you’re repeating yourself. If you are unsuccessful, people will say, “Well, okay, you’re doing that thing again?” \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n   I think my core ideas are always about articulating space. Even when I’m dealing with a flat representation, whether it’s in print or shown on screen or through a projection, I’m always imagining a space and a movement. There is an idea of some kind of connected gesture that results in form. Typically I’ll be imagining, “What if there was this object or particle that moved like this and then there was another one that had a similar property?” Then I extrude them and I make them into a mesh and I can then look at them either as real 3-D objects – if I’m looking at 3-D printing, for instance –, or I can imagine them only as graphic surfaces, in which case I will prioritize, “How can I render that surface? How can I draw that object in a satisfying graphic way?” If it’s a pure software piece, how is the animation working? How is this gesture continued endlessly? Most of my software pieces don’t have a beginning and end, they just keep on generating. There you find the logic that is interesting enough to look at and to generate different outcomes but you put into it the ability to keep going and keep going. That’s actually quite hard and it’s probably one of the most challenging things to do. Although, of course, making a large wooden sculpture is also really challenging. \n   Absolutely. Can you imagine the impact that something like this has on the viewer or visitor? \n   Yeah. My work is abstract. It’s non-representational. It will mean something different to me than it does to someone else. I find that viewers typically try to name my works. They’re like “The Umbrella” or “The Flower” or this or that. They come up with totally different names. “The Fish.” I think what’s interesting is the fact that because it’s non-representational, even if you name it, you know that they don’t really mean that it’s a fish. The work has to have the story of how it was created in it in a certain way, it needs to hint at the logic that created it. To me, that’s when a piece is successful. If it’s a still print of a system that was actually moving, because it’s always moving when I’m working with it, then it needs to have the story of how it was created in it. I hope that in the mind of the viewer, that story is then reanimated. If it’s successful, I think that’s something that happens. I sure hope it happens. \n   Marius Watz is an artist working with visual abstraction through generative software processes. His work is concerned with the synthesis of form as the product of parametric behaviors. He is known for his hard-edged geometries and vivid colors. \n   \n generator.x \n   code & form \n   unlekker.net"], "link": "http://substratumseries.com/issues/space/marius_watz", "bloglinks": {}, "links": {"http://workshop.evolutionzone.com/": 1, "http://unlekker.net/": 1, "http://www.generatorx.no/": 1}, "blogtitle": "Substratum Series"}, {"content": ["Part of it is feeling a little bit like a magician, where it’s kind of fun to come up with this idea that seems completely ludicrous or insane. We have more possibilities than we can have time for, so it’s quite amazing to suddenly be in this world where we could make a music video or we could make some crazy kind of thing that transforms a cityscape. We can hack into the wiring of a building and control the building. It’s actually like we are in this very lucky position where there’s a million possibilities that we can pick and choose what it is that we can do. \n   When do you first remember thinking of yourself as a designer/artist? How did you end up doing what you do today? \n\n   Emily Gobeille I think for me, when I was quite young. My mom is also an artist, so I think I saw that it was something that you can do. I remember there was a time when she asked my sister if she wanted to be an artist and she said no, she wanted to make money, and I said, “I want to be a starving artist”. \n  \n   Theo Watson I think in terms of the work we do, we sometimes feel like we are somewhere in between the role of a designer and the role of an artist, because some of what we are doing is very practical and really has to kind of make sense, and other things we do are completely ridiculous just for the concept itself and for our own enjoyment in the process. We are kind of trained in it, the background and the designs, but at the same time, some of the stuff we do and the reasoning behind it is more like artists would do things. \n   What excites you about being a designer/artist? Why do you keep doing it? \n  \n   Emily I think just having fun and making playful spaces. Things that we enjoy playing with and make ourselves crack up. \n  \n   Theo It’s moments like when we are sketching out on the back of a beer coaster in a café somewhere, just a little idea that we sort of come up with. And then that feeling two or three minutes later when you actually see it in front of you and it’s the real thing. That sort of feeling is really addictive to actually go from a concept to that thing being exactly it or better than you imagined it would be. \n   What do you think is your most important skill, and why? \n  \n   Emily The ideas. The concept development. But that’s a tough one; you kind of need a full range of skills in order to actually make things happen. \n   Theo I think it’s definitely the ideas in combination with having this kind of slightly insane belief that no matter how crazy the idea is, there’s a way to make it happen. Often people worry too much about whether something is possible or not. For us, the biggest challenge and the most fun part of our work is to have that crazy idea and then try and figure out how to do it. So far, nothing that we’ve come up with we haven’t been able to make, that gives us more confidence to go through with it. \n\n   Emily I think we usually start, like Theo said, at a bar or at a café, on paper, or just through conversation. So it’s not like we are really thinking about things from, “Oh, here is this new piece of equipment that came out. What can we make with it?” It really starts through just talking together. \n   Tell us about the community you’re working in. \n  \n   Theo The main community that we are involved in is the OpenFrameworks community. OpenFrameworks is a tool for creative coding and C++. What’s kind of nice about it is that there are a lot of people who are trying to solve some of the problems we have. There are people who are using it for research, but there are also people using it for art and artistic practice. Often it kind of works both ways. We often contribute code and things we’ve learned through the community, and at other times the community really contributes back to the projects that we’re making. There will be this moment where, “Oh, we need to do this,” and then we’re like, “Oh, I remember someone just posted an add-in for that a couple of days ago, and there’s this other add-in.” Essentially, they’ve saved us weeks of work because I can just quickly hook these things up that someone else has generously given back to the community. So it’s definitely a dialogue, and there is a very tight coupling between the tools that we use and the work that we make. They definitely feed back into each other, and that is definitely part of this bigger community. \n   In what ways does working within a community influence your work? \n  \n   Emily I think it’s hard not to be influenced by the people that you are around and the things that you’re seeing. \n  \n   Theo Sometimes we are like, “Damn it, that’s a really good project. I wish we had thought of that!” I think in that way it pushes us further. It pushes us further because I’m seeing what other people are doing and seeing that things that we might have thought were hard are actually maybe not as hard as we thought, because other people seem to be able to do them. All of that just helps give us more energy and more drive to go forward. \n\n   I think there’s also a little bit of a sense of competition, a kind of healthy competition within the community in the sense that everyone wants to come out with something that surprises everyone else. That part of it is quite fun, because I think it also helps push everyone a little bit further. It kind of forces us to raise our game a little bit. \n\n   Emily I don’t agree with that. Well, for at least the way that I work. I definitely don’t like that whole competitive thing. \n\n   Theo That’s okay… \n  \n   Emily We operate differently. \n   What role does collaboration with others play for your projects? \n  \n   Emily It’s highly collaborative. We’re kind of overlapping. It’s not like Theo does one part and I do another. \n   Theo It’s really a dialogue back and forth. For a typical project, Emily and I will brainstorm some ideas. Then we will start prototyping a little bit and exploring those ideas practically, and at that point it’s really a back and forth process. I will be like, “I’ll hook some ink up”, and then Emily will say, “try this.” There will be some stuff which will be much easier for Emily to design than it is for me to do in code, and vice-versa. Sometimes there’s problematic stuff that I can give to Emily and she can use and give back to me. Once we get started it’s really a continual collaborative process. I think towards the end we’re collaboratively playing and testing the system. I think everything that we do is quite feedback-driven. \n\n   Is it mostly a collaboration between the two of you or do you also collaborate with others? \n\n   Theo Oh, definitely with others. Depending on the projects, we’ll work with other people and as we progressively start doing bigger projects, we’ll have to hire people to work on things. I guess it’s a little bit of like a community thing, because there are often things that we will ask our friends, “Do you know how to do this?” \n   What do you wish to achieve with your work? \n  \n   Emily I want to give people a sense of wonder and delight and surprising them and playing with their expectations and giving them spaces where they can explore and create their own stories. \n  \n   Theo I would say clearly just transforming space, and really getting people’s curiosity and imagination flowing. I think also seeing how people use this stuff, and then learn from that so that we can and put it back into our work. \n   What do you think you can actually achieve with your work, where are the limitations? \n\n   Theo Some of the stuff that we would love to able to do, like doing projections in the daytime outside, are not possible because of the lighting conditions and that is always a little bit frustrating. But I think there’s been a fair amount of stuff where we have been surprised that we have been able to achieve what we thought might not work and that gives you this slightly false confidence, like “Nothing’s impossible, we can do that.” \n\n   I think it’s good to have this “anything is possible” attitude because you can really surprise people and also do stuff that surprises yourself. In a way, the limitations that we run up against are a good thing because having these sets of limitations helps us focus creatively on more creative solutions to the limitations that we deal with. \n\n   Emily I definitely have some ideas in my head that I’m saving until … yeah, it’ll be fun! \n  \n   Do you see any limitations in regards to the people who are interacting with your work? \n\n   Theo Some of our work is designed for children or mainly designed to be used by children, and I think we have seen in some cases that adults are not as willing to be curious and explore a space as children are. \n  \n   Emily They’ll ask, “Am I doing it right?” where it’s really just about jumping in and exploring. \n  \n   Theo I think if you had some sort of interactive wall or interactive floor it was sort of magic or a little bit Voodoo five or ten years ago. Now it’s like, “Oh, I absolutely know what that is,” and it’s kind of funny to see how quickly people are learning. With what we’re doing we always want to surprise people, it forces us to change our approach and not just do the same thing over and over again. \n  \n   Emily Which is nice also. \n  \n   Theo I think in some ways we’re not really aiming for the things we’re doing to be the most inclusive things ever. If we are happy with how it feels and if it has the right energy, we would just rather that people felt comfortable playing with it or experiencing it. We don’t want to dumb it down for the masses. \n   How has your work changed over the years? How did your goals change? \n  \n   Emily When I now look back at things that I’ve designed even a few years ago, I don’t think I’m capable to design that way anymore. I’m just not in the same head space and I sometimes think, “How did I do that?” I think that we are definitely constantly changing. \n  \n   Theo I think we’re both in some ways learning more complex stuff, but at the same time learning to try and be more simple as well. This sort of balance of complexity and simplicity really makes sense for interactive work. \n  \n   Did your goals evolve over time as well? \n   \n   Theo I think they’ve always been. Our goals are quite open ended in a way which is just to make stuff that we are excited about. And that actually changes over time. I think of a lot of the work that we do draws its inspiration from nature because nature is just vastly complex and it has so many aspects to it. I think that’s something that we will never really get bored of. I think we’ll never get to learn as much as we would like to be able to learn. \n   If you had the chance to tackle a really big problem our society is confronted with, what would it be? \n  \n   Theo The first thing that popped into my head is really how people experience space and both how people experience space in terms of inside buildings and also how people experience space in terms of a city or urban planning aspect. I’m really convinced that architecture has a massive responsibility towards the way that it actually affects the people who are growing up in that space. I think it has a huge potential to trigger imagination, to actually even change our daily interactions with people and each other. I would love to see more effort put into thinking about architecture from an education end to sort of spring an elemental perspective. I’m not sure if that is a problem that we’ll be able to solve, but in some ways that’s what we are doing, working on a slightly smaller scale where we’re trying to transform just small – not huge – spaces, where we just transform one or two areas and kind of give people this idea that spaces don’t have to be these static environments, and that there are ways in which we can explore spaces more dynamically. \n\n   Emily That was a good one. \n  \n   Theo When I find architects, I always kind of sit them down and try and lecture them about their responsibilities because I want other people to solve that problem. \n   Emily Gobeille studied art, design and interactive media in Boston and met Theo when she was doing her Master’s at Parsons in the Design Technology Program. Theo Watson has a background in photography and fell in love with the idea of using technology and tools to create weird experiences. \n   \n design I/O \n   Emily Gobeille \n   Theo Watson"], "link": "http://substratumseries.com/issues/space/theo_watson_emily_gobeille", "bloglinks": {}, "links": {"http://zanyparade.com/": 1, "http://design-io.com/": 1, "http://www.theowatson.com/": 1}, "blogtitle": "Substratum Series"}]