[{"blogurl": "http://swedeneurostat.blogspot.com\n", "blogroll": [], "title": "Sweden Statistics"}, {"content": ["Data from Eurostat \n \nLast updated: Oct 24, 2012 \n \n \n \n \n \n \n \n \nUnemployment rate \n \nThe unemployment rate represents unemployed persons as a percentage of the labour force. The labour force is the total number of people employed and unemployed. \n More info »"], "link": "http://swedeneurostat.blogspot.com/feeds/7680499894613410278/comments/default", "bloglinks": {}, "links": {"http://www.google.com/": 2}, "blogtitle": "Sweden Statistics"}, {"content": ["From: Oct 30th 2012, 15:13 by Economist.com \n http://www.economist.com/node/21565525?fsrc=scn/fb/wl/bl/dc/theundeployed \n \n \n A broader measure makes unemployment in Europe look even worse \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUNEMPLOYMENT rates typically count those looking for work but unable to find it. That measure overlooks many who are semi-detached from the labour market, even though they may be willing to work. People who fall into this category might be available to work but not seeking a job, or they might be looking for work but unable to start right away. Together, they number 17.8m in the European Union. This makes the broad measure of unemployment twice as high as its official rate in some cases. Italy alone has 4m of these undeployed workers. Europe's unemployment numbers, which are already bad, look far worse when they are taken into account."], "link": "http://swedeneurostat.blogspot.com/feeds/4011969577477349637/comments/default", "bloglinks": {}, "links": {"http://www.economist.com/": 2}, "blogtitle": "Sweden Statistics"}, {"content": ["From: Eurostat \n Release date: 24-OCTOBER -12 \n \nAround 2 000 asylum applicants more registered in Sweden (SE) and Germany (DE) in Q2 \n2012 compared to the same quarter of 2011 \n \n Figure 3: Asylum applicants, absolute change between Q2 2011 and Q2 2012 \n \n \n \n \n \nSource: Eurostat (online data code: migr_asyappctzm )"], "link": "http://swedeneurostat.blogspot.com/feeds/4494107437211955396/comments/default", "bloglinks": {}, "links": {"http://epp.europa.eu/": 2, "http://appsso.europa.eu/": 1}, "blogtitle": "Sweden Statistics"}, {"content": ["From: Oct 20th 2012 | from the print edition \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nIn the next decade nearly 1 billion women are likely to enter the global labour force. But their economic potential is largely unrealised. According to a report by Booz & Company , a consultancy, if female employment rates matched those of men, GDP would increase by 2% in Sweden , 5% in America and 9% in Japan by 2020. The impact would be even larger for developing countries, home to most of the world’s women who lack adequate education and support (social and political). Increasing female employment would increase GDP significantly in countries like India and Egypt, where female labour-participation rates are below 30%. These countries rank low in Booz’s index of women’s economic empowerment."], "link": "http://swedeneurostat.blogspot.com/feeds/1538909241366487532/comments/default", "bloglinks": {}, "links": {"http://www.economist.com/": 1, "http://www.booz.com/": 1}, "blogtitle": "Sweden Statistics"}, {"content": ["From: Rapporten Svenskarna och Internet 2012 släppt \n https://www.iis.se/press/pressmeddelanden/svenskarna-och-internet-2012/ \n \n(Part of the press release translated by Google below) \n \n \n \nOctober 17, 2012 \nThe daily use of the Internet have increased significantly among children in low-and middle school. Now, over half of Swedish people access the Internet via mobile phones, and even surf the plates begin to spread. This is shown by. SE's annual report Swedes and the Internet released today. \n \nA clear trend in the report Swedes and the Internet 2012 is that Internet use continues to go down the ages. The largest increase is school children in low and middle school for, but half of all three-year olds and two of five two year olds use the Internet. It is also becoming more common to connect via smart phones and tablets. In two years, a further third of the Swedish people gained access to the mobile Internet. Now, more than half of Swedish a connected mobile phone. \n \n- We have seen the trend of the declining age of onset of Internet use for some years now, but every time you shocked that it can continue, says Janne Elvelid, project manager for the Swedes and the Internet. U.S.."], "link": "http://swedeneurostat.blogspot.com/feeds/9086972662759448113/comments/default", "bloglinks": {}, "links": {"https://www.iis.se/": 2}, "blogtitle": "Sweden Statistics"}, {"content": ["Percentage of GDP, average for the period 2009-2011 \nFrom: Ekonomifakta (translated by Google)"], "link": "http://swedeneurostat.blogspot.com/feeds/1286523307648306401/comments/default", "bloglinks": {}, "links": {"http://translate.google.com/": 1}, "blogtitle": "Sweden Statistics"}, {"content": ["A bit more unequal, a lot more efficient \n \n Oct 13th 2012 | from the print edition \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSALTSJÖBADEN, A CHARMING seaside town on the outskirts of Stockholm, has an iconic place in Swedish economic history. The “Saltsjöbaden Accord”, signed there between unions and employers in 1938, ushered in the consensus system of labour relations that remains a pillar of Sweden’s economic model. Nowadays the town is famous for a different reason. It is one of Stockholm’s fanciest suburbs, and the setting for “Sunny Side”, a popular television comedy that pokes fun at the country’s new rich. In the show, Saltsjöbaden’s yuppy residents fret over how to get their babies into the best nursery. A badly behaved child is threatened with banishment to Fisksätra, a poor enclave a few train stops away, where immigrants from 100 countries cram into dilapidated blocks of flats. \n \n The most equal country in the world is becoming less so. Sweden’s Gini coefficient for disposable income is now 0.24, still a lot lower than the rich-world average of 0.31 but around 25% higher than it was a generation ago. That rise is causing considerable angst in a nation whose self-image is staunchly egalitarian. A leftist group caused a media hubbub earlier this year by organising a “class safari” bus tour of Saltsjöbaden and Fisksätra. Opposition leaders insist that the ruling centre-right party is turning Sweden into America. \n \n More...."], "link": "http://swedeneurostat.blogspot.com/feeds/7078032576554397057/comments/default", "bloglinks": {}, "links": {"http://www.economist.com/": 3}, "blogtitle": "Sweden Statistics"}, {"content": ["From: Press Release and Regional yearbook 2012 / Statistical Atlas \n \nThe Eurostat regional yearbook 2012 includes fourteen chapters on economy, population, health, education, labour market, structural business statistics, tourism, information society, agriculture, transport, science, technology & innovation, European cities, coastal regions and territorial typologies. \n \n \n \n \nThe share of R&D expenditure in GDP was 3% or more in 35 regions, which accounted for nearly half of all R&D expenditure in the EU27. Among these regions, eleven were in Germany, eight in the United Kingdom, four in Sweden of which South Sweden was highest (4,73 %) , three each in Denmark and Finland and two each in Belgium, France and Austria."], "link": "http://swedeneurostat.blogspot.com/feeds/8299306696259923542/comments/default", "bloglinks": {}, "links": {"http://epp.europa.eu/": 2, "http://ec.europa.eu/": 1}, "blogtitle": "Sweden Statistics"}, {"content": ["Digital Agenda for Europe - European Commission \n Sweden \n \n \n published by greg greg on Thu, 13/09/2012 - 15:58 \n \n \n \n \nDespite being well above the average penetration EU level, Sweden is the country with the lowest penetration growth rate among the countries of the EU. \n \n \n \n \n \n \n Contribution to 2015 EU targets \n \nExplore graphs: \n \n View country profile | Evolution over time | Analyse an indicator | Compare two indicators"], "link": "http://swedeneurostat.blogspot.com/feeds/1501265582413118566/comments/default", "bloglinks": {}, "links": {"http://scoreboard.lod2.eu/": 4, "https://ec.europa.eu/": 3}, "blogtitle": "Sweden Statistics"}, {"content": ["From: Significance website : The global economy: worse, better or the same? Author:Vasilis Nikolaou http://www.significancemagazine.org/details/webexclusive/2708761/The-global-economy-worse-better-or-the-same.html \nTaking a closer look in Europe’s trade statistics in 2010, we can see that Germany (DE), Europe’s largest economy, had the biggest positive trade balance of €154 billion, followed by the Netherlands (NL) and Ireland (IE) with €44 and €42 billion respectively. Sweden (SE) belongs to a group of countries with smaller surplus. On the other end, the United Kingdom (GB) had the biggest trade deficit of €132 billion followed by France (FR), Spain (ES) and Greece (GR) with negative trade balances of €65, €55 and €32 billion euros respectively. \n \n \n \n \n Read more...."], "link": "http://swedeneurostat.blogspot.com/feeds/9209164893607128376/comments/default", "bloglinks": {}, "links": {"http://www.significancemagazine.org/": 3}, "blogtitle": "Sweden Statistics"}, {"content": ["From: Europe 2020 Strategy – towards a smarter, greener and more inclusive EU economy? - Issue number 39/2012 \n \n \n \nThe publication presents the latest available data on Europe 2020 headline indicators, taking into \naccount the role of Eurostat to ensure the statistical support for the strategy and to produce \nrelevant data that meet high quality standards. To monitor the progress towards Europe 2020 \nstrategy objectives, a set of eight main indicators and three sub-indicators has been developed. \nThe strategy sets the union targets, to be achieved by 2020, while Member States commit their \nnational targets in the National Reform Programmes. The publication presents data on EU-27 \naggregates, individual Member States and where available on the EFTA and the candidate \ncountries, US and Japan. \n \n \n EU target - 75 % of the population aged 20-64 should be employed by 2020 \n \nDifferences between EU Member States are large – in 2011. Greece had the lowest employment rate at \n59.9 % and Sweden the highest at 80.0 %. Austria, Denmark, Germany, the Netherlands and Sweden \nreported employment rate above the EU target of 75 %, while Greece, Hungary, Italy, Malta, Spain, \nRomania, Bulgaria, Ireland and Poland below 65 %. Only Sweden has reached its national target \nof 80%. \n \n \n \n \n \n \nEU target – 3 % of the EU's GDP should be invested in R&D by 2020 \nThe European Union as a whole would have to increase expenditure on R&D by 1.0 percentage \npoint to meet the EU target. In 2010, Finland, Sweden and Denmark reported shares of 3.87 %, \n3.42 % and 3.06 % respectively. \n \n \n \n \nEU target – Increase the share of renewable energy sources in final energy consumption to 20 % by 2020 \nThe share of renewable energy sources in gross final energy consumption in 2010 varied widely \namong Member States, ranging from 0.4 % in Malta to 47.9 % in Sweden. Between 2005 and \n2010, all Member States increased their share of renewable energy. Romania, Estonia and Sweden \nare among the countries which have almost reached their national targets – with 0.6, 0.7 and \n1.1 percentage points respectively still remaining. \n \n \n \n \nEU target – Reduction of poverty by aiming to lift at least 20 million people out of the risk of poverty or social exclusion \nBetween 2005 and 2010, the share of people at risk of poverty or social exclusion declined in about half of \nthe Member States, rose in six and remained almost constant in seven others. The countries showing the \nhighest risk of poverty or social exclusion in 2005 had the strongest reductions by2010. In 2010 at national \nlevel the differences were large - from 14.4 % and 15.0 % respectively for the Czech Republic and Sweden \nto 41.6 % and 41.4 % for Bulgaria and Romania."], "link": "http://swedeneurostat.blogspot.com/feeds/3282536887031665465/comments/default", "bloglinks": {}, "links": {"http://epp.europa.eu/": 1, "http://2.blogspot.com/": 3, "http://1.blogspot.com/": 1}, "blogtitle": "Sweden Statistics"}, {"content": ["Last updated: Sep 24, 2012"], "link": "http://swedeneurostat.blogspot.com/feeds/4683936867218681436/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "Sweden Statistics"}, {"content": ["Sep 20th 2012, 15:35 by The Economist online \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Some countries see an opportunity rather than a threat in China's economic rise \n \nAS THE American presidential election looms, so the electioneering moves up a gear. This week on the campaign stump in carmaking, swing-state Ohio, President Obama announced that the government had filed a complaint against China at the World Trade Organisation for subsidising car-part exports . Mitt Romney accused the president of not going far enough. China, meanwhile, lodged a trade dispute of its own on the same day, alleging duties levied by America on Chinese steel, paper and other products are unfairly high. A Chinese spokesman later stated that China's complaint was lodged first, and that America's filing had a \"political goal\". Nonetheless, a tough China stance is likely to play well in the campaign. Most Americans see China as an economic threat, according to the recent Transatlantic Trends survey by the German Marshall Fund of the United States. Indeed, of the 14 countries polled, only in France did a higher proportion view China as a threat. In contrast, despite being overtaken by China as the world's biggest exporter in recent years, more people in neighbouring Germany see China as an economic opportunity."], "link": "http://swedeneurostat.blogspot.com/feeds/5753243601244538901/comments/default", "bloglinks": {}, "links": {"http://www.wto.org/": 2, "http://trends.gmfus.org/": 1, "http://www.economist.com/blog": 2}, "blogtitle": "Sweden Statistics"}, {"content": ["From: \n http://pejl.svt.se/visualisering/inkomster/skillnader/unga-och-gamla/"], "link": "http://swedeneurostat.blogspot.com/feeds/6504138153217963756/comments/default", "bloglinks": {}, "links": {"http://pejl.svt.se/": 2}, "blogtitle": "Sweden Statistics"}, {"content": ["Education at a Glance 2012 - Key findings \n \n \n \n Education at a Glance 2012 - Key findings from OECD Education"], "link": "http://swedeneurostat.blogspot.com/feeds/905203865207703768/comments/default", "bloglinks": {}, "links": {"http://www.slideshare.net/": 3}, "blogtitle": "Sweden Statistics"}, {"content": ["From: Global Right to Information Rating http://www.rti-rating.org/results.html \n Rating of Legal Framework for Right to Information in 90 Countries \nThe results of the world's first rating of RTI laws in 90 countries shows a significant spread: out of a possible total of 150 points, the range is from 39 points (Austria, one of 30 countries currently pending final review by national experts) to 135 points (Serbia). \n \n More.... \n \n \n \n \n \n \n More..."], "link": "http://swedeneurostat.blogspot.com/feeds/575638193715485268/comments/default", "bloglinks": {}, "links": {"http://www.rti-rating.org/": 4}, "blogtitle": "Sweden Statistics"}, {"content": ["How people are connected on Facebook, by country \n September 11, 2012 to  Mapping  by  Nathan Yau \n \n \n \n \n \n \n \n \nAs part of the Stories initiative that Facebook launched yesterday, an interactive map by Stamen Design shows how people are connected on Facebook , which offers a view into how countries are linked by language and history."], "link": "http://swedeneurostat.blogspot.com/feeds/7314150681131687205/comments/default", "bloglinks": {}, "links": {"http://www.facebookstories.com/": 2, "http://flowingdata.com/": 3}, "blogtitle": "Sweden Statistics"}, {"content": ["Daily chart: Healthy, wealthy and wise | The Economist \n \n \n \n \nSep 11th 2012, 15:07 by The Economist online \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n A college education is good for your well-being and your wallet \n \nTHE benefits of education should not need spelling out. But the OECD’s \" Education at a Glance 2012 \" report published on September 11th provides reams of statistics that do exactly that. It shows that college-educated people live over two years longer, are more likely to vote, and are more supportive of equal rights for minorities. But it is in the job market that the rewards are particularly pronounced. Across the OECD, the 4.7% unemployment rate for people with tertiary education is around one-third less than for those with only upper secondary education (which involves staying at school after the age of 15/16). And the longer one remains in education, the greater is the reward, as the chart below shows. Completing high school generates an extra $4,000 in net income a year on average, and completing college should give another $12,000 on top of that. A college education is most beneficial in America, adding almost $20,000 to income a year (even after tax and social-security contributions)."], "link": "http://swedeneurostat.blogspot.com/feeds/1589131027841330987/comments/default", "bloglinks": {}, "links": {"http://www.oecd.org/": 1, "http://www.economist.com/blog": 1}, "blogtitle": "Sweden Statistics"}, {"content": ["From: http://thewebindex.org/ \n \n \n \n\n\n\n \n \n \n \n \nWhat is the Web Index? \n \nDesigned and produced by the World Wide Web Foundation, the Web Index is the world’s first multi-dimensional measure of the Web’s growth, utility and impact on people and nations. It covers 61 developed and developing countries, incorporating indicators that assess the political, economic and social impact of the Web, as well as indicators of Web connectivity and infrastructure. \n \n Learn more \n \nThe 2012 Rankings \n \n Rank Country Score Impact Readiness The Web \n \n 1 Sweden 100 100 96.76 82.02 \n 2 United States of America 97.31 91.07 94.98 100 \n 3 United Kingdom 93.83 87.86 94.07 94.69 \n 4 Canada 93.42 90.64 84.17 92.22 \n 5 Finland 91.88 86.44 95.78 88.53 \n \n \n See the full 2012 rankings \n \n \n \nIndex Report and Key Findings \n \n \n \nSweden is best in the world at putting the Web to work, beating the US and UK for the top spot. However, the Web remains a largely untapped resource in much of the world, the study shows, with only 1 in 3 people using it globally and fewer than 1 in 6 in Africa. \n \n \n \nThis report highlights some of the 2012 Web Index’s key findings and spotlights several surprise outcomes across the globe. It also provides an overview of the Web Index’s design, structure, and methodology. \n \n View the full report"], "link": "http://swedeneurostat.blogspot.com/feeds/411917645920021246/comments/default", "bloglinks": {}, "links": {"http://thewebindex.org/": 5}, "blogtitle": "Sweden Statistics"}, {"content": ["From: http://www.weforum.org/news/persisting-divides-global-competitiveness-switzerland-singapore-and-finland-top-competitiveness \n \n \n \n \nOliver Cann, Associate Director, Media, Tel.: +41 (0)79 799 3405 oliver.cann@weforum.org \n \n Arabic | Español | Français | Deutsch | Português | 日本語 | 中文 \n \n Competitiveness gap widening among European countries \n US remains world’s innovation powerhouse despite decline in overall ranking \n People’s Republic of China most competitive among large emerging markets; India, Russia fall \n Download the full report profiling 144 economies, highlights, rankings and more at http://www.weforum.org/gcr \n Watch the video interviews on the results of the report \n \n \n Geneva, Switzerland, 5 September 2012 – Switzerland, for the fourth consecutive year, tops the overall rankings in The Global Competitiveness Report 2012-2013 , released today by the World Economic Forum. Singapore remains in second position and Finland in third position, overtaking Sweden (4th). These and other Northern and Western European countries dominate the top 10 with the Netherlands (5th), Germany (6th) and United Kingdom (8th). The United States (7th), Hong Kong (9th) and Japan (10th) complete the ranking of the top 10 most competitive economies. \n \n \n \nThe large emerging market economies (BRICS) display different performances. Despite a slight decline in the rankings of three places, the People’s Republic of China (29th) continues to lead the group. Of the others, only Brazil (48th) moves up this year, with South Africa (52nd), India (59th) and Russia (67th) experiencing small declines in rankings.Despite growing its overall competitiveness score, the United States continues its decline for the fourth year in a row, falling two more places to seventh position. In addition to the burgeoning macroeconomic vulnerabilities, some aspects of the country’s institutional environment continue to raise concern among business leaders, particularly the low public trust in politicians and a perceived lack of government efficiency. On a more positive note, the country still remains a global innovation powerhouse and its markets work efficiently.The report indicates that Switzerland and countries in Northern Europe have been consolidating their strong competitiveness positions since the financial and economic downturn in 2008. On the other hand, countries in Southern Europe, i.e. Portugal (49th), Spain (36th), Italy (42nd) and particularly Greece (96th) continue to suffer from competitiveness weaknesses in terms of macroeconomic imbalances, poor access to financing, rigid labour markets and an innovation deficit."], "link": "http://swedeneurostat.blogspot.com/feeds/5125071365310641918/comments/default", "bloglinks": {}, "links": {"http://www3.weforum.org/": 7, "http://www.youtube.com/": 1, "http://www.weforum.org/": 2}, "blogtitle": "Sweden Statistics"}, {"content": ["From: http://www.who.int/gho/maternal_health/en/index.html \n \nMaternal and reproductive health \n \n \n \n \n \n \n Maternal mortality: Every day in 2010, about 800 women died due to complications of pregnancy and child birth, including severe bleeding after childbirth, infections, hypertensive disorders, and unsafe abortions. Out of the 800, 440 deaths occurred in sub-Saharan Africa and 230 in Southern Asia, compared to five in high-income countries. The risk of a woman in a developing country dying from a pregnancy-related cause during her lifetime is about 25 times higher compared to a woman living in a developed country. Maternal mortality is a health indicator that shows very wide gaps between rich and poor, both between countries and within them. \n \n View interactive map"], "link": "http://swedeneurostat.blogspot.com/feeds/7422885158550707027/comments/default", "bloglinks": {}, "links": {"http://gamapserver.who.int/": 1, "http://www.who.int/": 2}, "blogtitle": "Sweden Statistics"}, {"content": ["Last updated: Sep 6, 2012 \n \n \n \n \n \n \n \n \nPhysicians (per 1,000 people) \n \nPhysicians include generalist and specialist medical practitioners. \n More info »"], "link": "http://swedeneurostat.blogspot.com/feeds/7610551551184783034/comments/default", "bloglinks": {}, "links": {"http://www.google.com/": 1}, "blogtitle": "Sweden Statistics"}, {"content": ["From: http://www.economist.com/content/global_debt_clock?fsrc=scn/fb/wl/bl/globaldebtclock \n World debt comparison \n \n Our interactive overview of government debt across the planet \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nThe clock is ticking. Every second, it seems, someone in the world takes on more debt. The idea of a debt clock for an individual nation is familiar to anyone who has been to Times Square in New York, where the American public shortfall is revealed. Our clock (updated September 2012) shows the global figure for almost all government debts in dollar terms. \n \n Read more...."], "link": "http://swedeneurostat.blogspot.com/feeds/1534515747752308443/comments/default", "bloglinks": {}, "links": {"http://www.economist.com/": 2}, "blogtitle": "Sweden Statistics"}, {"content": ["From: Sep 3rd 2012, 13:05 by The Economist online \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \nGOVERNMENTS labouring to deliver effective crime-prevention policies could do worse than consider divine deterrence. In a paper published this summer in PLoS ONE , Azim Shariff at the University of Oregon and Mijke Rhemtulla at the University of Kansas compared rates of crime with rates of belief in heaven and hell in 67 countries. Citizens of those countries were asked which of heaven and hell they believed in, and each country’s overall \"rate of belief\" was calculated by subtracting the percentage of hell-believers from that of heaven-believers. The researchers found that the degree to which each country’s citizens believed more strongly in heaven than in hell predicted higher national crime rates. It seems that believing more strongly in the forgiveness of sins than in punishment in the after-life may help pave the way for further transgressions. The researchers also noted that the proportion of people believing in heaven almost always outweighed the proportion believing in hell. So a little more preaching on the fiery furnace might be beneficial in this life, if not also the next."], "link": "http://swedeneurostat.blogspot.com/feeds/423659214660559728/comments/default", "bloglinks": {}, "links": {"http://www.plosone.org/": 1, "http://www.economist.com/blog": 1}, "blogtitle": "Sweden Statistics"}, {"content": ["Data from Eurostat \n \nLast updated: Aug 29, 2012 \n \n \n \n \n \n \n \n \nGovernment debt as percent of GDP \n \nGeneral government debt as percent of Gross Domestic Product. \n More info »"], "link": "http://swedeneurostat.blogspot.com/feeds/2177622661479598614/comments/default", "bloglinks": {}, "links": {"http://www.google.com/": 2}, "blogtitle": "Sweden Statistics"}]