[{"blogurl": "http://terahertztechnology.blogspot.com\n", "blogroll": [], "title": "Terahertz Technology"}, {"content": ["http://apl.aip.org/resource/1/applab/v101/i18/p181101_s1?bypassSSO=1 \n  \n I. D. Vugmeyster ,1 J. F. Whitaker 2 , and R. Merlin 1 \n  \n Department of Physics, The University of Michigan, Ann Arbor, Michigan 48109-1120, USA 2 Center for Ultrafast Optical Science, The University of Michigan, Ann Arbor, Michigan 48109-2099, USA \n \n We use GaP to generate terahertz pulses via optical rectification in a collinear phase-matched configuration relying on the dispersion of the refractive index. The GaP-based time-domain system operates up to 8 THz and is especially well suited at high frequencies, where it has high signal-to-noise ratio and power conversion efficiency ∼30 times greater than those of commercial photoconductive emitters. These characteristics are demonstrated in measurements of ZnTe in the reflection geometry. We also discuss the power output and describe theoretically the observed THz field generation by nonlinear mixing, the field's free space propagation, and its detection."], "link": "http://terahertztechnology.blogspot.com/feeds/966041472367303412/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://apl.aip.org/": 1}, "blogtitle": "Terahertz Technology"}, {"content": ["http://arxiv.org/abs/1210.6704 \n \nWe theoretically study the population inversion and negative dynamic conductivity in intrinsic graphene in the terahertz (THz) frequency range upon pulse photoexcitation with near-/mid-infrared wavelength. The threshold pulse energy required for the population inversion and negative dynamic conductivity can be orders-of-magnitude lower when the pulse photon energy is lower, due to the inverse proportionality of the photoexcited carrier concentration to the pulse photon energy and to the weaker carrier heating. We also investigate the dependence of the dynamic conductivity on the momentum relaxation time. The negative dynamic conductivity takes place either in high- or low-quality graphene, where the Drude absorption by carriers in the THz frequency is weak."], "link": "http://terahertztechnology.blogspot.com/feeds/2262587561195045107/comments/default", "bloglinks": {}, "links": {"http://arxiv.org/": 1, "http://2.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["Christopher W Berry and Mona Jarrahi \n \n http://iopscience.iop.org/1367-2630/14/10/105029 \n \nA photoconductive terahertz emitter based on plasmonic contact electrode gratings is presented and experimentally demonstrated. The nanoscale grating enables ultrafast and high quantum efficiency operation simultaneously, by reducing the photo-generated carrier transport path to the photoconductor contact electrodes. The presented photoconductor eliminates the need for a short-carrier lifetime semiconductor, which limits the efficiency of conventional photoconductive terahertz emitters. Additionally, the photo-absorbing active area of the plasmonic photoconductive terahertz emitter can be increased without a significant increase in the capacitive loading to the terahertz radiating antenna, enabling high quantum-efficiency operation at high pump power levels by preventing the carrier screening effect and thermal breakdown. A plasmonic photoconductive terahertz emitter prototype based on the presented scheme is implemented and integrated with dipole antenna arrays on a semi-insulating In 0.53 Ga 0.47 As substrate. Emitted terahertz radiation is characterized in a terahertz time-domain spectroscopy setup, measuring a terahertz pulse width of 590 fs full-width at half maximum in response to 150 fs pump pulses at 925 nm."], "link": "http://terahertztechnology.blogspot.com/feeds/1924767375763150338/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://iopscience.iop.org/": 1}, "blogtitle": "Terahertz Technology"}, {"content": ["http://www.sys-con.com/node/2421446 \n \nAgilent Technologies Inc. (NYSE: A) today announced the opening, at the University of Leeds, of the first Agilent-equipped terahertz measurement laboratory in Europe. The new laboratory will enable research on devices, components, circuits and systems at much higher frequencies than any other institution in the region has been able to do before. \n \nThe lab is set up in memory of professor Roger Pollard, former dean of engineering at the University of Leeds and a long-time friend of Agilent, who passed away at the end of last year. The Agilent 1.1-THz PNA network analyzer is the centrepiece of the new lab. \n \nPeter Jimack, dean of engineering at the university, and Greg Peters, general manager of Agilent’s component test division, formally opened the laboratory. Featured guest speaker professor Giles Davies delivered a keynote presentation on terahertz technology. \n \n“Roger Pollard had a long history of collaboration with Agilent, spanning more than 30 years, and held the Agilent Technologies chair in high-frequency measurements,” said professor Peter Jimack. “We are extremely grateful to Agilent for its continued support and, in particular, for the generous sponsorship of this exceptionally well-equipped laboratory in recognition of Roger’s contribution to Agilent’s success.” \n \nThe PNA THz network analyser supports a broad range of projects in nanoelectronics, complemented by a new electron-beam lithography facility. In the new field of graphene, the network analyser will allow the university staff to perform on-wafer terahertz measurements of transistors, THz biosensors, magnetic storage elements, THz spin-switches and novel acoustoelectric devices. It will also be used to characterise THz passive components such as filters, waveguides, fibres and antennas. \n \n“This laboratory is a fitting tribute to Roger,” said Graham Newton, district manager, UK, for Agilent’s Electronic Measurement Group, “both in terms of providing a location for cutting-edge research as well as reflecting the close relationship Roger had with us over so many years.” \n \n“Roger’s technical brilliance contributed to many innovations in network analyzers, calibration, and measurement science that Agilent brought to the marketplace,” said Henri Komrij, business manager, Component Test Division, Agilent. “His leadership abilities motivated engineers to be more creative, collaborative and innovative. Roger absolutely loved development – of engineering and people. A high-frequency lab named for Dr. Pollard at Leeds, an esteemed university, is a truly appropriate honor for a well-regarded colleague.” \n \n About the University of Leeds School of Electronic and Electrical Engineering \n \nThe School of Electronic and Electrical Engineering is the top electronic and electrical engineering department in the UK, as determined by the 2008 Research Assessment Exercise, which rated an impressive 80 percent of its research activity as internationally excellent or world-leading. The Institute of Microwaves and Photonics has an outstanding pedigree in microwave engineering research going back 50 years and is recognized as one of the very best centers for terahertz electronics and photonics in the world. The faculty of engineering at the University of Leeds is ranked seventh in the UK for the quality of its research (2008 Research Assessment Exercise); an impressive 75 percent of the faculty’s research activity rated as internationally excellent or world-leading. \n \n Institute of Microwaves and Photonics, University of Leeds \n \nThe Institute of Microwaves and Photonics has an outstanding international reputation with a pedigree dating back to 1963. The institute has an extensive research program in the area of microwave, millimetre-wave and terahertz devices, circuits and systems as well as in quantum electronics and bio-nanoelectronics. The institute has excellent microwave and millimetre-wave design, fabrication and measurement facilities including network analysis up to 1.1 THz, a class-100 clean room, MBE growth and a new electron-beam lithography facility. \n \n About Agilent Technologies \n \nAgilent Technologies Inc. (NYSE: A) is the world’s premier measurement company and a technology leader in chemical analysis, life sciences, diagnostics, electronics and communications. The company’s 20,000 employees serve customers in more than 100 countries. Agilent had net revenues of $6.6 billion in fiscal 2011. Information about Agilent is available at www.agilent.com ."], "link": "http://terahertztechnology.blogspot.com/feeds/992473380040607473/comments/default", "bloglinks": {}, "links": {"http://cts.businesswire.com/": 1, "http://www.sys-con.com/": 1, "http://1.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["TeraTOP  \n \n Terahertz Photonic Imager on Chip \n \n \n \n \n \n \n My Note: I try to keep an eye on developments at TeraTop, by checking their webpage intermittently. The last news article posted references a project meeting to be held last February, but nothing has been posted since then (which is accessible to the public at least). The lofty goals of TeraTop, are identified on the webpage below. \n I note that Darpa, is also working in this area, and is getting closer to the development of a solid state THz chip operating at frequencies above 1 THz, and it will be interesting to see if TeraTop can reach the 1.5 THz range by project close in 2014. \n http://www.teratop.eu/node/1 \n \n The impressive developments in the field of electronic imaging based on CMOS Imagers have generated worldwide enormous business opportunities, with revenues of more than $4B in 2009 at the component level alone. Today such Imagers almost solely address the visible and near-infrared part of the electromagnetic spectrum. Many applications would profit from affordable and reliable Imagers for the terahertz band, notably in surveillance and security. \n The goal of TeraTOP is to develop a new high performance, low cost, THz Imager for passive imaging systems ( 0.5-1.5THz ) based on CMOS batch manufacturing processes: A unique combination of several leading technologies will enable a real quantum leap in THz Imaging in terms of performance, size and costs. THz photonics components (THz lens, optical window and filters), THz antennas, CMOS-SOI (Silicon on Insulator) and NEMS are the key enabling building blocks that will be developed and combined to achieve such a breakthrough in functionality (passive, room temperature operation), performance (NETD of 0.5K), component size (THz imager on a chip) and significant cost reduction (< 7000 €). \n The objective is to bring the disruptive technology from the research lab closer to applications, by developing a passive THz Imager for Concealed Weapons Detection. The cost efficient approach will enable a massive deployment of the TeraTOP Imagers, including crowded places, providing therefore a highly efficient response to terrorists' threats. Other applications can be envisioned in medical imaging e.g. skin cancer detection, or astronomy. \n The consortium includes a mix of scientific and technological excellence (University of Wuppertal, the IIT, CEA-Léti), as well as leading industrial research groups (IBM, CSEM) and companies (EADS, QMC). The exploitation activities will be led by the key European industrial partner EADS. This will ensure that the project will target the current security needs and the results will lead to product development and promptly implemented on a wide scale across Europe for the benefit of its citizens."], "link": "http://terahertztechnology.blogspot.com/feeds/5428848390583000705/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://2.blogspot.com/": 1, "http://www.teratop.eu/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["http://www.nature.com/ncomms/journal/v3/n10/full/ncomms2153.html \n \n \n \n Jianqiang Gu , Ranjan Singh , Xiaojun Liu , Xueqian Zhang , Yingfang Ma ,, Shuang Zhang ,  Stefan A. Maier , Zhen Tian , Abul K. Azad ,, Hou-Tong Chen , Antoinette J. Taylor , Jiaguang Han , Weili Zhang \n \n Recently reported metamaterial analogues of electromagnetically induced transparency enable a unique route to endow classical optical structures with aspects of quantum optical systems. This method opens up many fascinating prospects on novel optical components, such as slow light units, highly sensitive sensors and nonlinear devices. In particular, optical control of electromagnetically induced transparency in metamaterials promises essential application opportunities in optical networks and terahertz communications. Here we present active optical control of metamaterial-induced transparency through active tuning of the dark mode. By integrating photoconductive silicon into the metamaterial unit cell, a giant switching of the transparency window occurs under excitation of ultrafast optical pulses, allowing for an optically tunable group delay of the terahertz light. This work opens up the possibility for designing novel chip-scale ultrafast devices that would find utility in optical buffering and terahertz active filtering"], "link": "http://terahertztechnology.blogspot.com/feeds/2544917716458519535/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://www.nature.com/": 14, "http://feedads.doubleclick.net/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["http://www.cmc.ca/en/AboutCMC/SuccessStories/EnergyEnviro/TerahertzBenefitingEnvironmentTeTechS.aspx \n \n \n Founded by Dr. Daryoosh Saeedkia (pictured), TeTechS Inc. draws on the distinctive characteristics of leading-edge terahertz technology to develop unique sensing and imaging solutions. The company’s systems can precisely identify and quantify materials in mixtures and composites by resolving their unique terahertz spectral signatures and fingerprints. Customers’ problems can be solved in ways that cannot be addressed by other approaches such as X-ray and infrared imaging. \n \n \n Dr. Daryoosh Saeedkia’s startup company, TeTechS Inc., is developing a novel terahertz (THz) sensor system that can identify different types of plastics. It will offer an automatic way for recycling plants to separate the dark plastics used in computers, televisions, cell phones and other electronic devices, according to Saeedkia. The system will allow selected types of recycled plastics to be sold to manufacturers— and keep the material out of landfill. That’s where much of it now ends up when people get rid of their old electronics \n \n \n \n \n  \n \n “Currently, there is a mixture of plastics coming  \n \n from the recycling stream. As a mixture, it has \n \n quite a low value for building new products,” \n \n Saeedkia explains. “Value is enhanced when we \n \n are able to separate the mix of plastics according \n \n to polymer type, so that the most appropriate \n \n material can be sold to a manufacturer who will \n \n use it to build a case for a computer or television \n \n set. So the value goes up and the recycling loop \n \n is closed.” \n \n The terahertz band is the wavelength range that \n \n falls between microwave and infrared on the \n \n electromagnetic spectrum. Many materials, \n \n including different types of plastics, have spectral \n \n fingerprints in the THz range. This means that \n \n THz spectroscopy can be used to distinguish \n \n between them. “Materials exhibit unique qualities \n \n when observed in the terahertz band that one can \n \n harness to perform tasks that might not be easy \n \n or even possible to do with \n other technologies,” says \n Saeedkia. \n \n  \n  \n Saeedkia founded TeTechS \n in 2010 and serves as its \n President and CEO. He is \n invigorated by opportunities \n to develop disruptive \n innovation using the unique \n properties of terahertz \n technology and to deliver \n new products to market. \n Based in Waterloo, the \n company presently has four \n full-time employees and is \n bootstrap financing this stage \n of operations. Previously, \n Saeedkia served as the \n chief technology officer of \n T-Ray Science Inc., now \n Verisante (VRS.VN: TSX-V), \n which manufactures medical \n devices. \n Saeedkia began working \n on a terahertz sensor as \n a graduate student at the \n University of Waterloo, \n where he received his \n doctorate degree in 2005 \n and subsequently was the \n coordinator of the university’s \n Microwave and Terahertz \n Photonics Integrated System Lab (MISL). He \n says CMC Microsystems gave him a boost in \n the early stages of the work and helped with \n the fabrication requirements. “We built our very \n first THz chips with outstanding performance \n through CMC Microsystems. They helped us \n get going. It was a great honour and a big help. \n Getting recognition from institutions like CMC \n is confirmation that you are on track. It helps \n you gain confidence.” In 2008, Saeedkia won \n CMC’s Douglas R. Colton Medal for Research \n Excellence in recognition of his research on \n terahertz photoconductive sources, detectors \n and terahertz photonics devices and systems. \n Terahertz sensor systems that will be deployed \n in an industrial setting have to be rugged. They \n also have to be able to do material sensing \n in real time. The proprietary terahertz sensor \n technology developed by TeTechS takes \n advantage of an all-optical-fiber laser light \n delivery system in a compact and regularized \n system architecture. These terahertz \n \n sensors are fabricated on a multi-quantum well \n InGaAs material system suitable to operate at \n telecommunication wavelengths. \n The material system was developed through \n a two-year research collaboration between \n TeTechS and the University of Manchester, UK. \n The THz sensors are packaged in compact fiber \n pigtailed chip enclosures. A laser light is delivered \n to the sensors through optical fibers. \n The company’s products are being developed \n with support from a number of federal and \n provincial agencies. Through discussions with \n several potential customers and partners in the \n recycling industry, Saeedkia is building interest \n in his company’s technology. He also sees \n an opportunity to market terahertz sensors to \n industrial research teams working in other sectors \n or to universities or research centres. “There \n are R&D groups that want to buy an off-the shelf \n sensor such as TeTechS is developing/"], "link": "http://terahertztechnology.blogspot.com/feeds/7011132374407573209/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://2.blogspot.com/": 3, "http://1.blogspot.com/": 1, "http://www.cmc.ca/": 1}, "blogtitle": "Terahertz Technology"}, {"content": ["http://www.businessweekly.co.uk/hi-tech/14695-financial-ace-quits-taptu-for-teraview \n \n \n \n \n Thursday, 25 October 2012 10:53 TONY QUESTED \n \n \n FINANCIAL ACE QUITS TAPTU FOR TERAVIEW \n \n \n \n \n \n \n \n \nTeraView, the Cambridge UK pioneer in terahertz solutions and technology, has appointed a new chief financial officer as it steps up its global growth strategy. \nLynsey Wilson is a senior level finance executive with over 15 years finance and accounting experience focused on the management of technology-based SME’s. \n \nShe joins Teraview from Taptu, where as CFO she was involved in the sale of the company to RSS ad giant Mediafed. \n \nBruce Anderson, the current chief financial officer, is staying on with TeraView as a senior adviser. \n \nDr Don Arnone, TeraView CEO said: “Lynsey’s extensive financial experience across a number of innovative technology companies will clearly enhance TeraView’s management team. \n \n“We are excited to welcome Lynsey and she will be a great asset to our future growth strategy. We also wish to take this opportunity to thank Bruce for his commitment to the company and his substantial contribution to its commercial progress over the past several years.” \n \nTeraView was recently cleared by regulators to start trials of a world-first, hand-held breast cancer probe. With support from the Technology Strategy Board (TSB) and in collaboration with surgeons at Guy’s Hospital in London, TeraView has developed the device as part of the world’s first commercial terahertz medical unit. \n \nIn January, the company secured $5.5m of investment from a consortium of US, Asian and EU based institutional and corporate investors. \n \nTeraView markets itself as the world’s first company devoted to the application of Terahertz light for spectroscopy and imaging. A spin out from Toshiba and Cambridge University in 2001 and employing circa 25 staff, TeraView has been developing the technology across a number of areas and applications and now has equipment in over 20 countries. \n \nHeadquartered in Cambridge, TeraView offers sales and support throughout Europe, North America and the Far East either directly or through a network of distributors. \n \n• PHOTOGRAPH SHOWS: Dr Don Arnone"], "link": "http://terahertztechnology.blogspot.com/feeds/3083623354839929650/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.co.uk/": 3}, "blogtitle": "Terahertz Technology"}, {"content": ["ANTERAL Innovative Antenna and Terahertz Imaging Technologies \n \n \n \n \n \n \n \n \n \n \n \n http://www.anteral.com/news/anteral/TSW-90_sensor \n \n Submitted by anteral on Fri, 26/10/2012 - 13:13 \n \n \nAnteral presents its new encapsulated Terahertz sensor TSW-90 in W-band, with a range of operation from 80 to 100 GHz. This sensor output provides a DC voltage proportional to the power received in the working band. \n \n \n \n Image: The front interface of the TSW-90 sensor. \n \n \n \nThis direct detection sensor includes an LNA before the detector, giving it an extraordinary sensitivity that allows it to be used even for passive applications without the need for a THz illumination source. \n \nThe module includes a front WR-10 waveguide interface, and an SMA connector signal output and 5V supply in its back, simplifying the interconnection with other systems."], "link": "http://terahertztechnology.blogspot.com/feeds/1862057759373053694/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.anteral.com/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["October 30, 2012 2:30PM to 3:30PM \n \n \n \n \nPresenter: \n \n \nDon J. Roth, NASA Glenn Research Center \n \n \n \n \nLocation: \n \n \nBuilding 208, Room C234 \n \n \n \n \nType: \n \n \nSeminar \n \n \n \n \nSeries: \n \n \nNuclear Engineering Division Seminar \n \n \n \n \n \n \nAbstract: \nThis talk covers recent technical efforts in the X-ray micro-computed tomography (uCT) and terahertz areas at NASA Glenn Research Center. The first part of the talk will discuss the uCT work being done for the Advanced Stirling Radioisotope Generator program in which NASA is partnering with DOE, Lockheed-Martin, and Sunpower Corp. The focus of this program is to develop an ultra high efficiency, lower mass Stirling convertor for use with a radioisotope, reactor, or solar concentrator heat source for power on beyond-earth-orbit space missions. A high resolution micro-CT system has been assembled and is being used to provide optimal characterization for ultra-thin wall space components in this program. \n \n \n \nThis talk will discuss many aspects of the development of the CT scanning for this type of component, including CT system overview; inspection requirements; process development, software utilized and developed to visualize, process, and analyze results; calibration sample development; results on actual samples; correlation with optical/SEM characterization; CT modeling; and development of automatic flaw recognition software. In the second part of the talk, the assembly of a terahertz system and its use in computed tomography and reflection modes for NASA thermal and environmental protection system materials will be briefly described. The THz tomography system can inspect samples as large as 0.0283 m3 (1 ft3) with no safety concerns as for x-ray computed tomography. The reflection mode THz capability is being investigated for use in simultaneously characterizing thickness and microstructural quality in coatings with the same set of measurements."], "link": "http://terahertztechnology.blogspot.com/feeds/8260362522455831957/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["http://english.eastday.com/e/121024/u1a6943091.html \n UNIVERSITY researchers in Shanghai have achieved a major breakthrough in \ndetecting gutter oil, which is recycled illegally by some eateries. \n\n The new method has been listed by the Ministry of Health as one of the final \ncandidates that could be adopted nationwide, university officials announced \nyesterday. \n\n A Terahertz (THz) wave is filtered through the oil sample to find out the \nvibration frequency of the oil so as to analyze its ingredients, according to \nthe University of Shanghai for Science and Technology. \n\n The vibration frequency of gutter oil, made from kitchen waste and dead \nanimals, differs greatly from edible oil, researchers said. \n\n \"It only takes one minute for the detection,\" said Zhu Yiming, deputy \ndirector of the university's School of Optical-Electrical and Computer \nEngineering. \n\n The ministry provided more than 70 oil samples to the researchers to check \nand they successfully detected the kind of oil in 90 percent of them. \n\n The portable gutter oil detector will be one of the highlights at the China \nInternational Industry Fair 2012, which will be held at the Shanghai New \nInternational Expo Center from November 6 to 10."], "link": "http://terahertztechnology.blogspot.com/feeds/56763743463273976/comments/default", "bloglinks": {}, "links": {"http://english.eastday.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["http://spie.org/x90791.xml?highlight=x2404&ArticleID=x90791 \n \n \n \n \n \n \nAlexey Kavokin \n \n \n \nPolariton lasers' unusual physical principles make them promising for optical communications and generating terahertz radiation. \n \n \n 23 October 2012, SPIE Newsroom. DOI: 10.1117/2.1201210.004477 \n \n \n \n \nThe word ‘laser’ originally stood for ‘light amplification by stimulated emission of radiation.’ In polariton lasers, the radiation is emitted spontaneously, but it possesses all the characteristic properties of laser light: it is coherent in the first and second order and monochromatic. The concept of polariton lasers was formulated by Imamoğlu and coauthors in 1996. 1 They are based on a type of quasiparticle called the exciton-polariton, which is made of light and matter and occurs in suitably designed semiconductor crystal structures. \n \nExciton-polaritons arise from interactions between excitons (neutral quasiparticles formed from bound electron-hole pairs) and photons (for instance, modes of visible light trapped in a semiconductor structure). Being bosons, exciton-polaritons can form condensates, similar to the Bose-Einstein condensates observed in gases of cold atoms. These condensates, in which large quantities of exciton-polaritons accumulate in a single quantum state, form the basis of the polariton laser. The exciton-polariton lifetime is much shorter than a nanosecond, and they decay by passing their energy to photons, which escape from the crystal. Being generated by identical exciton-polaritons, these emitted photons form monochromatic, coherent light. \n \nPolariton lasers have been realized in semiconductor microcavities: multilayer crystal structures in which light confined between two parallel mirrors strongly interacts with the elementary excitons in the crystal. In 1998, Le Si Dang and coauthors observed polariton lasing at liquid-helium temperature. 2 The first room-temperature polariton laser with optical pumping was realized in 2007 by a collaboration of the Southampton and Lausanne groups. 3 At present, optimized schemes of electrically pumped polariton lasers based on gallium nitride (GaN) microcavities are discussed in the literature 4 (see Figure 1 ). \n \n  \n \n Figure 1. Schematic of an electrically pumped polariton laser based on a gallium nitride (GaN) microcavity with embedded indium gallium nitride (InGaN)/GaN quantum wells (QWs). (Adapted with permission. 4 ) TCO: Transparent conducting oxide. Al: Aluminum. EBL: Electron blocking layer. SiO 2 : Silica. DBR: Distributed Bragg reflector. MQWs: Multiple quantum wells. nid: Nonintentionally doped. FS: Freestanding. \n \n \nPolariton lasers are expected to have lower thresholds than conventional semiconductor lasers. 4 Their output power is quite limited, however, because exciton-polaritons dissociate at strong pumping. Consequently, the area of application for polariton lasers still needs to be defined. Two promising directions stand out: high-speed optical polarization switches and compact sources of terahertz radiation. \n \nOptical polarization switches, or spin switches, enable light of a chosen circular polarization to be switched on and off in an optoelectronic device. Conventional approaches to such switching are typically based on nonlinear optical effects, which require high power and external optical elements. Spin switches based on polariton lasers instead exploit the spin properties of exciton-polaritons and the strong interactions induced between exciton-polaritons by their matter (exciton) component. Like photons, exciton-polaritons have two values of spin polarization, corresponding to left and right circularly polarized light, respectively. The polarization of light emitted by a polariton laser is governed by the spin of its exciton-polariton condensate, which can be controlled by external fields. The first optical spin switches based on semiconductor microcavities were realized by Amo and our coworkers in 2010, with gigahertz switching speeds. 5 A low-power continuous-wave laser primes the system in a ready state so that a little additional ‘probe’ laser light will switch on the polariton laser. Such spin switches are important building blocks for polariton integrated circuits, which would carry information as domains of spin-polarized exciton-polaritons. Polariton integrated circuits would have an advantage of lower energy losses and faster information transfer compared to conventional electronic circuits. \n \nFor the terahertz radiation application, we recently proposed vertical-cavity surface-emitting terahertz lasers based on polariton lasers. 6 Emission of terahertz radiation would be stimulated by a condensate of exciton-polaritons in these devices. Unlike many other types of terahertz laser, this design does not require a waveguide or a laser cavity for terahertz photons, allowing the whole structure to be microscopic. Tuning of the emission frequency may be achieved by shifting the optical excitation beam on the surface of a graded microcavity. Tunable terahertz lasers have wide areas of application in medicine, communication technologies, and security. \n \nPolariton lasers will bring fundamental effects of many-body quantum physics to our everyday life. Their unique physical properties make them suitable for novel types of spin switches and terahertz lasers, which have many applications. The most promising materials for polariton lasing are the wide-band-gap semiconductors GaN and zinc oxide (ZnO), which allow for room-temperature action. We are working toward commercialization of polariton lasers. The next milestones along that path are the experimental demonstration of an electrically pumped polariton laser, the realization of polarization modulators and amplifiers based on polariton lasers, and demonstration of vertical-cavity terahertz lasing. \n \n This work has been supported by the Royal Society and the European Union IRSES (International Research Staff Exchange Scheme) project POLAPHEN (Polarization Phenomena in Quantum Microcavities). \n \n \n \n \n \nAlexey Kavokin \nSchool of Physics and Astronomy \nUniversity of Southampton \n \nSouthampton, UK \nand \nCharles Coulomb Laboratory \nUniversity of Montpellier 2 \n \nMontpellier, France \n \n \nAlexey Kavokin received his PhD at the Ioffe Institute of the Russian Academy of Sciences in 1993. In 1998 he became a professor at Blaise Pascal University in France, and in 2005 he moved to the UK, where he is Chair of Nanophysics and Photonics in the Department of Physics and Astronomy at the University of Southampton. \n \n \n \n \n \n \n \n \nReferences: \n \n1. A. Imamoğlu, R. J. Ram, S. Pau, Y. Yamamoto, Nonequilibrium condensates and lasers without inversion: exciton-polariton lasers, Phys. Rev. A 53, p. 4250-4253, 1996. \n \n2. L. S. Dang, D. Heger, R. André, F. Boeuf, R. Romestain, Stimulation of polariton photoluminescence in semiconductor microcavity, Phys. Rev. Lett. 81, p. 3920-3923, 1998. \n \n3. S. Christopoulos, G. Baldassarri Höger von Högersthal, A. J. Grundy, P. G. Lagoudakis, A. V. Kavokin, J. J. Baumberg, G. Christmann, Room-temperature polariton lasing in semiconductor microcavities, Phys. Rev. Lett. 98, p. 126405, 2007. \n \n4. I. Iorsh, M. Glauser, G. Rossbach, J. Levrat, M. Cobet, R. Butté, N. Grandjean, M. A. Kaliteevski, R. A. Abram, A. V. Kavokin, Generic picture of the emission properties of III-nitride polariton laser diodes: steady state and current modulation response, Phys. Rev. B 86, p. 125308, 2012. \n \n5. A. Amo, T. C. H. Liew, C. Adrados, R. Houdré, E. Giacobino, A. V. Kavokin, A. Bramati, Exciton-polariton spin switches, Nat. Photon. 4, p. 361-366, 2010. \n \n6. A. V. Kavokin, I. A. Shelykh, T. Taylor, M. M. Glazov, Vertical cavity surface emitting terahertz laser, Phys. Rev. Lett. 108, p. 197401, 2012. \n \n \n \n \n  \n \n \n \n \n \n \nCopyright © 2012 SPIE \n \n About SPIE | Author Information | Privacy Policy | Sitemap | SPIEDigitalLibrary.org"], "link": "http://terahertztechnology.blogspot.com/feeds/751365768274888919/comments/default", "bloglinks": {}, "links": {"http://spie.org/": 15, "http://3.blogspot.com/": 1, "http://www.blogger.com/blog": 1, "http://feedads.doubleclick.net/": 2, "http://spiedigitallibrary.org/": 1}, "blogtitle": "Terahertz Technology"}, {"content": ["http://www.darpa.mil/Our_Work/MTO/Programs/THz_Electronics.aspx \n \n Imaging,\nradar, spectroscopy, and communications systems operating in the millimeter\nwave sub-MMW frequency bands have been elusive due to a lack of effective means\nto generate, detect, process, and radiate the necessary high frequency signals.\nIn order to control and manipulate radiation in this especially challenging\nportion of the RF spectrum, electronics must be developed that can operated at\nfrequencies past 1 THz. \n \n The\nsub millimeter wave (sub-MMW) frequency band begins at frequencies above 300\nGHz where the wavelengths become less than 1 mm. Until recently, active\nelectronics using solid-state technologies were unable to access sub-MMW\nfrequencies directly due to insufficient transistor performance. The compromise\nelectronic option was to use frequency conversion to multiply circuit operating\nfrequencies up from millimeter wave frequencies. Such an approach limited the\noutput power level of the devices and the achievable signal-to-noise ratio. It\nalso restricted the devices to relatively large sizes in terms of footprint and\nweight. These limitations and restrictions prevented widespread implementation\nand the subsequent exploitation of the sub-MMW frequency band. The enabling\ntechnology necessary to exploit the sub-MMW band is monolithic microwave\nintegrated circuits (MMICs) that will operate up to THz frequencies. These THz\nMMICs or TMICs, require THz transistors with maximum oscillation frequencies\n(fmax) well above 1 THz. \n \n The\nobjective of the Terahertz (THz) Electronics program is to develop the critical\ndevice and integration technologies necessary to realize compact,\nhigh-performance electronic circuits that operate at center frequencies\nexceeding 1.0 THz. The program will focus on the developments of two critical\nTHz technical areas. \n \n Terahertz\nTransistor Electronics. The program will aggressively develop multi-THz InP HBT\nand InP HEMT transistor technologies to enable TMICs. In addition, THz low-loss\ninter-element interconnect and integration technologies will also be developed\nto build compact THz transmitter and receiver modules. \n \n Terahertz\nHigh Power Amplifier Modules. Compact, micromachined vacuum electronics devices\nwill be developed to produce a significant increase of output power at\nfrequencies beyond 1.0 THz and to radiate this energy at an antenna. \n The success of the THz Electronics program will lead\nto revolutionary applications by enabling coherent THz processing techniques\nsuch as THz imaging systems, sub-MMW, ultra-wideband, ultra-high-capacity\ncommunication links and sub-MMW, single-chip widely-tunable synthesizers for\nexplosive detection spectroscopy. The program manager is Dr. John Albrecht"], "link": "http://terahertztechnology.blogspot.com/feeds/5984066531883438978/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://3.blogspot.com/": 1, "http://1.blogspot.com/": 1, "http://www.darpa.mil/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["http://arxiv.org/abs/1210.5372 \n T. Kampfrath ,  M. Battiato ,  P. Maldonado ,  G. Eilers ,  J. Nötzold ,  I. Radu ,  F. Freimuth ,  Y. Mokrousov ,  S. Blügel ,  M. Wolf ,  P. M. Oppeneer ,  M. Münzenberg \n \n \n \nIn spin-based electronics, information is encoded by the spin state of electron bunches. Processing this information requires the controlled transport of spin angular momentum through a solid, preferably at frequencies reaching the so far unexplored terahertz (THz) regime. Here, we demonstrate, by experiment and theory, that the temporal shape of femtosecond spin-current bursts can be manipulated by using specifically designed magnetic heterostructures. A laser pulse is employed to drive spins from a ferromagnetic Fe thin film into a nonmagnetic cap layer that has either low (Ru) or high (Au) electron mobility. The resulting transient spin current is detected by means of an ultrafast, contactless amperemeter based on the inverse spin Hall effect that converts the spin flow into a THz electromagnetic pulse. We find that the Ru cap layer yields a considerably longer spin-current pulse because electrons are injected in Ru d states that have a much smaller mobility than Au sp states. Thus, spin current pulses and the resulting THz transients can be shaped by tailoring magnetic heterostructures, which opens the door for engineering high-speed spintronic devices as well as broadband THz emitters in particular covering the elusive range from 5 to 10THz. \n \n \n Subjects: Mesoscale and Nanoscale Physics (cond-mat.mes-hall) ; Other Condensed Matter (cond-mat.other) \n Cite as: arXiv:1210.5372 [cond-mat.mes-hall] \n  (or arXiv:1210.5372v1 [cond-mat.mes-hall] for this version)"], "link": "http://terahertztechnology.blogspot.com/feeds/2401170557815382637/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://arxiv.org/": 15, "http://feedads.doubleclick.net/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["http://www.sciencedirect.com/science/article/pii/S0957417412011335  \nLeila H. Eadie \n \n Centre for Computational Intelligence, De Montfort University, The Gateway, Leicester, UK \n Centre for Rural Health, Aberdeen University, Centre for Health Science, Old Perth Road, Inverness, UK \n \n Terahertz reflection imaging (at frequencies ∼0.1–10 THz/10 12 Hz) is non-ionizing and has potential as a medical imaging technique; however, there is currently no consensus on the optimum imaging parameters to use and the procedure for data analysis. This may be holding back the progress of the technique. This article describes the use of various intelligent analysis methods to choose relevant imaging parameters and optimize the processing of terahertz data in the diagnosis of  ex vivo  colon cancer samples. Decision trees were used to find important parameters, and neural networks and support vector machines were used to classify the terahertz data as indicating normal or abnormal samples. This work reanalyzes the data described in Reid et al. ( Physics in Medicine and Biology,  2011, 56, 4333–4353), and improves on their reported diagnostic accuracy, finding sensitivities of 90–100% and specificities of 86–90%. This optimization of the analysis of terahertz data allows certain recommendations to be suggested concerning terahertz reflection imaging of colon cancer samples ."], "link": "http://terahertztechnology.blogspot.com/feeds/2118832931956968177/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.sciencedirect.com/": 3}, "blogtitle": "Terahertz Technology"}, {"content": ["http://proceedings.spiedigitallibrary.org/proceeding.aspx?articleid=1380680 \n Karun Vijayraghavan ; Augustinas Vizbaras ; Robert W. Adams ; Min Jang ; Christian Grasse ; Gerhard Boehm ; Markus C. Amann ; Mikhail A. Belkin \n Room-temperature terahertz (THz) quantum cascade laser (QCL) sources based on intra-cavity difference-frequency generation (DFG) with record THz conversion efficiencies is reported. THz DFG QCLs reported previously are highly inefficient since THz radiation produced more than ~100 &mu;m away from the exit facet is fully absorbed due to high THz losses in the QCL waveguide. Our lasers use a non-collinear Čerenkov DFG scheme to extract THz radiation from the active region. Dual-color mid-infrared quantum cascade lasers with integrated giant optical nonlinearity are grown on semi-insulating (S.I.) InP substrates. A lateral current extraction scheme is used. THz radiation is emitted at an angle into the substrate with respect to the mid-infrared pumps. Since S.I. InP is virtually lossless to THz radiation, this scheme allows for efficient extraction of THz radiation along the whole waveguide length. As a result, our sources demonstrate large mid-infrared-to-THz conversion efficiency and directional THz output. Experimentally, proof-of-principle devices demonstrate a conversion efficiency up to 70 &mu;W/W2 and provide output across a 1.2 - 4.5 THz spectral range.© (2012) COPYRIGHT Society of Photo-Optical Instrumentation Engineers (SPIE). Downloading of the abstract is permitted for personal use only."], "link": "http://terahertztechnology.blogspot.com/feeds/1946431514201129265/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://proceedings.spiedigitallibrary.org/": 1, "http://profiles.spiedigitallibrary.org/": 8, "http://feedads.doubleclick.net/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["http://www.teraoptronics.com/teracam/ \n \nTeraOptronics develops the TeraCam. The TeraCam features TeraOptronics’ unique terahertz imaging technology, enabling the TeraCam to look thru, or detect almost every material. \n \n Key features: \n \n \n \n High-quality terahertz imaging \n Look thru almost every material \n Real-time detection of metal, plastic, fluids etc. \n Adjustable wavelength range: 50 – 3000 µm \n Compact; easy to build in machine vision systems \n Fast, up to 1000 frames per second \n Easy to use \n Cost friendly \n \n \nThe ultrafast exposure time, the ability to operate at high speed and the compactness makes the terahertz camera attractive for (quality) inspection on systems that operate at high speed. The harmless terahertz radiation makes the TeraCam perfectly suitable for sectors like the beverage, agrofood and horticulture industry, or any other application where humans are involved in the product inspection. \n \nThe research and development of the TeraCam is an ongoing process"], "link": "http://terahertztechnology.blogspot.com/feeds/3409068598356699892/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://3.blogspot.com/": 1, "http://www.teraoptronics.com/": 1}, "blogtitle": "Terahertz Technology"}, {"content": ["http://prl.aps.org/abstract/PRL/v109/i16/e166603 \n \n \n \n \n Shuntaro Tani 1,2,* , François Blanchard 2,3 , and Koichiro Tanaka 1,2,3,† \n 1 Department of Physics, Kyoto University, Sakyo-ku, Kyoto 606-8502, Japan 2 CREST, Japan Science and Technology Agency, Kawaguchi, Saitama 332-0012, Japan \n 3 Institute for Integrated Cell-Material Sciences (WPI-iCeMS), Kyoto University, Sakyo-ku, Kyoto 606-8501, Japan \n \n \n \n We investigated ultrafast carrier dynamics in graphene with near-infrared transient absorption measurement after intense half-cycle terahertz pulse excitation. The terahertz electric field efficiently drives the carriers, inducing large transparency in the near-infrared region. Theoretical calculations using the Boltzmann transport equation quantitatively reproduce the experimental findings. This good agreement suggests that the intense terahertz field should promote a remarkable impact ionization process and increase the carrier density ."], "link": "http://terahertztechnology.blogspot.com/feeds/7482897907703966868/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://publish.aps.org/": 3, "http://1.blogspot.com/": 1, "http://prl.aps.org/": 1}, "blogtitle": "Terahertz Technology"}, {"content": ["Yingxin Wang , Ziran Zhao , Zhiqiang Chen , and Kejun Kang \n http://www.opticsinfobase.org/ol/abstract.cfm?uri=ol-37-21-4395 \n \n We present a calibration method for measuring the terahertz pulse energy through a conventional thermal power detector. Short terahertz pulses were generated by mechanically modulating a continuous wave source with a chopper containing a narrow slot and detected by a Golay cell. We use a calibrated calorimeter to monitor the total source power so we can know the terahertz pulse energy in advance. The Golay detector response to rectangular pulses is theoretically analyzed and the peak amplitude of its output signal is found to be the relevant parameter to determine the pulse energy. We accomplish absolute calibration for the pulse responsivity of the Golay cell by examining the linear correlation between the output signal and the incident energy."], "link": "http://terahertztechnology.blogspot.com/feeds/1711488847795411615/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://3.blogspot.com/": 1, "http://www.opticsinfobase.org/": 5}, "blogtitle": "Terahertz Technology"}, {"content": ["The TeraFlash combines TOPTICA’s FemtoFiber smart laser technology with state-of-theart InGaAs antennas.    \n \n \nOct. 16th, 2012     \n \n     TOPTICA introduces the new TeraFlash system, a table-top platform for    time-domain terahertz spectroscopy. The all-fiber design is based on    mature 1.5 μm telecom technology, combining TOPTICA’s established    femtosecond fiber lasers and state-of-the-art InGaAs antennas. Using a    highly precise delay stage, the TeraFlash achieves a peak dynamic range of    more than 70 dB.         Users can choose between a “precise scan” mode and a “fast scan” mode.    In “precise scan” mode a bandwidth of 4 THz and a resolution better than    10 GHz are attained. Alternatively, in “fast scan” mode, a pulse trace is    acquired in only 50 ms. The fiber-coupled antenna modules can be    conveniently arranged, depending on the needs of the experiment.    Integrated in the system is TOPTICA’s FemtoFErb 1560, the most compact    ultrafast laser on the market. The SAM mode-locked fiber oscillator and the    usage of polarization-maintaining fibers ensure a high robustness and    alignment-free, “hands-off” operation.         The TeraFlash system is a perfect solution for applications such as highbandwidth    spectroscopy (e.g. of explosives or liquid crystals) and industrial    process control. \n \n \n     \n Key Features \n \n Versatile time-domain terahertz platform     \n Fiber-coupled InGaAs photoconductive switches     \n High bandwidth > 4 THz, peak dynamic range > 70 dB     \n Selectable resolution: 4 .. 40 GHz     \n Built-in Er:fiber laser with SAM mode-locking technology     (100 mW / 100 fs / 100 MHz)     \n \nMore information at:     \n http://www.toptica.com"], "link": "http://terahertztechnology.blogspot.com/feeds/2865353357774042099/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://2.blogspot.com/": 2, "http://3.blogspot.com/": 1, "http://www.toptica.com/": 1}, "blogtitle": "Terahertz Technology"}, {"content": ["Yasuaki Monnai 1 ,                                                                                                                                                                                               Kristian Altmann 2 ,                                                                                                                                                                                               Christian Jansen 2 ,                                                                                                                                                                                               Martin Koch 2 ,                                                                                                                                                                                               Hartmut Hillmer 3 ,                                                                                                                                                                                       and        Hiroyuki Shinoda 1 \n \n \n 1 Department of Information Physics and Computing, The University of Tokyo, 7-3-1 Hongo, Bunkyo-ku, Tokyo 113-8656, Japan       2 Department of Physics, Philipps University of Marburg, Renthof 5, 35032 Marburg, Germany       3 Institute of Nanostructure Technologies and Analytics, University of Kassel, Heinrich-Plett-Str. 40, 34132 Kassel, Germany       \n http://apl.aip.org/resource/1/applab/v101/i15/p151116_s1 \n \n We demonstrate free-space focusing of terahertz (THz) radiation by scattering plasmonic surface-waves into the air. We use a grating of shallow holes which contains non-equidistant defects which act as scattering centers. The scattering occurs with defined phase delays such that the waves emitted in free-space interfere constructively to form a focus above the waveguide surface. In contrast to conventional lenses, this structure does not require any free-space on its backside and has great potential for integrated THz optics . \n©                           2012                           American Institute of Physics"], "link": "http://terahertztechnology.blogspot.com/feeds/8679245778788324548/comments/default", "bloglinks": {}, "links": {"http://2.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://apl.aip.org/": 1}, "blogtitle": "Terahertz Technology"}, {"content": ["Agnieszka Siemion , Andrzej Siemion , Michał Makowski , Jarosław Suszek , Jarosław Bomba , Adam Czerwiński , Frédéric Garet , Jean-Louis Coutaz , and Maciej Sypek \n \nAbstract \n \n http://www.opticsinfobase.org/ol/abstract.cfm?uri=ol-37-20-4320 \n \n \n \n Passive terahertz (THz) setups require optical elements with large diameters for optimal harvesting of weak signals. High   f    \n\n-number implies sophisticated aspheric designs to ensure optimal resolution and good energetic efficiency. Trial and error testing of such optics is expensive and numerical modeling is time consuming; hence, we propose extremely cheap diffractive lenses for THz made of regular paper. They are easy to manufacture even with large diameters, and the optical function can be easily customized, which can be used for initial experimental testing of THz setups. Characterization of the proposed diffractive lenses with time-domain spectroscopy is presented and discussed"], "link": "http://terahertztechnology.blogspot.com/feeds/652039489270502257/comments/default", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://1.blogspot.com/": 1, "http://www.opticsinfobase.org/": 10}, "blogtitle": "Terahertz Technology"}, {"content": ["http://graphenetimes.com/2012/10/graphene-based-voltage-tunable-coherent-terahertz-emitter/ \n \n \n \nAuthors: S. A. Mikhailov \n \n A portion of the electromagnetic wave spectrum between $\\sim 0.1$ and $\\sim 10$ terahertz (THz) suffers from the lack of powerful, effective, easy-to-use and inexpensive emitters, detectors and mixers. We propose a multilayer graphene — boron-nitride heterostructure which is able to emit radiation in the frequency range $\\sim 0.1-30$ THz with the power density up to $\\sim 0.5$ W/cm$^2$ at room temperature. The proposed device is extremely thin, light, flexible, almost invisible and may completely cover the needs of science and technology in the sources of terahertz radiation. \n \n arxiv.org"], "link": "http://terahertztechnology.blogspot.com/feeds/2238515907659204641/comments/default", "bloglinks": {}, "links": {"http://arxiv.org/": 2, "http://feedads.doubleclick.net/": 2, "http://3.blogspot.com/": 1, "http://graphenetimes.com/": 1}, "blogtitle": "Terahertz Technology"}, {"content": ["http://news.rice.edu/2012/10/10/photonic-gels-are-colorful-sensors/ \n \n Rice, MIT researchers create thin-film polymer metamaterial with potential for many uses \n \n Materials scientists at Rice University and the Massachusetts Institute of Technology (MIT) have created very thin color-changing films that may serve as part of inexpensive sensors for food spoilage or security, multiband optical elements in laser-driven systems and even as part of high-contrast displays. \n \n The new work led by Rice materials scientist Ned Thomas combines polymers into a unique, self-assembled metamaterial that, when exposed to ions in a solution or in the environment, changes color depending on the ions’ ability to infiltrate the hydrophilic (water-loving) layers. \n \n The research was published in the American Chemical Society journal ACS Nano. \n \n The micron-thick material called a photonic gel, far thinner than a human hair, is so inexpensive to make that, Thomas said, “We could cover an area the size of a football field with this film for about a hundred dollars.” \n \n But for practical applications, much smaller pieces would do. “Suppose you want a food sensor,” said Thomas, the William and Stephanie Sick Dean of Rice’s George R. Brown School of Engineering and former chair of the Department of Materials Science and Engineering at MIT. “If it’s inside a sealed package and the environment in that package changes because of contamination or aging or exposure to temperature, an inspector would see that sensor change from blue to red and know immediately the food is spoiled.” \n \n \n \n Such visual cues are good, he said, “especially when you need to look at a lot of them. And you can read these sensors with low tech, either with your own eyes or a spectrophotometer to scan things.” \n \n The films are made of nanoscale layers of hydrophobic polystyrene and hydrophilic poly(2-vinyl pyridine). In the liquid solution, the polymer molecules are diffused, but when the liquid is applied to a surface and the solvent evaporates, the block copolymer molecules self-assemble into a layered structure. \n \n The polystyrene molecules clump together to keep water molecules out, while the poly (2-vinyl pyridine), P2VP for short, forms its own layers between the polystyrene. On a substrate, the layers form into a transparent stack of alternating “nano-pancakes.” “The beauty of self-assembly is that it’s simultaneous, all the layers forming at once,” Thomas said. \n \n The researchers exposed their films to various solutions and found different colors depending on how much solvent was taken up by the P2VP layers. For example with a chlorine/oxide/iron solution that is not readily absorbed by the P2VP, the film is transparent, Thomas said. “When we take that out, wash the film and bring in a new solution with a different ion, the color changes.” \n \n The researchers progressively turned a clear film to blue (with thiocyanate), to green (iodine), to yellow (nitrate), to orange (bromine) and finally to red (chlorine). In each case, the changes were reversible. \n \n \n \n Thomas explained that the direct exchange of counterions from the solution to the P2VP expands those layers and creates a photonic band gap — the light equivalent of a semiconducting band gap — that allows color in a specific wavelength to be reflected. “The wavelengths in that photonic band gap are forbidden to propagate,” he said, which allows the gels to be tuned to react in specific ways. \n \n “Imagine a solid in which you create a band gap everywhere but along a 3-D path, and let’s say that path is a narrowly defined region you can fabricate within this otherwise photonic material. Once you put light in that path, it is forbidden to leave because it can’t enter the material, due to the band gap. \n \n “This is called molding the flow of light,” he said. “These days in photonics, people are thinking about light as though it were water. That is, you can put it in these tiny pipes. You can turn light around corners that are very sharp. You can put it where you want it, keep it from where you don’t want it. The plumbing of light has been much easier than in the past, due to photonics, and in photonic crystals, due to band gaps.” \n \n Co-authors of the paper are Rice research scientist Jae-Hwang Lee and MIT postdoctoral researchers Ho Sun Lim and Joseph Walish. \n \n The work was supported by the U.S. Army Research Office, the U.S. Air Force and the Korea Research Foundation, funded by the Korean government. \n \n \n \n About Rice University \n \n Located on a 300-acre forested campus in Houston, Rice University is consistently ranked among the nation’s top 20 universities by U.S. News & World Report. Rice has highly respected schools of Architecture, Business, Continuing Studies, Engineering, Humanities, Music, Natural Sciences and Social Sciences and is home to the Baker Institute for Public Policy. With 3,708 undergraduates and 2,374 graduate students, Rice’s undergraduate student-to-faculty ratio is 6-to-1. Its residential college system builds close-knit communities and lifelong friendships, just one reason why Rice has been ranked No. 1 for best quality of life multiple times by the Princeton Review and No. 4 for “best value” among private universities by Kiplinger’s Personal Finance. To read “What they’re saying about Rice,” go to www.rice.edu/nationalmedia/Rice.pdf."], "link": "http://terahertztechnology.blogspot.com/feeds/1873951905380302341/comments/default", "bloglinks": {}, "links": {"http://news.rice.edu/": 1, "http://3.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "Terahertz Technology"}, {"content": ["Rohit Singh  , Deepu Koshy George  , Jason B. Benedict  , Timothy Michael Korter  , and Andrea G. Markelz  \n  \n We report the anisotropic terahertz response of oxalic acid and sucrose crystals in the 0.2-3.0 THz range using terahertz time domain spectroscopy on large single crystals. We compare the observed anisotropic response with the response calculated using solid-state density functional theory (DFT) and find good agreement in the orientation dependence and relative intensities of the crystal phonons. It was found that oxalic dihydrate can be reversibly converted to anhydrous by controlled relative humidity. In addition, oxalic acid was found to have a large birefringence with  n = 0.3, suggesting the material may be useful for terahertz polarization manipulation. Sucrose has a smaller birefringence of  n = 0.05, similar to that of x-cut quartz. The anisotropic measurements provide both mode separation and symmetry determination to more readily achieve mode assignment for the more complex sucrose spectrum."], "link": "http://terahertztechnology.blogspot.com/feeds/568965967002167048/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://feedads.doubleclick.net/": 2, "http://pubs.acs.org/": 5}, "blogtitle": "Terahertz Technology"}]