[{"blogurl": "http://blogs.forbes.com/matthewherper\n", "blogroll": [], "title": "The Medicine Show"}, {"content": ["Merck scientist John Renger led the development of a new type of sleep drug. \n \n Starting with the creation of beer over 7,000 years ago, human sleep aids have all worked the same way: by stimulating brain receptors that turn off brain cells. Newer drugs like Valium, Halcion and the bestseller Ambien are all just improvements on this ancient mechanism. \n Now John Renger, a sleep researcher at Merck, thinks his team has created the first new way in millennia to help people get their z’s . \n Merck has done studies in almost 3,000 patients comparing Renger’s pill, suvorexant, with a placebo. The drug helps patients get to sleep perhaps 10 minutes faster and stay asleep 20 minutes longer–not that far out of line with existing therapies and not that much of a marketing advantage. \n But there are tantalizing signs as the FDA prepares to review suvorexant that this drug may be fundamentally different from current sleeping pills like Ambien, Lunesta and Sonata, lacking their rare but troubling side effects, like memory loss and sleepwalking. \n “What we’ve done here is really turn the medical approach to insomnia on its head,” says Renger, “because for the first time in our history we are beginning to understand how the brain controls sleep and waking. Showing that blocking wakefulness allows patients to go to sleep more quickly and to sleep throughout the night, it’s really a sea change.” Renger’s boss, Merck Senior Vice President Darryle Schoepp, calls this “some of the most exciting science I’ve ever been involved in.” \n But if this seems like a clear big pharma success story–creating a breakthrough pill in one of the most-prescribed categories ever–think again. Analysts doubt suvorexant can make a dent now that Ambien, which was prescribed 40 million times last year, is a cheap generic that costs under $2 per pill, 21% of the price of branded sleep drugs. Mark Schoenebaum at ISI Group, a fan of Merck shares, forecasts suvorexant sales of just $350 million in 2016, only 0.8% of Merck’s sales that year. \n That’s why the rest of the drug industry should pay close attention to suvorexant. What happens if new medicines for common ailments like insomnia can’t succeed in a world where 78% of drug sales by volume are for cheap generics and where health insurers and government plans alike are increasingly worried about costs? \n Most of Merck’s rivals have voted already, moving toward premium-priced areas like cancer and autoimmune disease. Merck is continuing not only in insomnia but also heart disease and diabetes. \n The sleeping pill market is particularly ripe for innovation. When Ambien was launched in 1992, Time was running a story, “The Dark Side of Halcion,” which raised a slew of questions about whether the sleeping pill was addictive and dangerous. When the Drug Enforcement Agency classified Ambien as less addictive than Halcion, sales hit $1.8 billion by 2005 before the patent expired. \n Now it’s Ambien’s turn. In 2001 Peter Buck, the guitarist of the socially responsible jangle-pop band R.E.M., went crazy on a British Airlines flight and nearly went to jail; he was saved partly by on-the-stand character testimony from U2′s Bono and by the defense that Ambien had caused his behavior. In 2006 Patrick Kennedy, driving on Ambien, had a terrible car crash that made headlines. Shortly thereafter the FDA added warnings to Ambien’s label saying that the drug did indeed make people go for drives without remembering what they had been doing–they also might scarf ice cream or have sex without remembering it. \n Doctors and regulators say these effects are rare, but the reports keep coming. A story this September in Marie Claire documented cases where sleep-driving on Ambien resulted in DUI arrests–or in drivers escaping vehicular manslaughter charges because they had taken the drug. \n Why might suvorexant be better? All the older drugs turn on brain switches called GABA receptors, present in half of the 1 billion neurons in the brain, causing whole-head drowsiness. Instead, suvorexant turns off a different set of switches, known as orexin receptors, which are involved in waking people up and are only present in 70,000 neurons in a particular place in the brain. \n These orexin cells were discovered from the study of narcolepsy, a disease in which people cannot stay awake, in the late 1990s by Emmanuel Mignot, a Stanford researcher, who found that dogs with a defective orexin receptor gene developed the condition. In humans narcolepsy is an autoimmune disorder that destroys the orexin neurons. Merck is one of a handful of drug companies to try to turn this insight into a sleep drug–and maybe the first to succeed. \n Suvorexant does have critics. Daniel F. Kripke, a doctor at Scripps Research Institute who has long argued existing sleep drugs are harmful, isn’t a fan. He points out that of 521 patients who took the drug in a safety study, 2 had forms of sleep paralysis, which can be a symptom of narcolepsy. Merck says the real severe paralysis that occurs with the disease has not occurred in its trials. \n Mignot says he is “not as worried” as Kripke: “It is always good for patients to have a new drug that works completely differently.” \n Steven Feinsilver at Mount Sinai School of Medicine agrees: “We need some new sleeping pills.” \n But science is one thing and commerce another. In an age where cost containment is the dominant issue in medicine, better drugs–even much better drugs–just may not be as profitable as they used to be. \n “It’s a theoretically huge market,” Schoenebaum says. “That said, competition will be generic, basically free drugs, and insurance companies will likely make life as difficult as possible for Merck.” \n Deep into Sleep \n \nThe $1.6 billion annual U.S. market for insomnia drugs is largely served by generics that all work on the brain in the same way. \n \n Ambien \nAnnual prescriptions: 40 million \nPrescribed four times more often than closest competitor. \n Temazepam/ Restoril \nAnnual prescriptions: 8.5 million \nApproved in 1981, and originally marketed by Sandoz, now part of Novartis. \n Ambien CR \nAnnual prescriptions: 4.7 million \nSustained release Ambien, including generic versions. \n Lunesta \nAnnual prescriptions: 4.3 million \nThe only successful nongeneric sleep drug on the market. \n Triazolam /Halcion \nAnnual prescriptions: 1.2 million \nOnce the biggest sleep drug in the country, now rarely used. \n Rozerem \nAnnual prescriptions: 379,000 \nNew type of sleep drug foundered when found to be ineffective."], "link": "http://www.forbes.com/sites/matthewherper/2012/10/31/can-merck-wake-the-sleeping-pill-market-it-depends-on-ambiens-side-effects/", "bloglinks": {}, "links": {"http://blogs-images.forbes.com/": 1, "http://www.marieclaire.com/": 1}, "blogtitle": "The Medicine Show"}, {"content": ["Yesterday, I had the chance to sit down with Christopher Viehbacher, who has been the chief executive of Sanofi , the fourth-largest drug company in the world, since 2008. A video of the first part of our conversation is embedded in this post. \n Viehbacher has worked hard to stablize Sanofi, a proud French company, as it has faced the expiration of the patents on many of its biggest drugs: best-sellers like Plavix for heart disease and Eloxatin and Taxotere for cancer. Now the company is emerging from the patent cliff with the long-acting-insulin, Lantus, leading the way. \n Sanofi shares are up 50% over Viehbacher’s tenure, slightly less than the S&P. The company reported strong earnings yesterday. Bernstein’s Timothy Anderson wrote in a note to clients that going forward, Sanofi should able to return to uninterrupted revenue and earnings growth, which, according to his modeling, makes the company “unique among its peers.” \n Viehbacher and I talked about surviving the patent cliff, but first I had to ask him about this : A New York Times Op-Ed from three top doctors at New York‘s Memorial Sloan-Kettering Cancer Center saying that Zaltrap, the new cancer drug Sanofi makes with its partner Regeneron, is just too expensive and that the cancer center won’t even offer it to patients. They wrote: \n  The drug, Zaltrap, has proved to be no better than a similar medicine we already have for advanced  colorectal cancer , while its price — at $11,063 on average for a month of treatment — is more than twice as high. \n Viehbacher argues that the Memorial Sloan-Kettering doctors are wrong, and that Zaltrap is worth the money. We shot this video at Oceana, a restaurant in Midtown Manhattan . Afterward, we had lunch; we both had the grouper, which was very good."], "link": "http://www.forbes.com/sites/matthewherper/2012/10/26/sanofis-ceo-on-the-new-york-times-criticism-of-drug-prices-and-surviving-the-patent-cliff/", "bloglinks": {}, "links": {"http://www.forbes.com/": 4, "http://www.nytimes.com/": 1, "http://health.nytimes.com/": 1}, "blogtitle": "The Medicine Show"}, {"content": ["This morning, Pfizer announced that it will spend as much as $700 million (including future milestone payments) to buy NextWave Pharmaceuticals, the maker of a long-acting liquid formulation of methylphenidate, the same drug that was in Ritalin, one of the first attention deficit/hyperactivity disorder (ADHD) drugs. \n From the release : \n NextWave is the developer of Quillivant XR™ (methylphenidate hydrochloride) for extended-release oral suspension, CII, the first once-daily liquid medication approved in the U.S. for the treatment of ADHD, and holds exclusive North American commercialization rights to Quillivant XR. Quillivant XR received approval from the U.S. Food and Drug Administration on September 27, 2012, and is expected to be available in pharmacies in the U.S. in January 2013. \n Quillivant XR was developed in collaboration with Tris Pharma, NextWave’s technology and manufacturing partner. Quillivant XR is built on Tris’ OralXR+ platform \n Pfizer had previously entered into an option and merger agreement with NextWave during the second quarter 2012 and made an option payment of $20 million. Today, Pfizer is exercising its option to acquire NextWave. Under the terms of the agreement, Pfizer will make a payment to of $255 million to NextWave’s shareholders at the closing of the transaction, and NextWave’s shareholders are eligible to receive additional payments of up to $425 million based on certain sales milestones. \n What’s amazing is how much of the new value in the ADHD field has come from new formulations, not new molecules. That’s true for Johnson & Johnson’s Concerta (a long-acting methylphenidate pill) and Shire’s Intuniv (a long acting version of another drug, guanfacine). And now Pfizer thinks there is value in yet another formulation. Concerns about how often stimulants should be used to help people concentrate aside, it’s amazing that this market continues to support premium prices for what are essentially new formulations of generics."], "link": "http://www.forbes.com/sites/matthewherper/2012/10/22/the-molecule-in-ritalin-keeps-generating-revenue/", "bloglinks": {}, "links": {"http://press.pfizer.com/": 1, "http://www.forbes.com/": 1}, "blogtitle": "The Medicine Show"}, {"content": ["Can insurers and hospitals just get along? Traditionally they’ve been –quite naturally — at each other’s throats. But recently I’ve been hearing, again and again, the idea that there is “a new alignment” and that payers and providers can begin to work together. It comes up in discussions about insurers such as Humana and Wellpoint, but also in discussions about electronic health records and the forces influencing the uptake of new medical devices and drugs. I asked Forbes contributor Avik Roy about this new alignment — and found him decidedly skeptical."], "link": "http://www.forbes.com/sites/matthewherper/2012/10/22/a-kumbaya-moment-in-health-care/", "bloglinks": {}, "links": {}, "blogtitle": "The Medicine Show"}, {"content": ["New York Times reporter Gina Kolata does a great job sifting through the wreckage of a federally funded study that failed to show a benefit to dieting and sustained weight loss for people with adult-onset diabetes. At the end, from Harvard diabetes specialist David Nathan, is this: \n Dr. Nathan, though, said the results meant that people with diabetes might have a choice. The group assigned to diet and exercise ended up with about the same levels of cholesterol, blood pressure and blood sugar as those in the control group, but the dieters used fewer medications. \n “That may be the choice we are highlighting,” Dr. Nathan said. “You can take more medications — and more, I should say, expensive medications — or you can chose a lifestyle intervention and use fewer drugs and come to the same cardiovascular disease risk.” \n That’s a pretty shocking idea — that makes diet and exercise merely a way to reduce, but not eliminate, the need for drug treatment. The reality of many chronic diseases, like heart disease and diabetes, may well be that they are unlikely to be treated by diet alone."], "link": "http://www.forbes.com/sites/matthewherper/2012/10/19/what-dieting-merely-lets-diabetes-take-fewer-medicines/", "bloglinks": {}, "links": {"http://www.nytimes.com/": 1}, "blogtitle": "The Medicine Show"}, {"content": ["Shares in Biogen Idec dipped 2.7% not only because the Food and Drug Administration said it would take an extra three months to review its key multiple sclerosis drug, BG-12, but because an Abbott Laboratories kidney cancer medicine that in some ways works similarly to BG-12 failed. Does the FDA have new safety concerns about BG-12? \n Mark Schoenebaum, the analyst at ISI Group, wrote this morning: \n What I wanted to point out was that BG-12 does share some mechanistic traits with Abbott’s bardoxolone (NRF2 pathway). And we know that ABT today announced that bardoxolone’s phase 3 is being stopped for safety reasons. This begs the question:  Did the FDA want more time to think about this issue as it might pertain to BG-12? \n \n Biogen says no. Says spokeswoman Amanda Galgay: \n No. To our knowledge the PDUFA delay announced by the FDA and Abbott’s announcement are completely unrelated, independent events. BG-12 and bardoxolone are unrelated chemical entities with distinct chemical structures. In regard to safety, as you  know, the safety profile of BG-12 has been evaluated in multiple studies including two, large completed phase 3 clinical trials that were recently published in the New England Journal of Medicine, as well as an ongoing extension trial in MS."], "link": "http://www.forbes.com/sites/matthewherper/2012/10/18/biogen-says-its-fda-delay-unrelated-to-abbotts-failed-medicine/", "bloglinks": {}, "links": {}, "blogtitle": "The Medicine Show"}, {"content": ["The wall of Centrum (Photo credit: Furryscaly) \n \n A new study shows that taking Centrum Silver, a top-selling multivitamin, can reduce men’s risk of getting cancer by 8%. It’s the kind of result that can give anyone who follows medical news whiplash. Just a year ago, a study in women showed that certain vitamins not only don’t help but can increase the rate of death. What gives? \n Studies of vitamins over the past decade have been “quite variable,” says Raymond DuBois, a professor of cancer medicine at M.D. Anderson Cancer Center and a former president of the American Association of Cancer Research (AACR). In context, that 8% decrease in risk over such a long period of time is not that large, though obviously better than nothing. Getting people to exercise regularly, avoid cigarettes, sun exposure, and other known carcinogens would have a much bigger and immediate impact in reducing cancer cases. Half of cancer cases are thought to be preventable by avoiding known risks, he argues. \n “This is a case of a statistically significant but not particularly impactful result,” notes George Sledge, an oncologist at Indiana University and a past-president of the American Society for Clinical Oncology. “The reduction in cancer incidence is small but real, but at the end of the day no one lived any longer.” \n The new study, published in the Journal of the American Medical Association and presented at a medical conference held by the AACR, has several big advantages over previous trials, and is the best-conducted study of multivitamin use conducted to date. It is a randomized controlled study, meaning that similar patients were assigned at random to either get either Centrum or placebo. This is the gold standard for medical research, because it means that whether or not they got the multivitamin was the only difference between the drug and placebo groups. \n “It’s a trial that shows how we can and should obtain evidence about what to eat and what not to eat and which supplements to take,” says Christian Gluud, head of the Copenhagen Trials Unit at the Copenhagen University Hospital. But though he has nothing but praise for the way the study was conducted and reported, he notes that this statistical significance is only borderline. “It’s clear there was a benefit, but it could be anything from a 14% decrease in risk to an 0.002% decrease in risk of cancer. Any trial should be seen as just a piece of evidence and therefore I would say we need further randomized trials of similar size and similar duration of follow-up before anyone should take therapeutic action on these results,” he says. \n Jaakko Mursu, the epidemilogist at the University of Eastern Finland who was lead author on the study showing vitamins could even be a little bit harmful, says the new result doesn’t change his overall take on the totality of the data. “My opinion is that there is no clear evidence for either benefits or harmful effects,” he writes via email. \n For every 100 people who took the vitamins for 10 years, Mursu says, taking Centrum would reduce the number of cancers from 18.3 to 17; put differently, Murku says, you’d have to treat 83 people for 11 years to avoid one cancer case. As Sledge and Dubois both noted, that is a very small impact on the number of cancers, and taken with all the other research that has been done it’s difficult to make a clear recommendation about what patients should do. \n Dubois would like to see studies that focus specifically on patients who have some vitamin deficiencies — and to figure out exactly which subset of patients are getting the benefit. But at the end of the day the decision to take a vitamin is probably a personal choice. There is unlikely to be great benefit or great harm in doing it. At the end of the day, people take these pills as much because they like to, because it gives them some measure of control over their health. (I’m not sure I believe in the mental benefits of taking fish oil, but I’m taking it every day because I think it improves my mood; if that’s a placebo effect, I’ll take it.) \n This study is good news for Pfizer , which makes Centrum. Recent studies have piled on negative results that there aren’t benefits for taking a multi-vitamin; even if this study doesn’t change the scientific consensus, it does change the public narrative about vitamins. You might not think that would matter much to Pfizer, which is gigantic. But sales of Centrum are probably in the high hundreds of millions per year, and this will help them stay there or grow. Because vitamins aren’t protected by patents, this is a steady, and valuable, revenue stream for the company. \n Updated from original post with additional reporting. \n Related on Forbes: \n see photos  Click for full photo gallery: 10 'Healthy' Habits That Drain Your Bank Account"], "link": "http://www.forbes.com/sites/matthewherper/2012/10/17/studies-on-vitamins-likely-to-give-patients-whiplash/", "bloglinks": {}, "links": {"http://www.forbes.com/": 4, "http://jama.jamanetwork.com/": 1, "http://www.flickr.com/": 1}, "blogtitle": "The Medicine Show"}, {"content": ["During the debate, I and several other Forbes writers were providing coverage on Twitter. My contribution was pretty simple: I asked two questions, and let folks on Twitter help me answer them. \n When Governor Romney said that before Barack Obama’s election gas prices had been $1.85 per gallon, a claim to which Obama acquiesced, I thought that number was incredibly low. And when Governor Romney said that creating stable marriages could decrease assault weapon violence, I wondered if any studies showed that connection. On both question, other folks on Twitter had the data to set me straight. \n On gas prices : Eric Milgram pointed me to Wolfram Alpha , which showed that the average price of gasoline was $3.70 a gallon in October 2008, but had dropped as low as $1.90 by December of that year before rising again. I’ll leave it to energy policy writers to explain why. \n On assault weapons and marriage: Reuters heath reporter Andrew Seaman  pointed me to a  study showing that the number of one-parent homes in a state did not correlate with the number of gun violence deaths. The one predictor was prevalence of firearm ownership in that state. (Great use of the NIH’s pubmed.org database, Andrew.)  Reader Andrew Egan  followed up with this paper , which reviews the evidence of whether marriage itself, or other factors, influences how well children do. Thanks for the fact-checks, guys."], "link": "http://www.forbes.com/sites/matthewherper/2012/10/16/debate-fact-check-via-twitter-gas-prices-assault-weapons-and-marriage/", "bloglinks": {}, "links": {"https://twitter.com/": 3, "http://t.co/": 3}, "blogtitle": "The Medicine Show"}, {"content": ["I recently taped a series of video debates with Avik Roy, a long-time Forbes contributor and, more recently, a Manhattan Institute fellow and adviser to Mitt Romney’s presidential campaign. One thing we talked about was Avik’s recent column arguing that Romney’s plan is better than Obamacare for those with pre-existing conditions . He doesn’t speak for the Romney campaign. \n One thing I wish I’d noted: that Politifact rated Romney’s debate claim that his plan would cover people with pre-existing conditions “mostly false .” What Romney plans, as Avik describes, is to strengthen the protections of the 1996 HIPAA law to help make sure people who are continuously insured or who lose their insurance for a short time. \n The guts of Politifact’s ruling are here: \n Romney said his health care proposals include protections for pre-existing conditions. What he didn’t say at the debate — but which his website states and advisers confirmed after the debate — is that people would be protected from denial only if they have been continuously insured. \n The health care law, though, offers protections whether people have current coverage or not, so it offers more robust protection. The law also includes a requirement that everyone have insurance or pay a tax penalty. Romney’s plan doesn’t have that requirement. \n I think I understand Avik’s fundamental argument: it’s that, in the long-term, it would be better if insurance were no longer linked to employment. This, a result of laws about wages in World-War-II-era America, is one of the original sins of the U.S. health care system. He feels that fixing this problem would make the insurance market more of a free one, and that market forces would fix things for the insured. By contrast, simply expanding coverage could be bad for those people by making the whole system even more insolvent. \n But I don’t think this is what any average person means by “better for those with pre-existing conditions.” What people mean when they say “better for people with pre-existing conditions” is that people with pre-existing conditions will face fewer or no obstacles to coverage. Graded on that point alone, and not on the broader context of what this means for health care, it’s pretty clear that ObamaCare is better. \n I agree with Avik that the tax rules that led to health insurance being linked to employers is one of the original sins of the U.S. health care system; the other would be the decision to pay for just about everything on a fee for service basis, which means more care is more profitable even if it is not better. But I think it’s an open question whether fixing those problems will immediately lead the system we have to self-correct. \n Really, I think the basic positions of both campaigns are fairly clear. The Obama administration wants to control costs, but thinks that in order to do that it’s necessary to get more healthy people into the system. The Romney campaign wants to get more people access to health care, but believes in order to do that one must fix the problems that are leading costs to go out of control. Basically, I think the differences are summed up effectively by this graph from the Journal of the American Medical Association . As you can see, the projections on cost are not that much different on Medicare, and show a big difference on Medicaid. Only Obam’s plan increases spending on new private insurance. I think this is a pretty fair summary of the basic positions of both campaigns: One is about access first, and tries to use that power to lower costs later;  the other is about making sure costs are controlled, in the hopes that lower costs will make it possible to expand access later."], "link": "http://www.forbes.com/sites/matthewherper/2012/10/16/no-romneycare-is-not-better-for-people-with-pre-existing-conditions/", "bloglinks": {}, "links": {"http://blogs-images.forbes.com/": 1, "http://www.forbes.com/": 1, "http://jama.jamanetwork.com/": 1, "http://www.politifact.com/": 1}, "blogtitle": "The Medicine Show"}, {"content": ["Biogen CEO George Scangos \n For the past few months, I’ve been working on a big project with a team of some of the smartest people at Forbes – our first-ever health care conference, hosted by Steve Forbes himself. It will be held here in New York City on the evening of December 4 and all day on December 5. Click here for the conference website . \n The theme of the day will be how unshackling market forces can help us face up to some of the biggest problems facing our society: not only ballooning health care costs but also the epidemics of Alzheimer’s, obesity, and diabetes that help drive them. These challenges are among the greatest opportunities available to entrepreneurs, and innovators, and they require smart, mindful regulation. Some of the top minds in health care will talk about how to fix current health care institutions with greater transparency and accountability. Others will introduce the new, disruptive technologies that are likely to be part of any future solution. And that effort will get disparate voices into the same room. Here’s a sampling of what to expect. \n  J&J's Paul Stoffels \n Can An Entrepreneurial Spirit Transform Drug Discovery? Inventing new medicines has never been harder. Already, all major pharmaceutical companies are spending billions of dollars in research and development for every drug they manage to get to market, and the discovery effort is only getting more expensive. The cost of inventing a new drug is doubling every nine years, an exponential increase that one analyst has called “Eroom’s Law” for the way it turns Moore’s Law, the driver of the computer industry’s productivity, on its head. How do we get pharma’s innovation engine humming again? We’ll ask some of the top executives in drug R&D, starting with two who have helped run both hungry startups and established giants: George Scangos, who founded and for 14 years ran the small biotech firm Exelixis before taking the reins at Biogen Idec, one of the first and biggest biotechnology companies, as it emerged, resurgent, from several years of doldrums; and Paul Stoffels, who helped create the antiretroviral cocktails that made HIV a chronic disease, founded an HIV drug startup called Tibotec, and now serves as Chief Scientific Officer for Johnson & Johnson, one of the largest medical research enterprises in the entire world. \n  Former Aetna CEO Ron Williams \n Making Health Insurance Price Transparent. What if health care were a consumer product? When a car is sold, the customer and the dealer are both aware of the price. Why can’t the same bargaining process occur between health insurers and their customers? This question bothers Steve Forbes, and he will lead a discussion of how transparency can lead to affordability and accessibility. Among his panelists: Ron Williams, the former chairman and chief executive of Aetna; Simon Stevens, the President of Global Health at United Health Group; and John Driscoll, the chief executive of Castlight Heath, a company whose entire business plan relies on X-raying doctor’s bills so the rest of us can understand them. \n  Jonathan Rothberg \n - DNA Sequencing — A Disruptive Force Seeks Its Purpose . The cost of DNA sequencing has been dropping faster than the number of transistors you can put on a microchip. That kind of velocity can transform entire industries. And now, as the cost of a human genome drops below $2,000, we’re starting to see this technology used not just in research but in real medicine, diagnosing rare genetic diseases, targeting cancer drugs, and perhaps even helping us to figure out why infants are in the neonatal intensive care unit. What’s next? Some of the greatest minds in the field will tell us, including Jonathan Rothberg, the chief executive of Life Technologies’ Ion Torrent division, who has twice kick-started new arms races in the DNA sequencing business, and George M. Church, the Harvard University visionary who has been one of the leading inventors and users of DNA-sequencing, analyzing, and synthesizing technology over the past three decades. \n  George Church \n - When Enemies Become Allies In The War On Health Costs . We’ve found a case of an insurer and a hospital system working together. The results are stunning. \n -We’ll also be unveiling our list of the 30 most important people under 30 in health care at the event, and we’ll ask the attendees to collaborate with us on another list, to discover health care’s biggest disrupters. \n \nThat’s just a taste. We also plan to look deep into the regulation of drugs, devices, and genetics at the Food and Drug Administration; to examine how wireless technologies could transform the relationships between doctors and patients; and how huge troves of data – and the ability to analyze them – could help us make our health care system better. I’ll be detailing more of our plans in this space over the coming weeks. \n Anyone interested should shoot me an email. Tickets to this event can be purchased by invitation only. To ask for one, email Chelsea Norton  at cnorton[at]forbes[dot]com.  Highlights of the day will be made available on Forbes.com."], "link": "http://www.forbes.com/sites/matthewherper/2012/10/16/first-ever-forbes-health-care-conference-to-focus-on-transparency-and-transformation/", "bloglinks": {}, "links": {"http://blogs-images.forbes.com/": 5, "http://www.forbes.com/": 1, "Mailto:cnorton@forbes.com.": 1}, "blogtitle": "The Medicine Show"}]