[{"blogurl": "http://spittoon.23andme.com\n", "blogroll": [], "title": "The 23andMe Blog"}, {"content": ["We plead guilty to occasionally geeking out on genetics, so it’s nice to see when someone else does it too. \n In September, Moment Magazine got all nerdy and wrote about their Great DNA Experiment , in which they look at the 23andMe results of 15 notable Americans of Jewish ancestry and make some interesting genetic connections. It’s a good illustration of how our DNA can tell us about our interconnectedness. \n The piece shows it’s not “six degrees” that separates these individuals from each other, but, in all but one case, no degrees of separation. This means that these individuals are all directly related to one another, albeit in most cases distantly. This was also news to the 15 participants. \n All but one of the individuals has Ashkenazi Jewish ancestry. The one exception is Linda Chavez, the political commentator, who descended from Conversos, indivduals of Jewish and Muslim ancestry who converted to Catholicism during the Inquisition. Her ancestors eventually settled in New Mexico. But even in her case, although she isn’t directly related to any of the group, she is connected to each of the others individuals focused on in the piece by just one other individual in the 23andMe database. \n The connections shown in the article are what prompted The New York Times columnist David Brooks and NPR “All Things Considered” host Robert Siegel to joke about learning they were distant cousins, sharing a common ancestor several generations back. Brooks kidded that he was “most surprised that our ancestors worked together on National Schetl Radio, on a program called ‘All Pogroms Considered.’” (Maybe the line needs a drum roll to work.) \n The article shows the genetic connections between people like Mayim Bialik, the actress on the Big Bang Theory, and Stephen Dubner, co-author of Freakonomics. Or the connections between NPR’s Siegel, and Harvard Law professor, Alan Dershowitz, or his connections to 23andMe’s CEO’s mother Esther Wojcicki, a journalist and teacher. The magazine shows the connections and the amount of shared DNA, measured in centimorgans (cMs), to illustrate the “relatedness” of any two individuals. More closely related individuals share more DNA. \n So why is all this interesting? \n It is a very specific example of unexpected connectedness. We’ve written about this interconnectedness before . We’ve even seen unexpected connectedness among 23andMe employees . Even in cases with people who have vastly different backgrounds and experiences, one can use genetics to create a short chain of people to connect any two individuals to each other. A little geeky, yes, but pretty cool nonetheless."], "link": "http://blog.23andme.com/ancestry/using-23andme-to-make-connections/", "bloglinks": {}, "links": {"http://www.npr.org/": 1, "http://blog.23andme.com/": 3, "http://www.momentmag.com/": 1}, "blogtitle": "The 23andMe Blog"}, {"content": ["(Editor’s note: We’ve heard from some of you about issues with the new app. We’re addressing many of those now. For updates and more information go here . Thanks.) \n Because we know your genes are made for walking, we’ve added a new 23andMe mobile app . \n Available as a download on Apple’s iTunes App Store and on Google Play , the application allows you to contribute to research, access your health results and explore new genetic discoveries at 23andMe. \n We got a lot of help from the smart developers at Scal.io , who were able to bring our signature style to the new app. \n But the application isn’t just for 23andMe customers; anyone can explore the world of genetics on the go. \n Part of 23andMe’s mission is to give people access to their DNA, and this is just another way to put that information at people’s fingertips. Over time we hope to improve the app as we get more feedback from customers. \n Along with giving customers access to their DNA, 23andMe wants to educate people about the science around genetics. We try to do that in a way that’s fun and engaging. So with this app we streamlined the 23andMe experience and pumped-up the fun factor with some quirky questions about things like tongue curl and whether you like whiskey. \n Of course there’s science behind everything we do and these questions help us return relevant information to customers about what makes them unique. \nSo take a gander over to our mobile page, try out the new app , and make some discoveries of your own."], "link": "http://blog.23andme.com/news/23-a-go-go/", "bloglinks": {}, "links": {"http://spittoon.23andme.com/": 1, "http://scal.io/": 1, "http://itunes.apple.com/": 1, "https://customercare.23andme.com/": 1, "https://www.23andme.com/": 3, "https://play.google.com/": 1}, "blogtitle": "The 23andMe Blog"}, {"content": ["What would you do if you found out that you had a rare and possibly life-threatening genetic mutation? You’d probably talk to relatives about your family medical history.  You’d likely visit your doctor and maybe a specialist.  You might even change your diet and exercise routines. Arnab Chowdry did all that and more. Arnab worked with other researchers to uncover the biological ramifications of the genetic mutation he carries and is presenting the findings at a national meeting of geneticists. \n Arnab is a Senior Manager of Platform R&D at 23andMe and recently discovered he carried a variant in the MYBPC3 gene that is associated with familial hypertrophic cardiomyopathy (HCM) .  This was sobering news; HCM is most common cause of sudden cardiac death in young athletes by thickening the heart muscles and interfering with blood flow. As he has blogged about, his particular genetic mutation is considered a “variant of unknown significance.” That is just another way of saying the scientists don’t know very much about it. As a scientist himself, however, Arnab was in a position to change that. \n \n  \n You, too, can contribute to research! How? One easy way is to answer the research surveys at 23andMe. \n Not yet a customer? Visit our store ! \n \n Over 160 other 23andMe customers also carry Arnab’s mutation.  Arnab, however, wasn’t able to verify the connection between HCM and the mutation in the 23andMe database because most people do not know their HCM status. Often a person doesn’t know they have the condition until it is too late, making association studies difficult. \n Instead of studying the mutation in individuals, Arnab simplified the equation by considering the effect of the mutation in just isolated cells.  He teamed up with Mohammad Mandegar from the Gladstone Institute , an independent research institute that focuses on biomedical research.  Mandegar and his team are creating cells that contain Chowdry’s mutation and hope to see how this mutation impacts cell function. \n In keeping with 23andMe’s dedication to sharing its research discoveries with the broader scientific community, Chowdry will be presenting the initial findings from his and Mandegar innovative collaboration at the upcoming annual American Society of Human Genetics (ASHG) conference.  His poster illustrates how science can move forward when individuals own their genetic data."], "link": "http://blog.23andme.com/23andme-research/researcher-investigates-his-own-genetic-mutation/", "bloglinks": {}, "links": {"http://www.23andme.com": 1, "http://www.23andme.com/": 1, "http://www.ashg.org/": 1, "http://blog.23andme.com/": 1, "http://gladstoneinstitutes.org/": 1, "https://www.23andme.com/": 2}, "blogtitle": "The 23andMe Blog"}, {"content": ["This past summer researchers announced they’d discovered a rare genetic variant that may be protective against Alzheimer’s disease. Alzheimer’s is an important topic among 23andMe customers so naturally they asked for more information about the variant. \n After a review of the research,  we recently released a new Preliminary Research report on Alzheimer’s that covers this rare protective variant. The report is considered preliminary because the finding still needs to be confirmed by the broader scientific community. While our report is preliminary and only a very small number of people have this protective variant, the research is interesting nonetheless because of what it may say about the disease. \n The variant is not found in the APOE gene, which is the most well-established genetic risk factor for the disease. (23andMe’s Established Research report on Alzheimer’s estimates genetic risk for customers with European ancestry based on variants of the APOE gene known as e2, e3, and e4.) Rather, the variant is located in a gene called APP. Rare mutations in APP are known to cause familial and early-onset forms of Alzheimer’s, but this particular variant is associated with lower risk for the disease. The study was done on more than  3,000 people with Alzheimer’s disease and about 9,000 people over the age of 85 without the disease. All of the participants were from Iceland. The results showed that the T version of rs63750847  — also known as the A673T variant in the APP gene — was associated with about five times lower odds of Alzheimer’s. \n \n Loading… \n \n <> \n This is a very rare variant with only one person in 10,000 of European descent having the variant. But the finding is very intriguing to researchers and drug-makers. The disease-causing mutations in the APP gene lead to an overproduction of beta amyloid protein in the brain, a hallmark of Alzheimer’s. The protective variant appears to do the opposite, according to the study. New drugs built on this finding could help protect against Alzheimer’s, or even the mental ravages of normal aging. \n Previous posts related to Alzheimer’s disease: \n• World Alzheimer’s Day \n• Genetics and the Risks from Traumatic Brain Injuries \n• SNPWatch: Do These Genes Make My Brain Look Big? \n• 23andMe Launches Health Report on Alzheimer’s Disease \n• Studies Identify Five More Genetic Variants Associated with Alzheimer’s"], "link": "http://blog.23andme.com/health-traits/a-genetic-variant-protective-against-alzheimers/", "bloglinks": {}, "links": {"http://www.nature.com/": 1, "https://www.23andme.com/": 4, "../health-traits/big-questions/gauging-the-risks-of-traumatic-brain-injuries-with-genetics/": 1, "../health-traits/news/announcements/23andme-launches-health-report-on-alzheimers-disease/": 1, "../health-traits/23andme-research/snpwatch/snpwatch-do-these-genes-make-my-brain-look-big/": 1, "../health-traits/world-alzheimers-day/": 1, "../health-traits/23andme-research/snpwatch/studies-identify-five-more-genetic-variants-associated-with-alzheimers/": 1}, "blogtitle": "The 23andMe Blog"}, {"content": ["The Genetic Alliance , a nonprofit health advocacy organization, is asking for support to expand people’s right to their own health information by giving them direct access to their clinical laboratory test results. \n 23andMe supports this position and several of our employees are signing-on to a letter the organization has put together advocating the rule change. If you agree, we’d like to encourage you to sign as well. \n Here’s a few reasons why: \n We believe people need quick and convenient access to test results so they can better manage their own health. We believe people should have the same right to access  their lab results as they do to their other medical records. And we believe that by giving people a simple way to access these records, it will improve the level of care and produce better health outcomes. \n This proposed change is a long time coming. About a year ago, 23andMe submitted comments along with more than 150 others to the Department of Health and Human Services about a proposed federal rule change ( CMS-2319-P ) that amends the current quality standards that are part of the Clinical Laboratory Improvement Amendments of 1988 — known as CLIA. The change specifies that, upon a patient’s request, the laboratory must provide access to completed test reports. \n These changes are part of a series of reforms governing access and privacy around health records. About a dozen years ago, changes were first made that gave people access to their health information. Another change made a few years later gave people the right to obtain those records electronically, but because of a fluke in overlapping regulation, the rules didn’t apply to laboratory test results. \n In addition to that rule, another related to Medicare and Medicaid only permitted the release of lab results to “authorized persons,” a term that doesn’t include patients themselves. The proposed change will correct these quirks in the law and give people the access to all their health records. \n Beyond the fact that a person should have the right to their own health information, there are a lot of other very good reasons for access. We’ve mentioned a few already, but the Genetic Alliance’s detailed letter gives plenty more including: saving money by avoiding redundant testing; giving patients the ability to quickly access this information in an emergency; and preventing harm by informing people of issues they might not have learned without access to their test results. \n We invite anyone else who supports this guarantee for access to their clinical laboratory test results to sign on. If you or your organization wish to sign onto the letter below, send your name, credentials if applicable, title and organization to: Barbara Wilkinson <bwilkinson@geneticalliance.org \n Thank you."], "link": "http://blog.23andme.com/news/23andme-supports-better-access-to-health-records/", "bloglinks": {}, "links": {"": 1, "http://geneticalliance.org/": 1, "http://blog.23andme.com/": 3, "http://www.reginfo.gov/": 1, "http://www.regulations.gov/": 1, "http://www.gpo.gov/": 1, "http://www.fda.gov/": 1}, "blogtitle": "The 23andMe Blog"}, {"content": ["A common refrain for critics of direct to consumer genetic testing is that the tests could cause unnecessary worry. \n Those critics believe that for some tests the results shouldn’t go directly to a consumer and instead be delivered by a doctor or genetic counselor. We believe that a person shouldn’t have to go through someone else to access their own genetic information, if they want it. \nAt a conference earlier this month in Boston, social scientist Cinnamon Bloss, Ph.D. talked specifically about whether these tests induce fear. \n Several studies indicate they don’t. \n “A major concern raised regarding these tests is the possibility they will lead to high levels of anxiety in consumers who receive estimates of high genetic risk,” said Bloss , last year after one of those studies was published . “But our data suggest this is not the case.” \n Bloss, from the Scripps Translational Science Institute , spoke at the Fourth Annual Consumer Genetics Conference about studies the institute did that showed that few consumers reported heightened anxiety from the tests. While not many people in the Scripps’ study said the tests resulted in a change in their diet or exercise, about a third of those tested shared their information with a doctor within a year and a majority said they found the information useful. \n  \n Earlier this month we gave a much-warranted nod to Holly Dunsworth , who wrote about the tendency in some coverage of genetics to play on people’s fear instead of illuminate issues. \nThere have been several studies into this very issue, and, so far, all have agreed that people can handle the truth about their genetics. They also want to know. \n Fear, or more accurately the potential anxiety surrounding the results of a genetics test, is an issue that can actually be studied. The studies done so far agree that genetic testing doesn’t induce high levels of fear and anxiety in those who choose to get tested."], "link": "http://blog.23andme.com/23andme-research/few-worry-about-genetic-testing/", "bloglinks": {}, "links": {"http://spittoon.23andme.com/": 2, "http://blog.23andme.com/": 1, "http://www.stsiweb.org/": 3, "http://www.nature.com/": 1, "http://www.consumergeneticsconference.com/": 1, "http://www.medpagetoday.com/": 1}, "blogtitle": "The 23andMe Blog"}, {"content": ["As we near our goal of enrolling 10,000 patients in 23andMe’s Parkinson’s research community , we are ever more eager to share what we are doing. \n Last month our CEO, Anne Wojcicki, along with our Parkinson’s research manager Emily Drabant, went to Washington D.C with two friends of 23andMe — Maryum Ali, a Parkinson’s activist and daughter of Muhammad Ali, and Rich Clifford, a former NASA astronaut who has become another powerful voice on behalf of patients. \n The main motivation for going to Washington was to explain 23andMe’s Parkinson’s research initiative. Although we’ve been around for awhile, many people, particularly in Washington, just don’t know about our research model or understand what is so different about it. Anne explained research model and our broader mission, while Rich and Maryum gave the patient’s perspective. \n \n \n \nOver the course of their time in D.C., Anne, Emily, Rich and Maryum were able to meet with the Congressional Parkinson’s Caucus, as well as individual senators and representatives to discuss the need for more research into the disease. \n They also hosted a briefing on crowd-sourcing cures and the future of Parkinson’s disease research. During the briefing, held at the House of Representatives’ Visitors Center in September, Anne gave a quick primer on 23andMe’s unique research platform and in particular our Parkinson’s research initiative , now the largest Parkinson’s community for genetic research in the world. \n Working with the Muhammad Ali family, the Michael J. Fox Foundation and others 23andMe has created an engaged community that has quickly helped to make breakthroughs, including finding two new genes associated with Parkinson’s. \n During her presentation, Anne quoted Haydeh Payami, a New York State Department of Health neurodegenerative disease researcher, who said our research model could significantly accelerate disease research. \n “What 23andMe did in a matter of years would have taken several decades and tens of millions of dollars” if done conventionally, she said . \n The visit to D.C. offered a chance to explain how our research model engages individuals and allows them to come together, share information and participate in research. The model has accelerated the pace of research and engaged people in the process. \n “People want to help each other,” and participate in research, Anne said. And they want access to their own genetic data to learn about their health, traits and ancestry. \n Maryum Ali, whose father Muhammad Ali has battled Parkinson’s since 1984 and who recently joined forces with 23andMe to help encourage more patients to join the research initiative, said the research model offers incredible promise. \n “So many discoveries that can be made through this kind of research,” she said. \n For Rich Clifford , a former NASA Astronaut who flew on the Space Shuttle Atlantis two years after getting his own diagnosis for Parkinson’s, said that 23andMe offers people an opportunity learn of their genetic risk for the disease giving them a chance to take steps to do something about it. \n “I’m all about early detection,” he said. \n The earlier someone learns of their risk the more they can do, Rich said. \nBecause of new treatments much can be done to mitigate the effects of the disease if it’s detected early. \n The visit accomplished what we hoped by introducing some of the policy makers in Washington to 23andMe and the possibilities of our research into Parkinson’s. \n Check out some of our other recent posts on Parkinson’s: \n• Why Not Participate? One Patient’s Perspective \n• 23andMe’s Latest Publication Shines Light on Male Pattern Baldness and Unexpected Associations with Disease \n• 23andMe and Parkinson’s: Past, Present, and Future \n• The State of the Science of Parkinson’s Research"], "link": "http://blog.23andme.com/23andme-research/in-washington-talking-about-parkinsons-research/", "bloglinks": {}, "links": {"http://discovermagazine.com/": 1, "http://spittoon.23andme.com/": 1, "http://blog.23andme.com/": 4, "http://theastronautssecret.com/": 1, "https://www.23andme.com/": 3}, "blogtitle": "The 23andMe Blog"}, {"content": ["For decades, a patient’s family health history has been a keystone to any wellness plan. \n A simple record of medical conditions your siblings, your parents, aunts, uncles and grandparents struggled with can help you and your doctor know what to watch for to keep you healthy. Like family health histories, genetic testing also offers people insights they otherwise might not have about their own health. \n Unfortunately there has often been a false division between family health histories and genetic testing where the approaches are portrayed as opposing alternatives. We’ve written about this before here and here . It’s an odd argument. No one would juxtapose the utility of a stethoscope against a thermometer. They are both useful in their own way. \n A new paper in PLoS Genetics by 23andMe shows that neither family health histories nor genetic testing is perfect in predicting health risks, but they each have their strengths. \n More importantly using them together improves upon the risk prediction by capitalizing on the situations where each method is at its strongest. Along with making comparisons between family health history and genetic testing to make risk prediction, the paper describes a model to combine the two methods together to assess risk. \n Lead author and 23andMe scientist Chuong “Tom” Do, Ph.D, worked with our senior medical director Uta Francke, MD, and scientists David Hinds, Ph.D., and Nicholas Eriksson Ph.D. to make a comprehensive comparison of family health histories and genetic testing to assess risk for 23 different conditions. \n “We show that family history is most useful for highly common, heritable conditions,” Tom said. \n So for relatively common diseases that may have many genetic and environmental factors — coronary artery disease, for instance — knowing that your father had the disease is helpful at predicting whether or not you might be at risk for the same condition. \n But for less common diseases with many genetic factors influencing them, knowing your family history seldom helps in making a risk prediction, said Tom. \n In part, that’s because these diseases are uncommon enough that they would rarely show up in the health history of your immediate family. When family histories are uninformative, genetic testing may still reveal the genetic variants that would put you at a higher or lower risk for the condition. So for example Crohn’s disease might not show up in a family history, but the risk prediction from a genetic test is relatively strong. As an aside there is also the issue of people who simply don’t know their family health history. And we’ve written about how genetic testing can alert them to risks they wouldn’t have otherwise suspected. \n To be fair, even though new genetic discoveries are being made every day, only a fraction of the genetic contributions to whether or not a person develops a disease is currently known in many cases. But even after accounting for this, existing genetic testing — that use single nucleotide polymorphism (SNP)-based methods to determine risk for some rare complex diseases — are already as good at predicting risk as family histories for common heritable conditions. \n “These results indicate that for a broad range of diseases, already identified SNP associations may be better predictors of risk than their family history-based counterparts, despite the large fraction of missing heritability that remains to be explained,” Tom writes in the paper. \n Finally, it’s important to remember that having a family history for a disease is generally not the same as a diagnosis. Just because your mom had diabetes doesn’t mean that you will get it too.  But knowing that you’re at increased risk based on family history can be a motivating factor in helping you to make appropriate lifestyle changes.  In much the same way, knowing your genetic risks can also be useful in helping you live healthier."], "link": "http://blog.23andme.com/23andme-research/using-genetics-and-family-history-for-health/", "bloglinks": {}, "links": {"http://spittoon.23andme.com/": 1, "http://blog.23andme.com/": 3, "http://www.plosgenetics.org/": 1}, "blogtitle": "The 23andMe Blog"}, {"content": ["Dave Hinds is a Principal Scientist in Statistical Genetics.  \n 23andMe is passionate about research on a group of rare blood disorders called myeloproliferative neoplasms, or MPNs. Physicians who study these disorders consider them to be blood cancers, though individual prognoses can vary widely — some people have shortened life expectancy while others live for decades. We recently reached our goal of enrolling 1,000 individuals into our MPN Research Initiative and are excited about the discoveries that are possible with such an amazing program. \n Some of the first discoveries stemming from this initiative will be presented at the upcoming American Society of Human Genetics (ASHG) conference, this year hosted in San Francisco. \n 23andMe scientist David Hinds * will present results from a web-based study aimed at discovering new genetic variants associated with MPNs. In the first nine months after launching our study, 800 individuals with an MPN diagnosis supplied DNA by simply spitting into a tube. Although larger groups of patients are usually needed to produce meaningful results, we were still able to replicate known associations between inherited variants in the JAK2 gene and forms of MPN known as “JAK2 V617F-positive MPN”. (These genetic variants are reported to 23andMe customers in our MPN Preliminary Report ). \n \n \n Participate in Research \nThe results presented in this post demonstrate that web-based participation can contribute to genetic research for rare diseases, which are usually difficult to study because so few individuals have them. 23andMe offers a variety of ways for people with and without rare diseases to contribute to research — all it takes is a little bit of spit and the willingness to answer web-based questionnaires. What you get back is the knowledge that you’ve personally helped move science forward. \n  Find out how you can contribute to research . \nNot yet a customer? Visit our store! \n \n The DNA from these same 800 individuals also allowed us to make new discoveries. Dr. Hinds will report a novel association between MPNs and a variant in the TERT gene, which codes for a protein called telomerase reverse transcriptase. Other variants in the TERT gene, which are highly correlated with the variant that we discovered, have been previously associated with a variety of cancers. This is an interesting finding because it suggests common biological pathways are involved in both MPNs and other cancers. \n These findings are just the first of many to come from our MPN research initiative. We now have the largest broadly genotyped MPN cohort in the world and are excited to continue delving into the data. We’ll be sure to keep you posted along the way! \n *This study is possible because of our collaborators and unpaid advisors to 23andMe’s MPN Scientific Advisory Board : \n • Dr. Jason R. Gotlib, Associate Professor at Stanford \n • Dr. Ruben A. Mesa, Director of the Acute and Chronic Leukemia Program and Chair of the Division of Hematology & Medical Oncology at the Mayo Clinic \n • Dr. James L. Zehnder, Associate Professor of Pathology and Medicine ( Hematology) at Stanford \n Additional members of the 23andMe Research Team also contributed to this work. \n Related posts: \n• 23andMe Partnering with Patients \n• A Milestone in the Fight Against MPNs Marks a Moment to Reflect \n• Fighting Rare Blood Cancers \n• SNPwatch: The “Jist” on JAK2 and Myeloproliferative Neoplasms"], "link": "http://blog.23andme.com/23andme-research/novel-genetic-findings-for-myeloproliferative-neoplasms/", "bloglinks": {}, "links": {"http://spittoon.23andme.com/": 6, "https://www.23andme.com/": 7, "http://www.ashg.org/": 1}, "blogtitle": "The 23andMe Blog"}, {"content": ["Not everyone would embrace their inner caveman, but in today’s Slate Ann Gibbons sure did. \n Gibbons , who also writes for Science , is the author of the book The First Human: The Race to Discover Our Earliest Ancestors . Over almost two decades, she’s delved into the discoveries around human evolution. \n In her Slate piece she writes about getting tested by 23andMe. While she was interested in her European ancestry, what really drew her in was the portion of her results that showed she has 2.9 percent Neanderthal DNA. \n For someone who has spent years writing about the march of mankind from our earliest ancestors to the emergence of modern humans, finding a tangible link to the past is powerful stuff. The PBS show NOVA scienceNOW recently aired a piece that nicely crafts a story about what it means to humans to share Neanderthal DNA. \n For a lot of us here, although Neanderthals disappeared long ago, it’s most intriguing that their DNA continues to live on in all non-African people. It may be that the DNA of other prehistoric human groups also are intermixed in our own DNA. Much like with Neanderthals, scientists extracted ancient DNA from the skeletal remains of another ancient cousin known as the Denisovans . The remains — a finger bone — was found in a cave in Siberia, showed that Denisovans were cousins of Neanderthals, who lived in Asia and disappeared about 40,000 years ago. Their DNA is found today in Melanasians. \n As for Neanderthals, 23andMe launched our popular Neanderthal Lab about a year ago. It allows customers to determine what percentage of their DNA is Neanderthal. A typical range is between 1 percent and 4 percent with the average being about 2.5 percent, but there are outliers, who have much more. \n Check out these posts about Neanderthals and Humans: \n• Did Humans and Neanderthals Have Sex? \n• Find Your Inner Neanderthal \n• New Evidence Suggests Humans and Neanderthal Interbreeding \n \n  \n Got Neanderthal DNA? \n 23andMe customers can find their inner Neanderthal or at least how much Neanderthal DNA they have at 23andMe Ancestry Labs . Not yet a customer? Visit our store !"], "link": "http://blog.23andme.com/ancestry/more-on-23andmes-neanderthal-lab/", "bloglinks": {}, "links": {"http://www.pbs.org/": 2, "http://www.slate.com/": 1, "http://blog.23andme.com/": 3, "http://spittoon.23andme.com/": 2, "http://www.anngibbons.com/": 1, "https://www.23andme.com/": 3, "http://www.amazon.com/": 1, "http://news.sciencemag.org/": 1}, "blogtitle": "The 23andMe Blog"}]