[{"blogurl": "http://lovestats.wordpress.com\n", "blogroll": [], "title": "The LoveStats Blog"}, {"content": ["If you want to choose the right statistic for the numbers in your dataset, you need to know what kind of numbers you’re dealing with. This handy table will help you differentiate between nominal, ordinal, interval, and ratio data. Enjoy, but don’t lick the screen! \n \n Tagged: interval , nominal , nominal ordinal interval ratio , ordinal , Ratio"], "link": "http://lovestats.wordpress.com/2012/10/31/a-halloween-chocolate-lesson-in-nominal-ordinal-interval-and-ratio-data-mrx/", "bloglinks": {}, "links": {"http://lovestats.wordpress.com/": 6}, "blogtitle": "The LoveStats Blog"}, {"content": [". \nApparently, you can tell a lot about a book just by looking at its cover. If that’s so true, then let’s have a look at the books on my bookshelf and see if they say anything about me. \n On the top shelf, we have a few books by my favourite author, W.O. Mitchel (Who Has Seen the Wind), a few books that were dear to me in my childhood ( A Little Princess , Velveteen Rabbit), and a number of books that were passed down through my family (Ontario Public School Hygiene, 1919 – which, by the way, highly recommends bathing at least once per week). \n The next shelf contains every Oliver Sacks book (except the new one that is coming out in a couple weeks), every book from the Best American Science Writing series (except most of them which are sitting in a stack being reread for the fiftieth time by my bed), and a number of Steven Gould and Jay Ingram science books. \n The next shelf, which is actually missing from this image, is all cookbooks. Much of the Companies Coming series, and various other bread, cookies, muffins, sweets recipe books. Because one book specializing in cookies is simply insufficient. \n Then we come to another shelf completely full of cookbooks. These ones are nonstandard sizes, and not part of any series. There are a few main course books here but I can guarantee you I didn’t buy those. The emphasis remains, shockingly, on things with sugar. \n The last two shelves reflect one topic – gardening. There are lots of specialty books – ponds, shade, small gardens, bog gardens, succulents, xeroscaping. There are also a number of big fat heavy comprehensive books to cover everything that just might not be covered in the other gardening books. \n And that’s just bookshelf #1. \n Tagged: bookshelf , Jay Ingram , Little Princess , Oliver Sacks"], "link": "http://lovestats.wordpress.com/2012/10/26/whats-on-my-bookshelf/", "bloglinks": {}, "links": {"http://www.oliversacks.com/": 1, "http://lovestats.wordpress.com/": 5, "http://en.wikipedia.org/": 3}, "blogtitle": "The LoveStats Blog"}, {"content": ["If I can’t be there in person, I’ll certainly be there in spirit. MRMW Asia is sure to be a great event given the line up of speakers and topics in a fascinating city. And though I’d go to every session if I was there, if I could only see three, these are the three that I’d pick. \n I’d love to see Frank Kelly’s presentation on the use of mobile devices in different countries. Canada, where I’m from, is known for its multiculturalism but that doesn’t mean I’ve had the opportunity to step into the homes and experience the lives of people who are so different from me. Anytime we can gain a better understanding of the differences between cultures means our research results will be better and more relevant to the right people. Even better, it means that as humans, we’ll have an increased understanding and more empathy for each other. And we all know we need more of that on this planet. \n  Self portrait via mobile for a facial coding exercise \n I’m also thrilled to see that ethics and standards are on the agenda twice, first with a solo session by Mark Michelson and second with a panel moderated by Michelson. As a social media researcher, I see the problems of loose standards and ethics day in and day out. Companies have been charged with deceiving consumers, consumers have been furious over their loss of privacy, and clients have given up on methodologies because multiple vendors have misled them about validity and capabilities. This isn’t good for anyone, and certainly not good for an industry that prides itself on fairness and honesty. I’d love to see Ho, Ooi, Niles, and Foreman take a hard stand for consumer privacy and research ethics. \n And last, I’d love to see Pankaj Jha’s presentation on facial coding. As a past Psychologist, I know there is validity behind the theory of facial coding. I know that researchers are also getting better at transferring the theory of facial coding into valid practice, though we aren’t there quite yet. If that’s not enough, let’s just see if we can take something that is already difficult and make it even more difficult by going mobile. Hopefully, the mobile picture I took of myself thinking about this conference will be easy to code – good lighting, clear expression. I’m sure every consumers’ image will make it this easy for Jha. \n To those fortunate enough to be attending, keep the rest of us in the loop with your blog posts and tweets. We’ll be anxiously waiting for them! \n Related articles \n \n The 6 Worst Market Research Mistakes #MRX (lovestats.wordpress.com) \n Market research in popular culture (mriablog.wordpress.com) \n \n Tagged: ethics , Frank Kelly , mrmw , Pankaj Jha"], "link": "http://lovestats.wordpress.com/2012/10/25/if-i-could-only-pick-three-mrmw-mrx/", "bloglinks": {}, "links": {"http://lovestats.wordpress.com/": 7, "http://www.mrmw.net/": 1, "http://mriablog.wordpress.com/": 1}, "blogtitle": "The LoveStats Blog"}, {"content": ["There are a few sides to the loyalty card argument.  The consumer arguments go like this: \n \n I LOVE loyalty cards! I get great discounts at all kinds of stores and I save tons of money! Give me another one! \n I HATE loyalty cards! I don’t need ten more plastic cards taking up space in my wallet just so I can have the price that something should have been all along! \n \n \n And the retailer argument goes like this: \n \n I LOVE loyalty cards. It’s a mutually beneficial partnership between me and my loyal consumers. My consumers understand that we are offering great deals on products in return for a bit of information. The cards let me track the behaviours of individual people people right down to the SKU level. They let me know when and where and how often and how much each person buys of every single thing. Now that I can predict people’s household size, number of children, age of household members, race, religion, and education, I can plan my sales and discounts to encourage them to buy products they don’t usually buy. \n \n But the bigger problem with loyalty cards is this. Consumers don’t TRULY know what’s going on behind the loyalty cards. Consumers don’t truly know that those loyalty cards mean their every move is being tracked. Consumers don’t truly know that every purchase they make is monitored and analyzed and fed back into the great shopping machine that dictates which ads and sales will show up in their inbox and at their doorstep. Consumers don’t truly know that the local grocery stores and clothing stores and electronic stores have algorithms that accurately predict every aspect of their personal lives. Consumers don’t know that their information from one store is getting matched up with information from another store creating an even more precise and eerily creepy description of their household. \n Just like every Terms of Service and Privacy Policy out there, loyalty card agreements are too long, too difficult to read, too vague, and too easy to misinterpret for us to assume that consumers get what they’re signing up for. Retailers like to think they’re offering up a partnership where both parties benefit. But when one party doesn’t understand the whole picture, it’s not a partnership. It’s simply a business. Are you offering a partnership or running a business? \n Tagged: Loyalty program"], "link": "http://lovestats.wordpress.com/2012/10/24/the-loyalty-card-misconception-mrx/", "bloglinks": {}, "links": {"http://commons.wikipedia.org/": 1, "http://lovestats.wordpress.com/": 1}, "blogtitle": "The LoveStats Blog"}, {"content": ["LinkedIn is a popular business social network where people can connect for work related online networking. There are lots of philosophies on who you should connect or LinkIn with but most people fall into one of three main camps. \n \n I only LinkIn with people I know \n I LinkIn with anyone (LION) \n I LinkIn with anyone who meets certain conditions \n \n Option #1 focuses on linking only with people you know or have met, a very short sighted option. What about people you would love to meet? What about experts in your field? What about people’s you’ve always wanted to talk to, share ideas with, or ask advice and opinions? \n Now consider option #2, linking with everyone. This too is not a recommended practice. When exactly do you expect to require the services of a waste management manager in India? There’s no need to fill up your contact list with people who have no relation or interest in anything you do. Indeed, LinkedIn puts limits on their services so why waste them on people whose path you will never cross. \n The third option is ideal. \n \n Obviously, Linkin with people you know. Current colleagues will eventually become past colleagues and these are the people you will look to when you next need a job reference or a shared connection to an interesting job posting. And if you’re not looking for a job, you might be able to help these people fill their jobs. \n Linkin with people you have met at conferences, or virtually via Twitter or Facebook. These people might also serve as job connections, people to bounce interesting ideas off, people to speak at your conference, people to write a case study with. \n Even better, send LinkedIn requests to experts in your field you’ve never met. Just because you aren’t able to attend conferences in England or Australia or South America is no reason to avoid building relationships with mobile researchers, survey researchers, focus group researchers, or social media researchers in other countries. In fact, it’s good practice to chat with people outside your comfort zone, outside your company, and outside your country. Your ideas and opinions have been developed based on your personal education, work experience, and cultural upbringing. Imagine what you could learn from someone who grew up in a totally different environment. If you admire someone’s work, send them a note on Linkedin and say so. \n \n But please, don’t ever do this \n \n Don’t send your linkedin connections messages about the highly valuable and relevant services your company provides, without even taking the time to see if your services are indeed valuable or relevant to them \n Don’t send generic group messages more than once every few months. It could very well be perceived as spam and people don’t like it. \n \n And on that note, if you’re a market researcher, please do  LinkIn with me . I’d love to connect! \n Related articles \n \n An open letter to Scotiabank and ING #MRX (lovestats.wordpress.com) \n I love social media research because: It lets you conduct research around the world #8 #MRX (lovestats.wordpress.com) \n 3 Problems with Gamification in Market Research #MRX (lovestats.wordpress.com) \n \n Tagged: LinkedIn , market research"], "link": "http://lovestats.wordpress.com/2012/10/22/linkedin-contacts-lion/", "bloglinks": {}, "links": {"http://www.crunchbase.com/": 1, "http://lovestats.wordpress.com/": 5, "http://www.linkedin.com/": 1}, "blogtitle": "The LoveStats Blog"}]