[{"blogurl": "http://www.thegeneticgenealogist.com\n", "blogroll": [], "title": "The Genetic Genealogist"}, {"content": ["This weekend I had the privilege to review an advance copy of “ Finding Family: My Search for Roots and the Secrets in My DNA, ” a new book by author and genetic genealogist Richard Hill.  The book is currently available at Amazon only in paperback (link here:  Finding Family: My Search for Roots and the Secrets in My DNA ), although eBook versions will be available soon. \n Many genetic genealogists are already familiar with Richard Hill and his website DNA-Testing-Adviser.com , where he shares information about using genetic genealogy to learn about your family, especially for adoptees and birth parents.  You may also be familiar with Mr. Hill through the front-page 2009 Wall Street Journal article detailing his search for his family, or from the 2009 article in the Grand Rapids Press (“ Rockford man uses DNA testing, Internet searches to find his birth father “). \n Finding Family \n Mr. Hill’s fascinating new page-turner describes his 30-year search for his birth patents.  Although he was quickly able to identify his birth mother, the search for his birth father took much, much longer.  As the author writes: \n Finding Family: My Search for Roots and the Secrets in My DNA is Richard Hill’s true and intensely personal story of how he pieced together the long-kept secret of his own origins. This highly suspenseful book is a page-turning saga of personal detective work that will appeal to anyone who loves a good mystery. \n I found this 260-page book waiting for me in my mailbox on Friday evening after work, and before 24 hours had passed I finished the last page.  I was completely unable to put it down, anxious to discover the conclusion of Mr. Hill’s decades-long search (even though I knew how it ended!). \n Highly Recommended! \n I highly recommend this book to anyone interested in genealogy, family secrets, genetic genealogy, or mystery in general.  The book is a complete and entertaining saga from A to Z.  Although it was occasionally challenging to follow the considerable cast of characters, I think this serves to emphasize how meticulous Mr. Hill must have been in his research and record-taking.  Without good notes and research ability, it might have taken Mr. Hill much longer to complete his search. \n Mr. Hill’s story also shows the power of genetic genealogy, especially for adoptees and birth parents.  However, the story also shows that DNA alone is not a magic tool; as I’ve argued for many years now, DNA is a tool that supplements traditional research.  Genetic genealogy is at its best when combined with a well-researched paper trail.  In the case of adoptees with no hope of a paper trail, DNA might provide clues that will help point you toward the paper trail. \n You can get more information about using genetic genealogy to supplement your search by reading  Finding Family: My Search for Roots and the Secrets in My DNA , or my visiting Mr. Hill’s great website at  DNA-Testing-Adviser.com . \n I met Dick in the fall of 2011 at the Family Tree DNA administrator’s meeting, although we had corresponded several times prior to meeting in person.  Dick was warm and inviting, and it clearly shows in his book.  He has connected with innumerable people in his search for family, and by reading his book I now count myself among them. \n Disclosure : I received a free copy of Mr. Hill’s book to review for The Genetic Genealogist. However, this review reflects my honest thoughts about the book."], "link": "http://www.thegeneticgenealogist.com/2012/08/26/1754/?utm_source=rss&utm_medium=rss&utm_campaign=1754", "bloglinks": {}, "links": {"http://www.familytreedna.com": 1, "http://www.amazon.com/": 2, "http://www.thegeneticgenealogist.com/": 1, "http://www.mlive.com/": 1, "http://www.DNA-Testing-Adviser.com": 2}, "blogtitle": "The Genetic Genealogist"}, {"content": ["Today, The Genographic Project officially announced the launch of their new Geno 2.0 project, a significant update to the type and quantity of genetic information that will be collected and analyzed by The Genographic Project.  The new project will use an entirely new SNP chip (the GenoChip) designed specifically for Geno 2.0 in order to provide the world’s most detailed information about Y-DNA and mtDNA haplogroups (using SNP information) as well as detailed biogeographical estimates and ancient population (Denisovan and Neanderthal) estimates. \n As of today you can pre-order a Geno 2.0 kit, which is expected to ship no later than October 30th (although you can probably expect it earlier than that). \n Once again Family Tree DNA will perform all the testing, and The Genographic Project has worked very closely with FTDNA to design, troubleshoot, and use the GenoChip.  FTDNA will perform both the Family Finder and the Geno 2.0 test. \n Overview of Geno 2.0 \n \n The new Geno 2.0 SNP chip contains roughly the following SNPs: \n \n ~3,200 mtDNA SNPs \n ~12,000 Y-DNA SNPs \n ~130,000 autosomal and X-chromosomal AIMs (including ~30,000 SNPs from candidate regions of interbreeding between extinct hominins (Denisovan and Neanderthal) and modern humans) \n \n The AIMs (Ancestry Informative Markers) were derived from roughly 450 populations around the globe, including many that are unique to the Genographic project and many that have never been previously searched for AIMs.  The SNPs in regions believed to represent Denisovan and Neanderthal interbreeding will be used to detect and study DNA flow between humans and these extinct populations. \n Overview of Results \n So what do you get when you order a Geno 2.0 test? Via the new user interface (some of which you can see below), you will receive the following: \n \n A deep-clade Y-DNA haplogroup assignment; \n A deep-clade mtDNA haplogroup assignment; \n Information about the history and migration of mtDNA and Y-DNA haplogroups; \n A biogeographical (ethnicity) estimate; and \n An ancient population (Denisovan and Neanderthal) estimate. \n \n What Geno 2.0 does NOT do: \n \n Geno 2.0 does not reveal medically-relevant information (but note that medical/health/trait information can sometimes be revealed unintentionally as new health associations are discovered, for example).  NG went to great lengths to prevent medical/health/trait information from being detected by the Geno 2.0 chip.  For example, the team selected only non-coding SNPs with no known functional association, and filtered all selected SNPs against a 1.5 million SNP database (which they constructed from numerous sources) containing all SNPs known or believed to be associated with disease or health. The team also removed all SNPs with a high association with medically-relevant SNPs (which you might be familiar with b/c of Dr. Watson and his APOE status ). \n \n \n Identify genetic cousins with autosomal DNA .  The Geno 2.0 product is not intended to identify close genetic relatives based on autosomal DNA, and thus does not have that functionality.  I’m guessing that it will be possible for third-party sites to glean some information about relatedness from the data, however.  Note that relatedness through the Y-DNA or mtDNA based on haplogroup information is a part of the functionality of Geno 2.0, as can be seen in the screenshots below. \n \n FTDNA ( Deep Clade Testing; Integration of Genographic Results) \n One interesting aspect of the new Geno 2.0 chip is that it will completely replace the deep-clade analysis performed at FTDNA.  With this one test, all SNPs currently analyzed by FTDNA in all of its different deep-clade analyses are analyzed in their entirety. \n Another great benefit of the Geno 2.0 test is that Genographic will allow the test-taker to upload/transfer their results back into FTDNA, and neither Genographic or FTDNA will charge a fee for this transfer.  This means that Project Administrators will be able to work within the FTDNA system to analyze results of their project members rather than having to rely on collecting data from project members outside the system (thereby potentially increasing participation and results). \n Validation of the GenoChip \n The designed GenoChip has undergone significant validation (including the use of  about 400 known Y-DNA and mtDNA samples, and as many as 650 samples from various populations around the world).  Following this validation process (which will continue for at least the foreseeable future), the validated GenoChip SNPs are as follows: \n \n ~12,000 Y-DNA SNPs \n ~3,200 mtDNA SNPs \n ~130,000 autosomal and X-chromosomal SNPs which include the following SNPs: \n \n 23,692 Neanderthal \n 1,357 Denisovan \n 12,027 Aboriginal \n 10,159 Eskimo Saqqaq \n 998 Chimpanzee \n \n \n Downloadable Raw Data: Treasure for Third-Party Analysis and Apps \n \n The test-taker’s raw data will be available for download by the test-taker.  This has happily become the norm for most genetic genealogy companies, and NG will follow suit.  It’s not clear at this point whether that will be an immediate functionality (although I’m guessing it will be), or whether it will be in the near future. \n Interestingly, the ability to download raw data opens the door for third-party analysis.  For example, I data from the Geno 2.o chip will lead to significant new mtDNA and Y-DNA discoveries (using the user-fueled Y-Chromosome Genome Comparison project, for example). \n Consent \n During a presentation put on by Spencer Wells and FTDNA a few weeks ago describing the new Geno 2.0 project, I and several other DNA bloggers were able to ask questions about the new chip and the project.  I and a few others asked questions about consent, which is of course an important aspect of any research project involving human samples. \n Specifically, I asked whether all test-takers are automatically participants in the research aspect of the new Geno 2.0 project.  Dr. Wells responded that test-takers must opt into research; they are not automatically research participants.  Accordingly, people who are interested in the new test but have concerns about participating in research can do so. \n The Geno 2.o Terms and Conditions are here . \n Miscellaneous \n A few miscellaneous points: \n \n As of the recent presentation, Genographic was not yet certain if they will be storing DNA samples after they are tested.  They are considering doing so, but of course there are significant costs associated with long-term storage of tens of thousands of DNA samples. \n Testing will take approximately 4-6 weeks once the system is in full swing (but I’m guessing there might be some delays in the beginning with an initial influx of orders). \n You will eventually be able to order the Geno 2.0 test directly through the FTDNA website. \n Although not completely reflected in the screenshots below, the new project allows for much greater participant involvement and interaction.  For example, test-takers are encouraged to share their stories after receiving their results. \n \n For More Information: \n Several other bloggers will be writing about today’s launch, and I will update this post to include links to those reviews.  Also, since I will be taking the Geno 2.0 test in the near future, stay tuned for my review and results. \n \n National Geographic and Family Tree DNA Announce Geno 2.0 – at Your Genetic Genealogist (CeCe Moore) \n Geno 2.0 launches! – at The Legal Genealogist (Judy G. Russell) \n The Genographic Project: onto the autosome!  - at Gene Expression (Razib Khan) \n National Geographic – Geno 2.0 Announcement – The Human Story – at DNAeXplained (Roberta Estes) \n National Geographic Announces New DNA Test - DNA – Genealem’s Genetic Genealogy (Emily Aulicino) \n \n Screenshots \n Below are a series of screenshots from the new Geno 2.0 project and test results, provided by National Genographic: \n The complete kit (collection is by cheek swab): \n  \n Introduction Page: \n  \n Overview Page: \n   \n \n An mtDNA haplogroup and heat map (showing modern-day locations and frequencies of the haplogroup): \n  \n The “Your Story” main page: \n  \n An example of more information at the “Your Story” page: \n  \n The “Your Map” page (showing an mtDNA map): \n  \n More of the “Your Map” page (showing an mtDNA map): \n  \n NOTE: much of this information is based on preliminary information about the GenoChip and Geno 2.0 project.  Accordingly, the information is subject to change. Check The National Genographic website for the latest information."], "link": "http://www.thegeneticgenealogist.com/2012/07/25/the-genographic-project-announces-geno-2-0/?utm_source=rss&utm_medium=rss&utm_campaign=the-genographic-project-announces-geno-2-0", "bloglinks": {}, "links": {"http://www.familytreedna.com": 1, "http://daver.info/": 1, "http://blogs.discovermagazine.com/": 1, "http://dna-explained.com/": 1, "http://www.legalgenealogist.com/blog": 1, "http://www.genographic.com": 2, "http://shop.nationalgeographic.com/": 1, "http://www.yourgeneticgenealogist.com/": 1, "http://www.nih.gov/": 1, "http://www.thegeneticgenealogist.com/": 9, "http://networkedblogs.com/": 1}, "blogtitle": "The Genetic Genealogist"}, {"content": ["I’ve received a number of emails and comments (see, e.g., here ) complaining about Ancestry.com’s new test, AncestryDNA .  Specifically, several test-takers believe that the Genetic Ethnicity Prediction provided by Ancestry.com does not reflect the numbers that they expected based on their own research. \n For example: \n “I just got my DNA test results back from Ancestry.com and I am concerned. I was born in England and I have gone back many generations and have found that all my ancestors as far back as the 1600′s in most cases are English.  According to the results I have no British Isles DNA. It states that I have 60% Central Europe, 30% Scandinavian and 7% Southern Europe. I also have 3% unknown. How can this be?” \n “Just received my results: 21% Southern European and 79% Central European which doesn’t follow years of work on my family history.” \n Do these comments reflect errors in AncestryDNA’s Genetic Ethnicity Prediction, or are there other factors at play? \n Caveats \n Although I am not privy to the ‘behind-the-scenes’ at Ancestry.com, I don’t believe that there are serious issues with AncestryDNA’s Genetic Ethnicity Prediction.  Ancestry.com’s DNA arm has a solid scientific team and a large and valuable reference database. \n Indeed, Ancestry.com is well aware of the limitations and challenges that their Genetic Ethnicity Prediction brings: \n We use cutting-edge science as a base for our predictions, but that comes with its own inherent challenges. It’s an emerging field with exciting new discoveries and developments constantly changing the landscape. Right now, your genetic ethnicity may not look quite right, with some ethnicities under or over-represented. As scientists gain a deeper understanding of the data, our prediction models will evolve to provide you with more accurate and relevant information about your family history. \n It’s important to understand that biogeographical estimates, which are still relatively new, are notoriously difficult and complicated.  Ten different researchers analyzing the same genome can come up with ten different estimates based on a number of different factors, including their algorithm, the reference populations used for comparison, and many others. \n Here are just a few factors that can influence a biogeographical estimate, and any one or more of these may be the reason that your Genetic Ethnicity Prediction does not match estimates you make based on your paper trail. \n \n Different Reference Populations and Algorithms \n \n As I suggested above, different companies use different reference populations and algorithms to create a biogeographical estimate, which can result in varying estimates. \n For example, in my previous review of AncestryDNA’s Genetic Ethnicity Prediction, I compared my genetic ethnicity results from three companies (Ancestry.com, 23andMe, and FTDNA), and found that their results varied considerably.  I’m not surprised by this, but I do expect that over time – as the industry arrives at more standard reference populations and algorithms (which the cheap whole-genome sequencing revolution will enable) – that estimates from different companies will align much more closely.  Be patient and enjoy being a pioneer. \n \n You Have TWO Family Trees! \n \n Remember that “ Everyone Has Two Family Trees – A Genealogical Tree and a Genetic Tree .” Your Genealogical Tree is the tree containing ALL of your ancestors.  However, only a tiny subset of these individuals actually (randomly) contributed DNA to the genome that you walk around with today.  These ancestors are the only individuals in your Genetic Tree.  It has been estimated , for example, that at 10 generations, only about 10-12% of ancestors in your Genealogical Tree are actually in your Genetic Tree! \n Accordingly, even if a decent percentage of your ancestors at 10 generations originated in the British Isles, there is possibility that your DNA – and thus your Genetic Ethnicity Prediction – could include very little or absolutely no British Isles ancestry, simply because of the rules of genetics. \n Ancestry.com tries to explain this as well (I’m biased, but I think my “Everyone Has Two Trees” explanation is a little clearer; I’ve had great luck explaining this to newbies): \n So if you look at your family tree, it may indicate a pedigree-based ethnicity of 30% English, 20% Scandinavian, and 50% Italian (based on birth locations of your great-great-great grandparents). While this is one valid way to look at ethnicity (and in fact has been the only way until recently), DNA analysis can reveal the actual percentage of your DNA that is reflected by these ethnic groups. So your genetic-based ethnicity might reveal you are 40% British Isles, 15% Scandinavian, and 45% Southern European. Both measures are accurate and informative—but they are measuring different things. \n \n Misleading Labels \n \n Another issue with any biogeographical estimate is the labels used to describe a population.  For example, what does “Scandinavian” or “Central European” really mean?  Does “Scandinavian” mean that great-grandpa must have been a Swede, or does it mean something else? \n Ancestry.com defines the “Scandinavian” with the modern day locations of Norway, Sweden, Denmark, but explains in their FAQ that it can mean much, much more: \n Ethnic groups moved around. Because people move over time, (and when they do they take their DNA with them), a group may contribute DNA to other groups at different times. So ethnic groups can be defined by time and place—not just location. For example, if you have German or British ancestors in your family tree, it’s a possibility that your genetic ethnicity may be partly Scandinavian. The Viking invasions and conquests about a thousand years ago are likely responsible for occurrences of Scandinavian ethnicity throughout other regions. And there are similar examples for other ethnicities. With your results, we provide historical information describing migrations to and from the regions to give you a broader picture of the origins of your DNA. \n Similarly, the “Central European” label is defined to include the enormous swath of land in Europe including the modern day locations of Austria, Belgium, France, Germany, Netherlands, Switzerland, Slovenia, Czech Republic, Luxembourg, and Liechtenstein. \n I certainly don’t think of France as being “Central Europe,” which shows that a test-taker shouldn’t rely on the labels alone. Dig a little deeper. \n \n Non-Paternal Events (NPEs) \n \n I won’t dwell on non-paternal events, because I believe they have become too much of a scapegoat.  Non-paternal events, or NPEs, can be broadly defined as secret or unknown breaks in your Genealogical Tree (adoption, infidelity, etc.).  At some point every single Genealogical Tree has an NPE, although current estimates vary widely.  Consider the possibility of a break in your tree, but focus on the other factors presented here as the more likely explanation for your unexpected results. \n Reviewing My Genetic Ethnicity Prediction \n I have a fairly well-documented Genealogical Tree.  My documented ancestors were mostly from the British Isles (England and Ireland) and France, with far fewer ancestors from Germany, and Central America.  Years ago, based on my paper trail, I might have predicted 65% British Isles, 20% Irish, 15% French, and 5% German. \n In light of the above, let’s review my AncestryDNA Genetic Ethnicity Prediction: \n \n Scandinavian – 78% \n Central European – 12% \n Uncertain – 10% \n \n \n At first glance and without any of the knowledge above, these numbers seem way out of whack.  I don’t have a single document ancestor from Scandinavia or the area I think of as “Central Europe.” \n However, when I learn that “Central Europe” includes France and Germany, a contribution of 12% “Central European” doesn’t seem far-fetched.  Further, considering that ancestry in the British Isles can include “Scandinavian” ancestors as a result of relatively recent Viking conquests (on a genetic timescale), perhaps the 78% Scandinavian isn’t so far-fetched either. \n While I am still surprised that I don’t report any British Isles DNA, that could simply be because of difficulties in deciphering between Scandinavian and British Isles, or perhaps because of the random inheritance of DNA from those ancestors rather than others. \n Lastly, where’s my confirmed Native American and African DNA?  Well, these percentages are rather small (­~ or <5% each) and I’m sure they’re contained within the “Uncertain” category. \n In any event, I’m not discouraged by my results, and I fully expect my results to change over time. \n Conclusions \n Lastly, as Ancestry.com has warned, don’t forget that your results are subject to change with revisions of their algorithms and new discoveries.  And if Ancestry.com is dedicated to the best and latest results, your results almost certainly will and should change. \n Your Turn \n What are your percentages?  Do they match your expected percentages?  If you were unhappy with your AncestryDNA Genetic Ethnicity Prediction, does any of the above change your view?"], "link": "http://www.thegeneticgenealogist.com/2012/06/19/problems-with-ancestrydnas-genetic-ethnicity-prediction/?utm_source=rss&utm_medium=rss&utm_campaign=problems-with-ancestrydnas-genetic-ethnicity-prediction", "bloglinks": {}, "links": {"http://dna.ancestry.com/": 1, "http://www.thegeneticgenealogist.com/": 4, "http://blog.goldenhelix.com/": 1, "http://www.co.uk/blog": 1}, "blogtitle": "The Genetic Genealogist"}, {"content": ["Today (or perhaps yesterday?) popular DIY genomics website GEDmatch.com released a new tool for phasing DNA data.  Listed under a link entitled “Generate phased data file,” the tool allows users of the GEDmatch.com site to phase their chromosomes if they have their parent’s raw data. \n (A similar tool was previously created by David Pike at  http://www.math.mun.ca/~dapike/FF23utils/ ; with David’s tool, users receive their results directly and do not need to upload their DNA test results; accordingly, users have a variety of options depending on their privacy tolerance). \n What the Heck is “Phasing”? \n Currently, SNP chip testing performed by 23andMe or Family Tree DNA is unable to attribute a test result to either one of your parents.  For example, if your results for SNP rs00000 are “AG,” the test alone cannot determine whether the “A” came from your mother or father. \n “Phasing” refers to the process of separating the mixed DNA results (the “AG”) into the DNA obtained from your mother (the “A”) and the DNA obtained from your father (the “G”).  This is typically done by comparing your results to your parents’ results and determining which parent could have and/or must have contributed each SNP. \n For example, if mother’s results are “AA” at rs00000, and father’s results are “GA” at rs0000, then the data can be phased into “A” from mom and “G” from dad (since only dad could have contributed the “G”).  Every once in a while, the data can’t be phased, however (say you’re “AG,” mom is “AG,” and dad is “AG”). \n What Good is Phasing? \n Many genealogists are using phased data to identify which DNA came from individual grandparents, great-grandparents, and beyond.  I won’t get into that in detail now, but hope to at some point in the future (and eventually in the book I’m working on!). \n As another example of using phased data, I used the new GEDmatch.com tool to phase my data.  Both my parents and I had previously uploaded our 23andMe and FTDNA data into GEDmatch.  I then performed some admixture analysis to compare unphased v. phased data. \n Here is my unphased chromosome painting ( Dodecad World9 ): \n  \n For comparison, here is my chromosome painting using the DNA I obtained from my father (same settings): \n  \n And here is my chromosome painting using the DNA I obtained from my mother (same settings): \n  \n Note that since this is so early I can’t say for certain whether using phased data creates some unwanted effects on the analysis (I’d love some input on that).  It is interesting, however, to compare the results of phased v. unphased data. \n What uses will you put your phased data to?"], "link": "http://www.thegeneticgenealogist.com/2012/06/07/gedmatch-com-adds-phasing-tool/?utm_source=rss&utm_medium=rss&utm_campaign=gedmatch-com-adds-phasing-tool", "bloglinks": {}, "links": {"http://gedmatch.com": 1, "http://www.23andMe.com": 1, "http://www.familytreedna.com": 1, "http://dodecad.blogspot.com/": 1, "http://www.mun.ca/": 1, "http://www.thegeneticgenealogist.com/": 3}, "blogtitle": "The Genetic Genealogist"}, {"content": ["I just discovered today that The Genetic Genealogist was recently included in a list of 50 top genealogy blogs by Inside History Magazine . \n Inside History Magazine is a periodical “for people passionate about Australian and New Zealand genealogy, history and heritage.”  The current May-June 2012 issue has an article entitled “ Entering the Blogsphere ” in which author Jill Ball (of Geniaus ) writes about the prevalence of genealogy bloggers.  As part of the article, she compiled a list of 50 blogs that “every genealogist needs to follow.” \n I’m honored that The Genetic Genealogist was included in this list, especially considering the others blogs, many of which I’ve been reading for years! \n Be sure to check out Inside History Magazine and the many terrific blogs listed in the article.  Also, Jill just included a nice follow-up list of “ the blogs that got away .”"], "link": "http://www.thegeneticgenealogist.com/2012/05/11/the-genetic-genealogist-listed-among-top-50-genealogy-blogs-by-inside-history-magazine/?utm_source=rss&utm_medium=rss&utm_campaign=the-genetic-genealogist-listed-among-top-50-genealogy-blogs-by-inside-history-magazine", "bloglinks": {}, "links": {"http://www.com.au/": 2, "http://geniaus.blogspot.com/": 2, "http://www.thegeneticgenealogist.com/": 2, "http://issuu.com/": 1}, "blogtitle": "The Genetic Genealogist"}, {"content": ["I’ve written about Ancestry.com’s new autosomal DNA product, AncestryDNA, a number of times (see my review of the product at Ancestry.com’s AncestryDNA Product ). \n Today, Ancestry.com announced the official release of AncestryDNA (see press release below).  It is initially available only to Ancestry.com subscribers, at a cost of $99. \n The launch page is here . \n Press Release : \n Ancestry.com Launches new AncestryDNA Service: The Next Generation of DNA Science Poised to Enrich Family History Research \n Affordable DNA Test Combines Depth of Ancestry.com Family History Database with An Extensive Collection of DNA Samples to Open New Doors to Family Discovery \n \n Ancestry.com (Nasdaq: ACOM), today announced the launch of its highly anticipated AncestryDNA™ service, a new affordable DNA test that enables purchasers of the DNA test and subscribers of Ancestry.com to combine new state-of-the-art DNA science with the world’s largest online family history resource and a broad global database of DNA samples. \n The new DNA test analyzes a person’s genome at over 700,000 marker locations, cross referencing an extensive worldwide DNA database with the aim of providing exciting insights into their ethnic backgrounds and helping them find distant cousins who may hold the keys to exciting family history discoveries.  By combining these genetic matches with Ancestry.com’s 34 million family trees and 9 billion records, AncestryDNA intends to provide a differentiated experience that helps find common ancestors dating back as far as the middle 18 th Century. \n “We’ve worked hard at Ancestry.com for more than a year building, testing, and reinventing our approach to genetic genealogy,” said Tim Sullivan, President and Chief Executive Officer of Ancestry.com. “We think AncestryDNA has created a unique and engaging experience that will provide existing Ancestry.com subscribers with an entirely new way to make amazing discoveries about their family history.  We are excited to be making AncestryDNA available to loyal Ancestry.com subscribers first…but we look forward to eventually opening up this service to everyone.  We think it will allow us to extend our mission to help people discover, preserve, and share their family history to an even greater audience.” \n AncestryDNA helps determine geographic and ethnic origins by comparing test-takers’ unique DNA signatures to the DNA of people from across the globe – drawn from the preeminent collection of DNA samples assembled by the Sorenson Molecular Genealogy Foundation. The current version of the test includes 22 worldwide geographical and ethnic categories, including six regions in Europe, five regions in Africa, and Native American. \n “We think the newest DNA technology will dramatically change family history research. For the experienced genealogist it will help break down brick walls and for the casual family historian it will make it easier than ever to get started,” said Ken Chahine, Ph.D., J.D. Senior Vice President and General Manager of Ancestry.com DNA, LLC. “While the science is cutting edge, the new online experience is simpler and more intuitive than ever before. We’ve already had overwhelming response and positive feedback from beta users as they discover relatives and uncover the treasures their ancestors passed down through DNA.  DNA picks up where the paper trail leaves off. Genomic science can extend family history research into parts of the world where few paper records are available.” \n Interest in exploring family history is rising quickly, especially on the scientific front, and that interest extends all the way back to the “old country,” wherever it may be. In fact, 56 percent of Americans recently surveyed by Harris Interactive are interested in taking a DNA genealogy test, up from 42 percent less than a year ago*. What’s more, people’s family history interests reach back beyond arrival in America – nearly two in three respondents told Harris that learning about pre-U.S. family members is one of the most important benefits of researching family history. \n Pricing and Availability \n Due to very strong early interest and demand, AncestryDNA will initially be made available by invitation-only to Ancestry.com subscribers for $99, with the expectation that the service will be made available to the general public later this year. To learn more about AncestryDNA, or to sign up to be notified once it’s available, please visit www.ancestrydna.com . \n In preparing to bring AncestryDNA to market with the best science and a broad set of research assets, AncestryDNA has organized a distinguished and independent Science Advisory Board and has also acquired access to DNA samples, many of which had been assembled by the non-profit Sorenson Molecular Genealogy Foundation.  AncestryDNA will be offered through Ancestry.com DNA, LLC, a wholly owned subsidiary of Ancestry.com. \n Science Advisory Board \n With the continued focus on developing a solid DNA platform that stays ahead of the genetic genealogy trends, AncestryDNA has assembled a well-respected Scientific Advisory Board that can advise the company on best practices in the emerging field of DNA and genomic testing. The board consists of : \n ·         Carlos D. Bustamante, Ph.D., Professor, Department of Genetics at Stanford University School of Medicine \n ·         Mark J. Daly, Ph.D., Associate Professor of Medicine Harvard Medical SchoolCenter for Human Genetics \n ·         John Novembre, Ph.D., Department of Ecology and Evolutionary Biology, University of California, Los Angeles \n ·         Jeffrey R. Botkin, M.D., M.P.H., Professor of Pediatrics and Medical Ethics, Associate Vice President for Research, University of Utah \n ·         Philip Awadalla, Ph.D., Director of the CARTaGENE BioBank, Saint Justine Hospital, Montreal, Canada \n Addition of DNA Assets from  the Sorenson Molecular Genealogy Foundation \n In March, Ancestry.com DNA, LLC acquired access to an extensive collection of DNA assets from Sorenson Molecular Genealogy Foundation, a non-profit organization. Founded by molecular genealogy pioneer, James LeVoy Sorenson, this organization has been dedicated to building the world’s foremost collection of DNA samples and corresponding genealogical information. Over the last 12 years, the Sorenson Foundation collected a one-of-a-kind DNA database of tens of thousands of DNA samples with documented family histories in more than 100 countries on six continents. This DNA database gives AncestryDNA test-takers an expanded family history genetic resource, and should enable new levels of discovery about people’s family backgrounds. \n Jim Sorensen, President of Sorenson Molecular Genealogy Foundation added, “We are pleased to bring this far reaching, unique DNA collection to AncestryDNA. My father, James L. Sorenson, envisioned creating a genetic map of the peoples of the world that shows relationships shared by the entire human family and with the shared vision and resources of AncestryDNA his legacy will greatly expand. We are confident in the capabilities and dedication of the team to realize the potential of genetic genealogy faster than anyone else in the field. We see this as a great benefit to consumers as well as the scientific community by combining some of the best science with the leader in family history.”"], "link": "http://www.thegeneticgenealogist.com/2012/05/03/ancestrydna-officially-launches/?utm_source=rss&utm_medium=rss&utm_campaign=ancestrydna-officially-launches", "bloglinks": {}, "links": {"http://corporate.ancestry.com/": 1, "http://www.thegeneticgenealogist.com/": 3}, "blogtitle": "The Genetic Genealogist"}, {"content": ["Today begins the first in a series of articles about the use of genetic genealogy and personal genomics in the classroom, ranging from high school to college-level. \n Many scientists and health care experts believe that genetics will be a vital component to several facets of our lives in the future, especially in the field of medicine.  Indeed, some consider the study of genetics to be one of the most promising solutions to many of the health dilemmas facing society today, including advancing our understanding of interactions between genetics and the environment.  Accordingly, today’s students should have at least a basic grasp of genetics, and science educators must find innovative ways to share those concepts with their students. \n A Need for Genetics Education \n Unfortunately, some studies suggest that many of today’s students lack comprehension of some of the most basic concepts in genetics.  See, e.g., Wood-Robinson, C., Lewis, J. and Leach, J. 2000, Young people’s understanding of the nature of genetic information in the cells of an organism , J Bio Educ 35(1):29-36; and Quinn, F., Pegg, J., and Panizzon, D. 2009, First-Year Biology Students’ Understandings of Meiosis: An Investigation Using a Structural Theoretical Framework , Int’l J. Sci Educ 31(10):1279-1305. \n While students certainly can learn about genetics through lectures and textbooks, there is little doubt that hands-on experiences help reinforce concepts and may even reach some students that are less likely to learn from passive methods. \n Over the next few weeks, we’ll examine several instances of genetic genealogy and/or personal genomics being used in the classroom to examine and reinforce concepts of genetics, race, and ethics, including the following: \n \n The Genographic Project  in High Schools (Chicago Public Schools, Soldan International High School, Edward Bleeker Middle School, and Olympic High School) (2007-) \n The Cornell Genetic Ancestry Project (2011) \n 23andMe Testing for Freshman at Berkeley (2010) \n Medical School Testing (SUNY Upstate Medical University and Stanford) (2010-) \n Anthropology and Genetics at Penn State University (2012) \n Personal Genetics Education Project (www.pged.com) \n \n Without further ado, let’s begin with the use of genetic genealogy in schools. \n The Genographic Project in Middle and High Schools \n Each of the school projects below were conducted in conjunction with the The Genographic Project, which has done a tremendous job of working with public schools to educate students about their genetic ancestry. \n \nA.  Chicago Public High Schools in 2007 \n \n The earliest reference I can find of commercial genetic genealogy being used in the classroom is from 2007, when The Genographic Project (National Geographic, IBM, and Family Tree DNA) donated 150 testing kits to each of five Chicago Public Schools and 50 kits to each of their international partner schools in England, Jordan, France, South Africa, and China (a total of 1000 kits, priced at approximately $100 each). \n According to several reports, the teachers at these schools expected the testing to provide the students with valuable information and experiences: \n \n Parents ‘hear DNA, all they think about is “CSI.” It’s not like that at all,’ said Brian McKay, who teaches European history at the Charles A. Prosser Career Academy and scraped his own cheeks for cells on Tuesday. ‘Our kids are going to get a lot out of this. (Students) are very positive, they’re very excited.’   Source . \n \n Prosser Principal Ken Hunter stated that: \n “We are more than excited to help our students learn about our world’s common threads. At Prosser we tell our students to “extend the world”—this project presents them with a wonderful opportunity to make those words come alive in real world application. My teachers are thrilled to be taking part in such a thoughtful learning activity that brings the idea of common ancestry and shared humanity to our students in such a powerful and compelling way. This ‘learning tool’ has really helped make the education experience here at Prosser ‘the stuff that dreams are made of.” Source . \n Interestingly, the schools involved were chosen based in part on the diversity of the student population:  “‘Chicago is a melting pot, a multicultural melting pot, it’s a great place to illustrate how interrelated we are,’ [Spencer] Wells said.” \n The launch of the project was covered by The Genographic Project itself, and by the media: \n \n “ Who Are You and Where did You Come From? Tracing Your Ancient Ancestors in the Classroom ,” The Genographic Project (January 23, 2007); \n “ The Silk Road Project Meets the Genographic Project ,” The Genogrpahic Project (date unknown); \n “ Chicago 10th-graders trace ancestry through DNA ,” AP report (January 22, 2007); and \n “ Tracing a Common Ancestry ,” Chicago Tribune (January 24, 2007) \n \n Unfortunately I was unable to find any reports of the outcome of the testing, so it’s unclear what lessons the students derived from the experience. \n B. Soldan International High School in Chicago in 2007 \n In 2007, forty advanced placement science students at Soldan International High School in St. Louis, Missouri submitted their DNA for testing with the Genographic Project.  (see “ High school students uncover their past through their DNA “) (several articles also appeared in the St. Louis Dispatch, but are now found only in the newspaper’s archives). \n At Discovering Biology in a Digital World, blogger Sandra Porter wrote the following about the Soldan project: \n \n \n Most science instructors steer clear of these sorts of activities because there is a real possibility that children might learn some things in class that their parents would prefer remain secret. Any science instructor who’s had to find a really creative way to explain why a student has the “wrong blood type” based on their parentage, will appreciate that analyzing Y chromosomes has potential for trouble.  I wonder how the teachers at Soldan will answer those questions. \n \n I actually wrote about this project here on TGG back in 2007, the early days of the blog, partially to address the concerns that were raised (see “ Genetic Genealogy in the Classroom ”).  As Sandra’s blog post suggested, some were concerned that testing in the classroom had the potential to reveal non-parental events.  To address this issue, I posited the following: \n \n \n “although there is surely a chance of there BEING a non-parental event in a large group of students, the chance of CONCLUDING that there was a non-parental event is quite small. Most genetic genealogy companies return a list of allele numbers (12 alleles for the Genographic Project) for Y-DNA or a list of mutations for mtDNA along with a probable haplogroup designation. Armed with that knowledge, how is a student going to determine that there was a non-parental event?” \n \n There are certainly some ethical concerns with genetic genealogy testing in the classroom, but non-paternal events are unlikely to be of serious concern.  \n C.  Other Schools \n Following the apparent success of the Chicago school experiment, the Genographic Project worked with several other schools in the following years: \n \n \n Newark High School in western New York state (2007) – approximately 10 students contributed DNA to the Genographic Project for testing (see “ Connecting Some Dots With Our DNA ”); \n \n \n Edward Bleeker Middle School in Flushing, New York (2011) – several sixth graders participated in testing, as roughly 400 students at four different New York City public schools would trace their ancestry with the Genographic Project (see “ Am I Related to Justin Bieber? ”); \n \n \n Olympic High School (2012) – teacher Anthony Fuller used his results to educate the students about the Genographic Project and genetics (see “ L.A. High Schoolers Dig in to the Genographic Project ”); and \n \n \n Harlem Children’s Zone in Harlem, NY (2011) – In last Sunday’s episode of “ Finding Your Roots with  Henry Louis Gates, Jr. ,” Gates tested a group of six or so African American students at  Harlem Children’s Zone .  The testing appears to have analyzed only their ethnicity, which varied considerably.  What was most interesting, however, was that Gates discussed with them the implications of their testing, and asked for their thoughts after receiving their test results. \n \n A Useful Exercise: Estimating Admixture Before Testing \n On Finding Your Roots,  Gates also had the students estimate their admixture before they received their results, which is a great way to introduce the scientific and historical concepts associated with admixture testing.  This is a tool that Gates has already used at least once in the series, and I’m sure we’ll see it again. \n Another useful component of this exercise might be to have the kids do some preliminary research on their own family tree before estimating their admixture, including research as simple as asking parents and grandparents.  With this information, they could make a more educated estimate of their admixture. \n Conclusions \n Although using genetic genealogy in the classroom is not new, it hasn’t been used as extensively as it could be.  What suggestions do you have for the successful use of testing in the classroom?"], "link": "http://www.thegeneticgenealogist.com/2012/04/05/genetic-genealogy-and-personal-genomics-in-the-clasroom-part-i/?utm_source=rss&utm_medium=rss&utm_campaign=genetic-genealogy-and-personal-genomics-in-the-clasroom-part-i", "bloglinks": {}, "links": {"http://www.pbs.org/": 1, "http://scienceblogs.com/": 2, "http://www.ed.gov/": 1, "http://blogs.nationalgeographic.com/blog": 1, "http://articles.chicagotribune.com/": 1, "http://connection.ebscohost.com/": 1, "http://newswatch.nationalgeographic.com/": 1, "http://mywebtimes.com/": 2, "http://en.wikipedia.org/": 1, "http://goo.gl/": 1, "https://genographic.nationalgeographic.com/": 4, "http://www.thegeneticgenealogist.com/": 1}, "blogtitle": "The Genetic Genealogist"}, {"content": ["In the past, I’ve reviewed new autosomal DNA testing options offered by 23andMe and Family Tree DNA : \n \n Genetic Testing With 23andMe \n Genetic Testing With 23andMe – Ancestry Testing \n A Review of Family Tree DNA’s Family Finder – Part I \n A Review of Family Tree DNA’s Family Finder – Part II \n \n Today, I’m reviewing the new autosomal DNA test from Ancestry.com called “AncestryDNA.” I’ve already written at length about AncestryDNA, so I won’t cover too many of the basics here.  I have an in-depth introduction to the product located at “ Ancestry.com’s AncestryDNA Product, ” which you might want to check out before or after reading this review in order to gather more information. \n AncestryDNA: An Introduction \n The introduction page, which appears after clicking on “View Results” on the front page, consists of my Genetic Ethnicity Summary and the Member DNA Matches (which is further broken into close cousins and distant cousins, as discussed in detail below).  Please note that for purposes of this review I’ve removed the identifying information for my genetic matches. \n  \n Genetic Ethnicity Summary: \n My genetic ethnicity results, which suggest 90% European and 10% Uncertain, are very interesting.  In a recent webinar with the AncestryDNA team, they reported that the genetic ethnicity analysis is still very early in the beta phase, and will continue to be updated and refined as new reference populations are added.  Indeed, I’m predicting that over time as new information is added and the algorithm is refined, some or all of my10% Uncertain will be categorized (perhaps to reflect my maternal Asian and African contributions, which I’ve written about before), and that some of of my 90% European may very well change. \n Under a heading “About Your Ethnicity” is a pop-up file with more information about Ancestry.com’s ethnicity estimation algorithm.  In that file, under “Is It Accurate,” for example, Ancestry.com provides the following: \n When determining your genetic ethnicity, we hold our process and results to an extremely high standard of accuracy.  Our lab’s analysis uses some of the most advanced equipment and techniques to measure approximately 700,000 points in your genome (with at least a 98% rate of accuracy).  We compare that to one of the most comprehensive and unique collections of genetic signatures from around the world.  And as this collection improves over time, it can only get better. \n I’m not sure whether the AncestryDNA tests these 700,000 SNPs, or whether it tests more SNPs but is currently using a subset of 700,000 for its analysis.  I’ll try to find this information. \n I thought it might be interesting to compare my genetic ethnicity results from the three companies (Ancestry.com, 23andMe, and FTDNA): \n Ancestry.com’s AncestryDNA : \n \n 78% Scandinavian \n 12% Central European \n 10% Uncertain \n \n 23andMe’s Ancestry Painting : \n \n 98% European \n 2% Asian \n <1% African \n \n Family Tree DNA’s Population Finder : \n \n 68% European (Northeast European) – Finnish \n 32% Middle East (Jewish) – Jewish \n \n After reviewing the results one thing is certain: all three companies estimate a strong European contribution to my genome, particularly Scandinavian (ranging from 68% to 78%).  It’s ironic, however, that I have yet to identify a single Northern European ancestor!  I certainly won’t be surprised when one pops up someday. \n Clicking on “See Full Results” takes me to a more detailed analysis of my ethnicity results, but not before I click through the following pop-up: \n Please keep in mind… Our prediction of your genetic ethnicity is not yet finalized. As we gather more DNA samples and continue our research we expect your ethnicity results to become more accurate and perhaps more detailed. \n As I stated above, the ethnicity results are likely to change over time, so be forewarned. \n The Full Results page – reproduced below – includes historical and anthropological information about each of the identified regions from your ethnicity profile (Scandinavian and Central European, for me).  It also shows a list of genetic matches who share the relevant region (it’s a long list along the right lower side of the page, but it’s not shown below for privacy reasons).  You can also zoom into the map where ancestors from a tree you’ve linked to your account are displayed.  For example, I have 8 listed in Ireland and 2 in Central Europe. \n  \n In summary, Ancestry.com’s AncestryDNA test provides a genetic ethnicity/region calculation based on about 700,000 SNPs and a large collection of both public and proprietary reference databases.  The product can currently categorize DNA into at least 22 different ethnicities/regions, with more to come.  So be prepared for changes to your estimation as their algorithm and databases grow. \n Member DNA Matches \n Also on the introductory page is a listing of genetic matches.  These are individuals that, based on shared segments of DNA, you are predicted to share a common ancestor with.  An interesting aspect of the DNA matches list, however, is a sliding scale for the relationship confidence level, which ranges from 99% to 10%: \n \n 99% Confidence – Immediate Family \n 99% Confidence – 1st Cousins \n 99% Confidence – 2nd Cousins \n 98% Confidence – 3rd Cousins \n 96% Confidence – 4th Cousins \n 50% Confidence – Distance Cousins \n 20% Confidence – Distance Cousins \n 10% Confidence – Distance Cousins \n \n Accordingly, the introductory page can be customized to only display cousins of a certain confidence level.  If I reduce the confidence level to 96%, for example, I only have two matches (my two predicted fourth cousins shown in the picture above). \n Clicking on the “What Does This Mean” link next to the  possible relationship range on the “Review Matches” page for each genetic cousin (see the figure below) causes the following information to be displayed, along with some nice inheritance charts: \n Predicted Relationship Info: FOURTH COUSIN \n … \n It’s interesting to note that (at this degree of separation) we are accurately able to predict only about 85% of the possible relatives that are out there—in other words there is a 15% chance that our DNA analysis does NOT recognize an actual relative of yours. One way to be more certain that the DNA testing captures as many relatives as possible is to have multiple members of your immediate family tested. \n It is also interesting to note that at this degree of separation we are sometimes wrong in our prediction of a real relationship. We’ve found that for this relationship about 15% of the time we predict a relationship that cannot be found in any family tree. \n This provides some interesting insight into AncestryDNA’s matching algorithm and, accordingly, the algorithm’s results.  For example, it’s important to always keep in mind that there is a roughly 15% chance of incorrectly labeling an individual either as a match or as not being a match. \n As the user slides the scale from 99% down to 10%, more results typically appear.  For example, I currently have two 4th cousins listed as matches, 9 matches with 50% confidence, 14 matches with 20% confidence, and 38 matches with 10% confidence.  I expect these numbers to increase considerably once more test results become available.   I don’t know how big the AncestryDNA database currently is, but I’m guessing that only a few 100 to a few 1000 people, at the very most, have undergone testing so far. \n Comparing Family Trees \n The true power of the AncestryDNA test lies in the ability to automatically compare your uploaded family tree with the uploaded family tree(s) of genetic matches.  For example, one of my predicted fourth cousin matches has a public tree with 408 people.  Clicking on “Review Match” takes me to the next page with more information (see the next screenshot) including each of the following: \n \n A predicted relationship and predicted relationship range; \n Our ethnicity comparison (a very cool and potentially very useful feature); \n My genetic cousins’ entire tree out to 7 generations (and a link to see more); \n A possible shared ancestor (a “shaky leaf” hint) if one is identified; \n Surnames that we share in common; and \n My genetic cousins’ surnames through 10 generations. \n \n I especially like the Genetic Ethnicity Bar (I just made that up, but I guess it fits) comparison, which shows your ethnicity prediction next to your matches ethnicity prediction.  For example, my fourth cousin displayed in the image below is 93% British Isles and 7% Uncertain.  Since I have no reported British Isles genetic contribution, my Genetic Ethnicity Bar is gray: \n  \n  On the other hand, if there is some matching ethnicity contribution, the Genetic Ethnicity Bar comparison will look like this: \n  \n This genetic match and I, predicted to be distant cousins, both have contributions from Central Europe and Scandinavia.  My match also has British Isles and Middle Eastern, which I am estimated not to have. \n Also on the the “Review Match” page is a link to send a message to the match (very important for genealogists).  I also like the “Last signed in” information, which lets people know just how active a genetic match might be (and why they aren’t answering your email!). \n Common Ancestor and Shared Surnames \n As can be seen from the last two screenshots, the list of shared surnames (if there are any) is prominently displayed near the top of the page.  If there was an individual in common between our trees, he or she would also be displayed there.  Unfortunately, when I review the match with each of my possible genetic cousins, I typically have one or more shared surnames, but none have a single identified common ancestor.  I was hoping for such a match, but I’ll have to be a bit more patient.   While I currently have about 55 matches, only some of those have public trees, and even fewer have substantial family trees (larger trees increase the likelihood of identifying a possible shared ancestor, of course). \n Conclusion \n This post included just a few initial thoughts about my testing experience and results.  I may add more information, or create a new post, as I continue to review my results.  If you have any questions about the testing process or ancestry results that I didn’t address, please feel free to leave a comment.  I’m sure many other people have the same question, so don’t hesitate to ask.  I’ll also try to get the AncestryDNA team to answer any questions I can’t answer. \n While there is currently no information about when AncestryDNA will be available, or pricing, I’m sure that this will be available soon. \n I’m looking forward to your comments, ideas, and questions. \n ( Disclosure:  I received my AncestryDNA test without charge from Ancestry.com for review purposes and beta testing.  Regardless, I have attempted to review this product as honestly and as objectively as possible in order to provide valuable information about AncestryDNA to my readers.)"], "link": "http://www.thegeneticgenealogist.com/2012/04/02/a-review-of-ancestrydna-ancestry-coms-new-autosomal-dna-test/?utm_source=rss&utm_medium=rss&utm_campaign=a-review-of-ancestrydna-ancestry-coms-new-autosomal-dna-test", "bloglinks": {}, "links": {"http://www.thegeneticgenealogist.com/": 9, "http://www.23andme.com/": 1, "http://www.familytreedna.com/": 1}, "blogtitle": "The Genetic Genealogist"}, {"content": ["I’ve written before about Ancestry.com’s new AncestryDNA autosomal test.  See, for example: \n \n Ancestry.com’s Autosomal DNA Product – An Update \n The Legal Genealogist Discusses Ancestry.com’s New Autosomal Testing  \n WDYTYA Reveals More Information About Ancestry.com’s New Autosomal DNA Testing \n \n Webinar with Ancestry.com \n Last week, I participated in a webinar with Ancestry.com regarding the AncestryDNA test (although, unfortunately, I had to leave a bit early due to a previous engagement).  It was a great list of about 10 well-known genealogy bloggers, each one of whom is someone I’ve been reading or following for years.  It was an honor to be included among them. \n One of the participants was CeCe Moore of Your Genetic Genealogist.  CeCe has a nice summary of the webinar and the important points about the autosomal test and the user interface at “ New Information on Ancestry.com’s AncestryDNA Product .”  If you’re interested in autosomal DNA testing, or in Ancestry.com, I highly recommend reading her post. \n The Power of DNA \n The highlight of the webinar – and of the AncestryDNA product – was the combination of DNA and family trees.  I’ve said before that the ability to combine DNA and the paper trail is the future of genetic genealogy, and the true power of DNA. \n The AncestryDNA test automatically compares your family tree (if you have one hosted at Ancestry.com) to the family tree of your genetic matches (if they have one hosted at Ancestry.com, and if it’s public ).  The user interface then suggests overlapping individuals that might be the source of the shared DNA!   The user interface presents this information as a “Potential Common Ancestor,” and provides it as a “shaky leaf” hint.  Thus, as with all shaky leaf hints, it should be subjected to further research and not blindly accepted. \n You can also see the first 7 generations of each genetic match in your user interface (again, if their tree is public), another great benefit. \n While there are of course MANY caveats to this matching algorithm, it eliminates a time-consuming step in sharing information with genetic matches, as many of us know from [many hours of] experience.  (I didn’t get a chance to ask if the matching algorithm takes into account the predicted relationship range of the genetic cousins being matched, but I’ll try to get that information for you.) \n If you think about it for a moment, the power of this approach is mind-boggling.  Over time it will create a mesh of DNA and genealogies, with individual data points that can be confirmed or rejected based on the results of numerous test-takers.  In other words, there will be an enormous DNA family tree.  Not only that, but that enormous DNA family tree can then be used to test genealogical hypotheses (was John Smith’s mother a White?  was John Smith Jr. adopted? etc…).  While a long way down the road, the possibilities are endless. \n Concerns About Combining DNA and Family Trees \n I know there is a lot of criticism and concern about the quality of third-party genealogies on Ancestry.com.  It’s impossible to know just how subjective or objective the data in any given tree is.  It’s true that there will always be concerns about third-party genealogies, and that there will be many, many errors as genealogists begin to tie DNA to specific ancestors. \n But these concerns are equally true for paper records.  Any time you tie a paper record to a certain individual in your family tree, there’s a serious possibility of error, and this error can be propagated throughout numerous genealogies.  Every genealogist has seen this before, probably many times. But the fact that we’ve recognized the error likely means that the error has been corrected through careful research. \n There is nothing different or exceptional about tying DNA to ancestors.  Any time you tie a piece of DNA to a certain individual in your family tree, there’s a serious possibility of error.  Over time, however, careful and methodical research – likely contributed by many different test-takers – will allow genealogists to make the most reasoned and knowledgeable judgment. \n There’s enormous power in numbers. \n A Roundup of AncestryDNA Posts \n Here’s a complete roundup of posts around the genealogy blogosphere about Ancestry.com’s new Autosomal DNA product (AncestryDNA): \n \n “Science and the “10th” cousin”at The Legal Genealogist; \n  “ Ancestry.com Venturing into Autosomal DNA Testing? ” at Your Genetic Genealogist \n “ More Details on Ancestry.com’s New Autosomal DNA Test Offering ” at Your Genetic Genealogist \n “ Update on the New Autosomal DNA Test from Ancestry.com ” at Your Genetic Genealogist \n “ My (free) Ancestry.com DNA results – a comparison to FamilyTreeDNA ” at genejourneys \n “ Ancestry.com autosomal DNA test – Part II ” at genejourneys \n \n Did I miss any?  Feel free to mention them below. \n Disclosure : I received a free beta test from Ancestry.com, although I have not yet received my results (I will receive them this week, I believe).  However, I have tried to review this product objectively."], "link": "http://www.thegeneticgenealogist.com/2012/04/01/ancestry-coms-ancestrydna-product/?utm_source=rss&utm_medium=rss&utm_campaign=ancestry-coms-ancestrydna-product", "bloglinks": {}, "links": {"http://genejourneys.com/": 2, "http://www.thegeneticgenealogist.com/": 4, "http://www.yourgeneticgenealogist.com/": 4}, "blogtitle": "The Genetic Genealogist"}, {"content": ["“ Finding Your Roots with Henry Louis Gates Jr .” is a new series from Henry Louis Gates Jr. , who previously brought us series such as Faces of America, African American Lives, and African American Lives 2.  The show, which airs on PBS stations on Sunday nights, premieres March 25th, 2012 with singer/actor Harry Connick, Jr. \n Last week I participated in a conference call with members of the show, including Senior Story Editor and Producer Leslie Asako Gladsjo and Chief Genealogist Johni Cerny.  Also on the call, although only able to participate for a few minutes, was Henry Louis Gates Jr. \n Here are some interesting tidbits about Finding Your Roots – and genealogy in general – that I learned from the conversation: \n \n Gates believes that genetic genealogy is deconstructing the notion of race; never has FTDNA or 23andMe returned an African American’s testing results and reported 100% African, for example.  In other words, science is demonstrating that things are much more complicated than we would have guessed without the benefit of DNA. \n \n \n All guests on Finding Your Roots used both 23andMe and FTDNA  for DNA testing – all African Americans participating in the series also used African Ancestry .  While the guests receive all their results, we may not always see them. \n \n \n Many are still wary of genetic genealogy; many potential guests even turned down the series largely because of the DNA testing involved. \n \n \n Gladsjo and Cerny noted that DNA is just another tool for the genealogist; sometimes the guests’ DNA results were very interesting, and sometimes they were “pretty boring.” \n \n I hope you’ll be tuning in tomorrow to see Finding Your Roots.  I have a feeling that this is going to be a fascinating series. \n By the way, did you catch last night’s episode of “ Who Do You Think You Are ” with Helen Hunt? It was another fantastic episode.  Too bad they didn’t bring in DNA testing.  With Hunt’s Jewish ancestry, it would have been a terrific opportunity to education viewers about the many unique facets of genetic genealogy testing in this population."], "link": "http://www.thegeneticgenealogist.com/2012/03/24/finding-your-roots-with-henry-louis-gates-jr/?utm_source=rss&utm_medium=rss&utm_campaign=finding-your-roots-with-henry-louis-gates-jr", "bloglinks": {}, "links": {"http://www.familytreedna.com": 1, "http://www.pbs.org/": 1, "http://www.africanancestry.com/": 1, "http://www.23andme.com": 1, "http://en.wikipedia.org/": 1, "http://www.nbc.com/": 1}, "blogtitle": "The Genetic Genealogist"}]