[{"blogurl": "http://phylogenomics.blogspot.com\n", "blogroll": [], "title": "The Tree of Life"}, {"content": ["Very interesting: There is a new workshop summary out from the Institute of Medicine of the National Academy of Sciences: The Human Microbiome, Diet, and Health - Workshop Summary - Institute of Medicine From the summary\n \n \n\"One of the most intimate relationships that our body has with the outside world is through our gut. Our gastrointestinal tracts harbor a vast and still largely unexplored microbial world known as the human microbiome that scientists are only just beginning to understand. Researchers are recognizing the integral role of the microbiome in human physiology, health, and disease — with microbes playing critical roles in many host metabolic pathways — and the intimate nature of the relationships between the microbiome and both host physiology and host diet. While there is still a great deal to learn, the newfound knowledge already is being used to develop dietary interventions aimed at preventing and modifying disease risk by leveraging the microbiome. \n \nThe IOM’s Food Forum held a public workshop on February 22-23, 2012, to explore current and emerging knowledge on the human microbiome, its role in human health, its interaction with the diet, and the translation of new research findings into tools and products that improve the healthfulness of the food supply. This document summarizes the workshop.\" \n \nI was unable to go but am very interested in the topic. Forrunately one can get the report for free. And I will be reading it ASAP. \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/4213215019418663912/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://iom.edu/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["I assume if you pay any attention to science satire/humor you are familiar with PhD Comics by Jorge Cham. If not, you must check it out. It is simply brilliant stuff. And thus I was completely floored when I was contacted about whether I wanted to be interviewed by Jorge for a video he was commissioned to make as part of Open Access week activities. I mean - I figging say no to almost everything these days but I said yes to this almost immediately.\n\nAnd so I did a phone interview with him and Nick Shockey from SPARC . \n\nAnd then Jorge worked his magic -- and here it is. \n \n \n\n\n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/4906269014241045339/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://www.phdcomics.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://www.arl.org/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Uggh. Just read this: Specific bacterial species may initiate, maintain Crohn's . Basically it reports on a paper that showed a correlation between bacterial taxa and early Crohn's disease. The paper makes a big deal out of showing a correlation in the severity of pediatric Crohn's and the types of microbes found. Good. That is useful. But here is the thing. It is a $&*#($@(& correlation. They have NO IDEA if this is the result of the CD or the cause (or both). To go around pushing the idea that this is about bacteria initiating CD is misleading. \n \nThe news release says \"The work may ultimately lead to treatment involving manipulation of the intestinal bacteria.\" True. The work may ultimately also lead to my screaming. Oh wait. It did already. \n \nFor more on Overselling the Microbiome see some of my other posts \n \n Overselling the microbiome award: MedicalDaily on Effects of Sugary Drink \n The microbiome in the news: risk of overselling but not always bad coverage \n Overselling the microbiome award: Scientists look to mummies for obesity cure \n Probiotics are the new viagra & the risks of overselling of probiotics \n Probiotic use spreading, lots of money being made, known benefits still murky \n Overselling the microbiome award #2: The Marshall Protocol \n Overselling the microbiome award: Stephen Barrie on pre and probiotics at the Huffington Post \n Dubious Press Release from Cedars-Sinai linking Irritable Bowel Syndrome (IBS) and Bacteria in Gut \n As I have said many time. I believe the human microbiome is VERY important. I believe it probably plays a role in all sorts of human issues - health and disease. But we need to be careful not to be misleading about what we know and don't know ... \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/8924252297075610802/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://phylogenomics.blogspot.com/": 9, "http://www.nih.gov/": 1, "http://medicalxpress.com/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Well, too long of a saga to post directly to Twitter so posting here. \n \nYesterday I recorded a review session for a class with iTalk https://itunes.apple.com/us/app/italk-recorder/id293673304?mt=8. I recorded it on my iPhone 4S. \n \nWhen I got home to upload the file and to convert it to an MP3 to share with the class I discovered that it seemed to not be there in the iTalk file list. \n \n \n \n \n \nI thought - maybe I never formally \"saved\" the file but maybe iTalk kept the recording somewhere. \n \nSo I opened up iTunes connected to my phone and there it was in the Apps file area \n \n \n \n  \nI then copied the file to my desktop and no matter what I do I cannot seem to open it and /or extract audio out of it. I have tried to open it a million ways with all sorts of desktop and online programs and nothing works. My guess is somehow the file was not closed out correctly and thus even though it is 430 Mb it is viewed as empty by all the programs I have tried. \n \nAnyone know a solution for this? \n \nI have posted the file to Dropbox here . \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/1978433439644662697/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://3.blogspot.com/": 1, "http://1.blogspot.com/": 1, "https://www.dropbox.com/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Interesting story in thge BBC News on a paper from PLoS Pathogens: BBC News - Faecal transplant clue to treating gut bug (seems that the article has disappeared - maybe they jumped the Embargo? --- anyone --- found another version here ). In the work, researchers from the Sanger Institute infected mice with Clostridium difficile and then treated them with different combinations of microbes isolated from mouse feces. In the end they are reported to have identified a combination of six strains that was highly effective in clearing the C. difficile infections. I say \"reported to have ...\" because I cannot find the PLoS Pathogens paper, again suggesting to me that the BBC story may have somehow jumped the embargo. Will post more when more comes out.\n\n\n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/945820877240789540/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://www.co.uk/": 1, "http://timesofnews.co/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Very quick post here. This is worth a read: BioTechniques - DNA Extraction: Overcoming Obstacles in Microbial Studies . From their summary: \n \n\" What are the most efficient methods to extract microbial DNA that accurately represents the community it is isolated from? Janelle Weaver reports on efforts to identify the best methods for DNA extraction from unknown frontiers in the human body and across the globe.\" \n \nIt discusses among many things this fascinating paper: Flores GE, Henley JB, Fierer N (2012) A Direct PCR Approach to Accelerate Analyses of Human-Associated Microbial Communities. PLoS ONE 7(9): e44563. doi:10.1371/journal.pone.0044563 \n \nNote - I found out about this on the Twitter \n \n @ dr_bik @ noahfierer Great paper. We wrote about this paper and similar efforts in a #metagenomics feature this month: bit.ly/RJytjr \n— BioTechniques (@MyBioTechniques) October 18, 2012 \n \nOn a related note see the paper from my lab on a metagenomic simulation we did a few years ago ... \n \n PLOS ONE: Metagenomic Sequencing of an In Vitro-Simulated ... \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/4914706797863782029/comments/default", "bloglinks": {}, "links": {"https://twitter.com/": 4, "http://www.plosone.org/": 2, "http://t.co/": 1, "http://www.biotechniques.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://twitter.com/": 1, "http://www.google.com/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Just out as a provisional PDF . \n \n \n Sifting through genomes with iterative-sequence clustering produces a large, phylogenetically diverse protein-family resource \n \nThomas J Sharpton, Guillaume Jospin, Dongying Wu, Morgan GI Langille, Katherine S Pollard and Jonathan A Eisen \n \n BMC Bioinformatics 2012, 13:264 doi:10.1186/1471-2105-13-264 \n \n \n Abstract : \n \n Background New computational resources are needed to manage the increasing volume of biological data from genome sequencing projects. One fundamental challenge is the ability to maintain a complete and current catalog of protein diversity. We developed a new approach for the identification of protein families that focuses on the rapid discovery of homologous protein sequences. \n \n Results We implemented fully automated and high-throughput procedures to de novo cluster proteins into families based upon global alignment similarity. Our approach employs an iterative clustering strategy in which homologs of known families are sifted out of the search for new families. The resulting reduction in computational complexity enables us to rapidly identify novel protein families found in new genomes and to perform efficient, automated updates that keep pace with genome sequencing. We refer to protein families identified through this approach as \"Sifting Families,\" or SFams. Our analysis of ~10.5 million protein sequences from 2,928 genomes identified 436,360 SFams, many of which are not represented in other protein family databases. We validated the quality of SFam clustering through statistical as well as network topology--based analyses. \n \n Conclusions We describe the rapid identification of SFams and demonstrate how they can be used to annotate genomes and metagenomes. The SFam database catalogs protein-family quality metrics, multiple sequence alignments, hidden Markov models, and phylogenetic trees. Our source code and database are publicly available and will be subject to frequent updates ( http://edhar.genomecenter.ucdavis.edu/sifting_families/ ). \n \nWill try to write more on this soon but am in the middle of teaching a 700 person course so a bit overwhelmed with other things. \n \nThanks for the Gordon and Betty Moore Foundation for support for this work. \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/5288338360993936395/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://www.biomedcentral.com/": 2, "http://2.blogspot.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://edhar.ucdavis.edu/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["A student in my Intro Bio class is interested in learning more about the origin and evolution of the genetic code. I am looking for some relatively recent papers to suggest to her.\n\nI have found the following: \n \n \n A four-column theory for the origin of the genetic code: tracing the evolutionary pathways that gave rise to an optimized code \n Optimization models and the structure of the genetic code \n Origin and evolution of the genetic code: the universal enigma \n On origin of genetic code and tRNA before translation \n Imprints of the genetic code in the ribosome \n Codon size reduction as the origin of the triplet genetic code \n \n \nOther suggestions wanted ... \n \n--------------------------- A suggestion from Twitter \n \n\n @ phylogenomics How about this work from Albert Erives: springerlink.com/content/mh546u… ? Very interesting take on code origins — Jay T. Goodwin (@dyna_chem_net) October 16, 2012 \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/6184597766866553861/comments/default", "bloglinks": {}, "links": {"http://www.biomedcentral.com/": 2, "https://twitter.com/": 2, "http://www.pnas.org/": 1, "http://dx.plos.org/": 1, "http://onlinelibrary.wiley.com/": 1, "http://t.co/": 1, "http://phylogenomics.blogspot.com": 1, "http://twitter.com/": 1, "http://www.springerlink.com/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["So cool - check out this Free App The Butterfly Guide for iPhone 3GS, iPhone 4, iPhone 4S, iPhone 5, iPod touch (3rd generation), iPod touch (4th generation), iPod touch (5th generation) and iPad on the iTunes App Store \n \n  \nFrom Melissa Whitaker who is a PhD student in Art Shapiro's lab at UC Davis and who comes to my lab meeting occasionally since she is also interested in microbes associated with butterflies ... \n \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/4808542084340529800/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://butterfly.ucdavis.edu/": 2, "https://itunes.apple.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://1.blogspot.com/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["I have just joined an advisory group for the UC Davis Magazine and I am really happy with their new direction. They are trying to make the magazine a little less \"UC Davis is awesome\" and more \"Here are some interesting things to think about, with a UC Davis angle\". The new Fall Issue is a good example of this. There is for example a nice article by Sasha Abramsky about student involvement (or the lack thereof it). Plus there is a little video interview to go with the article.\n\n\n\nPerhaps even more \"interesting\" is the article on the future of higher education by Clifton Parker . Not exactly a glory piece about UC or UC Davis.\n\nAnyway ... just thought I would put this out there. Any opinions on the magazine please send them my way - the staff there seem great and really interested in feedback. \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/6055153493777726632/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://ucdavismagazine.ucdavis.edu/": 3, "http://phylogenomics.blogspot.com": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Below is another in my series on \"The Story Behind the Paper\" with guest posts from authors of open access papers of relevance to this blog. Today's post comes from David Pollock in Department of Biochemistry and Molecular Genetics, University of Colorado School of Medicine. Note - I went to graduate school with David and he is a long time friend. This is why he apparently feels okay to call me Jon even though I go by Jonathan. I have modified his text only to format it. Plus I added some figures from his paper. \n \n \n\n \n \n \n \n Adaptation and Convergence in Regulatory Systems \n \n \n \n \n Guest post by David Pollock \n \n \n Explanation \n \n This is a guest blog post about a paper of mine just published in Genome Biology and Evolution , \" SP transcription factor paralogs and DNA bindingsites coevolve and adaptively converge in mammals and birds \", and it amounts to my first attempt at an un-press release. You can tell it's not a press release because I'm writing this about a week after the paper came out. This guest blog is coming about because I released an announcement about the paper to a few friends, and credited my old buddy Jon Eisen with having inspired me to move towards avoiding press releases . And I sure wouldn't want this paper to be named in the same breath as the now infamous arsenic bacteria and Encode project press releases (although I note that a recent paper from my lab estimates that the human genome is at least 2/3 derived from repetitive sequence ); also see posts by Michael Eisen and by Larry Moran . I had the vague idea that maybe Jon, Ed Yong , Carl Zimmer , or some other famous blogger would be so inspired by the move (and the fundamental coolness of the paper) that they would quickly write up a thoughtful interpretive summary for general audiences. Jon, however, being much to smart for my own good, suggested that I should write it up as a guest blog instead. So, here I am. At least I got Jon to agree to edit it. \n \n \n \n The fundamentals of the paper \n \nOkay then, why do I think adaptation and convergence in regulatory systems is cool and important? Well, first because I think a lot of important changes in evolution have to have come about through regulatory evolution, and yet there are huge gaps in our knowledge of how this change might happen. And I say this as someone who has spent most of his career studying (and still believing in the importance of) sequence evolution. Second, a lot of people seem to think that evolution of whole regulatory systems should be hard, because there are so many interactions that would need to change at the same time. Remember, transcription factors can interact with hundreds of different binding sites to regulate hundreds of different proteins. It makes sense that evolution of such a system should be hard. In this paper, I think we go a long way towards demonstrating that this intuitive sense is wrong, that functional evolution of regulatory systems can happen quite easily, that it has happened in a system with around a thousand functional binding sites, and that some of the details of how it happens are really interesting. \n \n \n  \n Fig. 1. Evolution of SP transcription factors. (A) SP1 binds preferentially to the GC box in placental mammals and birds (red) and to the ancestral GA box consensus in other vertebrates (black). Modifications in binding motif preferences along the phylogeny are denoted by red-filled circles. ‘Variable regions’ in zinc finger 2 (zf2-VR), containing all non-conserved sites in zinc finger 2 within vertebrates, are shown for SP1, SP3, and SP4. Site –13 (highlighted) is putatively responsible for the change in SP1 binding preferences. (B) Zinc finger 2 (zf2) of human SP1, SP3, and SP4. Each zinc finger contains an alpha-helix and two beta sheets (Philipsen et al. 1999; Dhanasekaran et al. 2006). Red and gray columns denote sites non- conserved across vertebrates; all are contained in the boxed variable region (zf2-VR), comprising sites -13 to -8. Site +3 binds directly to the convergent A/C fourth site of the GC box. (C) SP1 binds to the DNA via zinc fingers 1-3 (zf1-zf3), where zf2 binds to the three central nucleotides of the GC box (GGGCGG) (Philipsen et al. 1999; Bouwman et al. 2002; Dhanasekaran et al. 2006). Site -13 (red) is only 9.5 Å from site +3 (green) and directly contacts the neighboring site (site +4) (Bouwman et al. 2002; Oka et al. 2004; Dhanasekaran et al. 2006). \n \n \nAside from promoting the science, the other reason I want to blog about this paper is that I think it is a great demonstration of how fun and how diverse science can be. To support its points, it brings in many different types of evidence, from genomics to population genetics to protein structure prediction. It is also a good example of using only publicly available data, plus a lot of novel analysis, to see something interesting that was just sitting there. I think there must be a lot more stories like that. All of that Encode data, for example, is bound to have some interesting undiscovered stories, even with 30 papers already published. The most fun part, though, which I don't think I can fully recreate without jumping up and down in front of you, was just the thrill of discovery, and the thrill of having so many predictions fall into place with data from so many different sources. \n \nI don't recall another project where we would say so many times, \" well, if that is the explanation, then let's look at this other thing ,\" and bam!, we look at the other thing and it fits in too. It started with Ken Yokoyama, the first author, walking into the lab having just published some pretty good evidence that the preference for the SP1-associated binding site (the GC-box) was newly evolved in the ancestor to eutherian mammals. Well, if that's true, there ought to be a change in the SP1 protein sequence that can explain it. Sure enough, there is, and SP1 is a very conserved protein that doesn't change a lot. Hmm, we have more sequences now, let's look to see if preferences changed anywhere else on the phylogenetic tree. Yes, in birds. Well, there ought to be a change in bird SP1 that can explain that; sure enough, there is, and it's at the homologous position in the protein. Looking good, but is it in the right place in the protein? Yes, in the right domain (zinc finger 2, or zf2), right behind the alpha helix that binds the nucleotide for which the preference changed. And before you ask, Ken ran a protein structure prediction algorithm on the amino acid replacements in SP1, and the predicted functional replacements in bird and mammal are predicted to bend the protein right at the point where it binds the nucleotide at which the preference changed. You might then ask if this amino acid replacement does anything to the binding function, and the answer again is \"yes\". This time, though, we were able to rely on existing functional studies, which showed that human SP1 binds 3x better to the GC-box binding site than it does to the ancestral GA-box (more on this below). \n \n \n \n  \n Fig. 2. Birth-death rates of the SP1 binding motif in mammals. Birth rates (α) denote the probability (per year) that an unoccupied position will gain a binding site; death rates (β) give the probability (per year) that an existing binding site is lost. Branches in the mammalian phylogeny were partitioned into three groups: early eutherian mammals (red), late eutherian mammals (black), and GA box-preferring non- eutherian mammals (blue). Birth and death rates of each group were estimated for the GC box (GGGCGG), GA box (GGGAGG), and the non-functional motif GGGTGG (Letovsky et al. 1989; Wierstra 2008). \n \n The coup de grace on this residue position as the source of convergent functional changes, though, came with consideration of the other transcription factors that interact in this regulatory system (that is, they bind to the same binding sites to modify transcription). If there was a functional change in the transcription factor, driving modified changes in the binding sites, then it seems that this should affect the other transcription factors in the system. It could have been hard to figure anything out about these other transcription factors, but luckily they consist of SP3 and SP4, two paralogs of SP1. This means that they are ancient duplicates of ancestral SP proteins, they share a great deal of conserved sequence with SP1, and they bind with similar affinities to the SP1 binding consensus. And they have not just one or two, but between the two proteins, in birds and mammals, at least eight convergent amino acid replacements at the homologous position that putatively modified binding in SP1. And the substitution that occurs is the same replacement that occurred in bird SP1. Based on sequences from jawed fish and frogs, this position was almost completely conserved in the SP3 and SP4 paralogs for 360 or 450 million years of evolution. The convergent changes all occurred in only the last 100 million years or less of eutherian and bird lineages. We believe that the simplest interpretation is that, over tens of millions of years, a functional replacement occurred at the SP1 protein, adaptively driving hundreds of SP1 binding sites to convert from ancestral GA-boxes to derived GC-boxes, and that this then drove the same functional replacement in coregulatory paralogs SP3 and SP4. \n \n Timing and a mechanism \n \nTwo questions often comes up at this point, \" how do we know the order of these events ?\" The simplest piece of evidence for the order of events comes from the order of fixation of substitutions. The amino acid substitutions in SP1 are fixed in all eutherian mammals and all birds, indicating that they occurred on the branches leading to these taxon groups. The increase in GC-boxes occurred over time at different loci, mostly on the branch leading to eutherian mammals and on the branches immediately after that split the most ancient eutherian mammal groups. The replacements in SP3 and SP4 occurred later in the evolution of eutherian mammals and birds, and did not occur in all lineages. One might be able to come up with complicated scenarios whereby changes in some SP1 binding sites occurred first, driving the fixation of the SP1 replacement, followed by further selected changes in other SP1 binding sites, but we think our hypothesis is simpler. \n \n \n  \n Fig. 3. Population frequencies of an adaptive mutant transcription factor and its binding sites. (NOTE - SOME DETAIL OF LEGEND LOST IN COPY/PASTE - SEE PAPER). (A) Shown are the population frequencies of the adaptive mutant transcription factor allele (blue), which first occurs in a single heterozygous individual at generation (population size:   ). The total population frequency of the novel binding consensus (BOXC) and the initial wild-type binding motif (BOXA) are shown in red and black, respectively. We assume a small adaptive benefit for the adaptive transcription factor SPC binding to BOXC (relative fitness , where ) over the wild-type transcription factor and its motif (relative fitness ). Maladaptive binding events (SPC binding to BOXA or the wild-type transcription factor binding to BOXC) have reduced fitness ( , where ). Population frequencies of SPC, BOXA, and BOXC are given on the left for the first 20,000 generations and on the right for 150,000 generations. (B) Evolution of the adaptive trans-factor and binding sites under a semi-dominant model. SPC binding to BOXC is assigned relative fitness for individuals heterozygous for the transcription factor genotype (     ) and for individuals homozygous for the mutant transcription factor. (C) The single binding site locus model. In contrast to the previous model, each locus is restricted to no more than one binding motif (either BOXA or BOXC). \n \n \n \nOther pieces of evidence also come into play. The question about the order of events can be rephrased as a question of whether neutral forces, such as changes in mutation rates at binding sites, could have altered the frequency of the alternative binding sites, with SP1 (and then SP3 and SP4) playing functional catch-up to better match the new binding site frequencies. It seems to us that such a model would predict that the binding sites would have changed irrespective to the function of the proteins that they regulate. (As an aside here, we note that our binding site data set is best described not as a definitive set of SP1-regulated promoters, but as a set that is highly enriched in functional SP1 binding sites. We don't trust binding site function predictions, and the putative binding sites inclusively considered were those that had either the ancestral GA-box or the derived GC-box in the functionally relevant region prior to the transcription start site. Such sites are highly enriched for categories of genes known to be under SP1 control.) But the binding sites that shift from GA-boxes to GC-boxes are even further enriched for categories of genes under SP1 control. This is not compatible with the neutral mutational shift model, but is compatible with the idea that the subset of our sites for which SP1 regulation is most important are the ones that were most likely to adaptively shift box type when the SP1 with altered function became more frequent. \n \nThe mutational driver model also predicts a simple shift in frequencies driven by mutation. For example, GA-boxes might tend to mutate into GC-boxes, and conversely, GC-boxes might tend to be conserved and not mutate to GA-boxes. What I haven't told you yet, though, is that the excess GC-boxes do not tend to be produced by mutation from GA-boxes, but rather they tend to be produced as de novo mutations from non-SP1 box sequences. They are produced by a wide variety of mutations from a wide variety of different sequences that are slightly different from the canonical SP1 binding sites. Furthermore, the GC-boxes appear in a burst of birth early in eutherian evolution, but the GA-boxes don't disappear in a burst at the same time. Rather, they simply fade away slowly over time in lineages that have evolved GC-boxes. It is not clear to us that this can be explained using a mutation model, but it is easily explained by a model in which the SP1 replacement has adaptively driven hundreds of binding site convergent events. This is then followed by the slow mutational degradation of the GA-boxes, which don't matter so much to function anymore. It is also worth mentioning that the GC box preference doesn't seem to correlate with GC content, as several fish lineages are just as high in GC content as humans, but do not have the GC-box preference. \n \n \n  \n Fig. 4. Structural changes of SP1 zinc finger 2 (zf2) following replacements at site -13. (Top) Comparisons of predicted lowest-energy zf2 structures between the native human peptide (-13M), and peptides following replacements to the ancestral valine (M-13V) and bird isoleucine (M-13I) at site -13. Structural alignments were conducted according to residues on the 5’ end of the peptide (residues -16 to -12). Both -13M and M-13I peptides showed displacement of residues 5’ to the DNA-contacting alpha-helix (sites -6 to -1) compared to the ancestral valine peptide. No such displacement was seen between -13M and M-13I. All three peptides aligned closely at the 3’ end of the alpha-helix (sites +6 to +10), reflecting structural modifications at the 5’ end of the alpha-helix. (Bottom) Distances between alpha carbons prior to and within the alpha-helix (blue and orange, respectively). Comparisons between the native human peptide and M-13V (left) and between M-13I and M-13V (center) show closely-aligned residues at the 3’ end of the alpha-helix and increasing displacement towards the 5’ end. These modifications begin around site +3, which directly contacts the A/C evolving site of the SP1 binding motif (Philipsen et al. 1999; Bouwman et al. 2002; Dhanasekaran et al. 2006). No such region- specific displacement between -13M and M-13I was observed between -13M and M-13I (right). \n \n \nThe observed pattern of binding site evolution is also predicted by a model we developed to determine if the evolution of transcription factors and their binding sites could be explained in a population genetics framework. We asked, what is a possible mechanism by which these changes might occur? At the beginning of this post, I noted that a lot of people seem to think that evolution of complex multi-genic regulatory systems should be hard. We reasoned, though, that if the beneficial effects of a newly evolved binding interaction were dominant or semi-dominant (that is, the beneficial effects in the heterozygote were at least partly visible to selection), then it might be possible for evolution to be achieved through a transition period in which both the transcription factor and its cognate binding sites were polymorphic. \n \nWe developed both a deterministic and a stochastic model, and found that, indeed, even small (nearly neutral) selective benefits per locus can drive the entire system to fixation. What happens is that as long as there are some binding loci with the new binding box in the system, then a new variant of SP1 with a preference for the new binding box, and an associated small selective benefit, will at first rapidly increase in frequency. It won't immediately fix though, but rather will maintain a temporary steady state, kept down in frequency by the deleterious effects that new variant homozygotes would have with the large number of binding loci that are homozygous for the ancestral binding box. Once it has reached this steady state, it exerts selective pressure on all the binding loci to increase the frequencies of the new binding boxes at each locus. Much more slowly then, the frequency of the new transcription factor variant increases, in step with the frequencies of new binding boxes at all the binding loci. \n \nAlthough our studies do not prove that our population genetics model is the exact mechanism for adaptive changes in SP1, it provides proof of concept that it is not difficult for such a mechanism to exist. \n \n \n Where does this leave us? \n \nAt the broader level, this paper shows that small selective benefits can drive the evolution of complex regulatory systems (in diploids, at least; sorry to leave out the micro folks, Jon). Furthermore, it demonstrates, we believe convincingly, that adaptation has driven the evolution of the SP1 regulatory system, driving convergent evolution at many hundreds of promoters, and in SP3 and SP4. It thus strongly counters prevailing notions that such evolution is hard. We hope that this work (along with other work of this kind) will drive others to further pursue the broad questions in regulatory evolution. Are the details of the SP1 system common to other regulatory systems? \n \nA particularly important question, which we did not focus on here, is whether the evolution we have described involves only static maintenance of the status quo in terms of which genes are regulated. One has to wonder, though, whether if it is easy to evolve a static regulatory system, that it is not therefore easier than previously believed to modify regulatory connections in a complex regulatory system. There are hints of such changes here, in that genes that may have gained novel SP1 regulation (that is, gained a GC-box when they did not have the ancestral GA-box) tend to be enriched in certain GO categories (see Table 2 in the paper). \n \nFor SP1, it will be interesting to see if good stories can be developed for to explain why this adaptation should have occurred specifically in birds and eutherian mammals. The ideal story should include both a biophysical mechanism, and a physiology-based mechanism, such as the possibility that warm-bloodedness played a role. Both of these avenues promise to be complicated, if addressed properly. For example, we believe that it will be more meaningful if a biophysical mechanism can address the need for specificity as well as strength of binding, perhaps by utilizing next-generation sequencing approaches to measure affinities for all relevant binding site mutations (see, among others, our recent paper on this topic, Pollock et al., 2011 ). Are there interactive roles for selection on transcription factor concentration as well as efficiency and selectivity? What trade-offs exist among binding efficiency and binding site duplication? Do different types of regulatory connections evolve differently? These are all great questions for future research. \n \n Addendum \n \nI'll try to add further comments if questions or issues come up. I'm particularly interested to see how this non-press release guest log post works as an experiment to promote the paper and the work. I also hope it will promote Ken Yokoyama's career (he's now at Illinois, and will probably be looking for an academic job in the next year or two). He did an awesomely diverse amount of work on this, learning how to work in totally new areas for him, such as population genetics, birth/death models, and protein structure prediction. He dove into these areas unhesitatingly to pursue the logical scientific questions, developed novel analyses, and did a great job. This paper represents a fundamental contribution and a fantastic advertisement for Ken's abilities. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/6029264957530632050/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://selab.janelia.org/": 1, "http://blogs.discovermagazine.com/": 2, "http://www.plosgenetics.org/": 1, "http://1.blogspot.com/": 1, "http://www.evolutionarygenomics.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://www.blogger.com/blog": 4, "http://www.theatlantic.com/": 1, "http://sandwalk.blogspot.com/": 1, "http://4.blogspot.com/": 3, "http://www.nih.gov/": 1, "http://phylogenomics.blogspot.com/": 2, "http://gbe.oxfordjournals.org/": 2, "http://www.michaeleisen.org/blog": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Compiling posts and articles discussing why Carl Woese deserves a Nobel Prize. Will be writing a new article on this but felt like I should share the articles in case I don't get done in time \n \n A Tale of Woese by Douglas Page in 1998 \n Here's hoping molecular classification of cultured and uncultured microbes wins #NobelPrize in medicine by me in 2010 \n And the winner should be... : Article Darwin Nature Reviews Microbiology in 2011 \n Darwin's Disciple from Amherst Magazine in 2002 \n I note I do not think Woese should win a Nobel for discovering the archaea. That was a groundbreaking finding but it does not fit well with the Nobel Prize categories. I think he should win it for the concept of molecular classification of microorganisms and applying this in general to the microbial world around us. This concept (expanded by Norm Pace and colleagues to uncultured microbes) revolutionized our approach to studying single microbes in the environment, to studying single microbes infecting people and to studying communities of microbes in and on people. And thus Woese and Pace in my opinion deserve the Nobel Prize for Medicine. I will be expanding on this in a future post ... \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/3971493501476721096/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://home.earthlink.net/": 1, "http://phylogenomics.blogspot.com": 1, "http://www3.amherst.edu/": 1, "http://www.google.com/": 2}, "blogtitle": "The Tree of Life"}, {"content": ["Wow - just got an email from a colleague with details on a scientific publishing saga. Here is the summary: \n \nStage 1: Jenica Rogers wrote a blog post expressing a bit of frustration with the American Chemical Society and their publishing system: Walking away from the American Chemical Society \n \nStage 2: The Chronicle for Higher Education wrote a story about it: As Chemistry Journals' Prices Rise, A Librarian Just Says No \n \nStage 3: The Director of Public Affairs for the ACS responded to questions and was quoted with the following \n \n“We find little constructive dialogue can be had on blogs and other listservs where logic, balance and common courtesy are not practiced and observed,” Glenn S. Ruskin, the group’s director of public affairs, said in an e-mail message. “As a matter of practice, ACS finds that direct engagement via telephone or face-to-face with individuals expressing concern over pricing or other related matters is the most productive means to finding common ground and resolution.\" \nThen he attempted to clarify some details of the quote in that he claimed that the following got left off the end of the quote \"Therefore, we will not be offering any response to this blog posting or the conversation that has ensued.\" but when doing this he g ot a bit personal and nasty : \n \nThe individual responsible for the above cited blog certainly has the right to her opinion, but that does not excuse rude behavior or her use of profanity and vulgarity in addressing ACS or its employees. While not evident in the most recent postings, I won’t repeat what she has posted in the past. But I think you would agree that vulgarity and profanity postings do not lend themselves to meaningful, productive and civil discourse, thus our decision not to engage any further with her on this topic \nAnd the discussion continued on various blogs like Chembark . The most disturbing part to me of the whole thing is that it is hard to find anything particularly extremely vulgar in writings by Jenica Rogers (I note - I only googled around for a minute or so so I may have missed things but Walk Walt at Random has more detail on this and also did not find any serious vulgarity). Generally I find the response of ACS to be extremely distasteful. They don't like what she wrote. So they go after her character. Brilliant. \n \nFor other takes on this story see \n \n \n When you’re wrong on the message… \n On Discourse, Civility, and Vendors; or, JoVE and ACS and bullies \n The ACS and FUD \n Supposed To’s: An Open Letter to Library Director \n we are not the ones who failed \n A Call to Action | The Daily Scan | GenomeWeb \n Electric Librarian \n BeerBrarian: September 2012 \n The American Chemical Society: Paving paradise to put up a ... \n \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/6898069249172924359/comments/default", "bloglinks": {}, "links": {"http://pegasuslibrarian.com/": 1, "http://beerbrarian.blogspot.com/": 1, "http://blog.chembark.com/": 1, "https://list.indiana.edu/": 1, "http://phylogenomics.blogspot.com": 1, "http://chronicle.com/": 1, "http://twitter.com/": 1, "http://www.attemptingelegance.com/": 3, "http://stevelawson.name/": 1, "http://www.google.com/": 4, "http://walt.lishost.org/": 2}, "blogtitle": "The Tree of Life"}, {"content": ["Wow. I am always on the lookout for microbe-themed art. In most cases, when I see such art, I think \"wow - that is an interesting way of embedding microbes into a traditional form of art\". You know - painting with microbes or art with microbes in it or such. Well, in this new case I can say this is the most unusual and most creative use of microbes in art I have ever seen: Opera singer grows algae on her face by feeding it with her breath and then the audience eats it \n \nYou see, an opera singer work a \"head-mounted, face-clinging device\" which contained within in some algae in water. And then the algae was fed by the opera singer's breath. This is part of something called the \" Algae Opera \". The most amazing part of this is described in the io9 article \n \n\"Because the algae's growth is dependant on the amount of CO2 it receives, the singer controlled her pitch and volume to alter various characteristics of the algae, including taste (what they called \"sonic enhancement\"). Depending on the way she sang, the different pitches and frequencies could make the food taste either bitter or sweet\" \nAnd then at the end of the performances the audience was invited to sample some of the algae. Yum. Certainly a bit weird. But kudos on the creativity index. \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/6399997783603224696/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://happyfamousartists.com/blog": 1, "http://io9.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://img.gawkerassets.com/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["A new paper is getting some press on a link between type II diabetes and the microbiome. The paper is here . The abstract of the paper reads: \n \nAssessment and characterization of gut microbiota has become a major research area in human disease, including type 2 diabetes, the most prevalent endocrine disease worldwide. To carry out analysis on gut microbial content in patients with type 2 diabetes, we developed a protocol for a metagenome-wide association study (MGWAS) and undertook a two-stage MGWAS based on deep shotgun sequencing of the gut microbial DNA from 345 Chinese individuals. We identified and validated approximately 60,000 type-2-diabetes-associated markers and established the concept of a metagenomic linkage group, enabling taxonomic species-level analyses. MGWAS analysis showed that patients with type 2 diabetes were characterized by a moderate degree of gut microbial dysbiosis, a decrease in the abundance of some universal butyrate-producing bacteria and an increase in various opportunistic pathogens, as well as an enrichment of other microbial functions conferring sulphate reduction and oxidative stress resistance. An analysis of 23 additional individuals demonstrated that these gut microbial markers might be useful for classifying type 2 diabetes. \nSeems pretty reasonable. All they say there is that they found associations between bacteria and diabetes. That is interesting but they do not seem to present any evidence about a causal connection. Perhaps people who get type II diabetes end up then having their microbiome shift. Perhaps a shift in the microbiome causes type II diabetes. Or perhaps something else (e.g., excessive inflammation) causes both type II diabetes and microbiome shifts. Who knows. \n \nBut alas a bit of hype crept into some of the the news stories. And it seems that the scientists behind the study are responsible for some of this hype. For example, consider the article Changes in Intestinal Bacteria Linked to Type 2 Diabetes - US News and World Report . One quote is a bit much for me: \n \n\"I think our study provides many targets for disease prevention and treatment through gut microbiotia in the near future,\" said study senior author Jun Wang, executive director of the Beijing Genomics Institute in Shenzhen, China. \nFortunately the reporter who wrote this story does a very good job of providing cautious interpretations. See for example: \n \n\"There's no way right now that you can say there's a cause-and-effect relationship. It could be that the patients with diabetes were treated with drugs that changed their gut flora. Or maybe they ate differently? This is an interesting hypothesis -- that gut bugs could influence diseases states -- but it's far from proven,\" said Dr. Stuart Weinerman, associate chief of the division of endocrinology at North Shore University Hospital/Long Island Jewish Medical Center in New Hyde Park, N.Y. \nAlso see stories like Gut bacteria could cause diabetes from Science Codex. The title alone makes me want to cry. Some quotes as well as discussion in that article also seem, well, not cautious enough. \n \nThe research, which was recently published in the scientific journal Nature, also demonstrated that people with type 2 diabetes have a more hostile bacterial environment in their intestines, which can increase resistance to different medicines. \nDefinitely not buying this \"hostile\" environment claim. Fortunately as with the US News story, there is some caution presented \n \n\"It is important to point out that our discovery demonstrates a correlation. The big question now is whether the changes in gut bacteria can affect the development of type 2 diabetes or whether the changes simply reflect that the person is suffering from type 2 diabetes.\" \n So - the stories seem to actually be doing an OK job with the correlation vs. causation issue I have complained about many times. And though some of the scientists may be pushing a bit of overinterpretation the reporters and even the press releases have some decent cautionary statements. \n \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/8996270305108079868/comments/default", "bloglinks": {}, "links": {"http://www.sciencedaily.com/": 1, "http://health.usnews.com/": 1, "http://www.nature.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://twitter.com/": 1, "http://www.google.com/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["CNN has a story on a fecal transplant case: Little-known fecal transplant cures woman's bacterial infection - CNN.com . It is worth a look and if you want to laugh (sometimes in pain, sometimes for jokes) read the comments. Some other recent stories on this topic include \n \n 'Ick factor' not withstanding, patients would accept fecal transplants ... \n What a relief! -- Stool transplant cures Sheldon woman's C. diff ... \n RI to Host Groundbreaking Medical Trial for C. Diff \n \n \nAnd the CNN story got picked up by Reddit \n \n Little-known fecal transplant cures woman's bacterial infection - Reddit \n \n \nAs many know - I have been talking / writing about such treatments a bit recently. I discussed it in my Tedmed talk ( which is now on Ted) . \n \n\n\n\n \n\nAnd I have a blog post with background and links on the topic . \n \n \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/9082790077626969715/comments/default", "bloglinks": {}, "links": {"http://www.cnn.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://twitter.com/": 1, "http://phylogenomics.blogspot.com/": 1, "http://www.google.com/": 4, "http://www.ted.com/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/8011632254506922763/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://phylogenomics.blogspot.com": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Playing around with Paper.Li. Took feeds from the blogs and Twitter profiles of people in my lab. Seems to come out OK ...\n\n\n     \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/3002800041044535109/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://phylogenomics.blogspot.com": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Got some questions about the Lake Arrowhead Microbial Genomes 2012 Meeting in regard to gender ratio of speakers and organizers, after I have been complaining about ratio at other meetings . Here is the full list of speakers and organizers for this meeting. Women in bold. \n \n \n \n Organizers : \n \n \n \n Jeffrey H. Miller \n Jonathan Eisen \n Ashlee Earl \n Lisa Raleigh \n \n \n So the organizers are a 50-50 split. \n \n \n \n Speakers (in order) \n \n \n \n Jonathan Eisen \n Nina R. Salama \n Frederic Bushman \n Kristine Wylie \n Janet K. Jansson \n Forrest Rohwer \n Curtis Huttenhower \n Tanja Woyke \n Maomeng Tong \n Jeffrey Cox \n Susannah Tringe \n Julian Parkhill \n Rustem F. Ismagilov \n Gautam Dantas \n Pamela Yeh \n Mike Gilmore \n Lance B. Price \n James Meadow \n Jason E. Stajich \n Laura Sauder \n Tara Schwartz \n Susanna Remold \n Bernhard Palsson \n Anca Segall \n Trent Northern \n Rick Morgan \n Beth Shank \n Morgan Langille (added) \n Anthony Fodor (added) \n Peter Karp \n Tatiana Tatusova \n Timothy Harkins \n Katrine Whiteson \n Mallory Embree \n Varum Mazumdar \n Abigail McGuire \n Ee-Been Goh \n Shota Atsumi \n Howard Xu \n \n \nSo 37 39 speakers, 16 of which are women. So that comes to 43.2 41%. \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/456610331207812772/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://phylogenomics.blogspot.com/": 2, "http://phylogenomics.blogspot.com": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Meeting went well. Here is a storification of it: \n \n \n [ View the story \"Lake Arrowhead Microbial Genomes 2012 #LAMG12\" on Storify ] \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/1553909094831174067/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://storify.com/": 1, "http://phylogenomics.blogspot.com": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Woohoo. Just discovered a cool (I think new) thing. Was looking for a link to a new publication of mine. And I searched Google Scholar \n \n \n \n \nThat gets my publications but they are sorted by citation number which alas does not pull up new publications. So I went to click on the \"Since 2012\" button I usually click on \n \n \n \n \n \n \nAnd I noticed something I have not noticed before (and that I think must be pretty new): \n \n \n \n \nWoohoo - a full sort by date option. And so I clicked it and indeed it did work. \n \n \n \n \nThis will make Google Scholar much more useful for certain purposes. This - along with other new features such as the Google Scholar \"Updates\" system is giving me hope that Google will continue to expand the tools/features of Google Scholar. \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/8531690597156013156/comments/default", "bloglinks": {}, "links": {"http://4.blogspot.com/": 1, "http://twitter.com/": 1, "http://2.blogspot.com/": 3, "http://phylogenomics.blogspot.com": 1, "http://www.google.com/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["Microbiology art pops up again. This time in this story from Jennifer Welsh: Galaxies And Faces Drawn With Glowing Bacteria - Business Insider . For more see the artist Zachary Copfer's website here: http://sciencetothepowerofart.com . Other stories about Copfer are popping up too - not sure if their is some publicity blitz going on or not but see below for examples: \n \n Bacteriograph: Photographs Printed with Bacterial Growth \n Zachary Copfer Blends Bacteria And Photography In Bacteriography ... \n These Incredible/Gross Photos Were Printed With E. Coli Bacteria \n Here's one I've grown earlier: Scientist-turned-artist uses bacteria to .. \n \"Bacteriografia\": artista cria retratos de cientistas famosos utilizando ... \n ut whatever is going on the art is worth checking out. \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/5582353984281229454/comments/default", "bloglinks": {}, "links": {"http://www.businessinsider.com/": 1, "http://static4.businessinsider.com/": 1, "http://twitter.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://sciencetothepowerofart.com/": 1, "http://www.petapixel.com/": 1, "http://www.google.com/": 4}, "blogtitle": "The Tree of Life"}, {"content": ["See phyloseminar.org home for more detail. \n \n \n \nNext talk \n \n \n \nInferring macroevolutionary processes based on phylogenetic trees\" \n \nTanja Gernhard Stadler (ETH Zurich) \n \n \nPhylogenetic trees of present-day species allow inference of the rate of speciation and extinction which led to the present-day diversity. Classically, inference methods assume a constant rate of diversification, or neglect extinction. I will discuss major limitations of this null model and will present a new framework which allows speciation and extinction rates to change through time (environmental-dependent diversification), with the number of species (density-dependent diversification), and with a trait of a species (trait-dependent diversification). For the latter model, particular focus is given to the trait being the age of a species. Issues arising in empirical data analysis, such as incomplete taxon sampling, model selection, and confidence interval estimation, will be discussed. The methods reveal interesting macroevolutionary dynamics for mammals, birds and ants, and can easily be applied to other datasets using the R packages TreePar and TreeSim available on CRAN. \n \n \n \n \n \nWest Coast USA: 10:00 (10:00 AM) on Wednesday, September 19 \n \nEast Coast USA: 13:00 (01:00 PM) on Wednesday, September 19 \n \nUK: 18:00 (06:00 PM) on Wednesday, September 19 \n \nFrance: 19:00 (07:00 PM) on Wednesday, September 19 \n \nJapan: 02:00 (02:00 AM) on Thursday, September 20 \n \nNew Zealand: 05:00 (05:00 AM) on Thursday, September 20 \n \n \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/886889595634673478/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://phyloseminar.org/": 1, "http://phylogenomics.blogspot.com": 1}, "blogtitle": "The Tree of Life"}, {"content": ["I have been wanting to start a new series here on my blog about examples of great writing in scientific publications. There is a lot out there on great science writing. But that is not what I am writing about here. I mean actual scientific research papers where the writing itself is exceptional. And todays example, which may be a bit unfair, comes from the one and only Vladimir Nabokov. For not only was he a great writer of literature, he was also a lepidopterist. He was for some time the curator of leps at the Harvard Museum of Comparative Zoology. \n \nI note - I first discovered this when I got a work-study job shelving books at a library at Harvard only to discover that that library had on display a collection of Nabokov's butterflies. I got little shelving done when nobody else was around). \n \nAnyway, I had read some of his short stories and book in high school but was not aware of his butterfly obsessions. What amazed me most was they had some of his butterfly research papers on display too and they were simply amazing to read. The writing in them is just awesome. \n \nSo thus we get to todays's example of great writing in science papers: Notes on Neotropical Plebejinae (Lycaenidae, Lepidoptera) . Thankfully, somehow, Hindawi publishers have come into possessing of the rights to the back issues of the journal Psyche where this was published and it is freely available as a PDF . The paper is not perfect mind you - some parts are written more eloquently than others. But there are sparks in there of what I think are wonderful (for a science research papers). Some of my favorite parts are quoted below: \n \nThe results proved so unexpected and interesting that it seems worth while to publish the present paper despite its rather superficial and incomplete nature. \n \n \nIn a way the initial blunder was Swinhoe’s who while correctly giving a subfamilial ending to the group which Tutt’s intuition and Chapman’s science had recognized (\"tribe\" Plebeidi which exactly corresponds to the Plebefine of Sternpffer) as different from other \"tribes\" (i.e., subfamilies) within the Lyccenidce, failed to live up to the generic diagnoses which he simply copied from Chapman’s notes in Tutt and tried to combine genitalic data he had not verified or did not under- stand with the obsolete \"naked v. hairy eyes\" system (which at Butler’s hands had resulted in probably the most ludicrous assembly of species ever concocted, see for example Butler 1900, Entom. 33: 124), so that in the case of several Indian forms which Chapman had not diagnosed, Swinhoe placed intra- \ngenerically allied species in different subfamilies and species belonging to different Tuttian \"tribes\" in the same subfamily. [[ YES - THIS IS ONE SENTENCE]] \n \nThe arrangement proposed in the present paper needs to be prefaced by a few words on taxonomic units. The strictly biological meaning forcibly attached by some modern zoologists to the specific concept has crippled the latter by removing the morphological moment to a secondary or still more negligible position, while employing terms, e.g., \"potential interbreeding,\" that might make sense only if an initial morphological approach were presupposed. \nI am sure there are other Nabokov papers with other choice sections ... will be looking for those later. If anyone has suggestions for other great writing in science papers, please post comments .. \n \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/4850117215694437903/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://downloads.hindawi.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://t2.gstatic.com/": 1, "http://www.hindawi.com/": 1}, "blogtitle": "The Tree of Life"}, {"content": ["So when this press release about microbes and hyenas came out: Microbes help hyenas communicate via scent I wanted to write about it. But I could not figure out what I thought about the story. Still don't know what I think but it is interesting and worth sharing. Also see the original paper: \n \nKevin R. Theis, Thomas M. Schmidt, Kay E. Holekamp. Evidence for a bacterial mechanism for group-specific social odors among hyenas. Scientific Reports, 2012; 2 DOI: 10.1038/srep00615 \n \nFor some possible related papers see \n \n \n Bats, bacteria, and bat smell: sex-specific diversity of microbes in a sexually selected scent organ \n Problems Caused by Microbes and Treatment Strategies Health and Safety Issues from the Production of Hydrogen Sulphide \n The relationship between oral malodor and volatile sulfur compound–producing bacteria \n Assessing the relationship between concentrations of malodor compounds and odor scores from judges \n Association of odor from infected root canal analyzed by an electronic nose with isolated bacteria \n \n \n-------- \nThis is from the \"Tree of Life Blog\" \nof Jonathan Eisen, an evolutionary biologist and Open Access advocate\nat the University of California, Davis. For short updates, follow me on Twitter. \n \n--------"], "link": "http://phylogenomics.blogspot.com/feeds/4261010409642657860/comments/default", "bloglinks": {}, "links": {"http://www.sciencedaily.com/": 1, "http://oto.sagepub.com/": 1, "http://jada-plus.com/": 1, "http://www.nature.com/": 1, "http://phylogenomics.blogspot.com": 1, "http://twitter.com/": 1, "http://www.asmjournals.org/": 1, "http://www.springerlink.com/": 1, "http://www.sciencedirect.com/": 1}, "blogtitle": "The Tree of Life"}]