[{"blogurl": "http://fungalgenomes.org/blog\n", "blogroll": [], "title": "The Hyphal Tip"}, {"content": ["We held a workshop last for some of the people using and developing tools and databases for fungal molecular ecology in Fungi in (beautiful) Boulder, CO last week as part of our efforts in the Microbiome of the Built Environment . I am working with my co-organizer and participants to prepare a meeting summary and some descriptions of concrete plans forward. We expect this to make it easier to analyze Fungal ITS sequences in tools like QIIME and provide linkage with resources built around phylogenetic analyses of Fungi. An longer meeting summary will be posted in the coming week after we have all the presentations gathered and the details of the meeting written out."], "link": "http://fungalgenomes.org/blog/2012/10/fungal-its-database-workshop/", "bloglinks": {}, "links": {"http://fungalgenomes.org/blog": 1, "http://microbe.net": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["Faculty Position in the Department of Microbiology. \n The Department of Microbiology and the Institute on Ecosystems at Montana State University Bozeman invites candidates with a PhD in Microbiology or related area to apply for a full-time, nine-month tenure track position in Environmental Microbiology at the Assistant Professor level beginning August 2013.  The successful candidate will have postdoctoral and/or Assistant Professor experience and will be responsible for developing an extramurally funded, nationally recognized research program within the broad field of environmental microbiology.  The faculty member will participate in teaching departmental undergraduate and graduate courses in their area of specialization, and will be responsible for providing service to the university and scientific community via integration of research, teaching, and service.  A competitive institutional salary, a generous start-up package, and a renovated state-of-the-art research facility support this position. Full details about the position and application procedure are available at http://www.montana.edu/jobs/faculty/12245-2 . \n Potential candidates are encouraged to contact the Search Committee Chairpersons, Drs. Mark Young or Matthew Fields, ( myoung@montana.edu ; matthew.fields@biofilm.montana.edu ) for more details.  Screening will begin Dec 1st, 2012 and will continue until a suitable applicant is hired.  ADA/EO/AA/Veterans Preference"], "link": "http://fungalgenomes.org/blog/2012/10/montana-state-env-micro/", "bloglinks": {}, "links": {"http://fungalgenomes.org/blog": 2, "http://www.montana.edu/": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["The University of California, Merced is a dynamic new university campus in Merced, California, which opened in September 2005 as the tenth campus of the University of California and the first American research university in the 21st century. In keeping with the mission of the University to provide teaching, research and public service of the highest quality, UC Merced offers research-centered and student-oriented educational opportunities at the undergraduate, master’s and doctoral levels through three academic schools: Engineering, Natural Sciences and Social Sciences/Humanities/Arts. \n http://jobs.ucmerced.edu/n/academic/position.jsf?positionId=3D4252 \nThe Molecular Cell Biology group in the School of Natural Sciences at the University of California, Merced invites applications from exceptional scholars and teachers at the Assistant Professor (tenure track) level in Biostatistics. \n Biostatistics is the development and use of statistical methods for medical and biological datasets including, but not limited to applications in experimental design, quantitative biology, epidemiology, medical informatics, nutrition, evolutionary biology, sequence bioinformatics, genomics, metabolomics, and systems biology. Current strengths of the Molecular Cell Biology group at UC Merced include cancer metabolism, diabetes, inflammation, infectious disease, and mechanisms of cell fate decisions. Ideally, applicants should demonstrate successful grantsmanship and nationally recognized research. We encourage applications from women and members of ethnic minorities. \n The University of California at Merced is an affirmative action/equal opportunity employer with a strong institutional commitment to the achievement of diversity among its faculty, staff, and students. The University is supportive of dual career couples. \n Qualifications:   Strong applicants should have a Ph.D. and show a track-record in development and/or application of methods in biostatistics, biomedical informatics, epidemiology, multiple hypothesis testing, Bayesian estimation and model selection, Markov chain Monte Carlo, machine learning and/or other areas. The successful candidate will be expected to cultivate collaborative research relationships with faculty in biology, health sciences, and may also collaborate with applied mathematics. \n Other qualifications include: \n(1) Quality, importance, and impact of past and current research in an area of biostatistics as judged by publications, awards, and letters of recommendation. \n (2) External funding history or potential for obtaining external funding. \n (3) Likely importance and impact of future research as judged by research plan and \nletters of recommendation. \n (4) Research interests that complement and strengthen those of current faculty \nin the biological sciences. \n (5) Potential ability to mentor graduate and/or post-graduate students and to contribute to graduate education and training, particularly of minorities underrepresented in health and \nSTEM fields. \n (6) Potential effectiveness as an educator at both undergraduate and graduate levels based on teaching statement, experience, teaching evaluations, and letters from former students (as available). \n Closing Date:         12/10/2012"], "link": "http://fungalgenomes.org/blog/2012/10/uc-merced-prof-of-biostatistics/", "bloglinks": {}, "links": {"http://ucmerced.edu": 1, "http://jobs.ucmerced.edu/": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["UNIVERSITY OF OREGON \n Faculty Positions in Genomics, Bioinformatics, Statistical Genetics \n The Departments of Biology ( http://biology.uoregon.edu ) and Mathematics ( http://math.uoregon.edu ) at the University of Oregon announce a cluster hire of up to three tenure-related faculty positions in Fall 2013. One of these positions may be at the level of Associate or Full Professor with indefinite tenure. These hires are part of an integrated effort to strengthen research and scholarship at the nexus of statistics/mathematics and biology at the University of Oregon, and will serve as a catalyst for future growth in this area. We are broadly interested in recruiting candidates working in areas developing statistical methodology related to the life sciences. Examples of these areas include, but are not limited to, statistical analysis of large data sets, algorithms for analyzing sequence data, and stochastic models for neuroscience, population genomics and molecular evolution. Successful candidates will bolster our emerging strengths in biomathematics, maintain an outstandi \nng research program that focuses on solving core problems in this area, and have a commitment to excellence in teaching. Ph.D. required. Position responsibilities include undergraduate teaching. \n Interested persons should apply online to the MATHBIO SEARCH, University of Oregon at https://www.mathjobs.org/jobs/jobs/4035 . Applicants should submit a cover letter, a curriculum vitae including a publication list, a statement of research accomplishments and future research plans, a description of teaching experience and philosophy, and three letters of recommendation. Ideally the research description and at least one of the letters of recommendation would include descriptions of the statistical/mathematical tools or models used in the applicant’s research. To ensure consideration, application materials should be uploaded by November 15th, 2012, but the search will remain open until the positions are filled. \n Women and minorities are encouraged to apply. The University of Oregon is an Equal Opportunity/Affirmative Action Institution committed to cultural \ndiversity and compliance with the Americans with Disabilities Act, and supportive of the needs of dual career couples. We invite applications \nfrom qualified candidates who share our commitment to diversity."], "link": "http://fungalgenomes.org/blog/2012/10/univ-of-oregon-faculty-position-in-genomics-bioinformatics-statistical-genetics/", "bloglinks": {}, "links": {"http://math.uoregon.edu": 1, "https://www.mathjobs.org/": 1, "http://biology.uoregon.edu": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["Position: http://www.cbs.umn.edu/facres/cluster-hiring-cbs/fungal-evolution/position-description \nCluster in Plant & Fungal Evolution: http://www.cbs.umn.edu/facres/cluster-hiring-cbs/fungal-evolution \nCluster hiring website: http://www.cbs.umn.edu/facres/cluster-hiring-cbs \n The College of Biological Sciences at the University of Minnesota announces up to two tenure-track positions in fungal biology at the assistant professor level with potential for hiring at the tenured associate level should outstanding candidates at this level be identified. This position will complement a faculty cluster focused on plant and fungal evolution. Research facilitating collaborations in evolutionary genomics, phylogenetic systematics, evolutionary ecology, molecular biology or cellular biology of fungi is of special interest. We welcome applicants working in any area of fungal biology and are particularly interested in those whose research explores the interface between organismal and genetic approaches to the study of evolutionary processes. \n Duties and Responsibilities: \nThe successful candidate will develop a strong, extramurally funded research program investigating evolutionary processes in fungal systems, pursue a scholarly, innovative teaching program, advise undergraduate, graduate and postdoctoral research, and participate in professional service. Faculty positions at the University of Minnesota provide opportunities for collaboration between researchers in all disciplines, and involvement in several excellent graduate programs. \n Required Qualifications: \n \n Ph.D. (or foreign equivalent) in fungal biology or a related discipline, and appropriate post-doctoral experience \n Strong publication record in disciplines related to the position \n Potential to initiate and sustain strong extramurally funded research program in fungal biology \n Ability to communicate effectively with multiple audiences \n Track record of interacting creatively, collaboratively and productively with other scientists \n Evidence of potential to be an effective teacher and commitment to innovative teaching and student learning \n \n Materials Required: \n \n Letter of application/intent \n CV \n Names/contact information for three professional references \n Statements of research and teaching \n \n The deadline is November 1. There will also be searches in another college at UMN for 1-2 fungal biologists over the coming years so there is a strong culture of fungal biology continuing to grow in Minnesota (excuse the pun!)."], "link": "http://fungalgenomes.org/blog/2012/10/innovative-cluster-hires-in-fungal-biology-minnesota/", "bloglinks": {}, "links": {"http://www.umn.edu/": 3}, "blogtitle": "The Hyphal Tip"}, {"content": ["Considering a PhD program for next year? Want to work in Hawaii with incredible diversity of species with a new lab that is interested in a variety of mycological mysteries in Microbial Diversity, Ecology and Evolution or Community Ecology? Then may I recommend you take a look at two new labs in the  Botany department  at the  University of Hawai’i at Manoa , those of Dr  Nicole Hynson  and Dr  Anthony Amend . \n Dr Amend is  interested in graduate students  who would like to start in Fall 2013. His lab studies microbial communities and microbe-host interactions with recent projects on symbiotic relationships between plants and fungi and corals and fungi. \n Dr Hynson’s work focuses on community ecology and studies the ecological factors that shape communities of plants and fungi and she is also  accepting students to start in the Fall 2013 ."], "link": "http://fungalgenomes.org/blog/2012/10/grad-positions-in-hawaii/", "bloglinks": {}, "links": {"http://www2.hawaii.edu/": 4, "http://www.hawaii.edu/": 2}, "blogtitle": "The Hyphal Tip"}, {"content": ["Research Computational Biologist/Plant Pathologist/Geneticist \nDUTIES: \nThe incumbent will initiate a new research program focused on comparative and functional genomics of Fusarium and other mycotoxigenic and plant-pathogenic fungi. Research objectives are to utilize next generation sequencing technologies to conduct comparative and functional genomic analyses of Fusarium and other mycotoxigenic fungi in order to elucidate the genetic factors critical to mycotoxin production, plant pathogenesis, and other critical aspects of pathogen biology; test hypotheses concerning the origin, evolution, phylogenetic distribution, and functional significance of genetic/metabolic variation within these fungi; and contribute to the development of novel tools for molecular diagnostics and management of mycotoxigenic fungi. The incumbent will be required to publish research results in peer-reviewed journals and provide supervision for support staff as assigned. \n Please send the following announcement and link to your colleagues as appropriate. \n The Bacterial Foodborne Pathogens and Mycology Research Unit at the National Center for Agricultural Utilization Research located in Peoria, IL is recruiting for a permanent scientist, Research Computational Biologist/Plant Pathologist/Geneticist, GS-0401/0434/0440-12/13. \n The Announcement opens, Monday, September 17, 2012, and will close on Monday, October 15, 2012. The link to the announcement is https://www.usajobs.gov/GetJob/ViewDetails/326528700 \n \n IMPERIAL COLLEGE LONDON \nPOPULATION GENOMICS OF EMERGING INFECTIONS \nDPT. INFECTIOUS DISEASE EPIDEMIOLOGY \n Salary Range £28,200 – £40,720 per annum \n Three year post \n Applications are invited to join the Department of Infectious Disease Epidemiology located at the St Mary’s campus, Paddington. The department is based within a five star research institute equipped with the latest technologies and facilities. DIDE is arguably the largest grouping of infectious disease epidemiologists in the world with a very wide range of skills represented, from experimental studies on bacterial/fungal pathogens, through population genetics and infectious disease modelling to field work on emerging infectious disease. As such, the Department offers excellent research facilities and a friendly, intellectually stimulating, working environment. \n Emerging fungal infections are attracting increasing scientific and policy interest as their impact on human and ecosystem health becomes more pronounced (see Nature 484 2012). This Research Associate post is funded by a 3-year MRC project grant, entitled ‘An evolutionary population genomics approach to determine the genetic basis of virulence in the pathogenic fungus Cryptococcus neoformans ‘, and seeks to understand the evolutionary basis underlying this pathogen’s emergence as a leading cause of human disease in Africa and South East Asia. \n The post holder will join a multidisciplinary team of researchers that are using statistical genetic and functional genomic approaches to identify the patterns and processes that have led to contemporary distributions of genetic diversity for emerging pathogenic fungi, with a focus on Cryptococcus . The post-holder will have a key role in study design and will develop a state-of-the-art bioinformatics pipeline for assembling next-generation sequence data from a global panel of environmental and clinical Cryptococcus isolates. These data will be used for statistical genetic, phylodynamic and evolutionary analyses with the ultimate goal of defining the subset of genetic diversity that is associated with virulence and spatial-expansion of key lineages of Cryptococcus . Key responsibilities will be to develop cutting-edge approaches to managing large eukaryote population genomics datasets, and to liaise with our international collaborators in order to effectively share and curate genome-data. \n The successful candidate will have a strong bioinformatic, evolutionary or statistical genetics background with a PhD degree or equivalent in a relevant quantitative subject. \n This post is a full time and fixed term until 31st July 2015. \n For informal enquiries please contact Dr. Matthew Fisher (matthew.fisher@imperial.ac.uk). \n Our preferred method of application is online via our website. Please complete and upload an application form as directed. \n http://www.jobs.ac.uk/job/AFE774/research-associate/ \n Reference number: SM151-12 \nCLOSING DATE: 21 October 2012 \n \n ASSISTANT PROFESSOR \nGlobal Health/Infectious Disease \nGeorgetown University \n The Department of Biology, Georgetown University, invites applications for a tenure-track position at the assistant professor level commencing in August 2013.  We seek applicants whose research efforts are in the area of infectious disease, including those who are working on evolutionary aspects of infectious disease.  This position is expected to complement ongoing research and teaching efforts in global health at Georgetown University, including a graduate program in Global Infectious Disease and an undergraduate major in the Biology of Global Health.  The successful candidate will be expected to teach one course per semester, mentor undergraduates, graduate students and post-doctoral fellows, and maintain an active, extramurally-funded research program. Department information can be found at http://biology.georgetown.edu/ .  Candidates should submit a letter of application, curriculum vitae, a detailed description of previous research accomplishments and future research plans, a statement of teaching philosophy, and the names and contact information for three or more references.  Application materials should be submitted electronically in PDF format (preferred) to biology@georgetown.edu with \u001bBiology Application as subject.  We will begin review of applications on November 15, 2012. \n *Georgetown University is an Equal Opportunity, Affirmative Action employer fully \ndedicated to achieving a diverse faculty and staff.  All qualified candidates are encouraged to apply and will receive consideration for employment without regard to race, sex, sexual orientation, age, religion, national origin, marital status, veteran status, disability or other \ncategories protected by law.*"], "link": "http://fungalgenomes.org/blog/2012/09/fungal-job-postings/", "bloglinks": {}, "links": {"https://www.usajobs.gov/": 1, "http://www.ac.uk/": 1, "http://biology.georgetown.edu": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["The genomes of five dermatophyte fungi were sequenced and the analyses of their lifestyles presented in a new paper out in mBio in Martinez et al. 2012 . The authors were able to identify gene family changes that associate with lifestyle changes including proteases that can degrade keratin suggesting how these species have adapted to obtaining nutrients from an animal host. The continued finding of fungal-specific kinase families in these fungi, extending the observations from previous studies in Coprinopsis and  Paracoccidioides on the FunK1 kinase family, makes me hope we will some day get some molecular information on the specificity of these families in addition to these copy number observations.  \nAnother paper published in Genome Research this summer from Emily Troemel ‘s lab and the Broad Institute describes the sequencing of two microsporidia species that are natural parasites of Caenorhabditis. The paper reveals some suprising things about Microsporidia evolution including the presence of a clade-specific nucleoside H+ symporter which is only found in bacteria and some eukaryotes and not in any Fungi. The phyletic distribution suggested it was acquired more recently and couple from lateral gene transfer. This acquisition likely helps the microsporidia cells obtain nucleosides from the host since the parasite cannot synthesize these. There is also evidence of evolution of microsporidia-specific secretion signals in the hexokinases which may be a mechanism for delivery of these enzymes into host cells to catalyze rapid growth once inside the host. Many more gems in this paper including phylogenetic placement of the microsporidia from phylogenomic approaches (also see related recent work from Toni Gabaldon ‘s lab )."], "link": "http://fungalgenomes.org/blog/2012/09/animal-associated-fungal-genome-papers/", "bloglinks": {}, "links": {"http://big.crg.cat/": 1, "http://mbio.asm.org/": 1, "http://labs.ucsd.edu/": 1, "http://fungalgenomes.org/blog": 1, "http://treevolution.blogspot.com/": 1, "http://pfam.ac.uk/": 1, "http://www.broadinstitute.org": 1, "http://dx.doi.org/": 5}, "blogtitle": "The Hyphal Tip"}, {"content": ["A few faculty jobs to post in case you hadn’t already seen these. Apparently working with Fungi can get you a job . \n Via the MSA jobs board \n UW Madison has an Assistant Professor of Mycology position advertised, with search closing September 15. \n Cluster hires of 2 individuals in  Fungal Evolution  and an Assistant professor of Mycology  at the University of Minnesota. It sounds like the cluster hire would really like someone with genomics and fungal biology so if you like reading this blog you might be a really good candidate though a whole range of research in fungi seems appropriate. \n 3 faculty positions in Molecular Microbology at Washington University in St Louis in the Molecular Microbiology department . \n UC Berkeley’s IB department is recruiting for Ecology and Evolution of Infectious diseases applications due by Nov 1. \n A faculty position in the Biofrontiers Institute at University of Colorado, Boulder is an interdisciplinary position where integrative approaches including computational biology and bioinformatics with deadline of November 1, 2012.  Also advertised are two positions in Evolutionary Biology at CU-Boulder in the EIBO department ."], "link": "http://fungalgenomes.org/blog/2012/09/end-of-summer-2012-lots-of-fungal-and-microbial-faculty-jobs-advertised/", "bloglinks": {}, "links": {"http://www.wisc.edu/": 1, "http://ebio.colorado.edu/": 1, "http://msafungi.org/": 4, "http://www.wustl.edu/": 1, "https://www.umn.edu/": 1, "http://ib.berkeley.edu/": 1, "http://biofrontiers.colorado.edu/": 1, "https://www.jobsatcu.com/": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["Consider voting for for some Fungi in the Open Tree of Life project. Pathogens, model systems, and any charismatic (or non-charismatic if like) organisms can be proposed to be included in a tree that will serve as teaching and communicating the tree of life. \n [ From Laura Katz ] \nDear Colleagues, \n We need your help creating a list of exemplar species from across the tree of life! \n As our team works to build an open tree of life for the systematics community, we are also working on an educational version of the tree for the public. Our goal is to depict about 200 better-known (i.e. phylogenetically or otherwise important in some way (pathogen, \nfood source, etc.)) species from all three domains of life. The intended audience of this effort includes educators, students, and the public in general. \n Please follow the link below to vote for your 5 best exemplars… https://www.surveymonkey.com/s/favorite_species_for_tree_of_life \n And please join the conversation through our website , email (opentreeoflife@googlegroups.com), or twitter ( @opentreeoflife ). \n Thank you! \n lkatz@smith.edu"], "link": "http://fungalgenomes.org/blog/2012/08/vote-for-some-fungi-in-open-tree-of-life-project/", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://opentreeoflife.org/": 2, "https://www.surveymonkey.com/": 1, "http://www.smith.edu/": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["New Scientist has an article entitled “ Fungus-powered superplants may beat the heat ” on how endophytic fungi from thermotollerant grass -  Dichanthelium lanuginosum – can be used to improved drought-, salt-, and cold- tolerance of many other plants including rice. This symbiosis of the endophyte and grass also has additional player in the form of a mycovirus that infects the fungus which we’ve talked about before . The article doesn’t seem to reference any recently published papers but mainly the ongoing work for field trials and the application of these endophytes to speed the adaptations of the plants. \n This complicated partnership is a fascinating example of the complex strategies that have evolved among these organisms as part of colonization of new niches. It is also quite likely, they are along for the ride in most plant systems and we are just now beginning to see their diversity and function."], "link": "http://fungalgenomes.org/blog/2012/07/the-superpowers-of-endophytes/", "bloglinks": {}, "links": {"http://fungalgenomes.org/blog": 1, "http://www.newscientist.com/": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["Three papers on some cool fungi that interact with hosts and I recommend them for a good read. \n One is coverage of by Ed Yong on rice blast ( Magnaporthae orzyae ) on paper from Nick Talbot  and Gero Steinberg ‘s lab on appressorium development in Science this week . \n A paper from my lab on role of an expansion of copy number of a chitin-binding domain in the amphibian pathogen B. dendrobatidis . \n New Scientist also provides a nice summary of  tripartite symbiosis paper on  Metarhizium , insects, and plants from Mike Bidochka’s lab."], "link": "http://fungalgenomes.org/blog/2012/06/few-fungihost-papers/", "bloglinks": {}, "links": {"http://mbio.asm.org/": 1, "http://blogs.discovermagazine.com/": 1, "http://www.gerosteinberg.com/": 1, "http://www.newscientist.com/": 1, "http://lab.stajich.org": 1, "http://www.brocku.ca/": 1, "http://cogeme.ac.uk/": 1, "http://dx.doi.org/": 2}, "blogtitle": "The Hyphal Tip"}, {"content": ["Presentation on the Lichtheimia genome, a Mucorales fungus, from 454 and Illumina. # ISHAM2012 # \n In silico characterization and molecular evolutionary analysis of a novel superfamily of fungal effector proteins http://t.co/f1M1hGx9 # \n \n Powered by Twitter Tools"], "link": "http://fungalgenomes.org/blog/2012/06/the-roundup-of-twittered-updates-for-2012-06-14-2/", "bloglinks": {}, "links": {"http://twitter.com/": 2, "http://alexking.org/": 1, "http://t.co/": 1, "http://search.twitter.com/": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["I am enjoying a wonderful visit to Berlin for the ISHAM 2012 conference. This meeting is at the intersection of clinical and basic researchers focused on Mycoses. Take a look at the program for a peek at what was presented. The sessions have covered a variety of tool-based, genetics, and applications of antifungals in treatments of mycoses. The connection to animal infections as well as human is especially important as there are some good lessons learned from each systems. \n One thing that has become abundantly clear to me is the importance of Candida glabrata as a research system as well as clinically relavant system. I have been particularly interested in studies that have highlighted the variability in the cell wall such as work presented by Piet de Groot on Adhesins (see Kraneveld et al 2011 ).  Jure Piskur gave a provocative talk on why C. glabrata is a haploid through some comparisons of forced diploids made in the lab and profiling of growth and metabolism. Geraldine Butler also gave a nice talk on evolution of the hypoxic response. Many other talks on C. glabrata that highlight its importance and distinct adaptations and this is clearly different from C. albicans. \n Several other interesting sessions on fungal genomics, systems biology, evolution and comparative genomics of fungi, the fungal cell wall. For example, Carol Munro  spoke about the new tools to develop the Candida ORFeome and over expression constructs. Several new genome sequences were described from Athlete’s foot, microsporida that infect C. elegans , basal Mucormycotina, and dandruff causing Malassezia fungi. \n I also want to highlight that this has been one of the most organized and well run conferences I have been to in a while. The Interplan conference organizer really has done an excellent job and the bcc conference venue in Berlin is really well equipped. Let’s see more conferences in Berlin please!"], "link": "http://fungalgenomes.org/blog/2012/06/hello-from-isham-2012/", "bloglinks": {}, "links": {"http://www.bcc-berlin.de/": 1, "http://www.ac.uk/": 1, "http://fungalgenomes.org/blog": 1, "http://www.ucd.ie/": 1, "http://www.nih.gov/": 1, "http://isham2012.org/": 2, "http://www.interplan.de/": 1, "http://www.jubilekinase.com/": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["“@mycologymycoses: Fungal evangelists needed!! # isham2012 ?? – we hope http://t.co/OxYH1daU can help spread the word! # \n \n Powered by Twitter Tools"], "link": "http://fungalgenomes.org/blog/2012/06/the-roundup-of-twittered-updates-for-2012-06-12-2/", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://alexking.org/": 1, "http://t.co/": 1, "http://search.twitter.com/": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["Fleming's penicillin producing strain is not Penicillium chrysogenum but P. rubens http://t.co/OwULKFfn # \n Genetic and genomic glimpses of the elusive arbuscular mycorrhizal fungi http://t.co/zZaGYe1m # \n \n Powered by Twitter Tools"], "link": "http://fungalgenomes.org/blog/2012/06/the-roundup-of-twittered-updates-for-2012-06-11-2/", "bloglinks": {}, "links": {"http://twitter.com/": 2, "http://alexking.org/": 1, "http://t.co/": 2}, "blogtitle": "The Hyphal Tip"}, {"content": ["Mucormycosis of Platypus http://t.co/vXPMgNoL and shrinking populations and loss of genetic diversity in Platypus http://t.co/Ozzqca5g # \n \n Powered by Twitter Tools"], "link": "http://fungalgenomes.org/blog/2012/06/the-roundup-of-twittered-updates-for-2012-06-06-2/", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://alexking.org/": 1, "http://t.co/": 2}, "blogtitle": "The Hyphal Tip"}, {"content": ["The Black Queen Hypothesis: Evolution of Dependencies through Adaptive Gene Loss http://t.co/4HrbkWN9 # \n The Origins of Cooperative Bacterial Communities http://t.co/3vRjOkN3 # \n \n Powered by Twitter Tools"], "link": "http://fungalgenomes.org/blog/2012/06/the-roundup-of-twittered-updates-for-2012-06-05-4/", "bloglinks": {}, "links": {"http://twitter.com/": 2, "http://alexking.org/": 1, "http://t.co/": 2}, "blogtitle": "The Hyphal Tip"}, {"content": ["TriAnnot: A Versatile and High Performance Pipeline for the Automated Annotation of Plant Genomes http://t.co/ELDZ0KU4 # \n \n Powered by Twitter Tools"], "link": "http://fungalgenomes.org/blog/2012/06/the-roundup-of-twittered-updates-for-2012-06-04-2/", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://alexking.org/": 1, "http://t.co/": 1}, "blogtitle": "The Hyphal Tip"}, {"content": ["Excellent PLoS Pearl: \"Hydrophobins—Unique Fungal Proteins\" http://t.co/JJYPhRCM # \n Extracellular Superoxide Dismutase Protects Histoplasma Yeast Cells from Host-Derived Oxidative Stress http://t.co/ruje6VDk # \n Global Analysis of the Evolution and Mechanism of Echinocandin Resistance in Candida glabrata http://t.co/jCJvPAR2 # \n LargeScale Gene Disruption M.oryzae Ids MC69,a Secreted Protein Req'd for Infection by Monocot & Dicot Fungal Pathogens http://t.co/Sn1oVJFA # \n \n Powered by Twitter Tools"], "link": "http://fungalgenomes.org/blog/2012/06/the-roundup-of-twittered-updates-for-2012-06-02-2/", "bloglinks": {}, "links": {"http://twitter.com/": 4, "http://alexking.org/": 1, "http://t.co/": 4}, "blogtitle": "The Hyphal Tip"}]