[{"blogurl": "http://www.themonkeycage.org\n", "blogroll": [], "title": "The Monkey Cage"}, {"content": ["Tom Holbrook: \n\n\t …throughout this campaign period the Democratic Party has been viewed more positively than the Republican Party.  In fact, there is not a single poll in this series in which the Republican party registered a net positive rating, and not a single case in which the net Republican rating was higher than the net Democrat rating.  The average net rating for the Republican Party in this series is -13, whereas the average for the Democratic Party is +.3.  To be sure, the net rating for the Democratic Party is sometimes in the negative, and the gap toward the end of the series is not as great as it was in the wake of the Democratic convention, but it is clear that the Democrats hold an advantage on this front… \n\n\t … Is this what’s keeping a president with tepid approval numbers and a still-sluggish economy afloat? \n\n\t More, including data on party identification, at his post ."], "link": "http://feedproxy.google.com/~r/themonkeycagefeed/~3/QDMgmCD_2uI/", "bloglinks": {}, "links": {"http://politics-by-the-numbers.blogspot.com/": 1}, "blogtitle": "The Monkey Cage"}, {"content": ["This is a guest post by Jeremy Pressman , the Alan R. Bennett Honors Professor in political science at the University of Connecticut. You can find his previous posts here and follow him on Twitter at @djpressman . \n\n\t ***** \n\n\t Former Gov. Mitt Romney and President Barack Obama have tried to out-do each other in their love for Israel, mentioning it more than 30 times in the third presidential debate. An observer would surely be left with the impression that the great determinant of the tightness of that alliance, at least from the U.S. side, was which party was most committed to Israel. \n\n\t Yet scholars have long looked for more fundamental explanations of the American-Israeli alliance. In 1996, Michael Barnett concisely argued that shared values best explains this special relationship. It is a case of two liberal democracies joining hands. (I’ll leave aside three other possibilities: military-strategic links, domestic lobbying , and alliance restraint .) An article ( gated ) last year by Michael Koplow (@mkoplow) emphasized the strong support in U.S. public opinion polls for robust U.S.-Israeli relations. Koplow also highlighted an ideological base to this support: “the general public identifies with Israel as a Western-style democracy.” \n\n\t It led me to wonder: what if Israel and the United States are moving further apart on values? Israel has long been expanding its settlements, the occupation continues, and illiberal legislation has grown, all seemingly undercutting an emphasis on shared U.S.-Israeli values. \n\n\t In the original essay in 1996, Barnett himself worried about the settlement project:  “No doubt Israel’s presence and policies in the territories were eroding the foundations of the special relationship.” Since Barnett wrote that line, the Israeli occupation and building of settlements in the West Bank has continued apace. In 1996, Israel had 303,100 settlers in the West Bank including East Jerusalem. Today there are over half a million settlers . Millions of Palestinians live under occupation as non-citizens with limited rights. \n\n\t In addition, questions are being asked about illiberal Israeli legislation and the treatment of Israel’s largest minority, its Palestinian citizens. A new survey of Israeli Jews demonstrated many with illiberal tendencies. Moreover, during much of Netanyahu’s administration, analysts have debated the importance of legislation proposed or passed to block Palestinian commemoration of the Nakba , remove Arabic as an official language, or punish Israelis who support boycotting goods from Israeli settlements. Civil society has come under attack. Israel’s Council for Higher Education pressed for reform or closure of the department of political science at Ben-Gurion University. Academic debates about whether Israel is a democracy or ethnocracy continue. \n\n\t Even the new election campaign has provided some food for thought as Prime Minister Netanyahu’s Likud party merged with Avigdor Lieberman’s Yisrael Beiteinu party. While the merger will surely affect the electoral outcome in early 2013, Peter Beinart highlighted a different result: the end of the Likud’s commitment to liberalism. (The Likud itself was originally created in part from Israel’s Liberal Party.) Beinart cited Aluf Benn of Ha’aretz who wrote that Likud will now become “a radical right-wing party, aggressive and xenophobic.” (See also this smart take on the exclusion of “the dreaded ‘Arab Parties.’”) \n\n\t Now perhaps this fear for Israeli liberalism and democracy is overblown. That I can string together a survey and some anecdotal evidence could be of limited value. But what if Israeli liberal values are deeply contested? \n\n\t One could argue that maybe Barnett and Koplow were just wrong about the centrality of an identity explanation, because during this same period of settlement expansion, the U.S.-Israeli military relationship has stayed quite strong. Israel has continued to receive tens of billions of dollars in U.S. military assistance and access to advanced weapons technology. So even as Israel has pursued a policy in the West Bank that seems like a rejection of the very values that supposedly underlie the alliance, the alliance has stayed strong. \n\n\t Alternatively, maybe we should turn back to other explanations such as military-strategic links, domestic lobbying, or alliance restraint. \n\n\t Or, maybe we have not reached the decisive moment for evaluating the shared identity explanation. As much as people have talked about the impending conflict for Israeli Jewish society between its Jewish identity and its democratic status, the Israeli decision not to annex the West Bank has left a certain amount of ambiguity. The idea of a two-state solution, which would allow Israel to choose democracy and Jewish identity, is not dead; it is hurting badly, but a two-state solution is not impossible. (Or maybe even if it is impossible on the ground, the broader perception remains that it is still possible if less likely than 10 years ago.) \n\n\t In short, maybe we are approaching but have not yet reached the moment when the shared values mantra supported by Barnett and Koplow will be truly tested. And even then, it could be that a different factor, say strategic links or a shared commitment to fight terrorism, will cement the ties were shared values to fall by the wayside. In the meantime, we can count on Obama and Romney to keep the issue in the spotlight for a few more days."], "link": "http://feedproxy.google.com/~r/themonkeycagefeed/~3/Z8s96jUghAY/", "bloglinks": {}, "links": {"http://www.fmep.org/": 2, "https://twitter.com/": 1, "http://www.cornell.edu/": 1, "http://www.uconn.edu/": 1, "http://www.npr.org/": 1, "http://www.haaretz.com/": 3, "http://www.tandfonline.com/": 1, "http://themonkeycage.org/": 1, "http://en.wikipedia.org/": 1, "http://souciant.com/": 1, "http://www.amazon.com/": 2, "http://latitude.nytimes.com/": 1}, "blogtitle": "The Monkey Cage"}, {"content": ["A group called EGAP (Experiments in Governance and Politics) is considering a proposal to establish a “Pilot Registry for Research Designs” where scholars could register new research projects, specifying in advance the topic, data to be collected, hypotheses to be tested, data analysis to be conducted, and conditions under which the hypotheses would be accepted or refuted. Once the research was conducted and written up, journal editors and referees would have access to the corresponding prospectus in order to verify that the results reported in the paper were not instances of “publication bias” or mindless “fishing” for statistically significant results. Upon publication, or after some pre-specified period of time, the corresponding research prospectus would be in the public domain. \n\n\t The focus of the pilot proposal is on “Prospective Research” designs, whether experimental or observational, ”for which outcomes   have not yet been realized.” That is mostly not what I do. Nevertheless, a friend—perhaps inspired by the proposers’ interest in expanding the system to include “retrospective studies,” and in using experience with the proposed pilot registry to decide “ whether to make registration mandatory for some kinds of research”—asks, as a “thought experiment,” how such a system would affect my work, suggesting as an example my 1996 article on “Uninformed Votes.” My response is below the fold. \n I’ve done some papers—including that one—that are sufficiently simple-minded that they would not be much affected by a process of the sort you describe. On the other hand, it is also an example of an instance in which effective enforcement would seem to be impossible. I have the NES cumulative file on my computer; what’s to stop me from ransacking it night and day for random correlations, then submitting the best 5% (suitably dressed up as “hypotheses to be tested”) to the registry? I suppose I could be made to wait for new data, but in this case that moratorium would still be in effect (since I used six presidential elections—and NES might not last long enough to provide six more). \n More often, my projects start with questions rather than “hypotheses” and end with findings of varying credibility rather than “accept or refute” decisions. I think of that as a kind of science—indeed, as the most fruitful kind of science we can do given where we are in our understanding of politics. And I think of the credibility of the findings as depending much more on the quality of the data and analysis than on their theoretical provenance or predictability (or, for that matter, their “statistical significance”). I recognize that many other scholars are more rigid in their views (and many others less so), which is fine with me, as long as we don’t have to waste a lot of potentially valuable time debating, or legislating, epistemology. (I assume there would be some journals that would not opt into the “registry” system, and I would stick with those rather than “constrain my implementation of the projects” I work on.) \n But you want examples. Since I hosted a workshop on Unequal Democracy a few weeks ago (I am just starting to work on a revised edition), I’ve thought recently about those analyses and can provide a brief, chapter-by-chapter run-down: \n  1. (Introduction) All pre-existing data in public domain and previously analyzed in similar ways by other scholars. Not sure whether or how this would be covered, since it is “merely” descriptive analysis. \n 2. The Partisan Political Economy . All pre-existing data in public domain. I set out to look for partisan patterns of income growth, but without any very strong preconceptions about what I would find. Having found them, I tried to make them go away, using a variety of data I didn’t know existed when I started. In the course of attempting to understand where these partisan differences came from, I also discovered some unexpected secondary patterns in the data that seem to me to shed light on that question (honeymoon years vs. non-honeymoon years; first terms following partisan turnover vs. others). \n 3. Class Politics and Partisan Change . All pre-existing data in public domain. This was an adaptation of previously published work, and shaped in a variety of ways by discussion and criticism of that work (e.g., differing implications of alternative measures of “class”; more elaborate analysis of a variety of potential “wedge” issues in 2004 NES data). \n 4. Partisan Biases in Economic Accountability . All pre-existing data in public domain. I had worked on “myopia” in economic voting in a separate project with Chris Achen, but did not think to connect it with partisan patterns of income growth until the two papers had sat near each other on my desk for a couple years. I had thought to look at economic voting by income class using NES data, then thought to examine class-specific growth, then thought to examine the effect of high-income growth on other income groups. Your editor and referees would have to decide whether the caveats in the text (“rather remarkably suggest,” “not impossible that the apparent electoral significance of high-income growth is merely a statistical fluke”) and robustness checks in the notes (dropping elections, considering various sub-samples of the data, comparing growth for other groups) were sufficient to make this pattern eligible for reporting. \n 5. Do Americans Care About Inequality? Mix of old and new data. Entirely descriptive except (perhaps) for interactions between information and ideology (which John Zaller would take as evidence of “polarization,” except that the concept had not previously been applied to “objective” facts). \n  6. Homer Gets a Tax Cut . Mix of old and new data. The NES module I helped design included some items reflecting my interests and expectations and others suggested by collaborators with their own agendas. The concept of “unenlightened self-interest,” which is the most novel theoretical underpinning of the analyses, was induced from the data rather than derived from anywhere. The analyses of partisanship and information, egalitarian values, and trade-off preferences among taxes, spending, and deficits were all added in response to suggestions from readers of earlier versions. \n 7. The Strange Appeal of Estate Tax Repeal . Ditto 6, with some historical analysis added subsequent to data collection that made the implications of the chapter in the context of the book quite different than I had in mind at the start. \n 8. The Eroding Minimum Wage . All publicly available data (aside from some income breakdowns of public polls provided by Marty Gilens). Largely descriptive. Partisan differences (Table 8.2) anticipated; partisan interactions (Table 8.3) unanticipated (and not “statistically significant”); effects of constituency opinion and partisanship on roll call vote anticipated, but only after it occurred to me that I had overlapping data (from Chapter 9). \n 9. Economic Inequality and Political Representation . All publicly available data. All of the analyses originally assumed a linear effect of income on political influence; the non-parametric specification with three income groups was suggested by readers of an early draft. The analysis of mechanisms (turnout, knowledge, contact) in Table 9.11 was an unanticipated elaboration; not sure where that came from. \n 10. (Conclusion) No data. Sections headed “Who Governs?” and “Political Obstacles to Economic Equality” could have been anticipated when I started the project; sections headed “Partisan Politics and the ‘Have-Nots’” and “The City of Utmost Necessity” could not (at least by me). \n You should feel free to share any of this, if any of it seems helpful. \n All the best, \n Larry"], "link": "http://feedproxy.google.com/~r/themonkeycagefeed/~3/LiIv9M2dJUA/", "bloglinks": {}, "links": {"http://themonkeycage.org/": 1, "http://e-gap.org/": 2, "http://themonkeycage.org/blog": 1, "https://my.vanderbilt.edu/": 1}, "blogtitle": "The Monkey Cage"}, {"content": ["From my online NYT column : \n\n\t For months now people I know have been stopping me on the street to ask who I think will win the election. And for months I’ve always said, either side could win it. . . . Different models use different economic and political variables to predict the vote, but these predictions pretty much average to 50-50. . . . \n\n\t Last week I was interviewed by a reporter from France, who asked me who I thought would win the election. I said, it’s too close to call. He said, but Nate Silver’s FiveThirtyEight blog on NYTimes.com currently gives Obama a 72.9 percent chance. I think Nate is great, and I was thrilled to have the opportunity to contribute to his blog for a while. But I’d still say the election is too close to call. . . . \n\n\t The online betting service Intrade gives Obama a 62 percent chance of winning, and I respect this number too, as it reflects the opinions of people who are willing to put money on the line. The difference between 63 percent and 75 percent may sound like a lot, but it corresponds to something like a difference of half a percentage point in Obama’s forecast vote share. Put differently, a change in 0.5 percent in the forecast of Obama’s vote share corresponds to a change in a bit more than 10 percent in his probability of winning. Either way, the uncertainty is larger than the best guess at the vote margin. \n\n\t Where is this uncertainty coming from? First, public opinion can shift quickly during the last week of campaigning, as news arrives and as voters make their final decisions. Second, the polls aren’t perfect. Nonresponse rates continue to rise and, although pollsters are working on more and more sophisticated methods for correcting for this problem — an area of my research — we cannot always catch up. Even an average of polls can be wrong, but it’s hard to know in advance of the election how wrong they will be, or in which direction. \n\n\t What I’m saying is that I can simultaneously (a) accept that Obama has a 72 percent chance of winning and (b) say the election is too close to call. . . . \n\n\t More at the link , including a discussion of why it’s not correct to say that “Romney’s a touchdown behind with five minutes to play.”"], "link": "http://feedproxy.google.com/~r/themonkeycagefeed/~3/cDRK0SnytSc/", "bloglinks": {}, "links": {"http://andrewgelman.com/": 1, "http://campaignstops.nytimes.com/": 2}, "blogtitle": "The Monkey Cage"}, {"content": ["Those are from U of Chicago political scientist Boris Shor.  More here ."], "link": "http://feedproxy.google.com/~r/themonkeycagefeed/~3/bnvngcxE4rI/", "bloglinks": {}, "links": {"http://research.bshor.com/": 1}, "blogtitle": "The Monkey Cage"}, {"content": ["In my earlier post , I modeled the choices of decided voters and then looked to see what that model would predict about the remaining undecided voters.  The apparent answer was that these voters will break pretty evenly for Obama and Romney. \n\n\t My co-author Lynn Vavreck suggested a different approach.  In our data for The Gamble , we have interviews from a December 2011 YouGov survey with approximately 44,000 respondents.  Then each week from January until Election Day, YouGov reinterviewed a different subset of 1,000 respondents from among these 44,000.  In other words, we have a two-wave panel, where the date of the second wave varies. \n\n\t Lynn’s suggested approach was: take the people who were undecided in December 2011 but decided in a later survey, model their choices, and then see what this predicts for the remaining undecided voters (as in my first post, these are the 195 undecided respondents in the 3 YouGov polls since the first debate).  The assumption here is that the remaining undecideds will make up their minds the way the earlier undecideds have—which is more plausible than assuming, as I was, that undecideds make up their minds like the decideds do.  (Of course, it’s still an assumption.) \n\n\t In this case, the answer is much the same: the remaining undecided voters are predicted to split fairly evenly—about 55% for Obama and 45% for Romney.  Given the uncertainty in these estimates, I don’t think this implies a definitive Obama “win” among these voters.  Ultimately, these models do not suggest either candidate will get a significant advantage from late-breaking undecided voters.  The same caveats noted in my earlier post apply here as well."], "link": "http://feedproxy.google.com/~r/themonkeycagefeed/~3/fumATlpDw2k/", "bloglinks": {}, "links": {"http://www.lynnvavreck.com/": 1, "http://thegamble2012.com/": 1, "http://themonkeycage.org/blog": 1}, "blogtitle": "The Monkey Cage"}, {"content": ["Continuing our series of  election reports ,  the following post-election report on Ukraine’s 2012 parliamentary election is provided by frequent Monkey Cage contributor University of Toronto political scientist Lucan Way . \n\n\t ****** \n\n\t Sunday’s parliamentary elections in Ukraine provide a revealing look into the developing characteristics of authoritarianism in Yanukovych’s Ukraine.  They suggest that while the regime has become much more authoritarian in recent years, important arenas of contestation remain.  Thus far, Ukraine is still a competitive authoritarian rather than fully authoritarian regime. \n\n\t Since coming to power in 2010 in a hotly contested Presidential election , Yanukovych has concentrated control at a dizzying speed. By the end of his first year, he had reversed political reforms passed during the Orange revolution that had significantly weakened the Presidency.  In problematic local elections in late October, his Party of Regions gained majorities in cities and provinces throughout east, central, and southern Ukraine.   Most critically, Yanukovych has jailed two key leaders of the Orange Revolution , Yuri Lutsenko and Yulia Tymoshenko.   Tymoshenko, who barely lost to Yanukovych in 2010, was sentenced in late 2011 to seven years in jail for “abuse of office” during her tenure as Prime Minister.  Similarly, Lutsenko, who led protests against the Kuchma regime in 2001 and 2004, has been jailed for four years on charges of embezzlement.  Such blatantly political prosecutions have garnered widespread criticism of the Yanukovych regime by US and EU authorities. Not even former President Leonid Kuchma jailed opposition for extended periods of time. \n\n\t Given so much authoritarian backsliding over the last two years, we might have expected the most recent parliamentary elections to be especially dirty.  Indeed, the elections demonstrated that the Party of Regions have created a highly uneven playing field .   The ruling party’s overwhelming access to patronage resources and informal control over the Central Election Commission – among other advantages – has created highly uneven conditions for the opposition in Ukraine.  And, most notably, Lutsenko and Tymoshenko were deprived of the right to participate.  Ukraine is clearly not a democracy. \n\n\t Yet, outright fraud and media abuse appears to have been surprisingly limited .  While state TV displayed a “clear bias in favor of the ruling party,” the much more popular private stations – Inter, 1+1, and ICTV provided “balanced” coverage of the competing parties. (These three stations account for about a third of TV viewers in Ukraine, while state TV, UT1 , accounts for 3-4 percent. The private pro Yanukovych “Ukraine” channel accounts for about 5 percent).  Serious problems with Ukrainian media remain.  Corruption is rife, major outlets lack editorial autonomy and coverage of the campaign was mostly limited. As a result, parties had to rely on paid advertising and thus required significant resources to compete.   Nonetheless in Yanukovych’s Ukraine, opposition parties so far have significant access to major media outlets.  The situation is a far cry from 2004 when most outlets were “overwhelmingly” imbalanced in favor of Yanukovych . \n\n\t Simultaneously, the evidence so far suggests that outright vote stealing was also relatively limited in this election.  Thus, the proportional vote – which gave the Party of Regions about thirty percent of the vote; and Tymoshenko’s Fatherland Party a quarter – was directly in line with exit polls .  The next few days will almost certainly reveal more evidence of fraud in the single member districts, where the ruling party has done much better (and which account for half of the legislature).  However, most estimates at the time of writing (October 30) suggest that overall the Party of Regions will have direct control over about 40 percent of the legislature – high by Ukrainian standards, but low compared to Russia and other semi authoritarian countries.  Even accounting for the fact that the government – with its vast resources – will certainly be able to bribe its way to a majority, the Party of Regions is unlikely to be able to gain a constitutional majority. \n\n\t In sum, Yanukovych has concentrated power in Ukraine and destroyed the democratic legacy of the Orange revolution with remarkable ease.   Yet, the most recent vote suggests that elections still allow for meaningful – if highly unfair – competition. Ukraine is a hybrid or competitive authoritarian regime .  Yanukovych is no Putin or Lukashenka. Such silver linings are worth noting. They may disappear…"], "link": "http://feedproxy.google.com/~r/themonkeycagefeed/~3/XEBQv5Ppu8E/", "bloglinks": {}, "links": {"http://muse.jhu.edu/": 1, "http://mediabusiness.com.ua": 1, "http://themonkeycage.org/blog": 2, "http://www.com.ua/": 1, "http://www.utoronto.ca/": 1, "http://www.com.ua": 2, "http://www.hrw.org/": 1, "http://www.amazon.com/": 1, "http://www.rferl.org/": 2, "http://www.nytimes.com/": 1, "http://www.osce.org/": 2}, "blogtitle": "The Monkey Cage"}, {"content": ["From XKCD , based on work by Keith Poole and Howard Rosenthal (disclosure: Howard was my dissertation adviser) (h/t many Facebook friends)."], "link": "http://feedproxy.google.com/~r/themonkeycagefeed/~3/Aei6OkTToZY/", "bloglinks": {}, "links": {"http://politics.nyu.edu/": 1, "http://polisci.uga.edu/": 1, "http://xkcd.com/": 1}, "blogtitle": "The Monkey Cage"}, {"content": ["Jay Cost took a look at how Gallup’s final likely voter poll was associated with the Electoral College vote share.  Here’s the picture: \n\n\t \n\n\t The advantage of using Gallup is it goes back so far in time.  Out of curiosity, I then asked Cost what the prediction would be given Gallup’s current number , which gives the incumbent party’s vote margin as -5 (i.e., Romney is up 51 to 46).  Cost did a simple linear model (noting that the fit above is a bit nonlinear) and kindly replied that it would imply 339 EC votes for Romney vs. 199 for Obama. \n\n\t To be sure, Cost is not suggesting that this is the best model and is generally skeptical of such models.  But given that there’s been a lot of Twitter debate about election modeling today—largely occasioned by this piece —I think it’s valuable to put additional forecasts out there.  We’ll learn more that way."], "link": "http://feedproxy.google.com/~r/themonkeycagefeed/~3/GcgFQ_4A2Zc/", "bloglinks": {}, "links": {"http://www.politico.com/blog": 1, "https://twitter.com/": 4, "http://elections.huffingtonpost.com/": 1}, "blogtitle": "The Monkey Cage"}, {"content": ["From Gallup : \n\n\n\n\t Gallup has suspended polling for its daily tracking as of Monday night and will reassess on a day-to-day basis. The ultimate effect on the overall picture of polling between now and this weekend, including election polling, will depend on what happens as a result of the storm, about which we will have a better understanding of on Tuesday and Wednesday of this week. \n\n\t Good luck to those of you for whom Sandy is going to mean more than just going without the Gallup tracking poll – we hope everyone is safe. \n\n\t [h/t to Jonathan Ladd .]"], "link": "http://feedproxy.google.com/~r/themonkeycagefeed/~3/x8uGg8MmcbU/", "bloglinks": {}, "links": {"http://explore.georgetown.edu/": 1, "http://thequeue.gallup.com/": 1}, "blogtitle": "The Monkey Cage"}]