[{"blogurl": "http://blog.openhelix.eu\n", "blogroll": [], "title": "The OpenHelix Blog"}, {"content": ["A while back Mary saw the following tweet go by & collected it as a possible topic for one of our weekly tips: \n RT @moorejh : #bioinformatics #genomics RT @GreeneScientist Interactive and video tutorials for IMP are available from: http://t.co/zvlVmoph \n This week I have claimed Mary’s “collected” tip idea & will be featuring one of their videos as this week’s quick tip. \n The Integrative Multi-species Prediction (IMP) web server is a gene-gene network analysis resource. There are several such resources ( Cytoscape , IntAct , MINT , STRING , VisANT , and one of my personal favorites GeneMania ) that OpenHelix has tutorials on (see our Pathway catalog listing). The IMP developers provide a nice amount of help for their users – not only do they have multiple YouTube videos (as do we on the OpenHelix YouTube channel ), but they also offer two interactive tutorials that allow users to be guided through an example usage of IMP. \n For today’s tip I am featuring the third YouTube video that they list on their tutorial page , because I thought it had the best sound and image quality. The other videos are also informative & are worth a viewing – enjoy! \n Reference : \n Wong AK, Park CY, Greene CS, Bongo LA, Guan Y, & Troyanskaya OG (2012). IMP: a multi-species functional genomics portal for integration, visualization and prediction of protein functions and networks. Nucleic Acids Research, 40 DOI: 10.1093/nar/gks458 \n Related Tutorials: MINT , IntAct protein interaction database , GeneMANIA , Cytoscape , VisANT , STRING"], "link": "http://feedproxy.google.com/~r/openhelix/GhpE/~3/u0UMc_kyDQ8/", "bloglinks": {}, "links": {"http://imp.princeton.edu/": 2, "https://twitter.com/": 2, "http://mint.uniroma2.it/": 1, "http://www.cytoscape.org/": 1, "http://feedads.doubleclick.net/": 2, "http://www.ac.uk/": 1, "http://visant.bu.edu/": 1, "http://t.co/": 1, "http://www.youtube.com/": 1, "http://www.openhelix.com/": 7, "http://dx.doi.org/": 1, "http://youtu.be/": 1, "http://www.genemania.org/": 1, "http://string.embl.de/": 1}, "blogtitle": "The OpenHelix Blog"}, {"content": ["Welcome to our Friday feature link collection: SNPpets. During the week we come across a lot of links and reads that we think are interesting, but don’t make it to a blog post. Here they are for your enjoyment… \n \n RT @jacksonlab : RT @illumina: The first in a two-part video series with Dr. Bruce Budowle about the impact of NGS on forensic genomics: http://t.co/xN7FIyRt \n iPhylo: The failure of phylogeny databases. http://iphylo.blogspot.co.uk/2012/10/the-failure-of-phylogeny-databases.htm l hat tip Dave Lunt on G+ . \n Snorf: RT @jermdemo : Saying you need the cloud to do bioinformatics is like saying you need to rent a tuxedo to get married. \n RT @neilfws: Despair at the quality of public data. Must be Monday. http://t.co/qiEG9N7M \n RT @genetics_blog : New from @marylynritchie lab- biofilter 2.0 – annotate GWAS results or use to construct biologically sensible GxG tests http://t.co/vCAIhmDu \n RT @GeneticAlliance : How much should doctors tell their patients about their genome? Decide for yourself! http://t.co/0MyRKkiT #genesinlife \n RT @OpenHelix : Pre-submission paper on PatientsLikeMe strategy of online, realtime, clinical trial data sharing http://t.co/BPPPL4fQ"], "link": "http://feedproxy.google.com/~r/openhelix/GhpE/~3/BZGkOJsDhQs/", "bloglinks": {}, "links": {"https://twitter.com/": 6, "https://plus.google.com/": 1, "http://feedads.doubleclick.net/": 2, "http://iphylo.co.uk/": 1, "http://t.co/": 5}, "blogtitle": "The OpenHelix Blog"}, {"content": ["BioStar is a site for asking, answering and discussing bioinformatics questions. We are members of the community and find it very useful. Often questions and answers arise at BioStar that are germane to our readers (end users of genomics resources). Every Thursday we will be highlighting one of those questions and answers here in this thread. You can ask questions in this thread, or you can always join in at BioStar. \n Today’s featured issue: More places to get your questions answered. \n The other day I saw a tweet that mentioned BioStar, and it caught my attention. Here’s the tweet: \n RT @samuellampa : Swedish Govt funded #Bioinformatics support offcly online since monday biosupport.se Let’s hope good interlink w  biostars.org \n It is a site supported by several entities in Sweden (but appears to be in English for everything I’ve seen), which has some overlap with the BioStars topics. But it also has some more locally-relevant issues, such as List of NGS services in Sweden? which is probably better handled on a more localized board of this type. \n So I just wanted to highlight it as another source of places to get your questions answered, or look around at the issues in bioinformatics. \n It also got me to check out the software that they are using, it’s an o pen s ource q uestion-and- a nswer (OSQA) platform that looks like it could be useful for all sorts of discussion sites. Check that out as well: http://www.osqa.net/  \n Let the question and answers ensue!"], "link": "http://feedproxy.google.com/~r/openhelix/GhpE/~3/PHZCnZ-rUJ4/", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.osqa.net/": 1, "http://t.co/": 1, "http://www.biostars.org/": 2, "http://www.biosupport.se/": 2}, "blogtitle": "The OpenHelix Blog"}, {"content": ["Transcription factor details–and sources of information about them and their binding sites–are definitely among the the most common questions we hear in our workshops. There are ways to look at predictions of binding, and for some species evidence of binding, and there are ways to look for binding motifs. But these resources vary in methods and scope, and it’s not easy to obtain collected information about transcription factors in many species. \n One group has tried to change this, at least for animal transcription factors, with the AnimalTFDB. They collected and curated information about more than 70 families of TFs from 50 species, and created an interface where you can explore this collection by family, by species, and more. \n This was offered as one of the sources of information from a recent query at BioStar . The poster was looking specifically for non-model organism information, and this database was one of the suggestions. But you can explore that question for other details and suggestions too. \n The paper from the AnimalTFDB team provides information on other sources of TF information–including bacteria, plants , and various types of related resources too. So if you are looking for non-animal details there could be some guidance for you in there. Some of these you might see in future tips! \n In the AnimalTFDB system itself, you’ll find that you have multiple ways to explore the data. From the landing page you can quickly browse to the collected data by TF family, or move right to the data organized by species instead. But there is also a standard search option with a form-based query. You can refine your search in various ways with that search form. \n When you get to a transcription factor (or one of the other types that’s curated, transcription co-factors and chromatin remodeling proteins) there will be links to many types of useful additional details. Transcripts, domains, GO terms, and links to multiple related resources and more. \n So if you are interested in transcription factors, co-factors, and chromatin remodeling proteins in animal species, check out AnimalTFDB. \n Quick link: \n AnimalTFDB: http://www.bioguo.org/AnimalTFDB/ \n Reference: \n Zhang, H.M., Chen, H., Liu, W., Liu, H., Gong, J., Wang, H. & Guo, A.Y. (2011). AnimalTFDB: a comprehensive animal transcription factor database, Nucleic Acids Research, 40 (D1) D149. DOI: 10.1093/nar/gkr965"], "link": "http://feedproxy.google.com/~r/openhelix/GhpE/~3/lCyIcmbcWcY/", "bloglinks": {}, "links": {"http://dx.doi.org/": 1, "http://feedads.doubleclick.net/": 2, "http://www.biostars.org/": 1, "http://www.bioguo.org/": 2, "http://plntfdb.uni-potsdam.de/": 1}, "blogtitle": "The OpenHelix Blog"}, {"content": ["Via: \n @dgmacarthur : Eric Lander dances Gangnam Style!? http://gangnamstylenews.com/video/1574/eric-lander-mit-professor-dancing-to-gangnam-style/ … via @ codushlaine"], "link": "http://feedproxy.google.com/~r/openhelix/GhpE/~3/gEDVh4mYi-M/", "bloglinks": {}, "links": {"https://twitter.com/": 2, "http://feedads.doubleclick.net/": 2, "http://t.co/": 1}, "blogtitle": "The OpenHelix Blog"}, {"content": ["Welcome to our Friday feature link collection: SNPpets. During the week we come across a lot of links and reads that we think are interesting, but don’t make it to a blog post. Here they are for your enjoyment… \n \n \n RT @BioMickWatson : A bioinformatics hipster is someone who uses Python, buys Apple products and sits in independent coffee shops reading PLoS One \n RT @bioinformatics : Delicious: Think Bayes – Bayesian Statistics Made Simple http://t.co/3rHNe21d \n Wow–I love the image of when the tools appeared, and the feature table is handy: RT @notSoJunkDNA : Impressive compendium of HTS mappers: [paper] http://t.co/RXsHK9dE [list site] http://t.co/nXwoT7pN \n Sweet–great collection of constructive actions: RT @DailyScan: Don’t Just Sit There: @CellCellPress commentary urges researchers to advocate for scientific funds http://t.co/odSDSjaR \n via email: On behalf of the Organising Committee for the 6th International Biocuration Conference I am delighted to announce that our website and registration are now open: http://www.ebi.ac.uk/biocuration2013/ \n RT @sjvn: Food Supply #Globalization Creates Urgency for #Genomics to Isolate Foodborne Diseases http://t.co/vwAhZgXv by @bakercom1  #genome \n RT @carlzimmer: I wonder how much of biology will join the pre-print culture of physics. http://t.co/C6MyxnAm \n RT @dgmacarthur : Anyone writing research software who isn’t reading @ctitusbrown is making a grievous error. This is awesome: http://t.co/sBQ0FTZF"], "link": "http://feedproxy.google.com/~r/openhelix/GhpE/~3/fAmj-a_39tM/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "https://twitter.com/": 6, "http://www.ac.uk/": 1, "http://t.co/": 7}, "blogtitle": "The OpenHelix Blog"}, {"content": ["BioStar is a site for asking, answering and discussing bioinformatics questions. We are members of the community and find it very useful. Often questions and answers arise at BioStar that are germane to our readers (end users of genomics resources). Every Thursday we will be highlighting one of those questions and answers here in this thread. You can ask questions in this thread, or you can always join in at BioStar. \n Today’s featured question: \n \n Which database and primer sets are the best for NGS (Ilumina) study of Fungal Soil Metapopulation study? \n I choice ITS1F/ITS4 , but now, I got some doubts. Is it the good choice? Which region is better – ITS or LSU? or better is to use both of them? and what about curated fungal database? \n Which primers are less preferable to amplify some fungal genus? We are looking for the best all fungi specific primers ( without matching plant DNA and without preference to some groups of fungi . \n We want to answer the question about in time variation of soil fungal population after addition Trichoderma `s biocontrol strains. \n Thanks a lot and Best regards \n michal \n This week’s question hasn’t generated much discussion in the answers section but the answer that was offered was terrific–yay Josh Herr . It was a great example of the right person to take on the question, offering information that is helpful but not yet published, and provided information that was new to me about some public resources–and the Taylor lab resources and guidance is very nice. Check it out in the answer. \n EDIT: coincidentally, there was a video put out today about soil sampling that might give you some more information on this process if you aren’t familiar with it: \n Chris Packham helps test cutting-edge soil sampling"], "link": "http://feedproxy.google.com/~r/openhelix/GhpE/~3/zm0Ce6he31o/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.biostars.org/": 6, "http://www.ac.uk/": 1}, "blogtitle": "The OpenHelix Blog"}, {"content": ["For this week’s tip, I’ve changed things up. I had something else planned, but as folks on Google+ last night were discovering and enjoying this new software, I decided to bring over this video on OneZoom, a new “cool tool” for exploration of the phylogenetic relationships of species. It’s an interactive viewer for larger phylogenetic trees. \n This tool uses fractal strategies to enable users to zoom and scroll around the tree of life. You can quickly get a large overview, and then navigate down to precise and specific nodes on the tree. It’s very slick. The first video gives you an overview of the project and the theory. A second video they call a tutorial offers more specifics on how to interact with the software. \n There are two reasons I’m glad to see this: 1) we definitely need new visualization and organization strategies with all the “big data” coming our way. And 2) they make that case that I keep making: \n Much of the difficulty with phylogenetic tree visualization (and with data visualization more generally) is that we all too often constrain ourselves to the “paper paradigm”—the practice of displaying data in ways that are optimized for printing on paper. \n Beyond the paper paradigm. Or, as I keep saying, the data is not in the papers anymore. It’s in the software and you have to use the software tools to explore it and take it further. And often (as was the case with ENCODE) the data is available to you long before publication–but unless you know the way in, you’ll miss out on great opportunities by waiting for the papers to come out. \n In this case they assess the state of other phylogenetic visualizations as well. They describe what drove them to the solution they’ve come to–something like Google Earth for species evolutionary relationships. You can use the software to scroll around and zoom in, but there’s also a search function to go right to places of interest. Currently there are over 5000 species of mammals, and their “coming soon” section says 5000 amphibians are on the way. The goal by 2014 is approximately 2 million species. \n This second “tutorial video” gives more specifics on how to interact with the software: \n \n It is a very cool tool described on the community page at PLoS Biology. They say it’s the first in a series of a new “Cool tools” section. Excellent–I love cool tools! It’s a bit funny to me though that the YouTubes aren’t embedded in the paper as figures. Go figure…. \n From the Software page ( http://www.onezoom.org/software.htm ) you can access both the mammal tree, and a bacterial tree with over 400,000 species. And there you’ll also see instructions for viewing your own data. \n I think it will be a very engaging educational tool. What’s not as clear to me is if this will drive discovery and enable people to go further. Slick displays are great–but they are always not enough to enable further work and analysis to ensue. That may be the case here, and their planned directions will also take it further. In the meantime, it’s probably enough to have creationists minds blown…heh. \n Quick links: \n OneZoom http://www.onezoom.org/ \n Follow them on twitter for updates: https://twitter.com/OneZoomTree @OneZoomTree \n Reference: \n Rosindell, J., & Harmon, L. (2012). OneZoom: A Fractal Explorer for the Tree of Life PLoS Biology, 10 (10) DOI: 10.1371/journal.pbio.1001406"], "link": "http://feedproxy.google.com/~r/openhelix/GhpE/~3/zGjj25TMyy8/", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.onezoom.org/": 2, "http://dx.doi.org/": 1}, "blogtitle": "The OpenHelix Blog"}, {"content": ["C’mon. Get one. I order one every year and they are always cute. \n This year it comes with a movie to entice you more. For me it just made we want to move back to Maine (I was a post-doc at Jax) and pick the damn calendar up myself. \n \n Order page: http://jaxmice.jax.org/calendar"], "link": "http://feedproxy.google.com/~r/openhelix/GhpE/~3/L_V0038ROGc/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://jaxmice.jax.org/": 1}, "blogtitle": "The OpenHelix Blog"}, {"content": ["Welcome to our Friday feature link collection: SNPpets. During the week we come across a lot of links and reads that we think are interesting, but don’t make it to a blog post. Here they are for your enjoyment… \n \n RT @Massgenomics : Highlights of ENCODE transcriptome paper, which soundly refuted “Widespread RNA and DNA differences” paper (Li et al): http://t.co/ipYoHYZO \n RT @cytoscape : Cytoscape 3 Beta is out!  http://t.co/cY7fM3g4 http://t.co/fj54agPN \n From the PDBe mailing list: The 2012 Nobel Prize in Chemistry has been awarded to Robert J. \nLefkowitz and Brian K. Kobilka for their studies of G-protein–coupled receptors. You can learn more about this important family of receptors by exploring their structures within the PDB .   http://pdbe.org/nobel2012 \n RT @the_prbb : “Personalised medicine and Big Pharma need bioinformatics” http://t.co/lf5v6MXU \n RT @cswitwer : @MountSinaiNYC announces course in sequencing ur own genome, to train future docs. Yes!  http://t.co/WAGANX92 #wgs #P4 @ISBUSA \n RT @doe_jgi : MT ‏@BrookhavenLab Virtual plant #biology: simulating seeds to raise oil production for food and #green fuel – http://t.co/565N7EPw \n RT @bioinformer : Some of the best tools for virus bioinformatics are over at LANL… http://t.co/0I92VEE2 Nice work! \n \n Priorities when the workplace is on fire : \n \n Related Tutorials: Cytoscape , ENCODE Data at UCSC , RCSB PDB"], "link": "http://feedproxy.google.com/~r/openhelix/GhpE/~3/9VcoHGd_5Fs/", "bloglinks": {}, "links": {"https://twitter.com/": 8, "http://feedads.doubleclick.net/": 2, "http://www.rcsb.org/": 1, "http://t.co/": 7, "http://www.openhelix.com/": 3, "http://pdbe.org/": 1}, "blogtitle": "The OpenHelix Blog"}]