[{"blogurl": "http://blogs.sas.com/blognormal\n", "blogroll": [], "title": "The Corner Office"}, {"content": ["Has the public’s tolerance for austerity reached the tipping point of social unrest? Is having an increasingly large portion of public resources spent on financing debt rather than education and health anti-social? Has the public’s confidence and trust in public reforms and government officials eroded beyond repair? You might feel [...]"], "link": "http://feedproxy.google.com/~r/sascorneroffice/~3/77Clkw_InXw/", "bloglinks": {}, "links": {}, "blogtitle": "The Corner Office"}, {"content": ["Does it seem like almost everything is a “big data” problem right now? And nearly every vendor is offering big data or big analytics solutions? Is big analytics more important than big data? And what is the difference? I've encountered this confusion in the market a lot over the last year as [...]"], "link": "http://feedproxy.google.com/~r/sascorneroffice/~3/PS06JUWjRUM/", "bloglinks": {}, "links": {}, "blogtitle": "The Corner Office"}, {"content": ["We have yet to recover from the economic crisis. But the turmoil seen in the struggling global market could yet be dwarfed by the utter devastation a cyber-crisis could unleash. As a company, SAS is frequently asked to support compliance efforts, such as FATCA (Foreign Account Tax Compliance Act), but [...]"], "link": "http://feedproxy.google.com/~r/sascorneroffice/~3/j6HoGAADuu0/", "bloglinks": {}, "links": {}, "blogtitle": "The Corner Office"}, {"content": ["In your organization, is “big data” an obstacle or an asset? Or is it still just a buzzword you’re trying to understand? A small group of us from SAS have spent the last week traveling to Mumbai, Singapore, Hong Kong, Seoul and Tokyo talking with business leaders about the benefits [...]"], "link": "http://feedproxy.google.com/~r/sascorneroffice/~3/UwWP0rgrGFQ/", "bloglinks": {}, "links": {}, "blogtitle": "The Corner Office"}, {"content": ["Regardless of the down economy, the amount of data being captured and stored didn’t slow down in the last few years. If anything, it has increased since 2008 when the recession hit. Even as business growth slowed and budgets were cut, most organizations continued to capture data. The question is, [...]"], "link": "http://feedproxy.google.com/~r/sascorneroffice/~3/JgdmB-OjeFQ/", "bloglinks": {}, "links": {}, "blogtitle": "The Corner Office"}, {"content": ["When faced with every possible challenge – from socio-economic to environmental – man has taken seemingly small steps into cyberspace, resulting in a giant leap for mankind: the creation of the new asset class, “big data.” With 90 percent of the world’s data created in the last two years, we [...]"], "link": "http://feedproxy.google.com/~r/sascorneroffice/~3/yVK3gB6llQo/", "bloglinks": {}, "links": {}, "blogtitle": "The Corner Office"}, {"content": ["A few years ago our new media team made this quick video to give you sense of just how big a billion is:   That’s big. But now that you can visualize a billion dollars, can you imagine what a billion rows of data looks like? Or find value in [...]"], "link": "http://feedproxy.google.com/~r/sascorneroffice/~3/ezrbVXkWuYA/", "bloglinks": {}, "links": {}, "blogtitle": "The Corner Office"}, {"content": ["Big data. Hyperconnectivity. Speed to intelligence. These central themes have served as common threads in previous issues of Intelligence Quarterly, a journal that examines the many ways analytics transform the world. Taken separately, these elements could be seen as just added complexities, but the convergence of the three is where [...]"], "link": "http://feedproxy.google.com/~r/sascorneroffice/~3/4TThny2yP7A/", "bloglinks": {}, "links": {}, "blogtitle": "The Corner Office"}, {"content": ["Let’s talk about the time savings involved with high-performance analytics. I’ve blogged before about the time reductions we’ve seen when analyzing big data with our high-performance analytics solutions. We’re quoting time savings of up to 92 hours, but what does that mean? Or, as I like to ask, “So what?” [...]"], "link": "http://feedproxy.google.com/~r/sascorneroffice/~3/CPHmlCO48I0/", "bloglinks": {}, "links": {}, "blogtitle": "The Corner Office"}, {"content": ["The Research Triangle area is getting attention as a hub of innovation for the Smart Grid.  Some facts: Nearly 60 companies in the Triangle are working in various aspects of the Smart Grid Industry. Twenty of those companies are headquartered in the region. From software to sensors and routers, the [...]"], "link": "http://feedproxy.google.com/~r/sascorneroffice/~3/bCzwUpkCudc/", "bloglinks": {}, "links": {}, "blogtitle": "The Corner Office"}]