[{"blogurl": "http://www.thepersonalgenome.com\n", "blogroll": [], "title": "The Personal Genome"}, {"content": ["Two-time Emmy award-winning documentary producer Marilyn Ness has been following around the Personal Genome Project (PGP) staff and volunteers for the past several years. I’m thrilled to announce that she has released the opening sequence and webisode #1 featuring George Church, founder and participant. More webisodes will be released in the coming weeks! \n Opening Sequence : \n \n Webisode #1 featuring George Church: \n \n You can read more about the documentary project by visiting Marilyn’s website: \n www.necessaryfilms.com/genome.html \n Short bio for Marilyn Ness: \nMarilyn Ness is a two-time Emmy Award-winning documentary producer with 14 years of experience. She founded Necessary Films in 2005, directing short films for non-profits including the ACLU and developing documentaries for television including Bad Blood and GENOME: The Future Is Now. Prior to that, Ness spent four years as a producer for director Ric Burns, collaborating on four award-winning PBS films: Ansel Adams; The Center of the World; Andy Warhol; and Eugene O’Neil. Ness’s other credits include films for The Learning Channel, Court TV, and National Geographic, as well as films for the PBS series American Experience and the theatrical feature The Life and Times of Hank Greenberg."], "link": "http://feedproxy.google.com/~r/thepersonalgenomeblog/~3/74nx4LhaixY/", "bloglinks": {}, "links": {"http://www.necessaryfilms.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.personalgenomes.org": 1, "http://www.youtube.com/": 2}, "blogtitle": "The Personal Genome"}, {"content": ["Charlie Rose interviews PGP participants George Church and Steven Pinker, as well as founders of 23andMe Linda Avey and Anne Wojcicki. Here is the video:"], "link": "http://feedproxy.google.com/~r/thepersonalgenomeblog/~3/cxYo8COYQmg/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.charlierose.com/": 1}, "blogtitle": "The Personal Genome"}, {"content": ["I will miss Rick J. Carlson. News of his sudden death has me twisted in knots. Although I met Rick only 5 years ago, during this time he became a friend to me and one of my most valued advisors. What I’ll miss most about Rick are the excited phone calls once or twice a year, when he and I would take turns dumping our brains out about the shifting landscape of genomics and health policy. At the end of every call, we would promise each other to talk more regularly. \n Rick liked to think big thoughts about the future of health care — far enough in the future that current rules of the system applied only loosely and where he had more freedom to think creatively and imaginatively about opportunities to effect positive change. He also was an expert of the hard realities facing our current health system and the difficulty of having anything turn out like you hoped it would. After all, Rick was one of the principal architects of the Health Maintenance Organization (or “H.M.O.”). When introducing Rick to others, I would always lead with this distinction, just to provoke his good nature (as others did too, I see ). \n This year, Rick was going to be a guest blogger here at TPG, with occasional pieces related to genomics and health policy. Rick proposed calling this blog series: “Where the Rubber Meets the Sky” (a tribute to Clem Bezold ). \n Although we were still in the process of editing his first installment, the essay is far enough along that it might be useful for a budding policy wonk out there somewhere and that would have made Rick happy. \n – \n Personal Genomics: public policy at the frontier of consumer markets in health care. By Rick Carlson \n Context: \n I first got interested in the consumer perspectives about genetics, while working on a Government financed “policy” research project at the University of Washington in 2004 when “retail genetics” was in its infancy. The study was designed to survey and discuss the arising markets and services such as ancestry and nutri-genomics web sites, and fledgling start-up’s like Sciona, and Great Smoky Labs, and the far more clinically rigorous, DNA Direct. \n In the ensuing 4 years, the field, or market space, has rapidly expanded—and, changed. With increasingly powerful computational technology available, and private and public capitol flowing, the research that results is throwing off granular risk/reward data on human health that is spiking consumer, regulatory and policy interests, (spurred, as well, by widespread promotion of the concept of “personalized medicine”). And all of this, in spite of the very unimpressive and limited clinical playbook this research has actually given us. \n To a degree, the rise of personal genomics markets, generally, is an outgrowth of rising consumer activism in health care under the rubric of “consumer-directed health care (CDHC). The policy objective is to increase the consumer’s investment if time, commitment to healthy living, and, most all money, into the health care system, the latter through steadily expanding cost-sharing by employers and payers. The long-term expectation (hope?) is that an educated, motivated consumer with “skin-in-the-game” will be more parsimonious in the use of scare health care resources. \n The rise of consumer markets in genetics, however, is primarily due to a discernable increase in consumer interest in genetic information——expressed in equal measures of fear, apprehension and fascination. It seems as if nary has a day gone by without two or three, often breathless, discoveries of presumed genetic health and disease gene associations are being reported for everything from restless leg syndrome to breast cancer. Entrepreneurialism is alive and well too, with companies large, Microsoft, Yahoo, Google, WebMD and Revolution Health launching portal and search capabilities, and start-ups like23 & me, and Navigenics and deCodeMe—promoted as “personal genomics” companies. \n At the same time, the almost sudden emergence of the personal genomics field is causing concern in clinical and regulatory and oversight circles, already troubled by the proliferation of consumer oriented web sites with arguably over-reaching claims. \n(see, in particular, Hunter, Khoury and Drazen, “Letting the Genome out of the Bottle—Will We Get Our Wish?”, NEJM, Jan. 10, 2008, pp. 105-107). \n The policy framework is best presented from these four perspectives \n —-An Overview of the “personal genomics’ field; \n —-Business and marketplace issues; \n —-Policy issues (including bioethical concerns); \n —-What’s next: looking ahead. \n Part 1: Personal Genomics Markets \n First, a distinction: the raw “genetic” data that companies like 23&Me is drawn from the same pool of data as does the research community, except, and this is the predicate of their positioning, the customer is provided personalized data from the rendering of a portion of their own genome (about 1% accounting for 95% or more of the genetic variation among us). The significant differences arise from how those data are characterized and “used”. Aggregated genomic data from gene-wide association studies are used by researchers to identify SNP’s that explain a sufficiently actionable amount of the variation in humans associated with health and disease status, and then, based on clinically acceptable genetic testing when available, determine what a specific patients response and/or susceptibility to a specific drug or disease might be. By contrast, personal genomic companies are promoting a service that allows a customer to “see” their own genome, and then guided by interpretative information, infer their own health status and/or susceptibilities to disease and/or capabilities and “store” their data securely with the company. Then, as tests become available the customer can be alerted that there is test available to “confirm” their arguable susceptibility and/or capability. These companies specifically disclaim that they are providing a health care or clinical service, admonishing their customers that they should seek the advice of a physician before making any health-related decisions. \n The personal genomics market leaders deny that they are just selling “curiosity” to the affluent and worried well, arguing that individuals fortified with personalized data will be motivated to address and minimize controllable risk factors and hence prevent or at least slow the onset or progression of chronic disease. This is a provocative and promising premise, and may be right, but to date we have very little evidence to support it, acknowledging at the same time that we haven’t had enough experience with highly personalized risk information to know the likely answer. \n 2. Business and Marketplace Issues \n Positioned in between conventionally available genetic testing through labs and physicians and the personal genomics frontier, are companies like DNA Direct. DNA Direct, as the exemplar in this sector, serves as a virtual delivery model for a set of genetic tests that have at least threshold evidence of clinical utility. The company provides consultation with genetic counselors, and focuses on developing proprietary tools for the interpretation of genetic risk data to the consumer. Though started as a pure direct-to-consumer offering, DNA Direct, and other companies in this business category increasingly look to a variety of payment models including referrals from physicians and genetic counselors, as well as third party reimbursement when available. This distinguishes these existing businesses from personal genomics companies, though; as the latter evolve they may compete in providing testing services. \n Details aren’t yet available to accurately peg the business model for the personal genomics market. As it evolves, however, it appears to be premised on securing enough subscribing customers in order to develop or outsource a genetic testing service, and, further, by aggregating data serve as a data warehouse to which access would be “sold”. Beyond this, these companies intend to utilize their customer base, presumably on an opt-in model, to create social networking relationships, with the sites either supported by subscriptions or advertising, or both. These businesses have only recently been launched and they appear to be well financed with buy-in from tried and tested venture capital groups and, in the case of 23&Me, Google. But, to date there is little if any, marketplace data to support their business models.  \n Naturally, in any new market there are fundamental factors related to the success and prosperity of any type of business, but, of those, there are a few related to business of health care and the science of Genomics that are unique. \n The health care community, particularly researchers and providers have already voiced criticism and will be highly skeptical. Public oversight and regulatory agencies will also be alerted. Some part of this is reflexive: many providers simply discount the ability of patients and consumers to either understand their health care needs or act responsibly when they claim to, and, sadly, perhaps we consumers haven’t given them good reasons to change their views. That said, a distinct business risk arises because the dim views of too many doctors can suppress the market. \n Then there is the vexing nature of the underlying science and technology. To use a thin analogy, when selling a financial service the complexity lies in the instruments and tools based on tested marketplace and economic fundamentals, with the rewards going to those who execute effectively on those fundamentals. Conversely, in health care, and exceptionally so in Genomics, the complexity lies in the underlying fundamentals of the science—-and the science is a fast and moving target as Genomics health care further evolves. This dynamic creates at least two business risks: betting on the science to confirm the first impressions upon which the businesses depend, and understanding that good health is ultimately far more valued as a public good than financial rewards, and therefore, more protected. \n Finally, there is the issue of whether pushback from payers and providers about driving inappropriate and unnecessary demand. Usually a solid sign of business success is the ability to prime markets and produce demand. In health care, however, driving demand is often when viewed as problematic, even superficial, or neurotic (except as practiced by physicians, when it’s called “medicalization”). If personal genomics company customers start showing up with their “genome chip” or print-outs in physician offices in any real numbers, the green eyeshade cost-containing forces will be aligned against them, and they can also count on Congressional hearings. \n 3. Policy Issues. \n “The potential to discover what contributes to red hair, freckles, pudginess, or a love of chocolate—-let alone quantifying one’s genetic risk for cancer, asthma or diabetes—-is both exhilarating and terrifying. It comes not only with great promise for improving health through personalized medicine and understanding our individuality but also with risks for discrimination and loss of privacy.”, Science, Vol. 318, 21 December 2007, p1842. \n The policy issues can be organized into four categories: clinical, bio-ethical/legal, regulatory and social. \n Clinical : to clinicians, information that doesn’t lead to known and effective treatments and good outcomes of care lacks prima facie clinical utility, and could also cause mischief and misinterpretation through an unholy mix of slick marketing and gullible consumers. In particular, physicians are concerned about “false negatives”, especially worrisome if a consumer’s genetic profile inaccurately posits low risks for life-threatening and compromising conditions. This concern was recently heightened when a study of the reliability of lab results showed wide variation on reported testing results. (2006, Genentech) \n A related concern is that for many consumers if their lab results do not appear to show them to be at elevated risk for a given condition they might falsely assume that they have “no” risk, and hence can neglect healthy behaviors . \n Lastly, as the utility of genetic testing increases, especially with the rapid pace of diagnostic development underway, clinicians may sense competition and intensify calls for more stringent regulation. Physicians, among all health care professionals, can most effectively incite regulatory zeal. \n Bio-Ethical/legal : a range of concerns arise for the bioethics community, from paternalistic—–harms outweigh benefits—- to dismissive—-can’t hurt/ variations on caveat emptor. The most frequently expressed concerns arise from fears that consumers at increased risk for a serious disease will either become fatalistic because they fail to apprehend that genetic data are inherently probabilistic (except for a few highly penetrant condition such as HD), or, conversely, may become neglectful of their health if their genomic profile is seemingly benign \n Legal issues include, of course discrimination by employers and insurers on the basis of definable risk, an ever growing concern in the absence of Federal legislation, and related concerns about privacy if the information, There is to date, very little settled law with respect to the uses genetic information because the issues had only raised marginal concerns until just recently. One case, Abigail Alliance vs. FDA that addressed the rights of consumers to treatments even if experimental might have provided some clarity on these issues, but, on appeal to the Supreme Court, the Court declined to hear the appeal from the Circuit Court upholding the FDA’s position that the plaintiff’s did not have a right to access to unproven, un-approved medications. \n Regulatory : Though there is on-going debate and discussion at the Federal level about strengthening the regulation of genetic testing, there isn’t yet a clear consensus. At root, the question is which model of oversight applies: will personal genomics markets be regulated as clinical services and hence fall under the scrutiny of the FDA, and state licensure requirements, or as a commercial concern regulated as a consumer information business like financial services where the issues of full and fair disclosure, protections again fraud and truth-in-advertising apply. \n Social : genetic discrimination can be practiced by communities, and social systems, not just by employers and insurance companies, though its forms are different. Stigmatization has occurred because of presumed genetic defects and disorders, and is likely to intensify. Communities of the disabled are increasingly apprehensive about “biological” stratifications. And, finally, it is now being appreciated that much of our accumulating genetic information could lead us down one of the slipperiest of slopes if it becomes the fodder for engineering human perfection. (A very thoughtful and balanced discussion of many of these issues can be found in, Michel Sandel, The Case Against Perfection: Ethics in an Age of Genetic Engineering, Belknap/Harvard, 2007) \n Ultimately genetic data alter our sense and that of others about our identities. These technologies are more culturally and socially disruptive than they are disruptive to business and economic models. Hence, personal genomics markets are fundamentally marked by uncertainty because of the disruptive nature of the products offered. Still, all the evidence points to a niche market, albeit a potentially lucrative one. Even if the price point for rendering a customers genome comes down, as predicted, to a $1000.00 in ten, or even five, years personal genomics markets are indisputably elite markets. \n On the other hand, there may be social and health benefits may be worth waiting for—– —will giving people data personalized to their specific risks and capacities have a strong enough motivational effect to actually reduce their risk factors through lifestyle practices? We don’t have these answers yet because we haven’t studied the subject enough; in fact, hardly at all. But, if positive outcomes can be achieved through the use of highly granular and individualized data, it would be of even greater significance if those outcomes could counter, even offset, the heavy tolls of the diseases of civilization, as Dubos called them——-Diabetes, Obesity, cardiovascular conditions and Cancer—afflicting the developed world, and increasingly, the developing world.. \n 4. A look ahead: \n The prospect ahead for Genomics technologies is illustrates why Genomic has been called a “terrible gift” (Carlson and Stimeling, The Terrible Gift: The Brave New World of Genetic Medicine, Public Affairs, Perseus Books, 2003) The potential benefits are exciting and immense, but along the way, society will have to digest a stew of disruptive social, cultural and economic uncertainties. The opportunities for improved public health are increasingly evident. But, our social uncertainties are deep and linked to a fear of genies let out of bottles by excessive entrepreneurialism. Our economic uncertainties, on the other hand, arise out of the complexity of the underlying science and how to scale demand for first generation genetic service technologies that can only reach a short ways now, but, guided by cogent public policy, could eventually reach far. \n Following the rise of personal genomics markets will start to give us some answers to these uncertainties. \n /END"], "link": "http://feedproxy.google.com/~r/thepersonalgenomeblog/~3/WXGrw33ie40/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.health.gov/": 1, "http://nextthingsfirst.wordpress.com/": 1, "http://www.aspendailynews.com/": 1}, "blogtitle": "The Personal Genome"}, {"content": ["Steven Pinker, one of the PGP-10 has written an essay for this weekend’s NYT Magazine. Here is a clip: \n Assessing risks from genomic data is not like using a pregnancy-test kit with its bright blue line. It’s more like writing a term paper on a topic with a huge and chaotic research literature. You are whipsawed by contradictory studies with different sample sizes, ages, sexes, ethnicities, selection criteria and levels of statistical significance…there’s no denying the horoscopelike fascination of learning about genes that predict your traits…Who wouldn’t be flattered to learn that he has two genes associated with higher I.Q. and one linked to a taste for novelty? It is also strangely validating to learn that I have genes for traits that I already know I have, like light skin and blue eyes…I also have genes that are nothing to brag about (like average memory performance and lower efficiency at learning from errors), ones whose meanings are a bit baffling (like a gene that gives me “typical odds” for having red hair, which I don’t have), and ones whose predictions are flat-out wrong (like a high risk of baldness).\n \n Read the whole thing . \n – \n Steven Pinker. “ My Genome, My Self ” New York Times Magazine. January 7, 2009"], "link": "http://feedproxy.google.com/~r/thepersonalgenomeblog/~3/_K9RhGy-Usc/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.nytimes.com/": 2, "http://www.personalgenomes.org/": 1}, "blogtitle": "The Personal Genome"}, {"content": ["MIT Tech Review published a video interview with Stanley Lapidus, founder and chairman of Helicos Biosciences and one of the PGP-10 :"], "link": "http://feedproxy.google.com/~r/thepersonalgenomeblog/~3/pMN89BkrOdA/", "bloglinks": {}, "links": {"http://www.helicosbio.com/": 1, "http://feedads.doubleclick.net/": 2, "http://link.brightcove.com/": 2, "http://www.personalgenomes.org/": 1}, "blogtitle": "The Personal Genome"}, {"content": ["Last week I featured a recent NEJM article by Robert Green and George Annas about presidential DNA and its role in public elections . Co-author Robert Green (pictured right) agreed to share more about his views on the issue, in the following Q&A: \n TPG : Both presidential candidates released information about their personal medical history during the recent election. Why do you believe genetic information should be treated differently? Why is DNA exceptional? \n RG : There is a great deal of debate about whether DNA information warrants the ‘exceptionalism’ that has attached to it. The risk information provided by most genetic tests is currently less specific than family history and other risk factors can provide, putting it squarely into the domains of disease risk that health workers regularly communicate to patients. When discussing common diseases, the “exceptionalism” of genetic testing is amplified by the incorrect public perception that most genetic markers provide highly predictive information, when in fact, this is true for only a few. \n Yet for some situations, there are undeniably special features to genetic testing. DNA is a highly specific identifier for forensic purposes and the occasional revelation of non-paternity can create upheaval in families. Genetic tests for highly penetrant diseases may provide reliable predictive information far in advance of symptoms, and providing such information to one family member may inadvertantly provide it to another who does not wish to receive it. And in situations where highly penetrant disease information is available far in advance of symptoms, there is greater potential for both prevention and for discrimination or unnecessary psychological distress. \n Since much of the aura of ‘exceptionalism’ surrounding genetic testing is a byproduct of misunderstood notions of determinism, some of it should fade and normalize as the population learns more about genetics in the coming decade. \n TPG : Both Obama and McCain have potentially serious conditions in their family medical histories (prostate cancer and heart disease, respectively). Do you believe genetic information could have helped voters in the last election evaluate the health status of the candidates? \n RG : Most of us would agree that health information is relevant to a candidate’s fitness for office, particularly an office like the Presidency. Therefore, health information that could affect fitness for office seems undeniably relevant to voter decisions. So while the public does not have a right to know every detail of a candidate’s medical history, those facts relevant to fitness should be public information. Health information related to fitness may be misunderstood, exaggerated or minimized and therein lies the problem. The public is not particularly skilled or rational at sorting out the probabilities associated with health risks from whatever source… be it prior illness, lifestyle habits like smoking, cholesterol levels, family history information or genetic testing results. In the last election, I do not believe that any genetic information currently available woudl have been sufficiently predictive to warrant sharing with voters. However, if a highly predictive genetic test for recurrence of melanoma were available, that would arguably have been relevant and thus, would warrant dislosure to voters. \n TPG : In your article you argued that the fierce political environment that surrounds elections, combined with our limited ability to understand genetic information, might lead to “genetic McCarthyism”. Is this a temporary circumstance? \n RG : As we pointed out, there is a clear potential that someone might try to use genetic markers to smear another candidate, particularly in the realm of behavioral of psychiatric genetics. Certain conditions, such as mental illnesses, are so psychologically loaded that such smears might even be effective, even if quickly countered by experts explaining the predictive limitations of the science. But as your question suggests, as the general population becomes more familiar with genetic information and the limitations and complexities of such information, there should be less of a potential for distortion. Whether you call it “Genetic McCarthyism” or “Genetic Swiftboating”, and whether it occurs in presidential politics or in other contentious situations (lesser elections, custody cases), all of us in genetics should be prepared for it and prepared to combat it when it occurs. \n – \nGreen, Robert C., Annas, George J. The Genetic Privacy of Presidential Candidates . N Engl J Med 2008 359: 2192-2193. \n Dr. Robert Green is a professor in the Departments of Neurology, Medicine (Genetics), and Epidemiology at the Boston University Schools of Medicine and Public Health."], "link": "http://feedproxy.google.com/~r/thepersonalgenomeblog/~3/rrr-J8PzhxI/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://content.nejm.org/": 2, "http://thepersonalgenome.com/": 1, "http://www.bu.edu/": 1}, "blogtitle": "The Personal Genome"}, {"content": ["Millions of individuals in the United States will know something about their own DNA by 2012. Whole genome sequencing will no longer be the exotic luxury item it is today. Genome scans like those available now for a few hundred dollars will be dirt cheap, if not free. By almost all accounts, genetic information will be more accessible to more people in 2012 than it is today. \n The next presidential candidates will face an electorate that is radically more conversant in and curious about DNA than ever before. We should reasonably expect that the presidential election of 2012 will include, for the first time, requests for candidates to make their genetic information part of the public record. \n Should the candidates heed these requests? \n In an article published today in the New England Journal of Medicine, Robert Green and George Annas advocate for the next presidential candidates to honor a “Don’t Ask, Don’t Tell” policy for DNA. If genetic information is invoked by either candidate, the authors argue, the outcome will almost surely be one of exaggerated claims: \n “…in the world of inflammatory accusations and smears that characterize presidential politics, it would be easy to engage in what might be called “genetic McCarthyism” by implying that an increased risk of disease is more substantial than it really is.” \n The issue of presidential DNA and who gets access to it, is here to stay. 2012 presidential hopefuls have a few years to work out their talking points. \n What would your talking points be? Would requests for disclosure of genetic information affect your decision to run for public office? Could you imagine scenarios where genetic information might influence your decision to vote for one candidate over another? \n This week I’ll be interviewing Robert Green to learn more about his views on the future role, or absence, of genetics in political campaigns. Comments are open. \n – \n Green, Robert C., Annas, George J. The Genetic Privacy of Presidential Candidates . N Engl J Med 2008 359: 2192-2193."], "link": "http://feedproxy.google.com/~r/thepersonalgenomeblog/~3/I9jagihSamc/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://content.nejm.org/": 1, "http://www.bu.edu/": 1}, "blogtitle": "The Personal Genome"}, {"content": ["Harvard Medical School’s Office of Public Affairs has published an audio recording of the October 20th press conference where the PGP-10 discussed their individual decisions about public release of their genomic data. \n Listen to mp3 here ."], "link": "http://feedproxy.google.com/~r/thepersonalgenomeblog/~3/FIXi8i1xU1U/", "bloglinks": {}, "links": {"http://web.harvard.edu/": 1, "http://hms.harvard.edu/": 1, "http://feedads.doubleclick.net/": 2}, "blogtitle": "The Personal Genome"}, {"content": ["George Church, founder of the Personal Genome Project, will be a guest on Science Friday with Ira Flatow, tomorrow at 2pm ET. \n Details on how to tune in to this October 24th broadcast . \n Update : Listen to the archived show now ."], "link": "http://feedproxy.google.com/~r/thepersonalgenomeblog/~3/hLMWI7_GcTg/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://podcastdownload.npr.org/": 1, "http://www.sciencefriday.com/": 2}, "blogtitle": "The Personal Genome"}, {"content": ["After an all day meeting of talks and discussion, the PGP-10 participated in a press conference. NECN has some video footage from that event: \n \n Scot Yount. Researchers intend to build online DNA database . NECN, October 21, 2008."], "link": "http://feedproxy.google.com/~r/thepersonalgenomeblog/~3/d-j_sf0WAG8/", "bloglinks": {}, "links": {"http://www.necn.com/": 1, "http://feedads.doubleclick.net/": 2, "http://thepersonalgenome.com/": 1, "http://www.personalgenomes.org/": 1}, "blogtitle": "The Personal Genome"}]