[{"blogurl": "http://www.excelcharts.com/blog\n", "blogroll": [], "title": "The Excel Charts Blog"}, {"content": ["I’ll assume that you are not paid for your artistic skills. You’re a mere mortal in a corporate environment, trying to make sense of your data and making rational decisions if possible. \n You make charts all the time, but you don’t really know if this new “data visualization” is the same thing with a pompous name or is something bigger and more complex. Perhaps you could start with a quick image search in Google for “ data visualization “. Here is what you’ll get in the first page: \n  \n Wow! Fascinating! But… is it relevant for you, for your work? Let’s check the prerequisites: \n \n Data types that you don’t have in your work; \n Artistic talent you are not born with; \n programming skills you are not interested in; \n tools your company will never buy. \n \n What’s left? Aesthetic enjoyment as a consumer and little inspiration for a chart maker. \n Is data visualization for you? \n Well, don’t feel excluded from the fascinating world of data visualization just because these results don’t help you in your work. There is a vast silent majority equally frustrated! \n Before you return to your simple and boring charts , let me ask you this: do you think that a poetry soiree is a good sample of how people use their mother tongue? Of course not! These search results are like a poetry soiree (in the sense of a very specialized use of language). If you just need a functional use of language, poetry may not be your best role model (don’t get me wrong: we need poetry too). \n Is there information visualization without aesthetics? \n One of the data visualization founding fathers, Jacques Bertin, believed that data visualization is an objective set of signs and rules, with no place for aesthetics. I actually disagree, but back then the world was in black and white and it was easier to accept it. You can’t avoid aesthetics. It is embedded in every single one of your choices when making a chart. \n You can approach data visualization from multiple perspectives, depending on your background, skills or goals. Given the same data set,  a designer, a product manager or a statistician will come up with very different visualizations. The problem, today, is that we are witnessing some kind of “ over-aesthetization “. The more visible perspective of what data visualization is about is defined by the results returned by search engines. They obviously emphasize design (beauty tends to be linked and shared more often), not visualizations made by engineers or statisticians. And it all started with Edward Tufte. He must be proud (I always wanted to write this). This is bad, because many people may start to equate data visualization and pretty charts, nice to look at but not terribly useful for their job and their skill sets. \n Occam’s razor, or How can we avoid an aesthetic disaster? \n To tell you the truth, I’m glad most corporate charts are not listed in the search engine results. Many are ugly, useless and childish (yes, childish). But if you can’t even choose the right tie for your shirt how can you avoid a disaster when making a chart? \n Glad you ask. There are no easy answers, but let me put it this way: if your goal is to facilitate chart reading, remove everything that cannot be justified and justify all the other options. That’s probably the safest way to avoid major disasters. \n It’s easier to explain with an example. Compare the first chart, using the embarrassing defaults in Excel 2003 (the smiling cow adds the childish touch) with the second chart, also made using Excel 2003. \n  \n Let me justify my options: \n \n Why is the title not centered? Because left aligned text is easier to read; \n Why is the vertical axis line not displayed? Because most of the time is unnecessary, specially when you have axis labels and grid lines; \n Why don’t you use a legend? Because direct labeling minimizes eye movement and working memory usage; \n Why are grid lines light gray? Because they are less relevant than the data itself; \n Why are grid lines dashed? To differentiate them from the horizontal axis line; \n Why is the line Chicken wider than the others? Because it is the series that interests me the most and I want to draw your attention to it; \n Why there seems to be three colors with varying tones? For you to realize that the series in each group have something in common (red meat, poultry, fish) ; \n Why was the happy cow removed? Because its childish, distracts and adds no benefit whatsoever. \n \n I suggest you to continue the exercise with some more questions and answers (why don’t you label Lamb and Veal? Why is Year on the right?). At first, not all your answers will be coherent and consistent with your goal but you’ll get there. \n Color is one of the major components of aesthetics and very hard to manage. The colors above were not chosen at random. The reddish tones are associated with red meat, orange with poultry and blue with fish. Is this the best possible color combination (assuming it exists)? Far from it. This is just a choice that I can justify, and that in general will be better than a different one base on personal taste alone. \n This chart will not win a beauty contest in the near future but, because your goal is to facilitate reading and you are forced to justify all your options, the risk of an arbitrary solution based on a not-to-be-trusted aesthetic sensibility is greatly minimized. Gradually your answers will become more consistent, the process more natural and you’ll find your own style. \n  At this level, function and aesthetics are deeply intertwined. If you want to explore further, well, let’s just say, like the ancient maps: “here be dragons”. Now aesthetics begins to have its own, autonomous value, with a greater emotional charge. Well used, it will attract the eye and enrich the experience without reducing the effectiveness or misrepresenting the message. Misused, it will become decoration and makeup, hindering communication and changing the message. \n There are multiple aesthetics \n Newton’s Binomial is as beautiful as Venus de Milo. What happens is that few people notice it. \n Perhaps we could follow Fernando Pessoa and write: \n Minard’s map of Napoleon’s March is as beautiful as the Sistine Chapel. \n  \n Beauty in a chart lies not in its ability to provide a moment of aesthetic enjoyment but in helping us understand the world, elegantly. So, start making elegant charts and aesthetics be damned! \n P.S.: If you’re interested to find the right balance between aesthetics and function in the context of data visualization, you cannot avoid Alberto Cairo’s The Functional Art , probably the best data visualization book published in 2012. \n \n______________________\n \nWant to create better dashboards? Try the Excel Dashboard Tutorial . \nPost from: Excel Charts Blog .\n Aesthetics be damned \n The original post is titled Aesthetics be damned , and it came from The Excel Charts Blog . You may also be interested in: \n The data visualization – data art continuum \n That’s not data visualization \n The Fish and The Fishing Rod: Core Skills for the Data Visualization Worker"], "link": "http://feedproxy.google.com/~r/JCCharts/~3/WtxlHnmCl3o/", "bloglinks": {}, "links": {"https://www.google.com/": 1, "http://www.excelcharts.com/blog": 9, "http://charts6.excelcharts.com/blog": 2, "http://charts7.excelcharts.com/blog": 1, "http://www.amazon.com/": 1}, "blogtitle": "The Excel Charts Blog"}, {"content": ["Most users love Excel, non-users hate it. When it comes to data visualization, Excel is generally dispised, except by those that have to make dozens of charts every single day. I call this the Excel Stockolm Syndrome . These are the forsaken data visualization users that keep making 3D pies when they should know better by now. Tired and overwhelmed. Not in the mood the learn yet another tool just to make those elusive “effective charts”. If you link good visualization to a tool they have no access to, you can be sure that the whole message is lost. \n Becoming a Data Visualization Anarchist \n I think things can be changed from the inside, improving the way people use Excel. I write for Excel users because I’m one of them. That’s not going to change soon.  But I love data visualization, not the tools that make it happen . I specially like interaction, multiple charts and making them available on the web. And I need to manage more data (not big data, just more data). Some things can’t be done in Excel or require too much effort. \n The Portuguese poet Fernando Pessoa has a funny short story called The Anarchist Banker . The idea is that only a banker can be a true anarchist, because only a banker can be free from “social fictions”, specially money… In data visualization, this means getting the tools out of the way, by learning them or avoiding them. \n I chose the learning path and I’m learning R now. I always wanted to make those scatterplot matrices. And I want to play with the ggplot2 package. A programming language is covered but R is not going to pay the bills. \n Enter Tableau and Qlikview \n I will not complicate matters  by discussing how I chose Tableau and Qlikview and not Spotfire, for example. I just want to choose one. Qlikview vs Tableau. Comparison articles like this  and this  are very helpful, but a man is a man with his circumstances. Each starting point is different from everyone else. Let me tell you what I think I know about these tools in this early stage. \n Tableau \n  \n I like Tableau, I have to admit it. I like the fact that you don’t have to fight stupid defaults in design and formatting, because I share the same data visualization principles. \n I like its enthusiastic and knowledgeable community. Let me give you two simple examples. I spent a lot of time making this horizon chart  in Excel, and Joe Mako quickly came up with a better version in Tableau. \n Then I tried to be creative with the bamboo charts and Joe Mako strikes again, with a better implementation . I’m starting to get nervous… (kidding) \n I know and respect many Tableau users, not because of Tableau but because I share the same views regarding data visualization. \n Apparently, maps in Tableau are good enough, so that’s a good point. \n And as a blogger, I want to make my work available to the web, and Tableau Public is a nice option (my population pyramid ). \n The Guardian often publishes Tableau visualizations. I’d like to try that with the local newspapers here. \n On the other hand, we know how stubborn some datavis experts are. Is Tableau that stubborn? Can clear vision and the right principles become a straitjacket? I really hate straitjackets (“the idea of”, never actually tried one…) \n In my country, Tableau is virtually unknown and I am not sure if I want to sell shoes in Africa . \n Qlikview \n  \nI know even less about Qlikview. The first chart I see in its video is the  pie chart above. Not exactly a shiny example of good data visualization principles. \n Apparently there is a very active Qlikview community on Linkedin  but not so much on Twitter. Probably this is meaningful. \n I keep reading that Qlikview is better than Tableau when it comes to making dashboards, while you should explore the data with Tableau. It’s a good point in favor of Qlikview (that’s what I need now). Extensions and the market seem to be interesting too. \n Qlikview has several business partners here. Actually, I was invited to work in some Qlikview projects in 2013 (obviously I have to learn the basics until then). They can pay a lot of bills. \n Its not always about features \n Not everything is black and white, not everything can be decided based on feature-by-feature comparison. Not everything is heart, not everything is reason. If I choose Tableau, my data visualization skills will improve a lot. Qlikview is harder to predict. I’m sure there are many users that dislike the pie above. If not, Qlikview can be more, hummm, challenging. \n What I’m going to do \n I mentioned those Qlikview projects, but I’ll try to remove them from the equation, at least for now. \n I have a simple dashboard in Excel and I’d like to create Tableau and Qlikview versions. That’s probably one best ways to evaluate a tool, using my own work. \n So, can you help me? \n I’d love to learn from you. Can you answer questions like: \n \n How do they compare regarding maps? Is it simple to add your own maps? \n Is it true that it’s easier to make a a centrally designed dashboard in Qlikview, while Tableau has a more exploratory nature? \n How can I share a Qlikview chart in my blog? \n \n And please don’t tell me I have to learn both… \n \n \n______________________\n \nWant to create better dashboards? Try the Excel Dashboard Tutorial . \nPost from: Excel Charts Blog .\n Qlikview vs Tableau? I have to choose and I’m not sure \n The original post is titled Qlikview vs Tableau? I have to choose and I’m not sure , and it came from The Excel Charts Blog . You may also be interested in: \n In London, for the Tableau Tour \n Beautiful but Terrible Pyramids: Tableau Edition"], "link": "http://feedproxy.google.com/~r/JCCharts/~3/m4CpxhJpYro/", "bloglinks": {}, "links": {"http://public.tableausoftware.com/": 1, "http://charts5.excelcharts.com/blog": 1, "http://datadoodle.com/": 1, "http://www.excelcharts.com/blog": 10, "http://apandre.wordpress.com/": 2, "http://charts8.excelcharts.com/blog": 1, "http://www.tableausoftware.com/": 1, "http://www.kenburnett.com/Blog": 1}, "blogtitle": "The Excel Charts Blog"}, {"content": ["So, this data visualization thing is new to you, but you already know enough to avoid basic mistakes (pies, 3D…). While playing with the data, you make these two charts: \n \n You already know that a bar chart helps you to compare data points, while a line chart is better at displaying trends, right? But you keep staring at them, not knowing which one to choose.  Suddenly, your little guardian angel whispers: “the bar chart is wrong”. \n The bar chart? What’s wrong with the bar chart? And why is the line chart OK? \n Then you realize that the vertical scale starts at 30, and apparently it should start at zero, so you change it in both charts: \n \n That leaves a lot of white space under the line. The experts say you don’t have to start scales at zero if you are using line charts. So you revert the changes in the line chart: \n  \n Ah, yes! Now you can choose one of them. Your guardian angel agrees that both charts are correct. So, do it, pick one! \n What’s the problem? Is there something bothering you? \n Humm, I see. They don’t look that similar. You believe that people may draw different conclusions depending on the chart you choose. \n OK, let’s discuss this a bit. Let’s talk about resolution . \n What is chart resolution, anyway? \n Higher resolution is usually a good thing. It means that you can see more clearly the difference between data points. To improve resolution in a chart, you zoom in, using the numeric scales: \n \n How much you can zoom in? Well, the lower limit should be the first nice round number below the minimum value in your data set, and the upper limit should be (you’ve guess it) the first nice round number above the maximum value . \n You have to make a little change to the rule when it comes to bar charts. In a bar chart, people compare heights, so if the bars are not proportional to the data they encode, you are misleading your audience. So, the charts above are both correct, but the one below is not: \n  \n That’s why the lower limit in a bar chart should always be the value that maintains the right proportions (usually zero). So, the take-away message is, improve resolution byt changing the scale, but in a bar chart you must keep proportions aligned with the data . \n What about slopes? \n Line charts are more subtle. Both charts below are correct: \n  \n The only difference between them is that the one on the left has a higher resolution, and in general is a better option considering Cleveland’s suggestions for banking to 45º  (slopes should average around 45º). You can do it by changing the numeric scales and/or the chart aspect ratio. This is a suggestion (an excellent suggestion), but it also tells you that there is no strict rule to obey. \n To be completely honest, I don’t care much about scales or aspect ratio in line charts , as long as they do not go overboard. What really matters is to have something to compare with. In the post  Weltanschauung, Lies and Charts , I use these politically biased charts… \n \n … and argue that only when you have more than one series you can learn anything from a line chart, like this: \n \n So it doesn’t matter much what you do with scales or  aspect ratio, as long as you have two or more series and your goal is to compare them. \n You can learn more about scales in Naomi Robbin’s Creating More Effective Graphs and she often writes about it, like in  here and here . \n Perhaps you could use this as a rule of thumb: use a bar chart when you have a single series and a line chart when you have two or more series. It will not always work, but it’s a good starting point, don’t you think? \n By the way: “méfiez-vous des morceaux choisis” is a lovely French expression that roughly translates to ”beware of selected pieces”. \n \n \n______________________\n \nWant to create better dashboards? Try the Excel Dashboard Tutorial . \nPost from: Excel Charts Blog .\n Bars and lines: méfiez-vous des morceaux choisis \n The original post is titled Bars and lines: méfiez-vous des morceaux choisis , and it came from The Excel Charts Blog . You may also be interested in: \n 10 x 10 tips to improve your (Excel or not) charts: Line charts \n Charting tips 004: You need guide lines \n The health benefits of line charts"], "link": "http://feedproxy.google.com/~r/JCCharts/~3/9DwrjZ00xSA/", "bloglinks": {}, "links": {"http://charts5.excelcharts.com/blog": 1, "http://www.excelcharts.com/blog": 9, "http://charts8.excelcharts.com/blog": 1, "http://www.forbes.com/": 2, "http://processtrends.com/": 1, "http://charts6.excelcharts.com/blog": 1, "http://www.amazon.com/": 1}, "blogtitle": "The Excel Charts Blog"}, {"content": ["I spent the last two weekends among kings and witches, foxes and wolves, dumb men and devious women, visiting castles in Scotland and villages in Africa. Two weekends of great storytelling. \n One little thing bothered me, though. Explicitly or not, many stories ended with the words “and now you know why”. \n And now you know why. \n We, the data visualization community, love to talk about visualization as a kind of storytelling but can we honestly say that our visualizations can deliver a good story? Can our audience say, “now we know why”? \n We can argue that this “visual storytelling” is nothing more than new-agey mumbo jumbo. After all, we just need to process data, get insights and act. We don’t have to mimic a folktale. \n If we do agree that storytelling can help us creating better visualizations, I have a humble suggestion: from now on, each datavis conference should be required to invite a renowned storyteller and let him/her show us what storytelling is really about . I liked Ben Haggarty  and Jan Blake  by the way. \n If you want to improve your charts/infographics/dashboards, here is a simple trick: write, below them, the words “and now you know why”. But first make sure they deserve it. \n \n \n______________________\n \nWant to create better dashboards? Try the Excel Dashboard Tutorial . \nPost from: Excel Charts Blog .\n And now you know why \n The original post is titled And now you know why , and it came from The Excel Charts Blog . No related posts."], "link": "http://feedproxy.google.com/~r/JCCharts/~3/npMnFcSscjQ/", "bloglinks": {}, "links": {"http://www.excelcharts.com/blog": 5, "http://www.applesandsnakes.org/": 1, "http://benhaggarty.com/": 1, "http://commons.wikimedia.org/": 1}, "blogtitle": "The Excel Charts Blog"}, {"content": ["Here is the percentage of people at risk of poverty or social exclusion in the European Union and a few other countries: \n \n We are going to resist the urge to identify them and use our preconceptions against them. Let’s dig deeper instead. Some groups are more exposed to the risk of poverty. Let’s see what happens when we split the data by sex: \n  \n How do you read this? For each sex, at the top you have the national average and at the bottom you have the group value. If the group has a lower risk, the line points to the left; otherwise, it points to the right. So, in this case the data shows very consistently that females have a higher risk of poverty or social exclusion than males. \n Perhaps there are other factors. with higher variability.  Let’s try age: \n  \n Lots of interesting stuff here: leaving your parents (16-24) is risky, while if you are 65 or over it can be heaven or it can be hell, depending on the country you live in. Let’s now add education: \n  \n As expected, there is a strong correlation between education level and risk of poverty. What about income and household type? \n  \n As you can see in the income, poor people run an extremely high risk of poverty (Monsieur de Lapalisse dixit). Explore the household type. Very interesting stuff too. \n If you want to focus on the leaves only: \n \n  \n Here is the complete chart (click to enlarge) : \n  \n Here is a comparison between two countries, Norway and Romania. \n  \n The bamboo chart:  the bastard son of Mr. Slopegraph and Madame Parallel Coordinates.  Do you like it? Do you find it useful? Confusing, perhaps? Do you know of a similar chart (link, please)? \n How would you represent the same data? Here is the dataset (xls) for you to play. \n \n \n______________________\n \nWant to create better dashboards? Try the Excel Dashboard Tutorial . \nPost from: Excel Charts Blog .\n Bamboo charts: People at risk of poverty or social exclusion \n The original post is titled Bamboo charts: People at risk of poverty or social exclusion , and it came from The Excel Charts Blog . You may also be interested in: \n Why do people make so many bad charts? \n Why do people make bad charts? [POLL] \n The same data, the same map, different stories"], "link": "http://feedproxy.google.com/~r/JCCharts/~3/eWwwQb6CVkU/", "bloglinks": {}, "links": {"http://charts4.excelcharts.com/blog": 1, "http://www.excelcharts.com/blog": 8, "http://charts6.excelcharts.com/blog": 3, "http://charts5.excelcharts.com/blog": 1, "http://charts7.excelcharts.com/blog": 4}, "blogtitle": "The Excel Charts Blog"}, {"content": ["What is wheat and what is chaff? Here is a list to help you take sides: \n \n If you want to fit the data into the shape of real-world objects, that’s not data visualization; \n If you use more than one dimension to represent a data point, that’s not data visualization; \n If your project breaks basic perception laws, that’s not data visualization; \n If there is a perceptually simpler way to represent the data, what you are doing is not data visualization; \n If you use color when color is not needed, that’s not data visualization; \n If you want to grab attention, that’s not data visualization; \n If you reject a chart type because the audience may not be familiar with it, that’s not data visualization; \n If your audience don’t know what the point of the chart is, that’s not data visualization; \n Alphabetical sort is not data visualization; \n If your chart is nothing more than a glorified table, that’s not data visualization; \n No variation, no data visualization; \n If a simple formula can be a better answer, there is not place for data visualization; \n If all you can do with a chart is to compare data points, that’s not data visualization; \n If you have three or fewer data points, that’s not data visualization; \n If you have to scroll, that’s not data visualization; \n If you have to compare slides, that’s not data visualization; \n … \n \n If your blood is boiling with so many enormities, cool down and don’t call me that. It may not be data visualization, but it may be important. It can be aesthetics, it can be literacy, it can be user interaction. They are important too. \n Like Michelangelo said, “I saw the angel in the marble and carved until I set him free.” If we want to talk about “data visualization” we must find its essence, its form (in the platonic sense) to be able to compare them to the shadows of everyday life. \n Actually, we don’t have to. We can always decide that the goals, the tools, the audiences and the processes are too dissimilar to accept a single concept of “data visualization”. Let’s decide this quickly so that we can return to our many other byzantine matters, like “should we use pie charts?”. \n So, what does your angel look like? Are you including the feathers? \n \n \n______________________\n \nWant to create better dashboards? Try the Excel Dashboard Tutorial . \nPost from: Excel Charts Blog .\n That’s not data visualization \n The original post is titled That’s not data visualization , and it came from The Excel Charts Blog . You may also be interested in: \n Data Visualization Hierarchy of Needs \n Data Visualization Personas \n 12 Data Visualization Questions I Have No Answers For"], "link": "http://feedproxy.google.com/~r/JCCharts/~3/8rnQbm9anko/", "bloglinks": {}, "links": {"http://www.excelcharts.com/blog": 8}, "blogtitle": "The Excel Charts Blog"}, {"content": ["Here is the draft result of my little weekend project, making horizon graphs in Excel: \n  \n I’m probably using too many color bands, but I like it! The horizon graph is a very compact way to display lots of data points and a shiny example of how to break the rules for a good cause. It was developed by Hannes Reijner at Panopticon and Stephen Few discussed it in his newsletter and in a blog post . You can learn more about the horizon chart here  and   here . \n Horizon graphs are even better if you use them as small multiples, as I did in the example above, and in the one below, from Panopticon: \n  \n There is something I don’t like about this one. If you look closely (click to enlarge), you’ll see that the charts are sorted alphabetically. This is a capital sin in data visualization . Much of the power of small multiples is lost when you do it, so don’t. You should think of a small multiples display as a reorderable matrix , sorting the categorical axis to identify meaningful groups.  I’m sure Panopticon’s implementation allows you to at least perform a manual sort. \n The Excel implementation \n There isn’t much to say about it. A macro copies the data for each state to a new sheet and splits it into 12 series, one for each color band. Then it creates the charts and stack them together. You can record the macro and add a for/next loop. \n \n \n______________________\n \nWant to create better dashboards? Try the Excel Dashboard Tutorial . \nPost from: Excel Charts Blog .\n The Horizon Graph Is a Reorderable Matrix Too: Unemployment Rate 1976-2012 \n The original post is titled The Horizon Graph Is a Reorderable Matrix Too: Unemployment Rate 1976-2012 , and it came from The Excel Charts Blog . You may also be interested in: \n Charts: Monthly Unemployment Rates by State 1976-2009 \n Animation, Small Multiples or the Reorderable Matrix? Growth of Walmart, Excel Edition \n Here's How the Unemployment Rate Sounds Like"], "link": "http://feedproxy.google.com/~r/JCCharts/~3/PdVPPGt1xYg/", "bloglinks": {}, "links": {"http://www.perceptualedge.com/blog": 2, "http://www.excelcharts.com/blog": 10, "http://www.youtube.com/": 1, "http://www.panopticon.com/": 1, "http://charts4.excelcharts.com/blog": 1, "http://vis.berkeley.edu/": 1, "http://www.perceptualedge.com/": 1}, "blogtitle": "The Excel Charts Blog"}, {"content": ["In data visualization, animation is overrated. OK, it’s an interesting option if you can see a clear pattern emerging when displaying data over time/space (and, thanks to animation, we were introduced to this communicator extraordinaire named Hans Rosling). \n It’s fun to make an animated GIF like the one above, but you must see animation as a component of interaction. The tool you are using must let you pause and explore, like Rosling does with Trendalyzer and Gapminder Desktop . \n Instead of a movie, why don’t you take a look at the individual video frames instead? \n  \n As you can see, the spatial pattern is still there, and you can easily compare individual maps. \n By the way, you’ll probably miss spatial patterns if you use a regular chart. You should always check for this patterns when you have a dataset with a spatial dimension. But don’t assume that the story ends there. Remove this dimension and you’ll find other (and often more interesting/useful) patterns. Compare the small multiples above with the reorderable matrix below: \n  \n The spatial pattern is powerful (a “wild-fire”) and memorable, but if I had to choose, I would choose the reorderable matrix. Lots of interesting and more precise details there that you can’t see in the map, and you still have a glimpse of the regional pattern via color coding. \n I actually like this sequence… It starts with a bang and then you can calmly explore the spatial patterns and the other details. \n What do you think? \n PS: You probably know the much better-looking map Nathan posted a while ago with this data set . That’s where the original idea for this post comes from. \n PS2: Next week we’ll see the result of combining counties (the gray dots in the maps) with store location. Stay tuned! \n \n \n______________________\n \nWant to create better dashboards? Try the Excel Dashboard Tutorial . \nPost from: Excel Charts Blog .\n Animation, Small Multiples or the Reorderable Matrix? Growth of Walmart, Excel Edition \n The original post is titled Animation, Small Multiples or the Reorderable Matrix? Growth of Walmart, Excel Edition , and it came from The Excel Charts Blog . You may also be interested in: \n Animation and demographic information visualization \n Animation, Interaction and Dynamic Excel Charts \n Making maps in Excel: cross-stitching edition"], "link": "http://feedproxy.google.com/~r/JCCharts/~3/f9hU4e-Oy5s/", "bloglinks": {}, "links": {"http://charts5.excelcharts.com/blog": 1, "http://www.gapminder.org/": 1, "http://www.excelcharts.com/blog": 8, "http://charts8.excelcharts.com/blog": 2, "http://projects.flowingdata.com/": 1, "http://www.umn.edu/": 1}, "blogtitle": "The Excel Charts Blog"}, {"content": ["Data visualization is becoming a catch-all concept with little analytic usefulness. The infographic plague we have to endure is not helping. \n It doesn’t have to be that way. Stephen Few wrote recently about the distinction between data visualization (“the goal that data be visualized in a way that leads to understanding”) and data art (“visualizations of data that seek primarily to entertain or produce an aesthetic experience”). Robert Kosara gives data art a different meaning . \n While I strongly agree with this, I am unable to see where to draw the line : there is no data visualization without graphic design and no data art without data. For the sake of the argument, let’s think of data visualization as 10% of graphic design and 90% of data and data art as 90% of graphic design and 10% of data. It’s a continuum, where the nature and the purpose change when the percentages change. \n It’s fun to play with these meaningless percentages, so let’s carry on. Suppose that a typical Excel user with no graphic design skills or training becomes aware of what data visualization is all about. She understands that some basic rules can improve effectiveness and make her charts aesthetically pleasing. She’s still using traditional charts, but she’s moving the split to the 75% data / 25%  design mark. At the 80%/20% mark we can start talking about “functional aesthetics”. We haven’t left data visualization yet. \n Around 60% data / 40% design, things start to change (I would place a typical New York Times visualization around here). Design can no longer improve data visualization and it slowly becomes data illustration (at 49% data / 51% design). The designer is making a unique piece and he uses a lot more textures and non-traditional charts, but he still believes (or wants us to believe) that the main goal is to inform and   entertain. I would place David McCandless around the 30% data / 70% design mark. \n Finally, at the 25%/75% mark data illustration becomes data art and the graphic designer becomes an artist. He’s now free of all constraints.  The data can be the starting point, but he uses it to create a unique work of art. \n Again, don’t take these percentages too seriously. I do believe that aesthetics play a major role in data visualization and it’s always there, no matter what. But if, at some point, we find ourselves trying to make out charts more beautiful and memorable than more effective, we are changing their nature and their usefulness in a corporate environment. As Stephen Few puts it, it’s “frivolous, costly, and harmful”. \n Leave data art to art galleries and please, please, don’t try to be an artist with Excel and canned effects. \n So, where are you in the data visualization – data art continuum? \n \n \n______________________\n \nWant to create better dashboards? Try the Excel Dashboard Tutorial . \nPost from: Excel Charts Blog .\n The data visualization – data art continuum \n The original post is titled The data visualization – data art continuum , and it came from The Excel Charts Blog . You may also be interested in: \n Data Visualization Bimbos \n Data Visualization Personas \n A course for the invisible data visualization users"], "link": "http://feedproxy.google.com/~r/JCCharts/~3/iTqbeFg2qgw/", "bloglinks": {}, "links": {"http://eagereyes.org/": 1, "http://www.excelcharts.com/blog": 9, "http://www.perceptualedge.com/blog": 1, "http://charts7.excelcharts.com/blog": 1}, "blogtitle": "The Excel Charts Blog"}, {"content": ["OK, maybe “love” is too strong a word. Let’s say that 3D column/bar charts are like a tall and ugly building: better appreciated from the top, where you can’t see it but you can enjoy a great view. Like this: \n  \n Now, change the viewing angle, remove gaps and you get this: \n  \n I’m shamelessly copying the first image in Robert Kosara’s Square Pie Charts  (I don’t know how Robert made his). Check his post. He makes some square pie charts like this: \n  \n I’m still using the 3D column charts, with a 3D rotation of 0º (Y), 90º (Y) and 0º (perspective). We can have some fun and use circles instead of squares: \n  \n Or fill the columns with pictures: \n  \n Or we can make a panel to display alerts: \n  \n No, I really can’t fall in love with 3D column charts, but seen from above they don’t look that bad, do they? And now you know how to make a square in Excel… \n [Upadate: Forgot to mention that Juice Analytics discusses other ways to make square pie charts here and has a screencast here .] \n \n \n______________________\n \nWant to create better dashboards? Try the Excel Dashboard Tutorial . \nPost from: Excel Charts Blog .\n I love 3D bar charts \n The original post is titled I love 3D bar charts , and it came from The Excel Charts Blog . You may also be interested in: \n 10 x 10 Tips to improve your (Excel or not) charts: column and bar charts \n 10 x 10 tips to improve your (Excel or not) charts: the scatter plot"], "link": "http://feedproxy.google.com/~r/JCCharts/~3/IAlJhCVYhLs/", "bloglinks": {}, "links": {"http://eagereyes.org/": 1, "http://www.juiceanalytics.com/": 2, "http://charts8.excelcharts.com/blog": 3, "http://charts7.excelcharts.com/blog": 3, "http://www.excelcharts.com/blog": 7}, "blogtitle": "The Excel Charts Blog"}]