[{"blogurl": "http://blog.thingiverse.com\n", "blogroll": [], "title": "Thingiverse Blog"}, {"content": ["Cross-posted from this post on the MakerBot blog : \n Hello, I’m Rich McCarthy, and since June I’ve been MakerBot’s in-house attorney.  In these three months, I’ve been working on playing catch-up with all the little things that fell through the cracks during MakerBot’s first three years without a full time staff attorney. In addition to that, MakerBot closed a lease on a new headquarters, leased a retail store, and launched a new product. As some of the busyness is now behind us, I’m starting to have time to work on MakerBot’s “wishlist” tasks. And one of those tasks is responding to community input on our Terms of Service (TOS). \n Despite what you may have heard, nothing has changed with the Thingiverse TOS. Bre publicly announced the last change, in February, 2011 here . I’ve looked at the TOS of some other sites that host user-content (Twitter, YouTube, Flickr, Vimeo,  FaceBook, etc.) and see places where we could improve the clarity and content of our own. But overall, the Thingiverse TOS is consistent with industry practices. \n Read fairly, our TOS are structured similarly to any large website that hosts user-content. When a user uploads a Thing, MakerBot requires a broad license so that we can do things like copy the Thing to other servers for content caching, or make the Thing available to the public. Without a license from the user, these acts might constitute wrongful “reproduction” and “distribution” under copyright law. \n MakerBot confines this license to only granting us the rights to use user-content in relation to operating Thingiverse.  MakerBot does not claim ownership over user-content and we distinguish between Intellectual Property belonging to MakerBot, and that of the users. \n Secondarily, users select a license, such as Creative Commons governing how others may use their work, including us.  When we use designs from Thingiverse outside the Thingiverse ecosystem, we adhere to the way users have chosen to manage the copyright terms that automatically attach to their work.  Moreover, we typically go beyond that by asking users if they approve, something I have personally done on several occasions.  We are keen on maintaining the spirit of Thingiverse as it has always been and on empowering a community of makers to share their digital designs openly. \n One provision of the MakerBot TOS that has caused confusion is the waiver of “Moral Rights or attribution.” I understand that this may sound sinister, but Moral Rights have a specific legal definition. Moral Rights (droits moraux) is a doctrine, mainly from French Law, that is not part of US copyright law. This means that unless you are a citizen of one of the countries that recognize Moral Rights, this provision doesn’t affect you. \n The reason MakerBot requires a waiver of these rights is to lend certainty to the license that MakerBot relies upon to operate Thingiverse. Because Moral Rights operate outside the context of US Copyright law, they can cause contradictory results. For example, there is a Moral Right against “mutilation” of a work. This can include any derivative work, remix, or mashup that the author disapproves of. Because Moral Rights exist outside of US copyright law, a user can grant someone a license that allows derivatives, and then cause trouble when they dislike a specific derivative work. This approach is fundamentally inconsistent with the intention of Thingiverse, which is to share things and their derivatives. \n Sound farfetched? In one case an author signed a contract, and was paid to ghostwrite a novel. The author collected her fee and then sued, relying on the Moral Right of Attribution, to have her name associated with the novel, and won. (Bragance v. Michel de Grece et Editions Orban, Court of Appeal of Paris, February 1, 1989, 142 R.I.D.A. 301 (1989)) In sum, Moral Rights just introduce too much uncertainty into the already complex world of US copyright law. We deal with it by restricting our agreement to be governed solely by US copyright law. \n I will be working on revising the TOS in the direction of “less legalese and more reader-ease”—terms that allow MakerBot to operate Thingiverse properly as a service-provider and that respect users’ contributions and the community’s values. It’s hard to make a legally binding agreement that is easy to read. It’s not a skill that lawyers spend much time honing but understandability will be a chief goal of the revision. \n Thank you, \n Rich McCarthy \nCounsel \nMakerBot Industries LLC"], "link": "http://blog.thingiverse.com/2012/09/26/terms-of-service-and-moral-rights-explained/", "bloglinks": {}, "links": {"http://www.makerbot.com/blog": 1, "http://blog.thingiverse.com/": 1}, "blogtitle": "Thingiverse Blog"}, {"content": ["The Thingiverse terms of use didn’t change yesterday. They are the same as they have been since we updated them in February . Check out the blogpost I made then. – Bre"], "link": "http://blog.thingiverse.com/2012/09/20/thingiverse-terms-of-use/", "bloglinks": {}, "links": {"http://blog.thingiverse.com/": 1}, "blogtitle": "Thingiverse Blog"}, {"content": ["Thingiverse user Emmett has contributed some of the most widespread and well known designs in the world of 3D printing. You’ve probably seen his Heart Gears or Cube Gears all over the web. Maybe you have one of his stretchy bracelets on your wrist right now. \n Another incredible feat by Emmett is this Moineau Pump. Wikipedia says we’re talking about a progressive cavity pump . \n It transfers fluid by means of the progress, through the pump, of a sequence of small, fixed shape, discrete cavities, as its rotor is turned. This leads to the volumetric flow rate being proportional to the rotation rate (bidirectionally) and to low levels of shearing being applied to the pumped fluid. Hence these pumps have application in fluid metering and pumping of viscous or shear-sensitive materials. The cavities taper down toward their ends and overlap with their neighbours, so that, in general, no flow pulsing is caused by the arrival of cavities at the outlet, other than that caused by compression of the fluid or pump components. \n If this looks like something that should be pumping out slushies, that’s because it is. Emmett notes these designs are used a lot in the food industry, “because it can efficiently pump slurries (like soup) without crushing the contents.” \n There’s another P rogressive Cavity Pump from Thingiverse user mechadense, and this one looks to be printed in PLA with an ABS core. Nice works of engineering here!"], "link": "http://blog.thingiverse.com/2012/09/19/progressive-cavity-pumps/", "bloglinks": {}, "links": {"http://en.wikipedia.org/": 1, "http://www.thingiverse.com/": 6}, "blogtitle": "Thingiverse Blog"}, {"content": ["So you have that awesome old school air hockey table in the basement but what happened to the puck and the mallets? Bring life back to the game and make replacements on your MakerBot. \n Game on! Thanks to LeftAngle!"], "link": "http://blog.thingiverse.com/2012/08/22/lost-and-found-air-hockey-edition/", "bloglinks": {}, "links": {"http://www.thingiverse.com/": 2, "http://blog.thingiverse.com/": 2}, "blogtitle": "Thingiverse Blog"}, {"content": ["How can you say I love you better than a Makerbot Mixtape ? \nHow about a Makerbot Mixtape in a heart ! \n Made by using the Makerbot Mixtape Negative file \n Designed by John Briscella and Matt Kroner"], "link": "http://blog.thingiverse.com/2012/08/09/love-song/", "bloglinks": {}, "links": {"http://www.thingiverse.com/": 3, "http://blog.thingiverse.com/": 1}, "blogtitle": "Thingiverse Blog"}, {"content": ["This is just cool . Thanks tbuser !"], "link": "http://blog.thingiverse.com/2012/07/30/towards-the-light/", "bloglinks": {}, "links": {"http://www.thingiverse.com/": 2, "http://blog.thingiverse.com/": 1}, "blogtitle": "Thingiverse Blog"}, {"content": ["This comes from neurothing . A 3D printed model of the human inner ear (cochlea, vestibule and semicircular canals) derived from MRI data of a human cadaver. Printed about 12X actual size. \n More details from the MakerBot.com blog."], "link": "http://blog.thingiverse.com/2012/07/30/can-you-hear-me-now/", "bloglinks": {}, "links": {"http://www.makerbot.com/blog": 1, "http://www.thingiverse.com/": 1, "http://blog.thingiverse.com/": 1}, "blogtitle": "Thingiverse Blog"}, {"content": ["Rediscover a lost classic – MakerBot a Mixtape ! \n The MakerBot Mixtape Kit gives you the power to create the ultimate gift. We ship you the electronics, you print the STLs on this page in any of our terrific filament colors and snap the whole thing together! \n This project is designed to work with the MakerBot Mixtape Kit, available on our store. \n store.makerbot.com/makerbot-mixtape-kit.html \n Don’t have a MakerBot yet? Get your hands on a fully assembled MakerBot Mixtape at the link below. \n store.makerbot.com/makerbot-mixtape.html \n Designed by John Briscella and Matt Kroner"], "link": "http://blog.thingiverse.com/2012/07/25/makerbot-mixtape-kit/", "bloglinks": {}, "links": {"http://www.thingiverse.com/": 2, "http://blog.thingiverse.com/": 1, "http://store.makerbot.com/": 2}, "blogtitle": "Thingiverse Blog"}, {"content": ["Here at MakerBot we believe in the power of making over buying. Imagine a day when you MakerBot your own locks. That day is finally here. As ttsalo says this padlock is, ‘not a joke lock.’ Security disclaimer: while this lock is fully operational please keep in mind it’s made of plastic. \n \nSee how it works: youtu.be/yzBI0HB2o-I"], "link": "http://blog.thingiverse.com/2012/07/23/locked-up/", "bloglinks": {}, "links": {"http://youtu.be/": 1, "http://www.thingiverse.com/": 2, "http://blog.thingiverse.com/": 1}, "blogtitle": "Thingiverse Blog"}, {"content": ["I long for the day when I can ditch the G train for my Hovercar . Shout out to dutchmogul for this model."], "link": "http://blog.thingiverse.com/2012/07/20/roads-where-were-going/", "bloglinks": {}, "links": {"http://www.thingiverse.com/": 3, "http://blog.thingiverse.com/": 1}, "blogtitle": "Thingiverse Blog"}]