[{"blogurl": "http://tiffanyfarrant.co.uk\n", "blogroll": [], "title": "Tiffany Farrant - Information Design"}, {"content": ["Happy Halloween! Enjoy a cute little pumpkin that I doodled this morning!"], "link": "http://tiffanyfarrant.co.uk/post/34705326971", "bloglinks": {}, "links": {}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["Every now and then I get hit by crippling creative block. I can’t predict when it’ll hit, but when it does unfortunately no amount of sitting at my desk, and banging my head against the computer will relieve me. \n \n There is a temptation I feel, that when you’re in a creative role and the dreaded block hits, to make yourself feel guilty for not accomplishing as much as you would on an average day. I know I do. I feel terribly guilty when I’m sitting and staring at a blank page of my notebook for hours without respite. I try and force the ideas out, and won’t step away from my desk until there’s something on that page. But that just makes the block’s hold on me stronger.  \n Even though I know the worst thing to do is to sit there and wait until an idea magically pops into my head, I still do it, because if I try and occupy my mind with something else for an hour or so, the inevitable guilt sets in.  \n But why do we do this to ourselves? Why make ourselves feel bad for something that we can’t help? Is it because deep-down we feel that we can help it? That because we’re in a creative job, we have a responsibility to be creative all the time? Or is it the pressure of looming deadlines and the possibility of failure? Either way, no one should make themselves feel guilty because of it.  \n There is a certain feeling of helplessness that accompanies creative block, and it can render an entire day wasted, but instead of sitting there moping about it, I should use that time to get away from the computer screen, to pick up a book or go for a walk… For most people (including me) inspiration doesn’t just come out of thin air, and a blank Illustrator file has got to be about as uninspiring as it gets."], "link": "http://tiffanyfarrant.co.uk/post/34640287834", "bloglinks": {}, "links": {}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["The History of Film \n This fantastically detailed graphic chronicles the history of feature films from the origins in the 1910s until the present day. More than 2000 of the most important feature-length films are mapped into 20 genres spanning 100 years. \n By  HistoryShots"], "link": "http://tiffanyfarrant.co.uk/post/34630874107", "bloglinks": {}, "links": {"http://www.historyshots.com/": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["Catan  Movie star wine  Mickey Mouse soup  Quiet evenings  Swag!  Geometric building  Dome  Farmer's market  Old man's pub A Snapshot of my Week (22-28 Oct) \n Catan, movie star wine, Mickey Mouse soup, quiet evenings, swag, geometric buildings, dome, farmer’s market and an old man’s pub."], "link": "http://tiffanyfarrant.co.uk/post/34578379862", "bloglinks": {}, "links": {}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["Whedon on Romney \n Joss Whedon ‘endorses’ Mitt Romney, harbinger of the Zombie Apocalypse"], "link": "http://tiffanyfarrant.co.uk/post/34555685440", "bloglinks": {}, "links": {}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["I’ve been waiting with baited breath for this! Finally, an official cartographic companion to the Song of Ice and Fire series! \n  \n I read a LOT of fantasy and sci-fi books and the first thing I always do when opening a new book is see if there’s a map. I’m always secretly disappointed when there isn’t, but when there is there’s something oddly satisfying about being able to plot out where each character is at any given time and to truly immerse yourself in the landscape. Maps also provide you with a sense of perspective and distance, something which can often be lost with words. \n  \n In no book I’ve come across is a companion map more essential than with the Song of Ice and Fire (Game of Thrones) series, where there are hundreds, if not thousands, of characters and locations and a plethora of inter-weaving plots. The world George R. R. Martin has created is so vividly rich and detailed, that you can become utterly lost and disorientated without a map by your side, so it’s super handy that there are a few small black and white maps included at the beginning of each book. \n However, having transitioned all of my reading activity to the Kindle half-way through the series, I got more and more frustrated that there wasn’t an easy way for me to keep flicking back to the maps at the beginning of the book, not to mention that Kindle’s zoom feature for images isn’t the best, making the reading of said maps nigh impossible.  \n So you can imagine how excited I was to see the announcement of the release of the official companion map book, which not only details all the locations in amazing detail (with colour!) but also tracks the paths of the main characters! \n I’m probably more excited than I should be, but as someone who adores the Song of Ice and Fire universe and maps (not to mention, the book looks beautiful), this is something that I need to acquire. Stat!  \n The Lands of Ice and Fire is released on October 30th"], "link": "http://tiffanyfarrant.co.uk/post/34290707382", "bloglinks": {}, "links": {"http://io9.com/": 3}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["My Home is My Castle by Adam Hill \n This is how I see my apartment… except I genuinely would like more turrets!"], "link": "http://tiffanyfarrant.co.uk/post/34286648443", "bloglinks": {}, "links": {"http://www.velcrosuit.com/": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["Book Sculptures by Rune Guneriussen \n Works by artist Rune Guneriussen . There is a quiet yet unexpected beauty in them; a fairytale-like quality that I’m always attracted to (via  bookshelfporn ,  source:  nevver )"], "link": "http://tiffanyfarrant.co.uk/post/34226122077", "bloglinks": {}, "links": {"http://www.runeguneriussen.no/": 1, "http://thisisnthappiness.com/": 1, "http://bookshelfporn.com/": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["Stamen’s Photo Sharing Explosions \n Facebook teamed up with data visualisation experts, Stamen to visualise how content is shared among its users. By tracking the shares of 3 popular posts by George Takei, Stamen were able to create some fantastic visualisations that appear to bloom before your very eyes. \n \n Each visualization is made up of a series of branches starting from a single person. As the branch grows, re-shares split off on their own arcs, sometimes spawning a new generation of re-shares, sometimes exploding in a short-lived burst of activity. The two different colors show gender, and each successive generation becomes more and more white as time goes by."], "link": "http://tiffanyfarrant.co.uk/post/34166449551", "bloglinks": {}, "links": {"http://www.facebookstories.com/": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["How the Chinese and the Greeks viewed (pretty much) the same sky. \n It’s pretty remarkable how differently two cultures can connect the same dots, don’t you think?  (Maps via  jtotheizzoe  and   radical cartography )"], "link": "http://tiffanyfarrant.co.uk/post/34164037093", "bloglinks": {}, "links": {"http://www.itsokaytobesmart.com/": 1, "http://www.radicalcartography.net/": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["A Snapshot of my Week (15-21 Oct) \n Broken heating, boardgames, a rainbow, Autumnal foliage, flowers and cake!"], "link": "http://tiffanyfarrant.co.uk/post/34100330773", "bloglinks": {}, "links": {}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["Halloween Costume Ideas for Inanimate Objects \n Bwahahahaha! I want Jeff Wysaki to be my best friend! He could help me trick out my apartment with all of the puns! (by pleatedjeans )"], "link": "http://tiffanyfarrant.co.uk/post/33948174904", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://www.youtube.com/": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["“Never Stop Learning” - My personal manifesto \n This wonderful typographic print is by Bilyana Kroll"], "link": "http://tiffanyfarrant.co.uk/post/33884076565", "bloglinks": {}, "links": {"http://www.biljanakroll.com/": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["I want these lovely  Geek Metal Art Bookends  by KnobCreekMetalArts on Etsy. Lovely!"], "link": "http://tiffanyfarrant.co.uk/post/33830215917", "bloglinks": {}, "links": {"http://www.etsy.com/": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["The Fool’s Cap Map of the World, circa 1580-1590, depicting the world as a foolish place with the jest’s penchant for mocking majesty and speaking truth to power. \n  \n \n This rather sinister image is one of the biggest mysteries in the history of western cartography. Most often referred to simply as the Fool’s Cap Map of the World, it is unknown why, when, where and by whom it was made. The only thing that can be said about it with some certainty is that it dates from ca. 1580-1590. \n The uncomfortable truth told by this map is that the world is a sombre, irrational and dangerous place, and that life on it is nasty, brutish and short. The world is, quite literally, a foolish place. \n \n View full article on The Big Think"], "link": "http://tiffanyfarrant.co.uk/post/33763960825", "bloglinks": {}, "links": {"http://bigthink.com/": 2}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["Have you seen this How to Choose the Perfect Board Game infographic? I found it surprisingly accurate. \n (via  seenontabletop )"], "link": "http://tiffanyfarrant.co.uk/post/33699017006", "bloglinks": {}, "links": {"http://www.silveroakcasino.com/blog": 1, "http://seenontabletop.tumblr.com/": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["Grabbing a delicious coffee to escape the rain (Taken with Instagram at Colonna & Small’s Espresso Room)"], "link": "http://tiffanyfarrant.co.uk/post/33636373333", "bloglinks": {}, "links": {"http://instagram.com": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["Last weekend, to celebrate our 2nd anniversary we stayed out in a cute little cabin in the middle of the Black Mountains in Wales. There was no electricity, no phone signal, no Internet and no hot water. It was truly a back-to-nature experience, and we loved every minute of it! \n \n There is a sheer simplicity to living off the grid, chopping up your own wood, heating your own water and building fires for cooking, with no temptation to check emails, post on Twitter or browse your usual Internet haunts. I honestly hadn’t felt that relaxed in a long time. Without the distraction of technology we just made the most of being out in the countryside, cooking outside and going for long walks in the valley, breathing in the clean, fresh air. Just living the simple life for a few days. \n When you’re plugged in everyday, it’s hard to imagine living without the Internet. But for those few days, none of us missed it at all. It’s certainly not for everyone, and I can’t imagine doing it any later in the year, as yes, it did start to get rather chilly. But I think in today’s time, where we’re constantly online no matter where we are, it’s so important to be able to take some time out to just log off and really get away from it all. It’s nice to know that there are places out there that you can do just this, and anytime I’m feeling fed up with the online world, or just want some distraction-free chillaxing time, I will definitely be heading back to this little cabin to wind-down and brew my coffee over an open fire!"], "link": "http://tiffanyfarrant.co.uk/post/33158210788", "bloglinks": {}, "links": {}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["Putting things in perspective - The history of the Earth in 24 Hours (via curiositycounts )"], "link": "http://tiffanyfarrant.co.uk/post/32865812390", "bloglinks": {}, "links": {"http://curiositycounts.com/": 1}, "blogtitle": "Tiffany Farrant - Information Design"}, {"content": ["My office setup today whilst the decorators take the windows out of the other room… (Taken with Instagram )"], "link": "http://tiffanyfarrant.co.uk/post/32863377125", "bloglinks": {}, "links": {"http://instagram.com": 1}, "blogtitle": "Tiffany Farrant - Information Design"}]