[{"blogurl": "http://timelyportfolio.blogspot.com\n", "blogroll": [], "title": "Timely Portfolio"}, {"content": ["As the Yen and Japan continue to get more interesting in my mind, I just wanted to resurrect some posts that I have done on Japan and the Yen and sort them by my favorites.  Japan Trade by Geographic Region Japanese Trade and the Yen Japan Intentional or Accidental Pursuit of Deflation Japan Trade More Specifically with Korea  Just to add a chart, here is one using data from the Federal Reserve Bank of St. Louis (FRED). While the extreme correlation between the Yen and the S&P 500 has limited the opportunity available in the Yen, the correlation has recently weakened as Japanese deficits have worsened and the Yen stopped getting stronger.     From TimelyPortfolio  R code: require(latticeExtra) require(quantmod) getSymbols(\"DEXJPUS\",src=\"FRED\") getSymbols(\"SP500\", src=\"FRED\") asTheEconomist(xyplot(DEXJPUS,main=\"US Dollars for Japanese Yen Since 1970\\nSource: Federal Reserve Bank of St. Louis\")) #merge the weekly returns of Yen and SP500 ret <- na.omit(merge(weeklyReturn(DEXJPUS),weeklyReturn(SP500))) #use the rolling correlation method from PerformanceAnalytics chart.RollingCorrelation rollcor <- as.xts(rollapply(ret, width = 208, FUN = function(x) cor(x[,      1, drop = FALSE], x[, 2, drop = FALSE]), by = 1,      by.column = FALSE, na.pad = FALSE, align = \"right\")) xyplot(na.omit(merge(SP500,rollcor,DEXJPUS)),col=brewer.pal(\"RdBu\",n=9)[c(9,2,8)],    lattice.options=theEconomist.opts(),    par.settings=theEconomist.theme(box=\"transparent\"),    scale=list(y=list(rot=0)),    xlab=NULL,    strip=strip.custom(factor.levels=c(\"S&P 500\",\"Correlation (Rolling 4 Year) S&P 500 and USD/Yen\",\"USD/Japanese Yen\")),    main = \"S&P 500 and USD/Yen Since 1970\\nSource: Federal Reserve Bank of St. Louis\")"], "link": "http://timelyportfolio.blogspot.com/feeds/6892785942687860928/comments/default", "bloglinks": {}, "links": {"http://timelyportfolio.blogspot.com/": 4, "https://picasaweb.google.com/": 2}, "blogtitle": "Timely Portfolio"}, {"content": ["The Ministry of Finance Japan very generously provides data on JGBs back to 1974. Here is a quick example how to pull it into R and then graph it.     From TimelyPortfolio  R code in GIST (do raw for copy/paste):"], "link": "http://timelyportfolio.blogspot.com/feeds/5689773230128482226/comments/default", "bloglinks": {}, "links": {"https://gist.github.com/": 1, "https://picasaweb.google.com/": 2}, "blogtitle": "Timely Portfolio"}, {"content": ["Although I have used the Kenneth French data library extensively in various posts , I have not yet used the international data sets paired with the wonderful paper.  Eugene F. Fama and Kenneth R. French (2012) \"Size, Value, and Momentum in International Stock Returns\", Critical Finance Review  To rectify this home bias, let’s generate some efficient frontiers for the biggest cap stocks by geographic region to see how the frontiers have evolved over the last 20 years.     From TimelyPortfolio  Eventually, I would like to think through some other methods of comparing risk, return, and weights across multiple frontiers. R code from GIST (do raw for copy/paste):"], "link": "http://timelyportfolio.blogspot.com/feeds/6352230395171233817/comments/default", "bloglinks": {}, "links": {"http://timelyportfolio.blogspot.com/": 1, "http://mba.dartmouth.edu/": 1, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 2}, "blogtitle": "Timely Portfolio"}, {"content": ["When I ask the question “What if the US 10 year goes to 0?\", most do not know the effect, the catalyst, or if 0 has ever happened before. The math is fairly simple to do in Excel or with an old-school calculator, but let’s use RQuantLib to do the pricing and then use LatticeExtra with some slight adjustment in SVG. RQuantLib spits out a total return of 17% if we go to 0 by the end of October, which seems like a decent amount until we look at on a chart.     From TimelyPortfolio  Mildly impressive, but the move is almost undetectable on a log scale.     From TimelyPortfolio  Throughout history, we have really only one good reference point in Japan whose 10 year went very briefly to 0.47%, but we need to remember that was in extended deflation in which stocks and real estate lost 90%. That 17% return if we go to 0 (actually much less since 0.47% 0.43% was the stopping point) is not all that helpful in this devastating environment. Even more strange is that the move we experienced over the last 15 months is greater than the potential move from here to 0. On a six month change in yield chart, the 2% from April to 0% in October seems perfectly normal if we forget about the starting point.     From TimelyPortfolio  Similarly, a 12 month rolling total return chart does not reveal anything odd.     From TimelyPortfolio  However, starting point is critical. Instead of subtracting ending from starting yield, ending yield/starting yield is more appropriate at this critical level. Now we can see how unusual the move really is.     From TimelyPortfolio  If you are buying bonds to protect/benefit from a disastrous, deflationary “end of the world”, please be aware that best case you make a fairly measly 17%. Just moving back to where we were Spring 2011 would mean a bigger loss than the absolute best case. THIS IS NOT INVESTMENT ADVICE. ALL OF THE ABOVE IS SIMPLY FOR ILLUSTRATION. R code from GIST: (do raw for copy/paste)"], "link": "http://timelyportfolio.blogspot.com/feeds/1284113873777526573/comments/default", "bloglinks": {}, "links": {"https://gist.github.com/": 1, "https://picasaweb.google.com/": 10}, "blogtitle": "Timely Portfolio"}, {"content": ["Extending the series begun with When Russell 2000 is Low Vol , I thought I should take a look at Emerging Market stocks during periods of low relative volatility to the S&P 500. So you can replicate even without access to expensive data, let’s use the Vanguard Emerging Market Fund (VEIEX) and the Vanguard S&P 500 Fund (VFINX) as proxies. In the 12 month rolling regression, we see the same fairly steadily increasing beta and correlation of the Emerging Market stocks to the S&P 500 that we saw in the Russell 2000.     From TimelyPortfolio  If I progress further on this research, I will have to work on an adaptive definition of “low vol”, but for the purpose of this post, I defined “low vol” as  Emerging 50 day std. dev – S&P 500 50 day sd > –0.075 For the Russell 2000, we used a more strict 0.0125. Although the numeric definition is different, the chart shows a very similar profile.     From TimelyPortfolio  R code from GIST:"], "link": "http://timelyportfolio.blogspot.com/feeds/2403378200529603125/comments/default", "bloglinks": {}, "links": {"http://timelyportfolio.blogspot.com/": 1, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 4}, "blogtitle": "Timely Portfolio"}, {"content": ["Continuing in my exploration of the Russell 2000 ( Russell 2000 Softail Fat Boy ), I thought I would try to approach the topic with a low volatility paradox mindset. Since 2005, beta of the Russell 2000 compared to the S&P 500 has exceeded 1.2 with a max of 1.6 for almost every rolling 1 year period. This suggests that the Russell 2000 is anything but low vol.     From TimelyPortfolio  However, we can take a more simplistic view by comparing the rolling 50-day standard deviation of the Russell 2000 with the S&P 500. Russell 2000 on an absolute and relative basis does very well when rolling 50-day standard deviation of the Russell 2000 minus the same standard deviation on the S&P 500 exceeds –1.25%, so the Russell 2000 performs best when volatility approaches the S&P 500. In low relative volatility environments, it seems we should own the high beta Russell 2000. You will see the largest down moves all occur in the non-shaded time periods.     From TimelyPortfolio  I intentionally wanted this post to be simple, so I hid a lot of the preliminary work and extra links. Far more went into this than appears above. R code from GIST:"], "link": "http://timelyportfolio.blogspot.com/feeds/1284818604931420185/comments/default", "bloglinks": {}, "links": {"http://timelyportfolio.blogspot.com/": 1, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 4}, "blogtitle": "Timely Portfolio"}, {"content": ["I very much enjoy papers such as  Antonacci, Gary, Risk Premia Harvesting Through Momentum (September 5, 2012). Available at SSRN: http://ssrn.com/abstract=2042750 or http://dx.doi.org/10.2139/ssrn.2042750 Faber, Mebane T., A Quantitative Approach to Tactical Asset Allocation (February 17, 2009). Journal of Wealth Management, Spring 2007. Available at SSRN: http://ssrn.com/abstract=962461  and clearly the finance community appreciates these with the first as a First place winner of the 2012 NAAIM Wagner Awards for Advancements in Active Investment Management and the second with a download rank of 2 on SSRN with 273,000 abstract views. However, I struggle mightily with how obvious would these papers’ choice of assets been without the benefit of hindsight. I already briefly touched on this flaw in Bonds Much Sharpe -r Than Buffett . Of course, using what we now know is one of the best asset classes in the history of the world that has also experienced an anomalous and extremely negative correlation with equities during their distress will provide a very positive result. Unfortunately, I have yet to find any research from the late 1970s or early 1980s that predicted such a glorious environment for bonds. Similar but not quite as extreme, adding REITs ( all my posts about REITs ) over the last 12 years in any way would almost guarantee a pleasant result. However, REITs were not so stellar for the 15 year period 1984-1999. Would REITs have been such an obvious choice in 1999? Of course, if we know the future, but I’m not so sure when we only knew the past.     From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio  Also, how obvious would gold have been in 1998 or how obvious would high yield have been in the early 1980s when they did not even exist? Can we expect the next 10 years to look like the last 10 years? R code from GIST:"], "link": "http://timelyportfolio.blogspot.com/feeds/6173577326185875042/comments/default", "bloglinks": {}, "links": {"https://gist.github.com/": 1, "http://timelyportfolio.blogspot.com/": 2, "https://picasaweb.google.com/": 6, "http://ssrn.com/": 2, "http://dx.doi.org/": 1}, "blogtitle": "Timely Portfolio"}, {"content": ["Almost always, when I see a system backtested, the backtest assumes a static portfolio with no contributions or withdrawals. This assumption only covers an extremely limited subset of my clients. Cash flows in and out of a portfolio or system can have a much larger impact on ending net worth than the geometrically linked performance of a system or money manager. Most of the systems I have shown for demonstration purposes on this blog have suffered from this unrealistic assumption. I thought I should show how contributions similar to those in a 401k can affect a simple moving average system. In a roaring bull market, any momentum system will underperform so significantly that potential abandonment of the system due to lack of confidence is highly likely. As shown below, there was very little discussion of moving average strategies 1990-2000 due to the simple fact that buy/hold absolutely clobbered them. While normal adjustments like return/risk and a log scale can soften the impact on the screen, the psychological impact to a client can be very damaging as the focus moves entirely to $ value of the portfolio. Below is a comparison of buy and hold versus a 200 day moving average system with no additions or withdrawals. As discussed, 1990-2000 was not kind to the moving average.     From TimelyPortfolio  However, if we add a simple framework similar to a 401k investor starting with $100,000 and adding $10,000 per year ($2,500 per quarter), the results differ significantly.     From TimelyPortfolio  I intentionally played a little trick by changing the y axis to a log scale. Clients don’t think in log scale when evaluating performance. They simply look at $ value of the portfolio. If we look at the results without a log scale, underperformance by 2000 is visible, but it is nowhere near as great as shown in the first chart of the post, and outperformance after the 2008-2009 collapse is very healthy. I actually think a client could accept this profile much more readily than that shown with a static portfolio.     From TimelyPortfolio  Of course, this test was not perfect, and all sorts of assumptions and simulations can be added, but we can start to see how inflows and outflows can impact a portfolio whether it is buy/hold, discretionary, or systematic. R code from GIST ( do raw for copy/paste ):"], "link": "http://timelyportfolio.blogspot.com/feeds/8576451528110322500/comments/default", "bloglinks": {}, "links": {"https://gist.github.com/": 1, "https://picasaweb.google.com/": 6}, "blogtitle": "Timely Portfolio"}, {"content": ["If the Russell 2000 were a motorcycle, maybe it should be a Harley-Davidson Softail Fat Boy . I have explored the exceptional case of the Russell 2000 in quite a few posts  More Exploration of Crazy RUT  Where are the Fat Tails?  Crazy RUT  but I still am not sure I have done a good job of clearly and simply explaining some of the unique characteristics of the Russell 2000 over the last 25 years. The Russell 2000 has been extremely difficult to beat because the upside has been so good (fat boy) and the downside has been the same or better (softtail).     From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio  R code from GIST:"], "link": "http://timelyportfolio.blogspot.com/feeds/8699016066271805886/comments/default", "bloglinks": {}, "links": {"http://www.harley-davidson.com/": 1, "http://timelyportfolio.blogspot.com/": 3, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 6}, "blogtitle": "Timely Portfolio"}, {"content": ["Tradeblotter announced the very nice features that will be added to the PerformanceAnalytics package as a result of the Google Summer of Code (GSOC) 2012 project:  “…Matthieu commenced to produce dozens of new functions, extend several more existing ones, and add more than 40 pages of additional documentation (complete with formulae and examples) to PerformanceAnalytics. He’s included Bacon’s small data set and several new table.* functions for testing and demonstrating that the functions match the published results. All on plan, I would add. He also wrote a very nice overview of the functions developed from Bacon (2008) that are included in PerformanceAnalytics, which should be helpful to readers or teachers of Bacon’s work. Matthieu’s summary document will also be distributed as a vignette in the package, accessible using vignette('PA-Bacon') . Additional detail is included in the documentation for each function, as well. I’ll highlight some of those functions in later posts…” Although the Bacon vignette is very helpful, I highly recommend reading the book also. For those of you on O’Reilly’s Safari, you can add the book to your bookshelf. Preview  or buy it from Amazon. Since I saw the announcement (been patiently waiting) when I was also reading this very good article “Tomatoes and the Low Vol Effect” by Research Affiliates , I was already working on some R to explore the Sharpe and Information Ratio between a buy/hold on the S&P 500 and a 10 month moving average strategy. When you look at the code, you might enjoy some of the other charts and methods, but I decided to change directions with my research and integrate a new PerformanceAnalytics function and continue to push the limits with another fine Google Summer of Code 2012 addition xtsExtra plot.xts . I was not real selective and opted for ProspectRatio, since it is a formula I do not often hear discussed. On page 20, the Bacon vignette describes ProspectRatio as   I basically tried to include absolutely everything possible (scattered, smothered, covered, chunked, and diced) from xtsExtra plot.xts in this chart. The chart includes cumulative growth of buy/hold and 10 month moving average on the S&P 500 in the top panel, shows drawdown in the middle, and then adds a horizon plot of Prospect Ratio for the ma strategy – Prospect Ratio for the buy/hold. Since plot.xts also allows for blocks, I thought it would be helpful to also shade those periods when the 36 month rolling Sharpe Ratio of the ma strategy outperforms buy/hold. While this is probably a bit much for a single chart, I think it demonstrates clearly how powerful these tools are.   From TimelyPortfolio  R code from GIST (do raw for copy/paste):"], "link": "http://timelyportfolio.blogspot.com/feeds/6359508002932413778/comments/default", "bloglinks": {}, "links": {"http://my.safaribooksonline.com/": 1, "http://advisorperspectives.com/": 1, "http://lh3.ggpht.com/": 1, "http://tradeblotter.wordpress.com/": 2, "http://timelyportfolio.blogspot.com/": 2, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 2}, "blogtitle": "Timely Portfolio"}, {"content": ["SocialDataBlog’s kind reference in post Horizon plots with ggplot (not) motivated me to finish what the post started. I knew that ggplot2 would be a little more difficult to use for the purpose of a horizon plot , but I felt compelled to provide at least one example of a horizon plot for each of the major R graphing packages. I achieved a good result but the code is not as elegant or as flexible as I would like. Readers more comfortable with ggplot2, please bash, fork, and improve.     From TimelyPortfolio  R code in GIST (do raw for copy/paste):"], "link": "http://timelyportfolio.blogspot.com/feeds/217705408459437736/comments/default", "bloglinks": {}, "links": {"http://timelyportfolio.blogspot.com/": 1, "http://socialdatablog.com/": 1, "https://picasaweb.google.com/": 2, "https://gist.github.com/": 1}, "blogtitle": "Timely Portfolio"}, {"content": ["Mebane Faber’s post Buffett’s Alpha points out Warren Buffett’s 0.76 Sharpe Ratio discussed in the similarly title paper Buffet’s Alpha . I of course immediately think about the 8th Wonder of the World – the US Bond Market, whose Sharpe Ratio has trounced Buffett’s for the last 30 years. What I like even better are all the tactical systems that employ US bonds in their backtests and make no adjustment for substantially different returns going forward. For those of you who do not know, bonds with absolute certainty cannot achieve >8% annualized returns with max drawdown < 5% for the next 30 years with a starting yield to worst at 1.86% (Barclays Agg 8/23/2012).  If anyone can show me where to get 8% annualized returns with max drawdown of 5% for the next 30 years, please let me know, and I will buy that with leverage and enjoy life. I’ll be happy to share my gains with whomever has the answer.     From TimelyPortfolio  In addition to an unbelievable Sharpe Ratio, bonds have exhibited a low/negative correlation with stocks during stocks’ bear market, which is also historically very anomalous.     From TimelyPortfolio  Just because I love horizon plots .     From TimelyPortfolio  For a longer perspective, here is rolling correlation since 1900 from the CSFB 2011 Yearbook.   So the experience can be dramatically different than what we have been fortunate enough to experience recently.   R code from GIST (install xtsExtra):"], "link": "http://timelyportfolio.blogspot.com/feeds/4612009194390930271/comments/default", "bloglinks": {}, "links": {"http://www.mebanefaber.com/": 1, "http://www.yale.edu/": 1, "http://lh6.ggpht.com/": 2, "http://timelyportfolio.blogspot.com/": 1, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 6}, "blogtitle": "Timely Portfolio"}, {"content": ["(for all plot.xts posts, see http://timelyportfolio.blogspot.com/search/label/plot.xts )  As another example of all that we can do with the new plot.xts, let’s try to do a price plot with a moving average overlays. We will use the ETFs shown by Mebane Faber at http://www.mebanefaber.com/timing-model/ . With the panel functionality, it is very easy to specify a panel to draw the price line and then add the calculated moving average. Notice how in all the examples, the recession block appears easily and very nicely.     From TimelyPortfolio  Also, if you wanted to specify some funky layouts, we have that option. For this case, I do not think it makes much sense, but in the future I will demonstrate some more appropriate uses.     From TimelyPortfolio  Or as one more example, let’s change it up just slightly.     From TimelyPortfolio  R code in GIST (do raw for copy/paste and also install xtsExtra from r-forge):"], "link": "http://timelyportfolio.blogspot.com/feeds/4348464231178057538/comments/default", "bloglinks": {}, "links": {"http://timelyportfolio.blogspot.com/": 1, "https://picasaweb.google.com/": 6, "http://www.mebanefaber.com/": 1, "https://gist.github.com/": 1}, "blogtitle": "Timely Portfolio"}, {"content": ["I’m clearly out of my realm of competence with most of the rugarch functions, but I thought it might be nice to provide an example combining plot.xts and uGARCHroll.   R code from GIST:"], "link": "http://timelyportfolio.blogspot.com/feeds/2146304466155310138/comments/default", "bloglinks": {}, "links": {"http://lh3.ggpht.com/": 1, "https://gist.github.com/": 1}, "blogtitle": "Timely Portfolio"}, {"content": ["Anyone who has read  48 Industries (Dendrogram Ordered) Over 50 Years  48 Industries Since 1963  “Trend is Not Your Friend” Applied to 48 Industries  Horizon Plots in Base Graphics  More on Horizon Charts  Application of Horizon Plots  Horizon Plot Already Available  Cubism Horizon Charts in R  should already know that I really like horizon charts. Also, you would probably guess that I would be very excited if the new plot.xts could produce horizon charts. So I am excited, since with its panel functionality, plot.xts very capably creates horizon charts.     From TimelyPortfolio  R code from GIST (also, please install xtsExtra from r-forge):"], "link": "http://timelyportfolio.blogspot.com/feeds/4313381795438341057/comments/default", "bloglinks": {}, "links": {"http://timelyportfolio.blogspot.com/": 9, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 2}, "blogtitle": "Timely Portfolio"}, {"content": ["As mentioned in FOSS Trading post A New plot.xts yesterday  “The Google Summer of Code (2012) project to extend xts has produced a very promising new plot.xts function. Michael Weylandt, the project's student, wrote R-SIG-Finance to request impressions, feedback, and bug reports . The function is housed in the xtsExtra package of the xts project on R-Forge . Please try xtsExtra::plot.xts and let us know what you think. A sample of the eye-candy produced by the code in Michael's email is below. Granted, this isn't a one-liner, but it's certainly impressive! Great work Michael!” and as announced by author Michael Weylandt in https://stat.ethz.ch/pipermail/r-sig-finance/2012q3/010652.html  “As the community which makes the most heavy use of xts, I would like to draw your attention to a new set of plotting functions for xts objects available as part of Google Summer of Code 2012. This work represents a major overhaul of previously existing plot.xts and should provide you with the most comprehensive and flexible time series plotting available in R. Features include:  \"automagic\" layout construction and axis alignment smart argument recycling panel function abilities more attractive candle and bar plots for OHLC objects scatterplots to view the co-evolution of multiple series event markers regime highlighting time-oriented barplots via barplot.xts [based on code by Peter Carl] interoperability with all known R time series classes using the xts try/reclass paradigm while retaining the same smart axis formatting and gridlines that plot.xts provided. We have made every effort to maintain complete compatibility with documented usages of the old plot.xts and to be 95% compatible with plot.zoo. My goal has been to craft a design which uses smart defaults to put attractive and informative graphics ever at your fingertips, while remaining flexible enough for \"power-users\" to craft every detail as they desire…” Michael has done a fantastic job with this Google Summer of Code (GSOC) project, and I look forward to incorporating all the new features of plot.xts. As a quick example very different from that shown in the post and mailing list announcement, I thought it would be fun to show how we can use plot.xts to replace the veteran chart.TimeSeries and charts.PerformanceSummary plots from the PerformanceAnalytics package. For the chart.TimeSeries, I will almost exactly replicate the chart given in the documentation.     From TimelyPortfolio  Not really as a useful application but for the sake of demonstration, we can produce something like this to separate styles and also avoid event label collision (just implemented by Michael very late last night).     From TimelyPortfolio  plot.xts even allows plot.zoo and lattice panel type functionality which allows us to do very nice things like in this charts.PerformanceSummary style chart.     From TimelyPortfolio  I very much appreciate this very powerful contribution to R. Thanks to everyone involved. R code in GIST (note: install xtsExtra from R-forge) :"], "link": "http://timelyportfolio.blogspot.com/feeds/1611956155484220327/comments/default", "bloglinks": {}, "links": {"https://stat.ethz.ch/": 3, "https://r-forge.r-project.org/": 2, "http://draft.blogger.com/": 1, "http://google-melange.appspot.com/": 1, "http://blog.fosstrading.com/": 1, "http://rwiki.sciviews.org/": 1, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 6}, "blogtitle": "Timely Portfolio"}, {"content": ["Inspired by http://blogs.reuters.com/felix-salmon/2012/08/06/chart-of-the-day-hft-edition/ , I thought I would build on 48 Industries (Dendrogram Ordered) Over 50 Years , “Trend is Not Your Friend” Applied to 48 Industries , and 48 Industries Since 1963 with an animated GIF of annual correlation for the Kenneth French 48 Industry Data set.     From TimelyPortfolio  R code in GIST (do raw for copy/paste):"], "link": "http://timelyportfolio.blogspot.com/feeds/5954840073260954664/comments/default", "bloglinks": {}, "links": {"http://blogs.reuters.com/": 1, "http://timelyportfolio.blogspot.com/": 3, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 2}, "blogtitle": "Timely Portfolio"}, {"content": ["Thanks to reader AHWest for the comment on post 48 Industries Since 1963 .  “I think it would be interesting to see the industries ordered by some sort of similarity of returns.” I think this is a great suggestion, and I would like to see it also. I tried the dendrogram plot technique from Inspirational Stack Overflow Dendrogram Applied to Currencies , but then I spotted the dendrogramGrob in the latticeExtra documentation. This was much easier, and in a couple of lines, we are able to order and connect the 48 industries.     From TimelyPortfolio  R code from GIST (do raw for copy/paste):"], "link": "http://timelyportfolio.blogspot.com/feeds/7913094666831179811/comments/default", "bloglinks": {}, "links": {"http://timelyportfolio.blogspot.com/": 2, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 2}, "blogtitle": "Timely Portfolio"}, {"content": ["Please see previous post Crazy RUT in Academic Context Why Trend is Not Your Friend .  I’ll repeat the intro to the post mentioned above, so we can all get caught back up. In response to Where are the Fat Tails? , reader vonjd very helpfully referred me to this paper The Trend is Not Your Friend! Why Empirical Timing Success is Determined by the Underlying’s Price Characteristics and Market Efficiency is Irrelevant by Peter Scholz and Ursula Walther. The authors conclude  “Our study on the basis of real data clearly confirms the hypothesis that the asset price characteristics of the underlying price process have a crucial impact on timing results. This allows us to forecast the timing success depending on the market's parameters. An OLS regression analysis supports our predictions and verifies our assumption that the drift has the strongest influence on timing success. By contrast, the higher moments (skewness, kurtosis) seem not to have any significant impact on the timing result in the empirical sample. As we presumed, the level of market development, and hence the degree of efficiency, does not play any role. Trading worked coincidentally rather well in the developed world and quite poorly in the emerging markets. The driving factor for the timing success is the parametric environment the trading system stumbles on… Our study contributes to the discussion by providing a structured analysis of the relevance of the most important price process parameters. As a result, the traditional explanations for timing success can be abandoned: we find that it is very likely for the SMA trading rule to generate excess returns over its benchmark if the underlying price path exhibits negative drifts, high serial autocorrelation, low volatilities of returns, and highly clustered volatilities. Drift and autocorrelation of the underlying asset seem to have the largest impact, though.” One of my initial ideas for extending the research was to incorporate a much larger set of indexes over a longer period of time. As I was working on 48 Industries Since 1963 , I decided 50 years of data on 48 different indexes would be a great dataset to apply the ideas and methods presented in the paper. Using R and all its wonderful packages, it is surprisingly easy to accomplish. Let’s see if we can test “drift and autocorrelation…have the largest impact” on excess returns with industries also. I’ll try not to get too statistical. In terms of drift or annualized return, we can see a linear inverse relationship between return and out(under)performance of the 200 day moving average system, so the better the performance of the industry, the less likely a moving average system is to outperform.     From TimelyPortfolio  In terms of the GARCH model effects on excess returns, a parallel coordinate chart will best start our exploration. Lines are colored by the excess return of a moving average system on each industry.     From TimelyPortfolio  Mu and alpha1 seem to most heavily influence the ability of a moving average system to outperform. Let’s isolate our chart to mu and alpha1 and add ar1 based on the authors’ findings. I am very tempted to try to explain GARCH here, but for the sake of brevity, I’ll refrain. This paper and this Portfolio Probe post offer a good introduction to GARCH.     From TimelyPortfolio  Now let’s look at a scatterplot of excess return versus each of the GARCH stats, starting with those with the most influence.     From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio  In conclusion, it seems the same effects observed by the authors also apply to US industry indexes. In future posts, I’ll add a little more statistical rigor to the analysis and apply to other indexes. Now, I just cannot resist using a horizon plot to evaluate the rolling 250 day excess returns of a moving average system over buy and hold. As you can see, a bull market favors buy and hold. The 70s and 2008-2009 were very kind to a moving average approach.     From TimelyPortfolio  R code in GIST (do raw for copy/paste):"], "link": "http://timelyportfolio.blogspot.com/feeds/7595556616950194998/comments/default", "bloglinks": {}, "links": {"http://scholar.google.com/": 1, "http://www.frankfurt-school.de/": 1, "http://www.portfolioprobe.com/": 1, "http://timelyportfolio.blogspot.com/": 3, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 20}, "blogtitle": "Timely Portfolio"}, {"content": ["Please see http://timelyportfolio.blogspot.com/search/label/horizonplot for all horizon plot posts.  Once more thanks to Ken French for his data , we can accomplish something I think is fairly amazing. In 640x800, we can see 250 day rollling returns for 48 U.S. industries since 1963.     From TimelyPortfolio  R code in GIST (do raw for copy/paste):"], "link": "http://timelyportfolio.blogspot.com/feeds/8959304532046225903/comments/default", "bloglinks": {}, "links": {"http://mba.dartmouth.edu/": 1, "http://timelyportfolio.blogspot.com/": 1, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 2}, "blogtitle": "Timely Portfolio"}, {"content": ["for background please see prior posts More on Horizon Charts , Application of Horizon Plots ,  Horizon Plot Already Available , and  Cubism Horizon Charts in R  There are three primary graphics routes in R (base graphics, lattice, and ggplot2), and each have their zealots. Last time in More on Horizon Charts , I used lattice and latticeExtra. This time we will build horizon plots in base graphics, and I was pleased with the result. Unfortunately, there is one small issue in that the points of change from positive to negative overlap. Please let me know if you have a solution. Thanks to helpful readers for their comments and code changes, this is now fixed.     From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio      From TimelyPortfolio  Now, let’s implement a for loop and mirror the negative values.     From TimelyPortfolio  With horizon chart functionality in base graphics, hopefully we can add this type now to other packages. Here is a potential example using quantmod.     From TimelyPortfolio   R code in GIST (do raw for copy/paste)"], "link": "http://timelyportfolio.blogspot.com/feeds/2482884096798959833/comments/default", "bloglinks": {}, "links": {"http://timelyportfolio.blogspot.com/": 5, "https://gist.github.com/": 1, "https://picasaweb.google.com/": 18}, "blogtitle": "Timely Portfolio"}, {"content": ["As the market has already started to poke holes in Draghi’s promise, I thought it would be good to continue the series of posts that I began with the British version “We Will Do Whatever it Takes” with my favorite article written during the Asia Pacific crisis in 1997.  The Economist, “The baht spills over”: May 22, 1997  Too soon to crow “Even if Thailand's troubles are in a regional class of their own, its neighbours still have reason to fear the knock-on effect of a successful onslaught on the baht. For now, Thailand has been crowing about a victory over the speculators. Mr Amnuay has even promised to bring interest rates, which have been kept high to protect the baht, down by two percentage points this year. It is as if a little guy, having survived one round with the big bullies, was dancing around with his fists up, saying, go on, hit me again.   They almost certainly will. The defence of the baht was achieved by a series of extraordinary measures that will be hard to sustain…” A little graphical perspective might help us remember when this article was written.   For the entire set of Economist articles on Thailand during this period, go to http://www.economist.com/topics/thailand-1?page=33&%2524Version=0&%2524Path=%252F&%2524Domain=.economist.com . Also, please read the incredibly thorough account of the 1997 crisis at The Nation blog . If throughout financial market history, the central banks and politicians ever defeated the markets (greedy speculators), please let me know. I am absolutely amazed at the confidence in central banks and politicians, especially in the United States.   R code: #plot Thai baht require(lattice) require(latticeExtra) require(quantmod) getSymbols(\"DEXTHUS\",src=\"FRED\") DEXTHUS <- 1/DEXTHUS[\"1995-01-01::1999-12-31\",] asTheEconomist( xyplot(DEXTHUS,  panel = function (x,y,...) {   panel.xyplot(x,y,...)   panel.abline(v=index(DEXTHUS)[which(index(DEXTHUS)==\"1997-05-22\")],col=\"black\", lty=3)   panel.text(x=index(DEXTHUS)[which(index(DEXTHUS)==\"1997-05-22\")], y = 0.025, labels=\"Economist article The Baht Spills Over\", col=\"indianred4\", srt=90, pos=3)  },   main = \"Thai Baht Before and After Crisis (1995-1999) \\n source : Federal Reserve Bank of St. Louis\") )"], "link": "http://timelyportfolio.blogspot.com/feeds/5395403245578050721/comments/default", "bloglinks": {}, "links": {"http://lh4.ggpht.com/": 1, "http://www.economist.com/": 2, "http://timelyportfolio.blogspot.com/": 1, "http://blog.nationmultimedia.com/": 1}, "blogtitle": "Timely Portfolio"}, {"content": ["for background please see prior posts Application of Horizon Plots ,  Horizon Plot Already Available , and  Cubism Horizon Charts in R  Some feedback has led me to think that I might have been a little ambitious with my last post on horizon charts . I thought it might be helpful to quickly provide an overview on horizon charts. Since I am not a visualization expert, I will try to compile the best examples and tutorials that I have found. At the end, I will do a step by step walkthrough of the construction of a horizon chart in R.  Below is a great talk in its entirety by Mike Bostock. For the discussion on horizon charts, skip to the 11:20 mark.  Mike Bostock @ Square talks about Time Series Visualization from Librato on Vimeo . Fortunately, Mike also provides the interactive example from the video demonstrating the construction of a horizon chart from an area chart. I have embedded it below (see https://bl.ocks.org/1483226 for the full example from the original source).  This quick YouTube clip from Panopticon all the way back in 2009 also does a very nice job explaining construction. If you learn better from reading, a short paper from Hannes Reijner of Panopticon Software covers the same material.  Jeffrey Heer of Stanford University with Nicholas Kong and Maneesh Agrawala from University of California, Berkeley, investigate the effectiveness of horizon plots and make some recommendations for their use. The chart below also offers another explanation of the steps in building a horizon plot.   They recommend and conclude  Layered Bands Are Beneficial As Chart Size Decreases We found that dividing a chart into layered bands reliably increased estimation time and increased estimation error at constant chart heights. However, we also found that 2-band mirrored charts led to better estimation accuracies for chart heights less than 24 pixels (6.8 mm on our displays). For larger chart sizes, we advise scaling 1-band mirrored charts. For smaller sizes, we advise adding layered bands.  Extending the horizon into healthcare, here is an interesting project using horizon graphs for visualization of diabetes care .  HorizonVis Interactive Visual Exploration of Multivariate Medical Measurements in Diabetes Care  Lead / Contact Wolfgang Aigner  Team Wolfgang Aigner , Vienna University of Technology Michael Atanasov, HTBL Krems Alexander Rind , Vienna University of Technology Philipp Schindler, HTBL Krems Reinhardt Wenzina, HTBL Krems  Partners Vienna University of Technology, Institute of Software Technology & Interactive Systems HTBL Krems, Department of Information Technology   Now For My Own Attempt at Explaining  If we use yesterday’s example of a 200 day moving average system where you enter when above the moving average and exit when below, we might like to see a standard time series plot like this one.     From TimelyPortfolio  In a simple world with only one asset or stock, this might be sufficient. However, we probably will have multiple instruments that we would like to monitor, and dedicating this much height per instrument will require lots of space. Ideally, we could condense each of these plots, so that we could see many at a time. In the first step toward condensing, we could extract just the information that is most meaningful, which I consider to be the percent above or below the moving average.     From TimelyPortfolio  We might then try an area chart to better depict above or below 0.     From TimelyPortfolio  I’m sure you are wondering though when we will start reducing height and saving space. We could start by changing all the negative values to positive values, and add color to represent positive or negative. This means we cut our chart height by about 1/2.     From TimelyPortfolio  However, we need much more efficiency, so let’s separate the chart into bands.     From TimelyPortfolio  Is there any potential way of separating each of these bands and then recombining them to save space? Let’s look at each band separately. Band 1 (0 to 10%)     From TimelyPortfolio  Band 2 (10% to 20%)     From TimelyPortfolio  Band 3 (20% to 30%)     From TimelyPortfolio  Band 4 (30% to 40%) exceeding 3 bands is not recommended     From TimelyPortfolio  Notice that similar to a heat map, the band colors increase in intensity and opaqueness as their values increase. If we layer each band on top of each other, we get a horizon plot, and we can reduce the original chart by 1/6 or even more without significant loss of information.     From TimelyPortfolio  I hope this helps explain why we might use horizon plots and how to make them. If nothing else, maybe you will have learned some lattice techniques in R.  R code in GIST (do raw for copy/paste):"], "link": "http://timelyportfolio.blogspot.com/feeds/7511252454262420992/comments/default", "bloglinks": {}, "links": {"http://www.ac.at/": 2, "http://lh4.ggpht.com/": 1, "http://www.stonesc.com/": 1, "https://gist.github.com/": 2, "http://vimeo.com": 1, "http://vis.stanford.edu/": 1, "http://ieg.ac.at/": 4, "http://timelyportfolio.blogspot.com/": 4, "http://vimeo.com/": 2, "https://picasaweb.google.com/": 20}, "blogtitle": "Timely Portfolio"}, {"content": ["When I first heard Draghi’s quote “We Will Do Whatever it Takes,” I immediately thought that I should dig through some other good quotes from similarly positioned officials in financial history. Let’s start with Prime Minister John Major in England 1992. I found this clip reminding us of the 1992 British Pound devaluation. http://news.bbc.co.uk/onthisday/hi/dates/stories/september/16/newsid_2519000/2519013.stm “The move is a dramatic U-turn in government policy, as only last week Prime Minister John Major reaffirmed the government's commitment to remaining within the mechanism.” (see his strong words below at the 2:34 mark) Another near real-time view of Black Wednesday, September 16, 1992. I think the last lines from the Atlantic June 4, 2010 article “Go For the Jugular” sum it up very well  “That evening, Lamont called a press conference in the Treasury's central courtyard. At 7:30 p.m., facing a massive battery of TV cameras from all over the world, he announced Britain's exit from the exchange-rate mechanism.  The markets had won, and the government had at last recognized it. ”"], "link": "http://timelyportfolio.blogspot.com/feeds/8016739762660328936/comments/default", "bloglinks": {}, "links": {"http://news.co.uk/": 1, "http://www.theatlantic.com/": 1}, "blogtitle": "Timely Portfolio"}, {"content": ["for background please see prior posts  Horizon Plot Already Available  and  Cubism Horizon Charts in R  Good visualization simplifies, and stories are better told with effective and pretty visualizations. Although horizon plots are not immediately intuitive, I have embraced them as an extremely effective method of analyzing more than four series. I hope they become much more popular, so I can use them with much more confidence. If we look at a traditional cumulative growth chart on the managers dataset provided by PerformanceAnalytics, I get confused by too many lines and colors since there are 10 different series. While this chart works, it can be better.     From TimelyPortfolio  We could panel the data, but I think this makes comparison even more difficult.     From TimelyPortfolio  In this case and many others, horizon plots provide what I feel to be both a more attractive and effective visualization. Here is an example using latticeExtra’s horizonplot function with very little adjustment. You can detect both comovement or seasonality and can compare the amplitude simultaneously.     From TimelyPortfolio  With a little additional formatting, we can get an ideal visualization-pretty and effective. The ability to scale well beyond 10 series offers power that we cannot obtain with a traditional line chart.     From TimelyPortfolio  As another example, let’s look at how we can use horizon plots to monitor a moving average system similar to the Mebane Faber's timing model. If you follow the link, you can see a decent visualization of the price and moving average. A horizon plot could accomplish this much more efficiently.     From TimelyPortfolio  I personally like the mirrored horizon plot even better. Let’s incorporate that.     From TimelyPortfolio  Please help me popularize these extremely powerful charts. R code from GIST (do raw for copy/paste):"], "link": "http://timelyportfolio.blogspot.com/feeds/7878364458475789783/comments/default", "bloglinks": {}, "links": {"http://timelyportfolio.blogspot.com/": 2, "http://www.mebanefaber.com/": 1, "https://picasaweb.google.com/": 12, "https://gist.github.com/": 1}, "blogtitle": "Timely Portfolio"}]