[{"blogurl": "http://trinkersstatsstuff.wordpress.com\n", "blogroll": [], "title": "TRinker's Stats Blog"}, {"content": ["A frequent question for people first learning statistical procedures is how to normalize data.  Other terms for normalizing may include standardizing , scaling and centering (though the last two terms may mean something other than the first two terms).  In my field (literacy) many of my colleagues work with count data on text data and thus have a need for comparing across data sets.  Normalizing data is one means of accomplishing this.  A while back I wrote a guide for people in my field to help with normalizing data.  Though it was written for them it’s really a good guide for any statistics beginner. \n The guide is broken into three parts: \n \n An introduction to normalizing text data   (if you don’t care about this skip on to section two) \n An explanation of the standard score formula (doing it by hand) \n A guide to doing normalization in excel (with pictures) \n \n Normalizing Text  Data (Click Here)           ←  good normalizing guide for anyone not just those who deal with text"], "link": "http://trinkersstatsstuff.wordpress.com/2012/05/05/15/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://dl.dropbox.com/": 1}, "blogtitle": "TRinker's Stats Blog"}, {"content": ["As a contributor at talkstats.com  one of the most often seen topics of posters’ questions is that of Likert data.  The problem with these questions is there generally is no “ correct ” answer.  The field has been debating the treatment of Likert and Likert type data for 80 years.  The answer to these questions is to become informed and make an appropriate decision based on data, measurement and the inferences being made. \n I recently wrote a paper regarding Likert data for a psychometrics class that I figured I’d share for those wanting to understand how a researcher should treat Likert data.  The reference list is also a valuable source of information. \n On the Treatment of Likert Data.pdf \n \n POSTSCRIPT: \n A 2008 paper discussing the treatment of categorical data not used in the above paper ( click this )"], "link": "http://trinkersstatsstuff.wordpress.com/2012/04/28/likert-ata/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 7, "http://www.talkstats.com/": 1, "http://dl.dropbox.com/": 1, "http://psy2.ucsd.edu/": 1}, "blogtitle": "TRinker's Stats Blog"}]