[{"blogurl": "http://www.visualcomplexity.com/vc/blog\n", "blogroll": [], "title": "VC blog"}, {"content": ["About two years ago, in November 2010, I wrote a post stating I much I enjoyed and admired the “ remarkable examples of visual storytelling” produced by the Royal Society of Arts (RSA) and CognitiveMedia in their enticing RSA Animate series. Earlier this year I received an email from RSA telling me that they were considering turning my original RSA talk , from December 2011, into an RSAnimate. I was absolutely over the moon. In May 2012, the 12th video of the series was released, based on my talk “ The Power of Networks “. The final result exceeded all my expectations, and to this day I’m still dumbfounded by the phenomenal creativity of Andrew Park and his team, and the fantastic visual metaphors they continuously come up with. \n Apart from the video you can also download a pdf of the complete final drawing, or order a printed A0 poster (well worth it). Here are some images of the final composition:"], "link": "http://www.visualcomplexity.com/vc/blog/?p=1125", "bloglinks": {}, "links": {"http://www.visualcomplexity.com/": 1, "http://www.co.uk/": 4, "http://www.thersa.org/": 3, "http://www.youtube.com/": 1}, "blogtitle": "VC blog"}, {"content": ["Not sure what to give your design/geek/scientist/artist friend this holiday? Here are two ideas: \n Visual Complexity: Mapping Patterns of Information \n  \n The book has been featured on: \n WIRED Magazine Wish List \n New York Times Book Review \nand many others \n Posters: Syntax of a New Language \n  \n The 15 visual methods of network visualization as showcased in Chapter 5 of Visual Complexity. \nYou can read more here ."], "link": "http://www.visualcomplexity.com/vc/blog/?p=1112", "bloglinks": {}, "links": {"http://www.nytimes.com/": 1, "http://www.visualcomplexity.com/": 4, "http://www.wired.com/": 1}, "blogtitle": "VC blog"}, {"content": ["Over the past 11 months I’ve received an avalanche of infographics in my email inbox. \n Here’s a glimpse at the growing collection (click image for main article):"], "link": "http://www.visualcomplexity.com/vc/blog/?p=1106", "bloglinks": {}, "links": {"http://www.visualcomplexity.com/": 1}, "blogtitle": "VC blog"}, {"content": ["**This text was part of an extinct chapter of Visual Complexity: Mapping Patterns of Information , which never saw the light of day. Instead of being forgotten in a dusty folder, I decided to make it available to the general public and invite any constructive criticism by our growing community. Hope you will find it useful.** \n - \n Data and information visualization are fundamentally about showing quantitative and qualitative information so that a viewer can see patterns, trends, or anomalies, constancy or variation, in ways that other forms – text and tables – do not allow. \n Michael Friendly \n - \n \n \n The concept of visualization is certainly not new. Humans have been involved in the visual representation of information for more than 30,000 years. During this time, there has been a variety of portrayed subjects, many of them pertaining to natural phenomena, but the common underlying purpose of communicating a message has always been present. Whether we talk about cave paintings, cuneiforms, maps, or charts, we are always alluding to information in a quality of a message from a sender to one or more receivers. “The progress of civilization can be read in the invention of visual artifacts, from writing to mathematics, to maps, to printing, to diagrams, to visual computing.”[ 1 ], say Card, Mackinlay and Shneiderman. Historian Alfred W. Crosby attests to the importance of visual aids throughout the ages, by claiming that visualization and measurement were the two factors most responsible for the rapid development of all of modern science[ 2 ]. \n Even though visual artifacts have always been a central element in the history of humankind, over the last 25 years the term “visualization” has become immensely popular, being fragmented in a profusion of subfields, carrying a diversity of specialized labels such as Information Visualization, Data Visualization, Scientific Visualization, Software Visualization, Geographic Visualization, Knowledge Visualization, Flow Visualization, and even Music Visualization. Many of these areas emerged in the midst of existing parallel areas like Information Design, Information Graphics, and Visual Communication. The distinction between them is occasionally thin, and in some cases almost inexistent. This rich plethora of labels is certainly indicative of the outburst of a new practice, but one that is still struggling to define itself. While some consider this to be the birth of a new medium, or even a new science, the consensus on a definite descriptive label is not so obvious. \n According to Michael Friendly, the renowned professor of Psychology at York University in Canada, information visualization is the broadest term that could be taken to include all the developments in visualization, since “almost anything, if sufficiently organized, is information of a sort: tables, graphs, maps and even text, whether static or dynamic, provide some means to see what lies within, determine the answer to a question, find relations, and perhaps apprehend things which could not be seen so readily in other forms.”[ 3 ] But even able to accommodate the broadest of scopes, information visualization has also been the definite title of a multidisciplinary field emerging out of the computer science community in the late 1980s. \n \n \n Originally coined by Jock Mackinlay and his User Interface Research Group at Xerox PARC in 1986, information visualization relates to the “use of computer-supported, interactive, visual representations of abstract data to amplify cognition”[ 4 ]. It’s in essence a computer-driven transformation of abstract data (distinct from physical data – the earth, molecules, cells, human body, etc) into an interactive visual depiction aiming at insight – which in turn translates into “discovery, decision-making, and explanation”[ 5 ]. Congregating a vast body of research from computer science, human-computer interaction, communication design, cognitive psychology, semiotics, statistical graphics, cartography, and art, modern information visualization surfaced from advances in computer graphics and was further consolidated in 1987, when the NSF Panel on Graphics, Image Processing, and Workstations published its landmark report Visualization in Scientific Computing . Since then, information visualization has grown considerably as an independent discipline, fostered by many conferences and workshops dedicated to the topic, particularly the prominent IEEE Computer Society symposium on Information Visualization, known as the InfoVis conference, first held in 1995. \n \n \n With roughly two decades, information visualization has already been the target of some criticism and dismissal. Most of it comes from an inadequacy of the field to swiftly adapt to recent changes, caused by a large adoption from eager art and design communities and an escalating curiosity from media, advertising, and publishing. As a close-knit group, naturally inclined towards the computer science community, as a result of its own heritage, information visualization must take a stance to either adjust to these changes and fully accept its growing popularity, or instead, remain a niche inward-looking academic practice. Some signs of an embrace between traditional circles and the new wave of enthusiasts are already starting to surface, and this initial hesitation might simply go down in history as the normal shyness of a first date. Nonetheless, it is not surprising that under the present uncertainty, some voices have come forward suggesting new terms and definitions. Ben Fry in his PhD thesis defended a new label called “Computational Information Design”, able to properly integrate information visualization, data mining and graphic design, while Robert Kosara is a promoter of “Visual Analytics”, with a stronger emphasis on analytical reasoning. While many of the arguments for new labels reinforcing specific scientific or design concerns are certainly valid, there’s a major concern of an excessive breakup of a field that’s still defining itself. \n Instead of trying to devise new titles for alternative branches highlighting a particular area of focus, the effort should be in creating a bridge between the existing body of research and the abundance of novel demands, in an attempt to revise and renovate the field, steering information visualization into a mature, integrated, and in demand hotspot. If willing to adapt, the field is broad enough to fully encompass most requirements, from a stronger prominence of design to a reinforced attention to analytics. This doesn’t mean the discipline can incorporate any attempt at visualizing data. But in essence, all interactive visual representations, able to make the depicted subject more intelligible and transparent, or find a new explicit insight within it, can and should be embraced by information visualization. \n Unified Framework \n Information visualization is well known for its multidisciplinary nature, assembling people from a vast assortment of backgrounds, but notwithstanding the contribution of innumerous disciplines, we can still highlight three main spheres of activity that best characterize its key attributes and capabilities. Readers familiarized with research publications in the field will find this conception slightly different from previous frameworks developed by Stuart Card, Jock Mackinlay, Ben Shneiderman, and Ed Chi. The deliberate intent of this reframing is to emphasize the leading role of design, in both visual and interactive choices, and the fundamental function of statistics and data mining. This is ultimately an integrating, yet diverse framework, keeping alive the heterogeneous nature of the discipline. Here we describe the three central layers of information visualization: Data Transformation , Visual Mapping and Interactive Framing . Even though there’s a natural progression between the three stages that doesn’t mean they sustain in a fixed order. There’s a lot of refinement taking place in a continuous iterative process that forces each step to be occasionally revisited. \n \n Data Transformation \n This is the very first stage in the development of any information visualization project. Without data no visualization would even be possible, hence everything starts by attaining access to a particular dataset relevant to the project’s pursuit. After getting hold of the data, what follows is a long process of data analysis, which includes inspecting, cleaning, filtering, and parsing the data, while organizing the relevant parts and removing the irrelevant. The subsequent process of data mining is crucial in order to have a better understanding of the natural affordances of the dataset. It encompasses a series of queries and algorithms in order to extract particular patterns in the data for some quick modeling and visualization tests, which will be of great importance in the build up of the second stage. Data transformation is the essential foundation of a successful execution, and covers areas like programming, statistics, data analysis, data mining, analytics, and machine learning. \n Visual mapping \n \n \n Visual mapping is a critical step in information visualization, where data finally comes to life through a deliberate visual form. It takes into consideration key factors like top-to-bottom hierarchy, color, legibility, typeface, contrast, spacing, position, size, shape, orientation, layout, and depth. This central task contemplates not only individual views or modules, but also the composition of the entire contiguous environment. The choice of a particular method (or methods) is tied with the specific goal of the piece – its intrinsic purpose – and might be defined a priori or during project development, as the natural affordances of the data come into place. It’s also highly dependent on end users, their immediate context and expressed needs –  when, where, and how the final execution will be used. Visual mapping is tied with various areas of visual design, including graphic design, information design, interface design, visual perception, cognitive psychology, aesthetics, and typography. Furthermore, it’s essentially made of two components: graphical objects and textual objects. \n \n Interactive Framing \n Information visualization is ultimately a discovery tool, and interactivity provides the final coalescing layer for exploration. “Visual representations and interaction techniques take advantage of the human eye’s broad bandwidth pathway into the mind to allow users to see, explore, and understand large amounts of information at once”[ 6 ], elucidate James Thomas and Kristin Cook, and they further explain, “Visual representations alone cannot satisfy analytical needs. Interaction techniques are required to support the dialogue between the analyst and the data. While basic interactions such as search techniques are common in software today, more sophisticated interactions are also needed to support the analytical reasoning process.”[ 7 ] \n Some don’t see the clear-cut need for interaction in information visualization, so it’s important to clarify this assertion. In a broader definition of visualization, it’s broadly consensual that information can be successfully conveyed in either static or interactive executions. However, we have to question what really sets information visualization apart from other parallel fields such as information design or information graphics. It’s in fact its computer-supported interactive nature that truly makes it distinct, and this unique offering becomes imperative as the degree of complexity of the portrayed system increases. The representation of complex networks is just an instance where interactivity is vital. Coupled with a relevant time-variant dataset, interactivity can also be a critical driver in a shift from short-term casual engagement to long-term active engagement, substantiating information visualization as a significant tool for exploration. \n But interactive framing is not limited to the constraints of a computer screen. It covers any responsive visualization where a two-way communication between user and layout is established, from reactive surfaces to highly immersive visualization environments. This ultimate unifying layer is critical for explorative analysis, enabling users to inquire, filter, manipulate, reshape, and examine the visual outcome in order to identify properties, relationships, regularities, or patterns. Finally, it’s important to elucidate that even though interactivity is a central component of information visualization, the field doesn’t aim at replacing static depictions of information, since they can successfully complement each other. It simply provides an alternative, yet extremely powerful medium. \n Structural Foundation \n Even though there is a widespread consensus on its qualifications, information visualization, as a recent emergent field, still lacks a structural foundation able to uphold and expand its projection well into the future. We cannot consciously claim to be a new medium or a new science, when innumerous questions are still unresolved. It is critical for such an introspection effort to happen without delay, since there’s too much work to be done, and once we all agree on what we do as a community, it will be easier for external parties to recognize the goals and boundaries of our discipline. It’s obvious that we are still pulling together the different parts that make this practice and trying to understand when best to use them, but in order for information visualization to take the next step, and grow into a cohesive field of study, it requires the consolidation of three critical components: \n Theory \n \n \n Assemble a clear underlying theory able to combine many of the learnings, knowledge and insights from the variety of disciplines that make information visualization. If recent years have been marked by a significant profusion of new projects, this sturdy practice needs to be sustained by a reliable system of ideas and ideological principles. The purpose is to ultimately provide a broad consensual framework able to evaluate past, present and future endeavors. The current unguided exploration is by no means detrimental, since it’s the perfect setup for innovation to sprout, however, if the discipline wishes to mature as a reliable knowledge domain, it needs a supporting body of theory capable of accommodating all recent advances. Cognitive psychology might be one of the most reliable instruments in the edification of such a system, able to easily translate cognitive behaviors into objective design principles. A theory of information visualization will have to embrace diversity, and consequently several theories might need to coexist in opposition to one universal all-encompassing framework. \n \n Taxonomy \n Define the spectrum of representational methods and techniques of information visualization. The central aim should be to consolidate and further exemplify, by recognizing the different data types and structures that underlie a common typology of patterns. Chaomei Chen, an important figure in the field, asserts on this current call to arms: “a taxonomy of information visualization is needed so that designers can select appropriate techniques to meet given requirements”[ 8 ]. This is not meant to be a fixed and definite taxonomy, but an evolving, ever-growing, ever-expanding endeavor. This effort doesn’t contemplate a mere collection of techniques either; it should foremost supply a set of foundational principles able to guide present and future practitioners. Some initial steps in the description of common information visualization patterns have started to arise, but we still have a long way to go. \n Evaluation \n Provide easy evaluation methodologies for existing tools and approaches. Information visualization requires a common rule system that can accordingly distinguish the good from the bad, the appropriate from the inappropriate, the usable from the unusable, the effective from the ineffective. Case studies and success stories are a great first step in this direction. If information visualization is a vehicle for evidence and clarity, it should embrace the same ideology in the definition of its own practice, by creating a systematic body of analysis able to properly evaluate the success of any project. Quantitative and qualitative evaluation methods should be welcomed, including observational studies, participatory assessment, usability testing, contextual interviews, and user feedback. This effort should, most importantly, go hands in hands with the development of an adequate language of criticism. \n \n \n \n \n Epigraph: \n Friendly, Michael. “Milestones in the history of thematic cartography, statistical graphics, and data visualization”. August 24, 2009. http://www.math.yorku.ca/SCS/Gallery/milestone/milestone.pdf (accessed October 23, 2011). \n Notes: \n  [ 1 ]  Card, Stuart K., Jock Mackinlay, and Ben Shneiderman.  Readings in Information visualization: Using Vision to Think , 5. \n \n \n  [ 2 ]  Crosby, Alfred.  The Measure of Reality: Quantification and Western Society, 1250-1600 . \n \n  [ 3 ]  Friendly, Michael. “Milestones in the history of thematic cartography, statistical graphics, and data visualization”, 2. \n [ 4 ] Card, Stuart K., Jock Mackinlay, and Ben Shneiderman. Readings in Information visualization: Using Vision to Think , 6 \n \n \n [ 5 ] Ibid. \n \n \n [ 6 ] Thomas, James J. and Kristin A. Cook. Illuminating the Path: The R&D Agenda for Visual Analytics , 30. \n \n \n [ 7 ] Ibid. \n \n \n [ 8 ] Chen, Chaomei. Information visualization: Beyond the Horizon , 1."], "link": "http://www.visualcomplexity.com/vc/blog/?p=1076", "bloglinks": {}, "links": {"http://www.yorku.ca/": 1, "http://www.visualcomplexity.com/": 9}, "blogtitle": "VC blog"}, {"content": ["In the Preface of Visual Complexity: Mapping Patterns of information , I exposed my astonishment with the amount of dead links and error messages encountered while reviewing projects to feature in the book. It’s therefore not surprising that preserving many of these projects for posterity became a central drive for the book’s completion. This took an even more serious tone when I started digging deeper into an unsettling prospect commonly referred to as the Digital Dark Age . This expression essentially contemplates a future scenario where it will be difficult or impossible to read historical documents or artifacts, because they have been stored in an obsolete digital format. Even though this is a widespread dilemma of modern technology , affecting a variety of knowledge domains, when it comes to information visualization, the possibility of many present-day digital projects vanishing within a few decades is a considerable worrying prospect. \n As I researched many of the projects to showcase in the book, I was surprised to find that it was easier to retrieve an illustration from Joachim of Fiore, produced 800 years ago, than to attain an image of a visualization of web routers, developed in 2001. As I expressed in the Preface: \n \n The reasons for the disappearance are never the same. In most instances, pieces are simply neglected over time, with authors not bothering to update the code, rendering it obsolete. In other cases, the plug-in version might become incapable of reading older formats or the API from an early dataset source might change, making it extremely difficult to reuse the code that generated the original visualization. Lastly, projects are occasionally moved into different folders or domains or just taken down from the servers, simply because they highlight an outdated model that does not fit the current ambitions of their respective author or company. \n \n Just yesterday while researching for meaningful tree visualizations, the project Ecotonoha came to mind, as it always does, so many times I lost count. Sponsored by NEC and developed by  Yugo Nakamura in 2003 , Ecotonoha was a project to nurture a virtual tree collaboratively, and at the same time contribute to the actual environment to cope with global warming. More important, Ecotonoha has been a major inspiration for several artists/designers over the last decade and influenced numerous new media projects. If you try to access its website today, there’s a simple message that reads: \n \n The Ecotonoha campaign launched in 2003 has come to an end. We thank you very much for participating in this initiative. During the campaign, 7,423 trees were planted based on messages generated. We believe that your messages in shape of these trees will contribute greatly to sustaining the earth. We hope to have your continued support in our activities and to the conservation of the earth. \n \n But Ecotonoha is a success story in the current landscape. Most online visualization projects have a much shorter lifespan, and very few will reach Ecotonoha’s milestone of 8 years. Overall, this digital laissez-faire contributes to the ephemeral nature of most online artifacts, and consequently the whole field suffers from memory loss. \n \n New York Times  - Timelapse \n  \n \n A few months back I saw a canny post by Philip Vieira, which made me rethink about the dangers of our current digital laissez-faire. Due to an errant cron task that ran twice an hour from September 2010 to July 2011, Philip Vieira, a developer based in Toronto, Canada, accidentally collected 12,000 screenshots of the front page of the nytimes.com . With this rich content at hand, Philip created a time-lapse video showing the dinamic, ever-changing nature of the New York Times online frontpage over months. The result was utterly fascinating and absorbing, but it also led Philip to equate how how much is being lost, every minute of the day, across numeral digital artifacts. \n As Philip Vieira expresses on his post: \n Having worked with and developed on a number of content management systems I can tell you that as a rule of thumb no one is storing their frontpage layout data. It’s all gone, and once newspapers shutter their physical distribution operations I get this feeling that we’re no longer going to have a comprehensive archive of how our news-sources of note looked on a daily basis. \n His concern is valid and entirely in line with mine: \n This, in my humble opinion, is a tragedy because in many ways our frontpages are summaries of our perspectives and our preconceptions. They store what we thought was important , in a way that is easy and quick to parse and extremely valuable for any future generations wishing to study our time period. \n Digital Archeology \n  \n Of course many others are also concerned with the prospect of a  Digital Dark Age . In October 2010 the exhibit Digital Archeology opened in London as part of  Internet Week Europe, with the primary purpose of harvesting and uncovering dozens of websites created in the last 20 years. As the organizers state on their website: \n Over this short time, technological and communications developments have been so fast that the groundbreaking work of the early creative pioneers, produced on now defunct hardware and software, have disappeared almost as soon as they appeared, like Mayflies in spring doomed to die as the daylight fades. \n Concerned that “the evidence of this explosion of creativity may be consigned to digital oblivion”, this exhibit is timely and extremely relevant: \n Soon we will know less about these HTML blossomings than we do about the relief carvings in Mohenjo-Daro or the Yucatán. While they helped define our new culture, almost none of the websites of less than two decades ago can be seen at all. Today, when almost a quarter of the earth’s population is online, this most recent artistic, commercial and social history is being wiped from the face of earth and a hundred million hard drives lie festering in recycling yards or rusting in landfills. \n The Deleted City \n  \n Another recent, and even more evocative project on this topic is  The Deleted City . The installation is an interactive visualization of a 650 gigabyte backup of Geocities made by the Archive Team on October 27, 2009. It depicts the file system as a city map, spatially arranging the different neighborhoods and individual lots based on the number of files they contain. As the authors explain: \n Around the turn of the century, Geocities had tens of millions of “homesteaders” as the digital tennants were called and was bought by  Yahoo! for three and a half billion dollars. Ten years later in 2009, as other metaphors of the internet (such as the social network) had taken over, and the homesteaders had left their properties vacant after migrating to Facebook , Geocities was shutdown and deleted. \n In an heroic effort to preserve 10 years of collaborative work by 35 million people, the  Archive Team made a backup of the site just before it shut down. The resulting 650 Gigabyte bittorrent file is the digital Pompeii that is the subject of an interactive excavation that allows you to wander through an episode of recent online history. \n The need to preserve \n Today there are numerous cuneiform records - one of the earliest known forms of written expression, some 6,000 years old - which communicate a great number of insights about Sumerian, Assyrian, and Babylonian cultures and societies. Can we safely guarantee that some, if any, modern-day digital artifacts will last this long? \n I’m not surprised by the news of Amazon’s e-book sales surpassing printed ones, or by any recent story on the conversion of atoms into bits. As Benny Landa once said in respect to this inevitable progress: “Everything that can be digital, will be”. I’m not concerned with mass digitization, I’m simply fearful we are not making enough effort to preserve it. After all, what good is all this information if we cannot safely guard it for future generations?"], "link": "http://www.visualcomplexity.com/vc/blog/?p=922", "bloglinks": {}, "links": {"http://www.visualcomplexity.com/": 2, "http://yugop.com/": 1, "http://www.co.jp/": 1, "http://archiveteam.org/": 1, "http://nytimes.com": 1, "http://en.wikipedia.org/": 4, "http://www.usatoday.com/": 1, "http://okayfail.com/": 3, "http://deletedcity.net/": 2, "http://www.storyworldwide.com/": 2}, "blogtitle": "VC blog"}, {"content": ["Many readers of  Visual Complexity: Mapping Patterns of Information have been wondering about the cover design and its underlying meaning. Since there’s no information about the piece in the book, primarily due to an oversight that will be fixed in a following edition, here’s a bit of an explanation. \n I always wanted to feature a visualization or bespoken illustration in the cover, and it would have to be something related to the book and its content. Talking to a friend of mine a while back, the idea of creating a piece based on the book’s body of text came up. I thought that was definitely the way to go and started looking closely at some of my favorite textual visualizations out there. \n It took me a while to decide on the appropriate style and method I wanted to feature, but then I payed a closer look at the amazing work of  Boris Müller . For those who are not familiar with his work, Boris has created many great projects in the past, including  Connected Communities and Knowledge Maps . But I have always been particularly impressed by his remarkable  Poetry on the Road series. Since 2002, Boris has been commissioned to design a visual theme for the Poetry on the Road international literature festival, which is held every year in Bremen, Germany. For the various editions of the festival, Boris has created a poster with rich visual graphics generated by a computer program that turns selected poems of the participants into striking compositions. Every year has a different theme, and some are truly outstanding (e.g.  2003 ,  2006 ). \n When I approached Boris to do something similar for the cover of Visual Complexity he was immediately on board. He ended up providing a simple java app that could be used with any text to generate a similar visual output to the one he created for  Poetry 2008 . I started playing around with it and this was the very first set of experiments: \n \n There was still no information on the cover, it was pure visual exploration at this stage. I started by depicting individual chapters, simply because it was more manageable and easier to grasp the type of outcome provided by the app. Below is a second group of tryouts using different colors and including the title and author’s name. \n \n In order to reveal a bit more diversity, we also explored different colors in the same composition and one unique visualization featuring all seven chapters of the book. \n \n Finally, and after a long discussion between myself and the design and marketing departments at Princeton Architectural Press, we finally agreed on the last version of the cover, this one including the entire seven chapters, or roughly 35,558 words. The final printed outcome has exceeded my expectations and sometimes it is easy to forget how much time, sweat, love, and dedication goes into a book cover. \n \n In case you are still wondering how everything works, here’s an extended description to be featured in a later edition of the book: \n “Visualization featuring all 35,558 words displayed in the entire book, spread across its seven chapters. It was built by sorting all words based on their frequency in the text and representing them as lines. Lines are grouped in seven horizontal bands, representative of all chapters, from top to bottom, chapter 1 to chapter 7. Thicker lines depict most frequent words, which are placed on the left hand side of the diagram. As words are repeated across different chapters their lines flow vertically from one band to the other.” \n Here is a close-up of the final product: \n \n \n And the book being displayed in two bookstores in NYC, respectively  Strand (left) and  St. Mark’s (right):"], "link": "http://www.visualcomplexity.com/vc/blog/?p=1055", "bloglinks": {}, "links": {"http://www.stmarksbookshop.com/": 1, "http://www.visualcomplexity.com/": 3, "http://www.strandbooks.com/": 1, "http://www.esono.com/": 4, "http://esono.com/": 1}, "blogtitle": "VC blog"}, {"content": ["In chapter five of Visual Complexity: Mapping Patterns of Information , entitled The Syntax of a New Language , I expose 15 visual methods for network visualization spread across 60 pages and 103 images. This chapter has been the result of several years of research and attentive review of more than 750 projects featured in VisualComplexity.com . \n As stated in the intro paragraph of the chapter: “Despite this rich graphical diversity, many projects tend to follow noticeable trends and common principles, which in turn result in a type of emergent taxonomy. This embryonic and evolving taxonomy provides a portrait of the current state of the practice and reveals the initial building blocks shaping a new visual language.” \n Here’s a link to the 3 posters created: \n VC Book Posters"], "link": "http://www.visualcomplexity.com/vc/blog/?p=1006", "bloglinks": {}, "links": {"http://www.visualcomplexity.com/": 4}, "blogtitle": "VC blog"}, {"content": ["Functional beauty is an intrinsic formula of Nature; moreover, it’s an intrinsic formula of great designs, where both elements (function & aesthetics) are highly intertwined to the point of becoming indistinguishable. The discussion of one versus the other occurs primarily as an argument to cover poor designs, which tends to fail by not considering both elements as equal parts of the same equation. \n The following quotes should be read as an ode to functional beauty, an enduring formula for great designs: \n - \n“The care for the beautiful leads us to the same selection as the care for the useful… The buildings we admire are those in which the architect has succeeded in proportioning the means to the end, in which the columns seem to carry the burdens imposed on them lightly and without effort.” \n Henry Poincaré (1908) \n- \n“Moreover, the perfection of mathematical beauty is such, that whatsoever is most beautiful and regular is also found to be the most useful and excellent.” \n D’Arcy Thompson - On Growth and Form (1917) \n- \n“The philosophical definition of beauty must set forth its purpose or function in the universe. The nature or constitution of beauty, then, can be only the combination of qualities fitted to bring about this end.” \n \nEthel D. Puffer , The Philosophical Review , (1904) \n- \n“Pressing beyond a Kantian aesthetic of form and beauty, we might suggest an aesthetic of function. The art may have served a practical function for its original viewers, and the aesthetics of the art should then be related directly to that function - an aesthetic that encompasses the art’s ritual purpose for which it was created.” \n Thomas Heyd and John Clegg , Aesthetics and Rock Art , (2005) \n- \n“Above all else, a visualization is beautiful when it is useful. A visualization is beautiful when it elegantly and appropriately makes the viewer think about the information organized in the visual display. A visualization is beautiful when it allows the viewer to gain insight and understanding into the information, especially when that information was not appreciated in some other form, such as written prose. A visualization is beautiful when the information is thoughtfully arranged in such a way that patterns and structures are revealed.” \n David J. Staley -  Computers, Visualization, and History (2002) \n- \n “All architecture is shelter, all great architecture is the design of space that contains, cuddles, exalts, or stimulates the persons in that space. ” \n  Philip Johnson \n-"], "link": "http://www.visualcomplexity.com/vc/blog/?p=984", "bloglinks": {}, "links": {}, "blogtitle": "VC blog"}, {"content": ["Although some in the past have explored this highly interconnected system, in the last week there were three infographics depicting the interbreeding, intermingling, or cross-pollination (or any other biological metaphor) between the main tech companies shaping the current market. \n - \nTalent Traffic \n  \n - \nSpawn of the Tech Giants \n \n \n - \nThe Interconnected World of Tech Companies"], "link": "http://www.visualcomplexity.com/vc/blog/?p=949", "bloglinks": {}, "links": {"http://www.fastcodesign.com/": 1, "http://mashable.com/": 1, "http://blog.topprospect.com/": 1}, "blogtitle": "VC blog"}, {"content": ["Since the book is almost out in major bookstores across the globe (I’m told in the next 12 days - Aug 3 for Amazon.com), and considering several requests, here’s the Table of Contents of Visual Complexity: Mapping Patterns of Information (click image below for pdf): \n  \n The book is divided in seven chapters and I like to think of it almost as a symphony, with the first three chapters providing a foundational opening for the lavish visual burst of chapters 4 and 5 - the sonata’s allegro or vivace - immediately followed by its final cadence, “Complex Beauty” (perhaps my favorite chapter) and “Looking Ahead”. Here’s a bit on the book’s structure, as explained in the Introduction: \n 01 | The Tree of Life \n The book opens with “Tree of Life,” an exploration of the sacred meaning of trees and their widespread use as a classification system over the centuries. It showcases an assortment of ancient representations — as predecessors of modern-day network diagrams — where the tree metaphor is used to visually convey a variety of topics, from theological events to an encyclopedia’s table of contents. \n 02 | Form Trees to Networks \n The second chapter, “From Trees to Networks,” makes the case for a new network-based outlook on the world, one that is based on diversity, decentralization, and nonlinearity. It explores several instances — from the way we envision our cities to the way we organize information and decode our brain — where an alternative network model is replacing the hierarchical tree schema. \n 03 | Decoding Networks \n Chapter three, “Decoding Networks,” delves into the science behind network thinking and network drawing, providing a short introduction to its main precursors and early milestones. It also takes a pragmatic and utilitarian look at network visualization, acknowledging its key functions and proposing a set of guiding principles aimed at improving existing methods and techniques. \n 04 | Infinite Interconnectedness \n Following a series of functional recommendations for network visualization, chapter four, “Infinite Interconnectedness,” presents a large number of examples divided into fourteen popular subjects. From depictions of the blogosphere to representations of terrorist networks, chapter four highlights the truly complex connectedness of modern times. \n 05 | The Syntax of a New Language \n If chapter four looks at the practice primarily through its most common themes, chapter five, “The Syntax of a New Language,” organizes a vast array of projects by their shared visual layouts and configurations. As designers, scientists, and researchers across the globe portray an increasing number of network structures in innovative ways, their collective effort forms the building blocks of a new network-visualization lexicon. \n 06 | Complex Beauty \n After presenting an abundance of network-visualization examples in chapters four and five, chapter six, “Complex Beauty,” examines the alluring nature of networks, responsible for a considerable shift in our culture and society. Alternating between scientific and artistic viewpoints, this chapter explores the divide between order and complexity before culminating in a discussion of an original art movement embracing the newly discovered beauty of the network scheme. \n 07 | Looking Ahead \n Finally, and in the spirit of network diversity and decentralization, “Looking Ahead,” the last chapter, presents different views on the influential growth of visualization, according to renowned experts, active participants, and attentive observers. The featured essays cover an array of trends and technologies shaping the progress of visualization and provide an immensely captivating perspective on what may lie ahead."], "link": "http://www.visualcomplexity.com/vc/blog/?p=929", "bloglinks": {}, "links": {"http://www.visualcomplexity.com/": 1}, "blogtitle": "VC blog"}]