[{"blogurl": "http://www.visualnews.com/category/infographics\n", "blogroll": [], "title": "Visual News"}, {"content": ["Check out your links after the jump. \n \n Back to work \n \n le Bat \n \n \n BLACK VELVET PAINTINGS – BRUCE WHITE \n \n HAIIRO (2012) \n \n Tribal Skull By Indi \n \n Feed Me & Crystal Fighters – Love Is All I Got \n \n The Trip – Liransz \n \n Scott Greenwalt \n \n 1934 – The Black Cat \n \n ‘American Scream’ Poster \n \n Lead Image: Jaw-Dropping Pumpkin Carvings by Ray Villafane \n For more art make an add request on the Facebook group Artsy !"], "link": "http://feedproxy.google.com/~r/TheVisualNews/~3/q6UK-8ARhPs/", "bloglinks": {}, "links": {"http://www.sitnie.com/": 1, "http://www.visualnews.com/": 2, "http://www.tumblr.com/": 1, "http://thissongissick.com/blog": 1, "http://twistedsifter.com/": 1, "http://soylentgreenwalt.com/": 1, "http://thisisnthappiness.com/": 2, "https://www.facebook.com/": 1, "http://www.bloodyloud.com/": 1, "http://www.hystericalminds.com/": 1, "http://www.firstshowing.net/": 1, "http://studdblog.blogspot.com/": 1}, "blogtitle": "Visual News"}, {"content": ["Just when you thought you’d seen all the mediums possible for street art (from chalk to yarn), here comes an artist creating fascinating work with cake frosting. Shelley Miller, a Montreal based artist, has been creating some highly detailed murals around the city which at first and even second glance appear to be made from victorian era blue and white tile. \n For most of her works Miller creates tiles of sugar and decorates them before affixing them to her chosen wall surface, using nothing more than sugar frosting for the task. Then in what is almost the culinary version of Andy Goldsworthy’s temporal works (which are often destroyed by nature), these sugar based pieces slowly melt away. For many, their dripping blue forms are the first clue that they are even made of food ingredients. As it simply washes away with the rain, this art should also keep city officials fat and happy. \n See Also Scratching the Surface: Portraits Carved in Walls \n Miller doesn’t limit herself to just his form of unique expression. She is currently working on a huge cement sculpture in the form of a cut log, molded completely out of old books. You can see more of her thought provoking work at her blog or her personal website . \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n The artist, Shelley Miller, with her completed work. \n \n &#x21ac; inthralld"], "link": "http://feedproxy.google.com/~r/TheVisualNews/~3/S7NLiUchRAY/", "bloglinks": {}, "links": {"http://www.curatorscode.org": 1, "http://www.shelleymillerstudio.com/": 1, "http://www.visualnews.com/": 3, "http://inthralld.com/": 1, "http://www.shelleymillerstudio.com/blog": 1}, "blogtitle": "Visual News"}, {"content": ["In the wake of a zombie apocalypse, things might get a whole lot more dead around here. If zombies started running the place – dead brains and all – you can imagine brands might need to start marketing there products a little, shall we say… unorthodoxly. That’s what designer/artist Ben Fellowes imagined: he’s reworked a whole line of popular logos, from Starbucks to FedEx, and made them a lot more gruesome just in time for Halloween day. \n See Also Human Butcher Shop Opens in Central London \n Fellowes hasn’t just reworked the look of these now gristly brands, he’s also come up with some equally morbid new names for each. Try Starguts, Kentucky Fried Carcass and FedOn for example. We could almost see major brands taking on these personas during future Halloweens… good marketing at least for non-picky meat eaters. \n If you’re interested in Fellowes’ more conventional work (which some would say is far more tasty), you can see it on Behance or his personal website . \n \n \n \n \n \n \n \n \n \n &#x1525; inspirationfeed"], "link": "http://feedproxy.google.com/~r/TheVisualNews/~3/V5tXlPaQfW8/", "bloglinks": {}, "links": {"http://www.behance.net/": 1, "http://www.curatorscode.org": 1, "http://www.visualnews.com/": 3, "http://inspirationfeed.com/": 1, "http://www.benfellowes.com/": 1}, "blogtitle": "Visual News"}, {"content": ["The web is expanding exponentially, and thanks to smartphones, the mobile market is vastly becoming a major player in this sphere. The mobile web is the fastest growing online arena, now home to more than 4 billion connected smartphones. If statistics hold, mobile use will overtake desktop traffic by 2014. This is an important realization to be made, because no matter what type of business you run, your audience already is — or soon will be — on the mobile web, and reaching them on this platform should become a priority. \n The growing importance of mobile search is already being seen today. 90% of mobile searches result in an action such as visiting a business location or purchasing a product. People are using their smartphones to search destroy best deals like never before. They’ll do research from their mobile on the product they’re interested in, then use it to find the nearest location, and while at that location they’ll go on again and search for a better deal online, or another physical location nearby. \n Apple’s Siri may not have revolutionized mobile search overnight, but it did ruffle feathers and have people voicing their frustrations about Siri and other mobile search assistants as being the death of SEO. The truth is that Siri presents unique challenges and opportunities for marketers — as does any new platform — but when approached intelligently, you can use Siri to your advantage. \n See how to optimize your site for the mobile web with some best practice tips, and how to get along with Siri’s search algorithm to make sure you and your business can excel in the mobile landscape. \n Click here or the graphic below for a full-sized view. \n  \n &#x1525; Alchemy Viral"], "link": "http://feedproxy.google.com/~r/TheVisualNews/~3/ISabLBlaxqA/", "bloglinks": {}, "links": {"http://www.curatorscode.org": 1, "http://www.visualnews.com/": 4, "http://www.alchemyviral.com/": 1}, "blogtitle": "Visual News"}, {"content": ["Check out your links after the jump. \n \n THE SUPER HAUNTING PHOTOGRAPHY OF ANDRZEJ DRAGAN \n \n I am a bird now – by Christan Martin Weiss \n \n Hourglass Sea By Kahn and Selesnick \n \n Claude Pauquet \n \n RowanDeVoe \n \n JON EDWARDS: BEAUTIFULLY HAUNTING PHOTOGRAPHY. \n \n Stephen King’s “The Shining” Cuckoo Clock \n \n Freaky Halloween snapshots: 1875-1955 \n \n IN L.A.: GARY BASEMAN’S NIGHTMARES OF HALLOWEEN’S PAST OPENING \n \n Evocative color photos taken between 1914-1918 \n \n EUGÈNE ATGET: OLD PARIS EXHIBITION \n \n Yves KleinLeap into the Void (photographed by Harry Shunk) \n \n Desconceptualizado – Carlosbull \n \n Lead Image: Govia – Photographs of Abandoned Spaces \n For more art make an add request on the Facebook group Artsy !"], "link": "http://feedproxy.google.com/~r/TheVisualNews/~3/Syfr9sSKd1E/", "bloglinks": {}, "links": {"http://blog.com.au/": 1, "http://www.visualnews.com/": 2, "http://myloveforyou.typepad.com/": 1, "http://www.lostateminor.com/": 1, "http://designyoutrust.com/": 1, "http://boingboing.net/": 1, "http://www.claudepauquet.info/": 1, "http://bizarrebeyondbelief.com/": 1, "http://www.soultravelmultimedia.com/": 1, "https://www.facebook.com/": 1, "http://www.ignant.de/": 1, "http://www.juxtapoz.com/": 1, "http://www.etsy.com/": 1, "http://designspiration.net/": 3}, "blogtitle": "Visual News"}, {"content": ["Did you know pencil sculpting was a thing? That’s right, using the common graphite filled writing device, artists are creating beautiful works of art which combine both the geometric, stackable nature of the lowly pencil, and the often organic forms of hand sculpted art. By glueing the hexagonal sticks of wood together and then carving the resulting block, large honeycomb-like structures can be created. Depending on if a colored pencil or graphite is used, the carved portions of the resulting forms reveal the inner writing material and form a flowing surface of pixilation. Today we bring you two sculptors working with this different medium: Australian Lionel Bawden and American Jessica Drenk. \n See Also Paper Sculptures from an Icon of Industrial Design \n Lionel Bawden has been working with arranging and carving colored pencils for about 10 years. His works range from undulating organic forms built out of graphite pencils to pill-like forms built out of carefully planned patterns of colored pencils. These latter works – which are also his most recent – are built and finished with such precision that they nearly hide their pencil based roots. \n See Bawden’s fine work directly below, then continue reading for a look at the work of Jessica Drenk. \n \n \n \n \n \n \n \n \n \n Jessica Drenk , an artist based in Clemson, South Carolina, takes inspiration from the natural world. Her works, with the smeared grey of graphite on their carved surfaces, have the warn and weathered feel of driftwood; while the manufactured yellow exterior of the pencils she often uses provides a sharp contrast to this natural form. \n \n \n \n \n \n \n \n \n \n &#x1525; juxtapoz & artblart"], "link": "http://feedproxy.google.com/~r/TheVisualNews/~3/JaL0AqWi3rk/", "bloglinks": {}, "links": {"http://www.juxtapoz.com/": 1, "http://jessicadrenk.com/": 1, "http://www.curatorscode.org": 1, "http://artblart.com/": 1, "http://www.visualnews.com/": 3, "http://www.lionelbawden.com/": 1}, "blogtitle": "Visual News"}, {"content": ["The folks over at Pop Chart Labs have done it again, producing another extensive, poster-based charting of beautiful information. This time though, rather than focusing on beer breweries or even celebrity hairstyles , they are getting geometric. Their new florescent design, The Synoptic Scheme of Shapes , points out just how much we all slept through geometry class… or maybe it just shows how much fun shapes can be when you aren’t getting tested later. My favorite part? I finally figured out the name of my long-time favorite shape: a superellipse. \n See Also Small Snippets of Wisdom from Literary Greats \n The poster aims to be a comprehensive charting of geometric shapes and includes logically organized groupings from polygons, quadrilaterals, deltoids and hypocycloids, to triangles, rhombuses, superellipses, and many more. The chart helps to show the connections between shapes, visually demonstrating how many types stem from one another. It also serves as some healthy design inspiration – giving us many overlooked shapes to incorporate into our work. Head to Pop Chart Labs where you can order a beautiful, archival print of the poster. \n Click here or the image below for a larger view of the poster: \n  \n \n \n \n &#x21ac; fastcodesign"], "link": "http://feedproxy.google.com/~r/TheVisualNews/~3/2HfoEuT75Us/", "bloglinks": {}, "links": {"http://www.curatorscode.org": 1, "http://www.fastcodesign.com/": 1, "http://www.visualnews.com/": 7, "http://popchartlab.com/": 2}, "blogtitle": "Visual News"}, {"content": ["Being born albino is a difficult fate for anyone, with the side effects of increased sensitivity to light and poor vision that go hand in hand with the condition, but for this Indian family of 10, the prejudice has been the hardest part. In Southern India, the Pullan family faced much hardship and prejudice, so they moved to the more diverse and accepting city of Delhi, where they are often mistaken for foreigners and called “angrez” which means English. In spite of the adversity they’ve faced, Mother Mani Pullan considers their condition “a gift from God.” The family of 10 albinos will soon be replacing a Canadian-American family of 6 for the title of “World’s Biggest Albino Family” in the record books. \n See Also DECOMMISSIONED AK 47 RIFLES BECOME SYMBOLS OF PEACE \n Rosetauri (50) and his wife Mani (45) wed in an arranged marriage in 1983 and gave birth to six children: sons Shankar (24), Vijay (25), and Ramkishan (19) and daughters Renu (23), Deepa (21), and Pooja (18). Renu married an albino man named Rosheh (27) and the two have a son named Dharamraj (2). All ten members of the family live together in a one bedroom flat and “are looking forward to global recognition as the world’s biggest albino family.” Albinism is a condition that affects around 1 in 17,000 people. See more of this story at Daily Mail, UK. \n  \n  \n  \n  \n ↬ dailymail"], "link": "http://feedproxy.google.com/~r/TheVisualNews/~3/QguJlcY9zXI/", "bloglinks": {}, "links": {"http://www.visualnews.com/": 3, "http://www.co.uk/": 2, "http://cdn.visualnews.com/": 4}, "blogtitle": "Visual News"}, {"content": ["It’s hard to imagine what Halloween costumes were like before slutty versions of every imaginable character fresh from the sweat shops of China graced our store shelves. Back in the day before temporary Halloween stores could be found in strip malls everywhere, many more people created their own costumes and the results were impressive to say the least. Check out this fun collection Halloween attire from yesteryear. \n See Also AMERICANS: NOT TOO SPOOKED TO SPLURGE ON HALLOWEEN \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n ↬ vintage everyday"], "link": "http://feedproxy.google.com/~r/TheVisualNews/~3/kHy9jT6vH6s/", "bloglinks": {}, "links": {"http://www.visualnews.com/": 3, "http://www.vintag.es/": 1, "http://cdn.visualnews.com/": 18}, "blogtitle": "Visual News"}, {"content": ["Here’s a pretty sweet costume for the Democratically inclined… a tribute to Shepard Fairey’s iconic Hope poster featuring Obama. Reddit user Juririm painted himself with uncanny skill, even including the background of the famous print. For the poster lovers here at Visual News, its costume perfection. \n \n \n \n &#x1525; reddit"], "link": "http://feedproxy.google.com/~r/TheVisualNews/~3/TOr8Aibf6mg/", "bloglinks": {}, "links": {"http://www.curatorscode.org": 1, "http://www.reddit.com/": 2, "http://www.visualnews.com/": 2, "http://en.wikipedia.org/": 1}, "blogtitle": "Visual News"}]