[{"blogurl": "http://www.vizthink.com/blog\n", "blogroll": [], "title": "VizThink"}, {"content": ["Graphic Recording of \"Red Light GO\" by Dean Meyers (@deanmeistr) \n When a traffic light shows as GREEN we normally expect to GO; but what if we saw a STOP sign, in its traditional hexagonal shape colored GREEN… what’s the right thing to do? \n This kind of visual confusion, where we are conditioned to respond a particular way to visual clues (text, symbols or colors) yet receive mixed signals because they don’t match our expectations is a form of COGNITIVE DISSONANCE, the theme of the recent VizThink NYC’s meeting led by Steve and Todd Cherches of Big Blue Gumball . \n \n A non-verbal conversation \n Todd and Steve began the evening with a workshop exercise, where participants worked in pairs to communicate information about themselves silently by “drawing” their stories for each other. Questions also had to be presented in a non-verbal way, using marker and paper. Regardless of artistic skills, it soon became a session of trading markers back and forth, as a wordless visual conversation would develop on paper. \n The next part of the session was a demonstration of what happens when we are given visual information that doesn’t match the expected meaning or runs contrary to verbal or written communication. This is called, “cognitive dissonance”. \n Display signage, traffic and wayfinding signs, web sites navigation, and presentations given using Powerpoint or Keynote can all contain cognitive dissonance, as demonstrated in a series of on-screen examples. Sometimes mixed signals come when signs or symbols are used that are unique to a local culture, or where they have specific cultural meanings that differ from one place to another. \n  Todd Cherches demonstrates differences in contextual meaning by visual placement \n Digging a little more deeply into visual context that can cause mixed signals, examples wer given where placement of images, or their position within the canvas or visual field, can add subtext which may enhance or detract from the intended meaning. \n In a final exercise, everyone was paired off again, with one person describing a series of geometric images to their partner, who had to draw the shapes strictly from the verbal definitions with no visual clues. (See an example of the results to the right) \n The program concluded with simple guidelines to avoid cognitive dissonance when using visuals, including: \n 1) Visual and verbal messaging should be in harmony with each other. \n 2) Be aware of context and be strategic when using visuals. \n 3) Know your audience – know their visual language and visual culture. \n 4) Have clear reasons for the decisions made regarding visual design. \n 5) Ask “WHY” for using visuals, and for choosing the visuals used. \n 6) Be purposeful in the use of visuals. \n You can see additional sketch notes from the event at  Visuals for Change by graphic facilitator Amanda Lyons, and more photos from the event at VizThink NYC’s Meetup.com page. \n \n \n \n\n\n Liked this article? You may also enjoy: Origami and the Art of Visual Communication \n VizThink NYC Event: Origami and the Art of Visual Communication"], "link": "http://feedproxy.google.com/~r/VizthinkBlog/~3/Akc1bma5cIk/", "bloglinks": {}, "links": {"http://www.flickr.com/": 1, "http://photos2.meetupstatic.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.meetup.com/": 1, "http://vizthink.com/blog": 2, "http://bigbluegumball.com": 1, "http://photos3.meetupstatic.com/": 1, "http://photos4.meetupstatic.com/": 1, "http://www.visualsforchange.com/blog": 1}, "blogtitle": "VizThink"}, {"content": ["1ère soirée VizThink Lille le mardi 10 avril 2012. Infos sur www.vizthink.fr \n 1st ViZthink Lille evening on Tuesday 10 March 2010. All details on www.vizthink.fr \n  \n\n\n Liked this article? You may also enjoy: VizThink Toulouse \n The VizThink France community in 2 new cities, Toulouse (March) and Lille (April) \n Next VizThink Paris"], "link": "http://feedproxy.google.com/~r/VizthinkBlog/~3/QTJvsOp82n8/", "bloglinks": {}, "links": {"http://www.vizthink.fr": 2, "http://feedads.doubleclick.net/": 2, "http://vizthink.com/blog": 2, "http://vizthink.com/": 1}, "blogtitle": "VizThink"}, {"content": ["1ère soirée VizThink Toulouse ce vendredi 30 mars 2012. Infos sur www.vizthink.fr \n 1st VizThink Toulouse evening this Friday 30th 2012. All Details on www.vizthink.fr \n\n\n Liked this article? You may also enjoy: VizThink Lille \n The VizThink France community in 2 new cities, Toulouse (March) and Lille (April) \n Next VizThink Paris"], "link": "http://feedproxy.google.com/~r/VizthinkBlog/~3/RGrtZYIyFE4/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://vizthink.com/blog": 2, "http://vizthink.com/": 1}, "blogtitle": "VizThink"}, {"content": ["We’ll be playing with visual dices at the next VizThink Paris to trigger creative thinking and engage story telling. All details on www.vizthink.fr \n  \n\n\n Liked this article? You may also enjoy: The VizThink France community in 2 new cities, Toulouse (March) and Lille (April) \n VizThink Toulouse \n VizThink Lille"], "link": "http://feedproxy.google.com/~r/VizthinkBlog/~3/-MUftL8foJM/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://vizthink.com/blog": 2, "http://vizthink.com/": 1}, "blogtitle": "VizThink"}, {"content": ["The group of folks that gathered at VizThink’s event at Liquidnet (Thanks so much for hosting!) got to jump right into creating art in the form of Origami. Dan Stillman facilitated our experience of not only folding the colorful, square paper that is Origami paper into something fabulous, but also walking us through the process of diagramming. The Origami community uses diagramming as their visual language. There are symbols which represent different folds, movements, and stages in the process. A master folder can read a diagram and understand the steps to build any kind of model such as a beetle. \n  \n \n Together we tried our hand at simultaneously folding our papers while drawing the diagram. It was a fun process where we really weren’t able to jump ahead because we didn’t know what we were aiming to create! Dan kept our goal a secret in order to help us stay on track. His experience has been that some of us impatient folks would start assuming folds and create weird snowflakes, notes for passing, or lame paper airplanes instead of the intended model’s outcome: rabbits…. In the end not knowing, was actually an important part of the process. This is a huge parallel to life. There are so many things that happen at work or in life where you can’t control the entire situation, where you don’t know all the pieces or all the perspectives but somehow you have to trust yourself and trust the process. \n \n \n Dan talked about how the community has evolved and master folders have taken the art to a new level. No longer can you simply fold a beetle, or else you will be asked which type of beetle you’re aiming to create. As co-learners we are always challenging each other to do more and do better. What will you do better today? \n A huge shout out to Dan for providing a glimpse into what is an art form rich with history and sharing many connections to visual thinking. Origami takes visual thinking and puts it right in the palm of your hand and says, ‘Fold that. I dare you. See what happens.’ In the end, you might get to see something you had no idea was possible. \n  —- \n Thanks to Amanda Lyons of Visuals for Change for this recap. \n Thanks to Dean Meyers for his awesome photography. For a complete set visit his collection on flickr . \n For more information on VizThinkNYC, join our meetup group . \n You can also check out Dan’s  recap  on his blog, daneilstillman.com \n \n \n \n\n\n Liked this article? You may also enjoy: VizThink NYC Event: Origami and the Art of Visual Communication \n Red Light Go: Mixed Signals in Visual Communication \n Next VizThink Paris"], "link": "http://feedproxy.google.com/~r/VizthinkBlog/~3/FVGKDrXyjtM/", "bloglinks": {}, "links": {"http://danielstillman.com/": 2, "http://www.flickr.com/": 2, "http://www.visualsforchange.com/": 1, "http://feedads.doubleclick.net/": 2, "http://vizthink.com/blog": 3, "http://www.meetup.com/": 1}, "blogtitle": "VizThink"}, {"content": ["After Rennes (NW) in 2010, Paris in 2011, Toulouse (SW) and Lille (N)  will begin their evening in Late March and early April respectively! All our events on www.vizthink.fr   \n\n\n Liked this article? You may also enjoy: VizThink Lille \n VizThink Toulouse \n Next VizThink Paris"], "link": "http://feedproxy.google.com/~r/VizthinkBlog/~3/WvY2-Sz41_I/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://vizthink.com/blog": 3, "http://vizthink.com/": 1}, "blogtitle": "VizThink"}, {"content": ["VizThink NYC Event … Tuesday, February 28 , 2012, 6:30-8:30 PM \n \n How can you visualize, record, and communicate a complex process in a way that’s universal and easy to understand? The answer may be found in the ancient art of Origami. \n Since the 8th century, Origami has not only been developed as an art form, but also a powerful discipline to help translate complex processes into simple instructions. And, it’s pretty damn fun to do! \n Join  VizThink NYC  for our 2012 kick-off event with guest presenter and Interaction Designer  Daniel Stillman . In this fun, hands-on, interactive workshop, you’ll learn the ancient art of Origami, and also explore a new visual language in Origami diagramming. We’ll create some great models (fun in and of itself!) and leave with a set of our own hand-drawn diagrams – helping us become more effective visual thinkers and communicators. \n Please RSVP for this VizThink NYC event, and stay in the loop on future events by signing up here:   http://www.meetup.com/VizThink-NYC/events/53001082/ \n\n\n Liked this article? You may also enjoy: Origami and the Art of Visual Communication \n The VizThink France community in 2 new cities, Toulouse (March) and Lille (April) \n VizThink Toulouse"], "link": "http://feedproxy.google.com/~r/VizthinkBlog/~3/_HyI1lvEDDU/", "bloglinks": {}, "links": {"http://vizthink.com/blog": 2, "http://feedads.doubleclick.net/": 2, "http://danielstillman.com/": 1, "http://www.meetup.com/": 1}, "blogtitle": "VizThink"}, {"content": ["V + E = DIT \n (Visuals + Experiential = Divergent I nspirational  Thinking) \n \n  \n Visuals for Change’s own Amanda Lyons will lead VizThink NYC’s next event, an excursion in Central Park, where we will break out of the office and into the great outdoors. \n \n This engaging outdoor event will highlight both individual and group processes through reflection and other visual + experiential activities that you can add to your tool box. We will find new reasons to appreciate our surroundings. We will ask questions about the cultural assumptions that propel us through our every day. We will share and gain new perspectives. The reflection, drawing, photography and visualization at this event might even inspire you to action! Come visualize with us! \n \n \n \n Bring friends, a water bottle and wear closed toed shoes. Optional items to bring: camera, sketchbook, and snacks to share. This is a free event, however if you feel compelled to donate a few dollars towards reserving the space in the park that would be ok too. See you in the park! \n \n \n \n When \n \n July 19, 2011 from 6-8pm \n \n \n \n Where \n \n Heckscher Picnic Area in Central Park \n \n 6500 West Dr. \n \n New York, NY 10023 \n \n (South West Central Park near 65th St) \n \n \n \n About out Facilitator \n \n Amanda Lyons is the founder of  Visuals for Change , a visual facilitation consultancy whose purpose is to serve clients via engaging experiences, dialogue, and visualizing the unfolding art of business and its ever-changing variables. Amanda is a master of the art of unconventional presentation with a passion for teaching folks how to present well. As a Lead Instructor for Outward Bound, Amanda revitalized her presentation style towards facilitation, sharing the belief that ‘learning by doing’ is the way to go. Visuals for Change performs graphic facilitation and other visual activities at conferences, meetings, and events. \n \n Please register at  http://vedit.eventbrite.com/ \n \n Admission is free!  \n\n\n Liked this article? You may also enjoy: Origami and the Art of Visual Communication \n VizThink NYC Event: Origami and the Art of Visual Communication"], "link": "http://feedproxy.google.com/~r/VizthinkBlog/~3/G8MjtESFKAo/", "bloglinks": {}, "links": {"http://vedit.eventbrite.com/": 1, "http://vizthink.com/blog": 2, "http://feedads.doubleclick.net/": 2, "http://www.visualsforchange.com/": 1, "http://vizthink.com/": 1}, "blogtitle": "VizThink"}, {"content": ["There was a lot of brainwork this week in Rennes France bringing together web developpers, web designers, graphic designers, telecom engineers, political sciences students, etc to work on developping infoviz based on public opendata: extracting data, processing, enhancing and visualising. \n Visualisation Rennes \n\n\n Liked this article? You may also enjoy: The VizThink France community in 2 new cities, Toulouse (March) and Lille (April)"], "link": "http://feedproxy.google.com/~r/VizthinkBlog/~3/DqKoUgDswnY/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://www.visualisons-rennes.fr/": 1, "http://vizthink.com/": 1}, "blogtitle": "VizThink"}, {"content": ["VizThink NYC Summer Social \n  \n Come out and get to know the community of New York area visual thinkers for an evening of socializing as we gear up for another great summer in the city. \n Join us for a casual evening of food, drink, and fun, including: \n \n Sketchbook Show & Tell – Bring yours, check out others. It’s always a treat to peek inside someone else’s sketchbook, as well as to share the doodles, notes, and thinking in yours. \n Pen Swap – Got a pen, pencil, or maker you love and want to share? Bring a couple to swap with other pen geeks. \n Napkin Sketching – We’ll be sure to have a few stacks of napkins to jot down your ideas on. \n Graffiti Wall – Contribute your doodles to a wall of paper… and we will share the end results with the community. \n \n \n When \n Wednesday, June 1, 2011 \n 6:00-9:00 p.m. \n \n \n Where \n Mustang Sally’s Saloon \n 324 7th Ave (@ 28th St.) \n New York, NY 10001 \n http://www.mustangsallysny.com/ \n \n \n \n Please register at  http://vizthinksummersocial.eventbrite.com \n Admission is free! (But you’re on your own for food & drink) \n \n \n\n\n Liked this article? You may also enjoy: The VizThink France community in 2 new cities, Toulouse (March) and Lille (April) \n VizThink NYC Event: Origami and the Art of Visual Communication"], "link": "http://feedproxy.google.com/~r/VizthinkBlog/~3/BxVI8KhxlMQ/", "bloglinks": {}, "links": {"http://feedads.doubleclick.net/": 2, "http://vizthink.com/blog": 1, "http://vizthinksummersocial.eventbrite.com": 1, "http://vizthink.com/": 1}, "blogtitle": "VizThink"}]