[{"blogurl": "http://www.vizworld.com\n", "blogroll": [], "title": "VizWorld.com"}, {"content": ["The Evolution of Android   The Pandemic of Disability  Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Infographics Summary for 2012-02-23  Infographics Summary for 2012-01-30  Infographics Summary for 2012-02-14"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/P12zJKqvyWU/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 6, "http://feedads.doubleclick.net/": 2, "http://feeds.vizworld.com/": 9}, "blogtitle": "VizWorld.com"}, {"content": ["If you’ve had your eye on The Foundry’s amazing CameraTracker app, but haven’t been able or willing to foot the price tag, then just wait til next week where they will have a massive 40% off discount, for 48 hours only! We wanted to let you know about our 48 hour CAMERATRACKER sale planned for 16th October, offering more than 40% off the list price . That’s a node-locked licence for just £100/ $165/ €120 or a floating for £150/ $485/ €180 . The sale will run from 9:00am 16th October until 9:00am 18th October London time, and you can go ahead and download their 15-day free trial to use until then. Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com  No related posts."], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/-Z_x-AC-y4I/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.co.uk/": 1, "http://feeds.vizworld.com/": 9}, "blogtitle": "VizWorld.com"}, {"content": ["Having learned a valuable lesson in regards to drivers with Windows Vista, NVidia has already released WHQL-certified drivers for Windows 8 (due out later this month). Today, NVIDIA released its final set of Windows Hardware Quality Labs (WHQL)-certified GeForce drivers in preparation for the launch of Windows 8 later this month. Download the new GeForce 306.97 drivers for Windows 8 from GeForce.com. While it remains to be seen if the industry disregard for Windows 8 will really play out, I’m glad to see hardware suppliers getting on board early. via NVIDIA IS READY FOR WINDOWS 8 « NVIDIA . Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Getting BackBurner rendering on Windows and Mac OS X simultaneously  ITK 4.0 is Now Available and Ready for Download  Adobe Lightroom 4 Beta Is Alive and Ready for You to Download"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/nmcqsDOSrig/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 4, "http://blogs.nvidia.com/": 1, "http://feeds.vizworld.com/": 9, "http://feedads.doubleclick.net/": 2}, "blogtitle": "VizWorld.com"}, {"content": ["Following on the heels of Usain Bolt’s amazing results yesterday in the Olympics, the New York Times has a great visualization of the last 116 years of 100-meter Olympic Runners showing how the race has consistently gotten faster over the years, and how they would stack up against today’s athletes. Based on the athletes’ average speeds, if every Olympic medalist raced each other, Usain Bolt (the London version) would win, with a wide distribution of Olympians behind him. Below, where each sprinter would be when Bolt finishes his race. via One Race, Every Medalist Ever – Interactive Graphic – NYTimes.com . Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   From Chaos to Chorus with Tecplot Chorus  Quo Vadis, Many Eyes?"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/2eETa0wR1z8/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 3, "http://feedads.doubleclick.net/": 2, "http://www.nytimes.com/": 1, "http://feeds.vizworld.com/": 9}, "blogtitle": "VizWorld.com"}, {"content": ["Whether you’re at SIGGRAPH or not, be sure to check out Autodesk’s offerings from the show floor that will be discussing the use of Autodesk technology in a variety of fields. Be among the 400,000 AREA community members worldwide to watch AREA TV during SIGGRAPH. Catch product demonstrations and customer presentations streamed live from the Autodesk booth, or attend an Autodesk® MasterClass online. Great content will be added during and after the event, so be sure to check out AREA frequently. So far I see guys from MPC behind “Prometheus”, Weta, Spark, and lots more, plus they promise they’ll keep adding over the week.  Hit their site for all the details. via AREA | SIGGRAPH 2012 . Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Autodesk 2012 Games Show Reel Call for Submissions  Autodesk 2012 Corporate Show Reel  Autodesk Max 2013 announced!"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/tko8O3hMars/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 4, "http://area.autodesk.com/": 1, "http://feeds.vizworld.com/": 9, "http://feedads.doubleclick.net/": 2}, "blogtitle": "VizWorld.com"}, {"content": ["Pixar has just released a new library into the wild called “OpenSubdiv”, a high-performance subdivision surface library made popular initially with projects like Geri’s Game. OpenSubdiv is a set of open source libraries that implement high performance subdivision surface (subdiv) evaluation on massively parallel CPU and GPU architectures. This codepath is optimized for drawing deforming subdivs with static topology at interactive framerates. The resulting limit surface matches Pixar’s Renderman to numerical precision. The full code is available over at Github and released under the Microsoft Public License, making it available for free commercial and non-commercial use. via OpenSubdiv Portal Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Kitware releases open-source Tubular Segmentation library TubeTK"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/VjrkwcF3FjA/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 2, "http://feedads.doubleclick.net/": 2, "https://github.com/": 1, "http://feeds.vizworld.com/": 9, "http://graphics.pixar.com/": 1}, "blogtitle": "VizWorld.com"}, {"content": ["Kitware is preparing their training courses for the fall, and is now accepting registrations for a new VTK development course in September.  The objects look simple enough: 1. Understand data structures, readers and filters – how they work and how to write new ones 2. Understand interaction and widgets – how they work and how to incorporate them into your programs 3. Discover how to control the way data is displayed with rendering and charts 4. Learn how to put these pieces together to make fully-featured applications with Qt Full details are on their site.  As someone who spent a the first 6 months muddling through VTK at my last job, something like this is a great value for getting up-to-speed under tutelage of the experts. via Kitware Professional Training Courses . Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com  No related posts."], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/JwDL7kOVnzc/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 1, "http://feedads.doubleclick.net/": 2, "http://www.kitware.com/": 1, "http://feeds.vizworld.com/": 9}, "blogtitle": "VizWorld.com"}, {"content": ["A new announcement today from the Visualization Sciences Group (VSG) as they’ve just announced their acquisition of popular biomedical visualization tool “amira”. “We are extremely excited to have amira on board,” says Jean-Bernard Cazeaux, President and CEO of VSG. “With the combination of amira and Avizo, VSG’s offering now addresses the whole range of scientific and industrial applications and, because they share the same technological framework, both products will mutually benefit from each other’s developments and innovations.” Amira has long-since worked hand-in-hand with VSG’s existing Avizo product, so it’s an obvious combination.  VSG plans to continue developing the tool and supporting it through their worldwide team. Hit the link to get all the details. via VSG Acquires amira 3-D Visualization and Analysis Software . Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Interactive Dynamics for Visual Analysis"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/nMPre4XCXcU/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 2, "http://feedads.doubleclick.net/": 2, "http://feeds.vizworld.com/": 9, "http://www.scientificcomputing.com/": 1}, "blogtitle": "VizWorld.com"}, {"content": ["We close this third week dedicated to the Olympics with a selection of some of most impressive newspaper infographics made around the event. These designs come from different countries but they’re all unique in their visual approach, elevating the term ‘infographic’ to a whole different level. The works presented here where found on the portfolios of information designers Julio Lara , Marcelo Duhalde , Julio Miguel Lago , Alberto Lucas López and The Times of Oman . (...) Read the rest of Daily Viz from Visual Loop – 03/08/2012 (53 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Daily Viz from Visual Loop – 23/07/2012  Daily Viz from Visual Loop – 27/07/2012  Daily Viz from Visual Loop – 02/08/2012"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/VcDNoXLVM08/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 5, "http://newspagedesigner.org/": 5, "http://feeds.vizworld.com/": 9, "http://feedads.doubleclick.net/": 2}, "blogtitle": "VizWorld.com"}, {"content": ["Wacom will, of course, be on hand at SIGGRAPH next week talking about their latest partnerships in education, and also will have their new 22HD and 24HD Cintiq tablets on display.  The new tablets boast full multi-touch functionality, adding a whole new level of interaction directly with your graphics.  If you really want to see what the new tablets can do, swing by their booth for a great onsite demonstration: -  Autodesk experts, Lee Fraser and Marcel de Jong, will demonstrate their skills on Wacom’s Cintiq 24HD touch interactive pen display during Autodesk’s Education Summit and the 2 nd  Annual Student Experience. Both events will be held on Monday, August 6 th  at the JW Marriott in downtown Los Angeles. Including a mix of industry discussions, post-graduate tips and product demonstrations, each event will give attendees a first-hand look at how much control and precision the Cintiq adds to Autodesk applications and the artists that use them. Get all the details after the break. (...) Read the rest of Wacom’s new MultiTouch Intuos at SIGGRAPH2012 (493 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Vicon to showcase new Motion Capture products at SIGGRAPH2012  Infinite Z launches zSpace virtual holographic 3D display for designers"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/k3eVeC_qUlo/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 4, "http://feedads.doubleclick.net/": 2, "http://feeds.vizworld.com/": 9}, "blogtitle": "VizWorld.com"}, {"content": ["Click for Fullsize New press release from Vicon today, announcing three new products they’ll be demonstrating on the floor of SIGGRAPH next week.. First off is their new Blade2 software (shown to the right) that offers real-time motion capture with a new engine called “Axiom” that can handle multiple characters in realtime.  Also, they’ll be demonstration two new tools : A handheld interaction device, and a new head-mounted facial tracking system named “Cara”. Imogen Moorhouse, COO at Vicon says, “The product line-up we’re showing at Siggraph this year is the result of years of research and development. Feedback from customers during our Alpha project for Blade has been invaluable to developing a product that, we think, will set a new industry standard for real time motion capture.” Get all the details after the break, or at Booth #729 next week. (...) Read the rest of Vicon to showcase new Motion Capture products at SIGGRAPH2012 (718 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   OptiTrack’s new large-volume Motion Tracking Cameras  Players get more pleasure from motion-based video games"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/X96Epxs47VU/", "bloglinks": {}, "links": {"http://static.vizworld.com/": 1, "http://www.vizworld.com/": 4, "http://feedads.doubleclick.net/": 2, "http://feeds.vizworld.com/": 9}, "blogtitle": "VizWorld.com"}, {"content": ["Every four years, there’s a new discussion around how technology impacts the Olympics, and this year, there’s no question that both Mobile and Social Media have taken the ‘Gold’, as far as major technological changes. Today’s Daily Viz from Visual Loop looks at those impacts, with a help from Pappas Group , Foat Mobile Learning , Esendex , Networked Insights and Acme Packet . (...) Read the rest of Daily Viz from Visual Loop – 02/08/2012 (43 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Daily Viz from Visual Loop – 23/07/2012  Daily Viz from Visual Loop – 25/07/2012  Daily Viz from Visual Loop – 27/07/2012"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/bYEqvaS9Ins/", "bloglinks": {}, "links": {"http://www.co.uk": 1, "http://www.vizworld.com/": 5, "http://feedads.doubleclick.net/": 2, "http://visualoop.com/": 1, "http://www.pappasgroup.com/": 1, "http://floatlearning.com": 1, "http://feeds.vizworld.com/": 9, "http://www.networkedinsights.com/": 1, "http://www.acmepacket.com/": 1}, "blogtitle": "VizWorld.com"}, {"content": ["A new company called “Oculus” has turned to popular website Kickstarter for their first round of funding.  They’re currently looking to raise $250,000 USD for development of the “Rift VR” head-mounted immersive 3D display.  If boasts a 110-degree FOV diagonally, and they claim to already have a nice stable of gaming companies working with them to build it.  ”I’m a believer,” said Cliff Bleszinski, design director at Epic Games. “We’re extremely excited here at Epic Games to get the Unreal Engine integrated with Oculus!” “I think this will be the coolest way to experience games in the future. It will simply be that big,” offered David Helgason, CEO of Unity. “It looks incredibly exciting. If anybody’s going to tackle this set of hard problems, we think that Palmer’s going to do it. So we’d strongly encourage gamers to support this Kickstarter,” said Gabe Newell, president and owner of Valve. So far, their kickstarter is already past the goal and holding at $338k.  It’s funny to see something like this get so much press so quickly, given that head-mounted displays have been around for other a decade but they all suffer from the same problems: Weight, low resolution, and framerate problems.  Who knows if Oculus can get it right.  Get the full release after the break. (...) Read the rest of Oculus takes a VR HMD to Kickstarter (590 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Daily Viz from Visual Loop – 06/06/2012"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/Q0g606xJViA/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 3, "http://feedads.doubleclick.net/": 2, "http://feeds.vizworld.com/": 9}, "blogtitle": "VizWorld.com"}, {"content": ["Today, european company Zero Creative is launching what they call the world’s brightest 46″ Glasses-Free 3D Display.  Lots of nice features there in the title, but the numbers seem to bear it out with an impressive 3000cd/m2 and an included software platform “3dZignage” to help users get 3D content started.  Aimed firmly at marketing and advertising, it looks like a promising product for anyone interested in glasses-free 3D. “Current digital signage (DOOH) solutions almost all still use traditional 2D displays and poor content. This way they are more and more losing the attention of the target audience. Introducing this new level of extreme brightness combined with glasses-free 3D image is a giant step forward for the DOOH market.”, says Jean-Pierre van Maasakker, CEO of Zero Creative, “This new type of innovative high performance xyZ 3D Displays will simply command attention of anyone near.” Get the full release after the break, or visit their website . (...) Read the rest of Zero Creative’s new 46″ Glasses-Free 3D Display (203 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   NICT demonstrate the World’s Largest Full HD Glasses-Free 3D Display  3D Glasses Infrared Protocols"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/9QxeTEiaqOk/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 4, "http://feedads.doubleclick.net/": 2, "http://feeds.vizworld.com/": 9, "http://zerocreative.com/": 1}, "blogtitle": "VizWorld.com"}, {"content": ["Next week at SIGGRAPH, OptiTrack will be on-site demonstrating their usual motion tracking cameras.  But this year, they’ll be announcing a new series of cameras specifically designed for large-volume full-scale productions.  The press release doesn’t include many details (but instead choosed to name-drop a few dozen companies and films that used their equipment), and I don’t see anything about it on their website yet.  Guess we’ll just have to wait. At SIGGRAPH 2012,  OptiTrack  will launch a brand new series of motion capture cameras specifically tailored to large-volume, full-scale productions. Mocap demos will be conducted in booth #610, and will also include a look at the Flex 13, which debuted in March 2012 and is OptiTrack’s solution for high precision, small and medium-volume tracking applications. Autodesk, Halon Entertainment, Fabric Engine and Oblong Industries will join OptiTrack on stage to demonstrate how OptiTrack virtual and motion capture cameras can be painlessly integrated into both established and custom-made pipelines. Get the rest of the release after the break. (...) Read the rest of OptiTrack’s new large-volume Motion Tracking Cameras (448 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Players get more pleasure from motion-based video games  Mozilla’s new User-Tracking Collusion Demo"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/zhpBVwlzx3c/", "bloglinks": {}, "links": {"http://static.vizworld.com/": 1, "http://www.vizworld.com/": 4, "http://feedads.doubleclick.net/": 2, "http://feeds.vizworld.com/": 9, "http://www.naturalpoint.com/": 1}, "blogtitle": "VizWorld.com"}, {"content": ["SIGGRAPH is coming soon (next week!) and the announcements are already rolling in.  Today MAXON has just announced the newest version of their CINEMA4D package, Release 14. R14 delivers breakthrough performance including a new, fully integrated sculpting system, camera matching functionality, exchange plugins to two key applications – The Foundry NUKE and Adobe Photoshop Extended – and improved integration with Adobe After Effects. Motion graphics/VFX artists and visualization designers will benefit from features that accelerate productivity to produce spectacular 3D content more fluidly and collaborate with increased efficiency. The new digital sculpting is a big addition in this release, and the new support for NUKE as a compositor is a huge addition for those in professional VFX shops.  Get all the details after the break.  (...) Read the rest of MAXON announces CINEMA 4D r14 (518 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   TEDx Talk on Molecular Animation: Combining Cinema and Biology  3Dconnexion Announces the SpaceMouse Pro  NVidia announces new Kepler-based Tesla GPU’s: K10 and K20"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/RGtjAUJUxnU/", "bloglinks": {}, "links": {"http://www.vizworld.com/": 5, "http://feedads.doubleclick.net/": 2, "http://feeds.vizworld.com/": 9}, "blogtitle": "VizWorld.com"}, {"content": ["Today we’ll be featuring some recent infographics that show different aspects of the Olympic history. The greatest records, the most iconic buildings of all time and the many designs of the Olympic gold medal are just dome of the topics brought to you by Brand Talking , Arch Daily , Harvard , Complex and Fitbie . (...) Read the rest of Daily Viz from Visual Loop – 01/08/2012 (43 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Daily Viz from Visual Loop – 27/07/2012  Daily Viz from Visual Loop – 22/05/2012  Daily Viz from Visual Loop – 09/01/2012"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/JGzMNNJQ8_4/", "bloglinks": {}, "links": {"http://brandtalking.com": 1, "http://www.archdaily.com": 1, "http://www.vizworld.com/": 5, "http://feedads.doubleclick.net/": 2, "http://fitbie.msn.com": 1, "http://www.complex.com": 1, "http://news.harvard.edu": 1, "http://feeds.vizworld.com/": 9}, "blogtitle": "VizWorld.com"}, {"content": ["Another Daily Viz from Visual Loop dedicated to the Olympics, this time featuring a couple of submissions to the Visualising.org ‘s Challenge, by Andy Kirk and Christian Gross. After that, Ria Niovosti takes a look at the cost of the London Games, The Guardian shows every Olympic medal and medalist in history, and to close, a beautiful infographic from The Times of Oman . (...) Read the rest of Daily Viz from Visual Loop – 31/07/2012 (59 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Daily Viz from Visual Loop – 25/07/2012  Daily Viz from Visual Loop – 24/07/2012  Daily Viz from Visual Loop – 17/07/2012"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/5-NGdAIJFF0/", "bloglinks": {}, "links": {"http://www.co.uk": 1, "http://www.vizworld.com/": 5, "http://feeds.vizworld.com/": 9, "http://feedads.doubleclick.net/": 2, "http://visualoop.com/": 1, "http://en.rian.ru": 1, "http://www.visualisingdata.com/": 1, "http://www.visualizing.org/": 1, "http://newspagedesigner.org/": 1}, "blogtitle": "VizWorld.com"}, {"content": ["Well, there’s simply no way we could stop talking about the Olympics – even after two straight week. But the amount of infographics being produced is really impressive (our Pinterest board has over 100 and new ones are being submitted to us everyday). So, we decided to go with the flow, and keep sharing works from all over the world. Today’s infographics come from Blue Fin Labs , Design Training , Policy Expert , Click Software and Credit Season . (...) Read the rest of Daily Viz from Visual Loop – 30/07/2012 (60 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Daily Viz from Visual Loop – 23/07/2012  Daily Viz from Visual Loop – 16/07/2012  Daily Viz from Visual Loop – 17/07/2012"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/Hdgx5iuDLCw/", "bloglinks": {}, "links": {"http://www.clicksoftware.com": 1, "http://www.co.uk": 2, "http://www.vizworld.com/": 5, "http://feedads.doubleclick.net/": 2, "http://pinterest.com/": 1, "http://bluefinlabs.com/": 1, "http://feeds.vizworld.com/": 9, "http://www.design-training.com": 1}, "blogtitle": "VizWorld.com"}, {"content": ["And the big day has arrived. The Opening Ceremony will mark the beginning of the Olympics in a few hours, and we close this week of Daily Viz from Visual Loop with more interactive graphics from different countries. This selection is part of the 40 Interactive graphics to explore article, published on our main site . Today’s selection comes from BBC Spain , Marca (Spain), Globo (Brazil) and Época (Brazil). (...) Read the rest of Daily Viz from Visual Loop – 27/07/2012 (151 words) Reach out to the community of Visualization and Graphics Experts by Advertising on VizWorld.com   Daily Viz from Visual Loop – 26/07/2012  Daily Viz from Visual Loop – 17/07/2012  Daily Viz from Visual Loop – 20/07/2012"], "link": "http://feeds.vizworld.com/~r/Vizworldcom/~3/M_VqmGOb0J8/", "bloglinks": {}, "links": {"http://visualoop.com/": 1, "http://www.marca.com/": 1, "http://feedads.doubleclick.net/": 2, "http://revistaepoca.globo.com/": 1, "http://oglobo.globo.com/": 1, "http://visualoop.com": 1, "http://www.vizworld.com/": 5, "http://www.co.uk/": 1, "http://feeds.vizworld.com/": 9}, "blogtitle": "VizWorld.com"}]