[{"blogurl": "http://vizwiz.blogspot.com\n", "blogroll": [], "title": "VizWiz"}, {"content": ["Earlier this week, my wife was having a conversation on Facebook about our move to California when she suddenly said “he has gained weight from the cafeteria.” She’s was being funny. If you ever meet her, you’ll know what an angel she is quite quickly, especially for putting up with me. Unfortunately she’s not exactly wrong. I pretended to be offended of course. Many of us are familiar with the “freshman 15” from college. At Facebook, there’s the “Facebook 15”. Same idea. I can use the unbelievably tasty, free food and unlimited snacks as an excuse (moderation is a challenge), but I really haven’t gained much weight, maybe five pounds. I exercise, not often enough however. I decided that I needed some help, so I build this viz to help me find the right activities for me.    Powered by Tableau"], "link": "http://vizwiz.blogspot.com/feeds/3396427055089561180/comments/default", "bloglinks": {}, "links": {"http://www.tableausoftware.com/": 1, "http://vizwiz.blogspot.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["A common question I get, and I’m sure you do too, is “How can I get my Tableau Dashboard into a PowerPoint presentation?” This question has a couple of solutions.  If you want a “live” Tableau dashboard in PowerPoint, see this blog post . If you want to embed the “latest snapshot” of a dashboard, i.e., an image that updates automatically, then continue reading. The URL to your dashboard will have a link similar to this: http://public.tableausoftware.com/views/ArsenalPerformance/TheDominanceofRVP All you have to do to get an image of the dashboard is to add “.png” to the end of the URL. My URL now looks like: http://public.tableausoftware.com/views/ArsenalPerformance/TheDominanceofRVP.png and here’s the resulting image.  This is a nice static snapshot, but your user, let’s see she’s a saleswoman, wants this in PowerPoint (she doesn’t want to have to go to Tableau Server) and she wants PowerPoint to always reflect the latest data. An example might be a sales report that you published on Tableau Server that refreshes weekly on Sunday night. The saleswoman wants to open PowerPoint every Monday and have it reflect the latest data. Here’s how you do it (Windows only): Step 1 – From the PowerPoint ribbon, choose Insert –> Image.  Step 2 – Paste the link to the image in the File name box and click the triangle next to the Open button.  Step 3 – The Open button might gray out for a few seconds while the image is retrieved and you may be prompted to login to Tableau Server. Go ahead and do so.  Step 4 – Choose Insert and Link when the menu appears.  That’s it! You now have an embedded, dynamically updating image from your Tableau Server inside PowerPoint. Of course, you now need to save the PowerPoint file. When your saleswoman opens the PowerPoint file, she’ll be prompted with a security warning. She needs to choose Enable Content.  Another security warning may appear, and she should choose Yes at this message. She should NOT check the “Do not ask me…” message because that setting extends beyond this specific file.  The image now reflects the latest data on Tableau Server. Try it yourself by opening the PPT file used for this blog post here . Reminder : This works for Windows only. PowerPoint on Mac does not have the same embed functionality (that I could find). Also, when you open the PPT file on a Mac, your are not given the prompt to Enable External Images and the image will not update dynamically. If anyone knows how to do this in PowerPoint on a Mac, please let me know. That’s really what I need."], "link": "http://vizwiz.blogspot.com/feeds/85388325797148504/comments/default", "bloglinks": {}, "links": {"https://dl.dropbox.com/": 1, "http://public.tableausoftware.com/": 2, "http://vizwiz.blogspot.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["On Tuesday, October 16th, one of my favorite novelists, Nelson Demille, published The Panther . I’ve read many of Demille’s books, including two of my favorites, Up Country and Wild Fire . I read Up Country after I was in Vietnam back in 2004 and Wild Fire just a few weeks ago. Wild Fire was particularly interesting given the current political climate in the United States and the state of hostility by some towards the Middle East. Demille is currently on a book tour and he’s sticking to the NE part of the US, unfortunately. I created this viz on the train home last night so that you could go see him in person, buy his book (by clicking on the book cover), and send me a signed copy. Thanks in advance!    Powered by Tableau  Question: The bubbles are a simple calculated field that compares the date of the event to the current date (if today() > [Date] THEN 'Yes' else 'No' end), however when published, Tableau does not evaluate the expression and the bubble colors are not updating automatically. Has anyone seen this?"], "link": "http://vizwiz.blogspot.com/feeds/4015934857738946122/comments/default", "bloglinks": {}, "links": {"http://www.amazon.com/": 3, "http://vizwiz.blogspot.com/": 1, "http://www.tableausoftware.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["Let’s start with how area charts and line charts are typically used:  Area chart - Area charts are used to represent cumulated totals using numbers or percentages (stacked area charts in this case) over time. Line chart - A line chart is often used to visualize a trend in data over intervals of time – a time series – thus the line is often drawn chronologically. * Source: Wikipedia  After reading these, one might suggest that an area chart provides the best of both worlds. Consider this area chart:  First impressions are often something like: “This is perfect! It shows me both the trends and the contribution.” However, it doesn’t show the trends as well as one might suspect. Why?  Our eyes tend to focus on the tops of each line, leading to misinterpreting the patterns. It’s nearly impossible for us to translate the width of each color (i.e., the actual value) into an accurate trend. This is because the pattern of each color is influenced by the colors below it. The only values that can be effectively interpreted are the West (gray area) and the total (top of the blue line). Try this exercise. Looking at the East and without scrolling down in this blog post, take one minute (using a timer) and try to draw the trend for the East only. In other words, if the chart was only the East, what would the pattern look like? Give it a shot, it’ll prove a point. Here’s what the East looks like:  If you were able to draw this accurately in under a minute, then you’re likely some incredible genius, and good for you. In every data visualization class I teach I use this exercise. I have yet to see anyone get close. So that brings us to another question. What’s the best way to display the pattern for each region AND show the total. I recommend this:  Now you get the best of both worlds:  You can see the trends for each region. You can see the total. I accomplished this in Tableau with one table calc - TOTAL(SUM([Sales])) – and created a dual-axis chart by placing Total Sales on the secondary axis and synchronizing them. Download the Tableau workbook here . I can’t recommend enough the exercise I outlined above. Sometimes asking the person you’re working with to draw the second area will prove your point for you. Hopefully this will give you some ammunition next time you need to argue against stacked area charts.   P.S. If you’re curious to see the two charts together, here you go. Very different stories, wouldn’t you say?"], "link": "http://vizwiz.blogspot.com/feeds/1015373889830738682/comments/default", "bloglinks": {}, "links": {"https://dl.dropbox.com/": 1, "http://en.wikipedia.org/": 2}, "blogtitle": "VizWiz"}, {"content": ["Last Wednesday, Matthew Dawson-Paver, a Business Planning Performance Analyst at Skype asked on Tableau’s LinkedIn group : How can you connect Tableau to NASA's Blue Marble WMS servers? Mel Stephenson pointed him to the NASA Earth Observations WMS. And I must say, this is quite possibly the coolest WMS I’ve seen. http://neowms.sci.gsfc.nasa.gov/wms/wms? Some of the text in the remainder of this post borrows from Tableau’s KB article on Mapping Data with WMS , focused on how to add and use a WMS server.  Add a WMS server You can add or import a WMS server. Step 1: Select Map > Background Maps > WMS Servers.  Step 2: In the WMS Server Connections dialog box, click Add.  Step 3: In the Add WMS Server Connection dialog box, type or paste the URL of the WMS server.  This is the WMS server link to enter: http://neowms.sci.gsfc.nasa.gov/wms/wms?  Step 4: When finished, click OK. The URL for the WMS appears in the WMS Server Connections dialog box.   And a link to this WMS server is added to the Background Maps sub-menu.   Step 5: Choose the WMS server from the Background Maps sub-menu Step 6: Double-click on a geographic field in your dimensions list (e.g., State in the Superstore Sales sample data) to build the initial map. Step 7: Choose the layer you’re interested in from the Map Options and you can see some crazy cool maps.  This example is zip codes in the Superstore Sales data in the West region with Land Surface Temperature [Day] (8 day) as the layer. Play around with it; I guarantee you’ll have fun! Download the sample workbook here ."], "link": "http://vizwiz.blogspot.com/feeds/8095664397113857994/comments/default", "bloglinks": {}, "links": {"http://neowms.nasa.gov/": 2, "http://www.linkedin.com/": 1, "https://dl.dropbox.com/": 1, "http://lh3.ggpht.com/": 1, "http://kb.tableausoftware.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["From Sports Chart of the Day :  ESPN aired the 50,000th episode of SportsCenter last night, an incredible accomplishment for the self-proclaimed Worldwide Leader. That works out to roughly 1,500 episodes a year for the the 33 years of ESPN's existence. But as we can see below, those 50,000 episodes have not been distributed evenly. Followed by this chart:  I’ll give you a couple of minutes to figure out what’s wrong… Give up?  Cork Gaines is using a line to connect uneven intervals. While it looks like a steady increase, was it really? Were there the same number of episodes every month between Sept 1979 and December 1998? I highly doubt it. I recreated the data in Excel, and low and behold, when I build a line chart with these six data points, it looks identical to Cork’s.   Clearly Cork used Excel to create the chart. And clearly he didn’t know that he should not use a line to connect unequal intervals of time. There are a few basic guidelines for line charts ( Stephen Few ):  Lines should only be used to connect values along an interval scale (with a couple of exceptions). Intervals should be equal in size. Lines should only directly connect values in adjacent intervals. Cork’s chart breaks all three guidelines. The best way to represent time-series data with unequal intervals of time is with a bar chart."], "link": "http://vizwiz.blogspot.com/feeds/3371709021657928475/comments/default", "bloglinks": {}, "links": {"http://lh4.ggpht.com/": 1, "http://www.businessinsider.com/": 2, "http://lh5.ggpht.com/": 1, "http://www.perceptualedge.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["Picture a sales chart like this that represents your actual + forecasted sales:   It’s difficult to see where today is in this chart, so you’d like to see it as a reference line on your time axis. And you want it to be dynamic so that it moves automatically every day. Ultimately, you want a chart like this and when you look at the chart again in a month, the reference line should be no whatever day that is, October 18 for example.   Step 1: Build the view so that the date field is on the Column shelf and the measure is on the Rows shelf. Right-click on your date pill and choose Exact Date.   Step 2: Create a calculated field to get today’s date.   Step 3: Add the Today field to the Level of Details shelf. Right-click on the pill and choose Exact Date. The pill will turn green, indicating it’s a continuous dimension.   Step 4: Right-click on the x-axis (i.e., time) and choose Add Reference Line.   Step 5: Because the Today field is on the Level of Detail shelf, we can use it as a Reference Line. Set up the reference line with these settings (format the line as you wish).   That’s it. The chart looks like this:   If you don’t believe that it works, change the clock on your computer. Of course, change the clock back when you’re done. Download the sample workbook here . ------------------------------- Dan Murray left a great, incredibly useful comment to enhance the chart even more by color-coding actual and forecasted sales. Step 1: Create a calculated field to determine whether Order Date is less today.   This results in a True/False dimension. Step 2: Drag the Actual/Forecast dimension onto the color shelf.   Now you have a clear indication of where actuals stop and forecast starts, split exactly by the reference line.   Thanks Dan!"], "link": "http://vizwiz.blogspot.com/feeds/3210005820744795450/comments/default", "bloglinks": {}, "links": {"http://lh3.ggpht.com/": 1, "http://lh4.ggpht.com/": 6, "http://lh5.ggpht.com/": 4, "http://www.interworks.com/": 1, "https://dl.dropbox.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["I always was under the assumption that you could not have an “All” option in a parameter to make it act like a compact list filter, but I was wrong. I was working with a n00b Tableau user at work answering his questions. He was building a tag analysis dashboard and was using a parameter that listed all of the tags, but then had an “All” option at the top. I completely changed the discussion and asked how he did it, and it’s so simple. Step 1: Add the field you want to filter to the Rows shelf. I’m only doing this so that you can see how it works along the way. I’m using Sub-Category. Step 2: Right-click on the field you want to use as a filter and choose Create Parameter. The advantage of right-clicking on the field you want to build the parameter on is that the list of values is pre-populated. Add (All) to the list of values. I use the format (All) so that the parameter looks like a compact list filter. I then rearranged the order so that (All) is at the top of the list.   Step 3: Right-click on the parameter and choose “Show Parameter Control”. It should pop up on the right side of the view. Step 4: In order to use the parameter as a filter, you have to create a calculated field.  Essentially what happens is that if the user picks (All) there’s nothing to filter, so it shows all sub-categories. Iff the user picks a sub-category, then that is passed to the filter.   Step 5: Drag the Sub-Category filter to the Filters shelf and select the True option.   That’s it! To see it in action, pick something from your parameter, then change it back to (All). So super cool! Literally about 1 minute of work. I know I’m going to use this technique many, many times now. Thanks to the n00b that showed me the light! I love learning new tricks. Download the sample Tableau workbook here ."], "link": "http://vizwiz.blogspot.com/feeds/15120430444524211/comments/default", "bloglinks": {}, "links": {"https://dl.dropbox.com/": 1, "http://lh4.ggpht.com/": 2, "http://lh5.ggpht.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["A request was made for a project I’m working on to allow the user/interactor to export the data on the dashboard into an Excel file from a dashboard that resides on Tableau Server. I totally overcomplicated this request and was convinced that it couldn’t be done. I was trying to create a URL link to export the data, but then I suddenly remembered that scrawny export button on Tableau Server and Tableau Public. Consider this dashboard that resides on Tableau Public:    Powered by Tableau  Look at the middle of the footer. Notice this little arrow pointing right. That’s the export button!   When you first click on it, it very well may look like this, where the Data and Crosstab options are disabled.   The trick is to click on the chart that has the data you want to export. You can’t export all of the data for the entire dashboard at the same time, but you can export the data for a single chart or table. Once you click on a chart, you’ll see a light gray border appear around the chart and now when you click on the export link, the Data and Crosstab options are enabled.   Way too simple! NOTES: 1. The Data option displays a web page which shows a table of the data. You then have to click on the export link. 2. If you want to directly download the data, click on the Crosstab option and you’ll get a nice clean CSV file."], "link": "http://vizwiz.blogspot.com/feeds/8750541222392640105/comments/default", "bloglinks": {}, "links": {"http://lh3.ggpht.com/": 1, "http://www.tableausoftware.com/": 1, "http://lh5.ggpht.com/": 1, "http://lh6.ggpht.com/": 1, "http://vizwiz.blogspot.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["I’m in constant learning mode with Tableau. I don’t think a day has gone by when I haven’t learned something. I love the Tableau community because everyone freely shares ideas from which they hope others borrow. This technique of from-to patterns is no exception; it’s definitely not a new topic I’m covering here. But I do like documenting the processes I follow, which is more or less why I started this blog in the first place. Paths are not a feature I use often, so in my inevitable quest for all things Tableau, I decided to find some data that would provide a good learning experience. The data for this post comes from the Bureau of Transportation Statistics . Here’s a sample of the data.   Each origin airport/destination airport combination is represented as one row in the spreadsheet. This is great, but in order to use Tableau’s Path functionality, you need to have two records for each origin/destination combination. The first for the starting point, and the second for the ending point.  You can accomplish this quite easily through Custom SQL. The example below contains all the columns I need from the spreadsheet.  Those before the red box are inherent in the spreadsheet. The SQL inside the red box is for the fields I have to add to make the paths work.  You must specify the path. In this case, 1 is the starting point, 2 the ending point. I added additional latitude and longitude fields to capture the starting and ending points. That is, I use the origin lat/long when my path = 1 and the destination lat/long when my path = 2. I included a concatenated string for the route, which I will use on the Level of Detail shelf. Union the SQL for path 1 to itself, but change the path to 2 and change the lat/long to the destination lat/long. Notice that the Route calculation stays to same.   In Tableau, all you have to do is:  Double-click on both Latitude and Longitude to draw the map Add Route to the Level of Detail shelf Change the Mark Type to line Add the Path Order dimension to the Path shelf   You now have a giant mess of lines all over the place that represent every single route in the data. That’s all you need to do.  The trick is that you need to write the custom SQL in order to have your data in a usable format. I wanted to take the viz a bit farther though, so I created this interactive version on Tableau Public.    Powered by Tableau  I included:  Filters options for Origin Airport, Destination Airport, and Airline (I chose ATL as my initial view since it’s the world’s busiest airport) Colors to indicate the length of the route Clicking on a color highlights the routes in the selected flight range and also highlights the destination airports on the bottom map A map of the number of passengers that flew to each destination, indicated by the size of the bubble Custom tooltips, which include the great-circle distance calculation This is a pretty fun viz to interact with. Choose all origin airports and you see all of the routes. Choose the airport you most frequently fly from. Choose your preferred airline. The three New York airports are particularly interesting (EWR, LGA, JFK). There are lots of other data elements that could be included, but I haven’t gotten to. Think about adding options to color the bubbles and lines by things like frequency of delays, average ticket price, etc. Wouldn’t this be really cool to do with your friend networks on Facebook ? Oh wait, we did that in a recent hack-a-thon."], "link": "http://vizwiz.blogspot.com/feeds/639741771984118776/comments/default", "bloglinks": {}, "links": {"http://kb.tableausoftware.com/": 1, "http://dl.dropbox.com/": 1, "http://vizwiz.blogspot.com/": 1, "http://www.facebook.com": 1, "http://www.tableausoftware.com/": 1, "http://lh6.ggpht.com/": 1, "http://onlinehelp.tableausoftware.com/": 1, "http://www.bts.gov/": 1}, "blogtitle": "VizWiz"}, {"content": ["Matt Katsaros built this really cool map in R of Spotify data. From Matt: “This is a map of SF showing the % of Spotify listens of [I’m leaving the song unnamed] within each ZIP code.”  When I saw this, I left a comment and told Matt that I could show him how to do this in three clicks with Tableau. We met today over lunch. I connected to the data in Tableau, in this case a CSV file, and was presented with this window:  Step 1: Double-click on the “zip” dimension and you get this map (NOTE: I zoomed in on the continental US for purposes of this write up):   With one click we know where all of the listeners are located. That’s right, one click! Step 2: Double-click on the “listens” measure and you get this map:  Two clicks and I have an excellent map that shows the concentration of listeners. Step 3: Drag “listens” onto the color shelf and you get this map:  We’re up to three clicks now and now we’ve emphasized the concentration of listeners with both size and color. Step 4: Matt then wanted to see the map he built of San Francisco, so I lassoed those point and chose the Keep Only option. I now have this map. Notice that the colors have adjusted to reflect only the data in the view.  Step 5: To change it to a filled map, all I have to do is select the Filled Map option on the Marks card and remove “listens” from the Size shelf.  Five mouse clicks to get Matt’s map. Yes, I know I told him three clicks, but I wanted to show him what Tableau does when you simply click the dimensions and measures. You could do it in less steps using the Show Me menu. To say Matt was excited is a huge understatement. I believe we have a new convert to Tableau."], "link": "http://vizwiz.blogspot.com/feeds/7562934969966819132/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "VizWiz"}, {"content": ["LeBron James is pretty awesome; we all know that. Sports Chart of the Day has interesting content, but creates horrible charts; we all know that too. This time, Sports Chart of the day is trying to represent deviations with pie charts. Really, seriously, I’m not lying. Here’s the evidence.   If the headline of Cork Gaines ’ article didn’t tell you what the point of the story was, do you think you’d actually be able to deduce anything from his pie charts? Can you tell me who is the largest % underpaid?  This has to be in the top 2 or 3 worst ways to represent change. But then again, Sports Chart of the Day (and their cohorts over at Chart of the Day) create quite a bit of chart junk. There’s some pretty basic information available and there are also some simple ways to portray the data that will tell the story better. Let’s go through a few examples (in no particular order). Example 1: Bar in bar chart, labeled by the amount under/overpaid  With this chart design, you can compare the salaries at a glance, both for the player and across the team. Example 2: Bar in bar chart, but the bar lengths represent the % of the team payroll for each player.  This chart is the identical shape as example 1, but the percentages provide a bit more perspective than the raw numbers. You cannot easily discern from example 1 that LeBron should account for 30% of the team payroll. In both example 1 and example 2, you’re able to quickly rank the players based on their current salary (you may not have even noticed that they’re not in order on the pie charts). So I can clearly see that Mike Miller is the 5th highest paid player and that he’s basically making 2x what he deserves. It’d be even better if you could select your sort criteria. Fortunately I can build and share in seconds using Tableau. Click here to see it live. Example 3 : Bar chart that shows the amount each player is underpaid or overpaid. Color is used as an additional visual cue.  This chart represents the math between the two bars in chart 1 so that the focus is directly on the amount LeBron is underpaid (and the amount Chris Bosh is overpaid). I prefer this over example 1 because the message is much simpler and clearer. Example 4: Bar chart that represents that % that a player is underpaid or overpaid. In other words, who is really getting screwed.  Interesting…when you compare this chart to example 3, it’s a very different story. Yes, LeBron is the most underpaid, but that’s because he makes so much money. This chart here tells us that he’s actually getting screwed the LEAST of those that are underpaid. Can you imagine being underpaid by 44% and being able to prove it? James Jones’ agent needs to get to work! This chart also shows us how ludicrously overpaid Wade, Bosh and Miller are. Good luck restructuring those contracts to help out their teammates. I’ve provided four alternatives, but many more exist. If I had to pick one that tell the story the best, I would go with example 4 because it makes the salaries all relative."], "link": "http://vizwiz.blogspot.com/feeds/6117385612337352987/comments/default", "bloglinks": {}, "links": {"http://www.businessinsider.com/": 3, "http://public.tableausoftware.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["I was teaching a data viz class at work yesterday and I tried an exercise that I’ve never done before. The idea came from this blog post by Santiago Ortiz on visual.ly . To set that stage, we covered attentive vs. preattentive processing, three forms of preattentive processing (I skipped motion), and the Gestalt principles of visual perception. Nothing ground breaking there, but a necessary base/toolkit that everyone should have. After the initial training, I had them grab some markers, head to the white board, and think of as many possible ways to visualize two simple numbers: 75 and 37.  At the end, we picked the best visualization. Here’s a sample of what they came up with (there was plenty more to the left and right):   Like the author of the blog post, I had no idea how this would go. It could have been a total flop, but it was the exact opposite. We spent a good hour discussing two simple numbers! And it was incredibly rich discussion. We went through each and every sample, discussed the pros and cons, and compared them all to determine which one we like best. What I found very interesting was that everyone made an assumption that the base was 100, but the directions never said that. All I gave them was two numbers. This led to an awesome discussion about needing context when presenting data. Give it a shot! Grab a few fellow data viz nerds and do this at lunch. Or better yet, over dinner and beers."], "link": "http://vizwiz.blogspot.com/feeds/7930198542885524669/comments/default", "bloglinks": {}, "links": {"http://lh6.ggpht.com/": 1, "http://blog.visual.ly/": 2, "http://visual.ly/": 1}, "blogtitle": "VizWiz"}, {"content": ["Nielsen is at it again. It’s not a spiral chart this time, but the simplest of bar charts that they couldn’t get right. It all begins with this headline: “Telecom Grows Global Ad Spend, Durables & Services Decline” Followed by this chart:   Wait…where’s telecom? Oh there it is, all the way at the bottom. If it’s so important, why isn’t it at the top? Because they sorted the chart alphabetically. When emphasizing rank, never sort your categories alphabetically. Next question, which sector was the 4th fastest grower? I bet it’ll take you longer than it should to find out. A few very small tweaks, that take all of 10 seconds, would have made their chart so much more effective.  Sort the sectors descending by growth rate, i.e., winners at the top, losers at the bottom Color code the bars to complement the length of the bars, i.e., double emphasize the point Put the mark labels on the ends of the bars Update the title – They didn’t mention that distribution channels were the leaders. Why not? I don’t get it.    Which sector was the 6th fastest grower? I bet it took you less than 2 seconds, certainly far less time than when the sectors are sorted alphabetically. Now their story makes more sense. If only they would give their work a bit of thought and put more pride into it. Nielsen consistently looks like they’re slapping a bunch of stuff together so that they can publish quickly. I think it hurts their brand to produce the junk they do, especially given how little time it takes to do it well."], "link": "http://vizwiz.blogspot.com/feeds/2580752598502343953/comments/default", "bloglinks": {}, "links": {"http://blog.nielsen.com/": 2}, "blogtitle": "VizWiz"}, {"content": ["Matt Stiles of The Daily Viz presented this chart to “see the trend in this quick column chart” in one of his recent blog posts .   First, let me say that this is a tremendous improvement over those produced by the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives (a.k.a. the ATF). Don’t bother reading the ATF report, unless you love 3D bar charts and 3D pie charts created in Excel. A stacked bar chart is basically a pie chart unrolled to make a stick. And more often than not, when plotted as a time series, they do a poor job at showing the overall trends. Stacked bars are good up to three bars, no more. Why? Because it’s difficult to compare the heights of any of the bars except for the bottom bar, rifles in this case.  Let’s go through several alternative displays. If you’re interested in playing with the data, Matt published it here for me. Thank you Matt! All of the charts below were built with Tableau . You can view an interactive version of all of these charts here and download the workbook here . Let’s start with a redesigned stacked bar chart that uses Tableau’s built-in color blind palette.  Can you see the trends for each of the weapons? Maybe an area chart would be better.  Well, ok. Now the trends are easier to see, right? Area charts certainly improve the ability to see trends over time, but there are only two trends that give an accurate reading:  The line at the top of the bottom area, i.e., rifles. The top of the top chart, which represents the total. We still don’t have the ability to see the trends for any weapon except for rifles.  Before you read on, take out a piece of paper and sketch what you think the trend is for shotguns (light blue) based on the area chart above. Ok. Now let’s compare the area chart above with the area chart for shotguns.  Did you come close? I doubt you did. Why? Because the tops of each color are influenced by the size of the colors below it, therefore making gauging the true size of each individual color extremely difficult. Here’s another way to prove it. I know this isn’t a good way to represent the data, but bear with me, I’m trying to prove a point. If I overlay lines for each weapon over the area chart, look how different the shapes of the lines become.  Like most time-series data, your best way to represent the data is nearly always going to be a line chart.   Using a line chart we can quickly make some observations:  There was a three-year spike in the early 90s for pistols made and there’s been a similar, but longer, surge since 2006. What was the cause of the big decline in 1995? Was there a change in handgun laws in 2005 or 2006?  Revolvers were on a steady 20-year decline until 2005-2006. Is this merely coincidental with the pistols? Possibly so, possibly not.  Rifles have increased recently, but shotguns have decreased. Are people buying rifles instead of shotguns? Their rate of variance since 1994 has grown consistently and the gap continues to get wider. Using a line chart, you’re immediately asking questions of your data. Rapid-fire analysis! When analyzing time-series data across several categories, consider not only looking at the raw numbers like above, but also review how each category contributes to the total. Let’s go through the same series of charts.  We’re off to a good start with the stacked bar chart. It looks like measuring the contribution of each weapon to the total may tell us something. Let’s try it as an area chart.  Not much better, other than it looks smoother. How about a line chart?  Ok, now we’re onto something. You might think that this is the same as the line chart for the raw numbers, and I can see how you might make that conclusion at a quick glance. But let’s look at them side-by-side.  The charts look very similar up until 1997, but then look at how many more rifles started to be made compared to the rest. And look at the drop off in percentage of shotguns produced since 2004. Hopefully you’ve learned two main lessons:  Don’t display time-series data as stacked bars (or pies unrolled onto on a stick if you prefer). The best medium for time-series data is a line chart. Consider looking at both the raw numbers and their contribution to the total. It’s always a good idea to look at your data in more than one way. You may get some additional and/or different insights. Let me wrap with two charts that disturbed me a bit as I was playing with the data for this blog post. I’m not disturbed by their visual display, but by what they reveal.  The chart on the left is the running total of guns made by gun type since 1986. The chart on the right summarizes the chart on the left. These charts tell us that the US has manufactured over 99 million guns since 1986. Seriously! 99 million! According to the US Census Bureau , there were ~238M Americans over 18. That means that approximately one of every five Americans 18 or older owns a gun.  That terrifies me! Perhaps political interests (and lobbyists) have played a part??  UPDATE – Source CNN : This certainly explains the drop that started in 1994 and the subsequent increase in 2005.  The Clinton administration imposed a ban on several types of military-style semi-automatic rifles and high-capacity magazines in 1994, but that ban was allowed to lapse in 2004. Obama has proposed restoring the ban, requiring background checks for buyers at gun shows, and other \"common-sense measures.\""], "link": "http://vizwiz.blogspot.com/feeds/4564773820870427754/comments/default", "bloglinks": {}, "links": {"http://thedailyviz.com/": 3, "http://articles.cnn.com/": 1, "http://public.tableausoftware.com/": 2, "http://www.atf.gov/": 1, "http://www.tableausoftware.com/": 1, "http://twitter.com/": 1, "http://goo.gl/": 1, "http://quickfacts.census.gov/": 1}, "blogtitle": "VizWiz"}, {"content": ["Situation: You have daily sales data, but you don’t want to include the current week until it closes. You also don’t want to manually filter the most recent week out of the report each week because that’s an unnecessary nuisance. Solution: Create two date calculations and one filter calculation Step 1 – Create a calculated field to get the current year & week  Note that I’m creating a string that includes the year. This is necessary if you have more than one year in your reports. If the formula only returns the week number, then that week number would be excluded for all years. Step 2 – Create a calculated field to get the year & week for each date of your date field  Step 3 – Create a calculated field to act as the filter  Step 4 – Drag the Exclude Current Week field to the Filters shelf and choose the Exclude option on the bottom right when the result of the calculation is “EXCLUDE”  An alternative solution would be to build the two calculated field from step 1 & 2 into the calculation built in step 3, but I chose to break them out separately for this example so that you can more easily see how the calculations work together. The calculation would look like this:  This method would work if you wanted to ONLY KEEP the current week. In this case, you would follow step 4, but you would NOT select the Exclude checkbox on the bottom right."], "link": "http://vizwiz.blogspot.com/feeds/8334492310912475195/comments/default", "bloglinks": {}, "links": {}, "blogtitle": "VizWiz"}, {"content": ["Here’s the situation: You have multiple measures that you want to view across time, but you don’t want to see all of the measures at the same time. Instead you want the user to be able to pick the measure to view. Parameters to the rescue! Andy Cotgreave blogged about user built views in his Data Studio days. In this blog post I will provide the step-by-step directions. The charts types you can create with the technique are seemingly endless, but I’ll go through a simple scenario. Step 1 – Right-click anywhere in the Measures or Dimensions windows and choose Create Parameter. Create a parameter named “Choose a measure” with the settings below. Note that I am giving this a name that will instruction the user as to what to do.  Step 2 – Find the parameter you just created in the Parameters window. Right-click on it and choose “Create Calculated Field”. Step 3 – Use a CASE statement to build the calculated field. This field is telling Tableau what measure to use based on the value chosen in the “Choose a measure” parameter.  Step 4 – Add Order Date to the column shelf and your new “Measure chosen” measure to the row shelf. For this example, I’ve expanded the Order Date field to Quarter.  Notice how the y-axis is labeled “Measure chosen”. We’ll clean that up in a bit. Step 5 – Right-click on your “Choose a measure” parameter in the Parameter window and choose “Show Parameter Control”. It should appear on the upper-right of the window.  Make different selections in the parameter control and notice how the y-axis and the chart change dynamically. Step 6 – Drag the “Choose a measure” parameter to the row shelf. Again, make different selections in the parameter control and watch the label change. We’re almost done. Just a bit of formatting remains. Step 7 – Clean up the chart.  Right-click on the field that shows the “Choose a measure” value and select “Rotate Label”  Right-click on the row label and choose “Hide Labels for Rows”.  Double-click on the “Measure Chosen” axis to bring up the Edit Axis window. Delete the title. That’s it. You’re final viz should look like this:   If you’re like me, once you saw this technique, you began thinking of all of the possible uses. Play around with lots of different use cases. Try scatter plots, dual-axis charts, bubble charts, etc. You can control ANY of the shelves using parameters. Imagine the guided analysis you can provide your users and the exploration they’ll be able to do on their own. It’s almost like creating a pivot table for them.  If you want a slightly more complex version, I created a scatterplot of NBA franchise values that allows you pick the x-axis, y-axis and size, all with parameters. Parameters are quite powerful. Leverage them! Download the sample workbook here ."], "link": "http://vizwiz.blogspot.com/feeds/5127753384557071162/comments/default", "bloglinks": {}, "links": {"http://twitter.com/": 1, "http://public.tableausoftware.com/": 1, "http://www.co.uk": 1, "http://vizwiz.blogspot.com/": 1, "http://www.co.uk/blog": 1}, "blogtitle": "VizWiz"}, {"content": ["One of the great benefits of working with brilliant people is that you get challenging questions. When those questions are about Tableau, I’m nearly always convinced that what the person is trying to do can be done. Wednesday was another great example. Assume you have a table that measures sales by year by customer. You’re only interested in customers that have more than $35,000 in sales per year.  And you don’t care who the customers are, just how many. Restating the question: How many customers have bought over $35,000 of products in a year and what was the total value of those sales? This is a simple question, but it wasn’t as easy to do in Tableau as I thought. My initial thought was to simply change the Customers field to a distinct count, but that didn’t work because my individual customers are no longer listed. Ok, so I need all of the customers, but I don’t want to see them. Basically I’m looking for one row for each year. Each row will list year, # of customers over $35K, and total sales for those customers. Here’s how to do it. I’m going to assume that you are starting with a view like this.  Step 1 – Create a calculated field to count all of the customers in the view (note that I’m working with an Excel data source, so COUNTD is only available if I make it an extract).   Step 2 – Drop the Customer Count measure onto the data area. You will see the Customer Count field appear in the Measure Values shelf. Step 3 – Right-click on the Customer Count measure in the Measure Values shelf and choose Edit Table Calculation.  From the Compute Using list, choose Advanced… Move the Year of Order Date and Customer fields to the right and click OK.  On the Table Calculation window, change the Restarting every option to Year of Order Date and click OK.  Your view should now look like this. Notice how the Customer Count field shows the same total number of Customers in each row for each year.  Step 4 – Create a calculated field to total all of the sales in the view   Step 5 – Drop the Total Sales measure onto the data area. You will see the Total Sales field appear in the Measure Values shelf. Step 6 – Right-click on the Total Sales measure in the Measure Values shelf and choose Edit Table Calculation.  From the Compute Using list, choose Advanced… Move the Year of Order Date and Customer fields to the right and click OK.   On the Table Calculation window, change the Restarting every option to Year of Order Date and click OK.  Your view should now look like this. Notice how the Total Sales field now shows to total sales by year on each row.   Step 7 – Drop the Number of Records measure onto the data area. You will see the Number of Records field appear in the Measure Values shelf. Step 8 – Right-click on the Number of Records measure in the Measure Values shelf and change the aggregation from Sum to Average. Step 9 – Right-click on the Number of Records measure in the Measure Values shelf and choose Add Table Calculation.  Change the Calculation Type to Running Total. From the Running Along list, choose Advanced… Move the Year of Order Date and Customer fields to the right and click OK.   On the Table Calculation window, change the Restarting every option to Year of Order Date and click OK.  Your view should now look like this. Notice the running total we’ve added and how it restarts every year. What we’re doing here is simply counting the number of rows in each pane.   Step 10 – Cleanup time!  Right-click on the Number of Records pill and choose Filter. Change the filter to be At Most 1. This will now keep only the first row in each year.  Notice how our Customer Count and Total Sales fields didn’t change. This is because we still have the Customers dimension in the view. Drag the Number of Records pill off of the Measure Values shelf. Be sure to keep it on the filter shelf though. Note: Steps 7 to 10.1 could all be combined into one step if we put the Number of Records field in the filter immediately. I didn’t do that because I wanted to demonstrate how we’re leveraging the running totals calculation in this example. Move the Customers dimension from the Row shelf to the Level of Detail shelf. Remove Sum of Sales from the view. It’s no longer relevant. Right click on the two headers for the measures and rename them (Edit Alias). That’s it!  I have a sneaking suspicion that I’m overlooking a very simple way to do this, so if I am, please let me know. Either way, this works. Download the workbook here ."], "link": "http://vizwiz.blogspot.com/feeds/8579971433886987899/comments/default", "bloglinks": {}, "links": {"http://lh4.ggpht.com/": 1, "http://public.tableausoftware.com/": 1, "http://lh6.ggpht.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["Before I get started, credit for the technique/trick in this blog post to Jonathan Drummey. Follow Jonathan on Twitter or follow his new blog .  Also, if you don’t use the Tableau Forums for getting answers to those things that have you stumped, then you’re missing out. It’s very rare that I can’t either (1) find the answer or (2) get the answer by starting a discussion. Now, consider that you have a stacked bar chart of sales by Product Container color-coded by Region.  Great! But it would be more useful to label the top of each bar with the totals sales like this.  Awesome! I was banging my head trying to figure out how to make this work. Adding totals to a stacked bar is straight forward, but the trick here is that the bars represent % of total, not the raw sales. It seems so simple, but I was stumped. Fortunately Jonathan was there to save the day, and I can’t believe how simple it was.  Here’s how it’s done, starting with the stacked bar. Step 1 – Create a calculated field with the value of one   Step 2 – Drag your new “One” measure onto the right side of the chart until you see the dotted lines (which indicate a dual axis), then drop it. You now probably have an ugly chart like this:   Step 3 – Change the aggregation for the One measure from Sum to Average (right-click on the One pill, go down to Measure, then pick Average) Step 4 – Right-click on the right axis and choose Synchronize Axis  Step 5 – Click on the carrot on the top-right of the Marks card and choose Multiple Mark Types Step 6 – Scroll to the right on the Marks card until you get to SUM(Sales). Change the mark type to Bar.   Step 7 – Scroll to the right again to get to AVG(One).  Remove Region from the Color shelf Set the color transparency to 0% Change the mark type to Gantt Bar ( Joe Mako suggested using Gantt Bar instead of Bar because it creates a line at the top and it will eliminate the chance that the user could select a hidden bar.) Drag the Sales measure onto the Label shelf Set the Label alignment to Top   You should now have a chart that looks like this:   Step 8 – Right-click on the right axis and uncheck Show Header That’s it! Pretty simple! (Now that I know how to do it.)   Download the workbook here ."], "link": "http://vizwiz.blogspot.com/feeds/5596594902789233900/comments/default", "bloglinks": {}, "links": {"http://public.tableausoftware.com/": 1, "https://plus.google.com/": 1, "http://kb.tableausoftware.com/": 1, "http://drawingwithnumbers.artisart.org/": 1, "http://community.tableausoftware.com/": 1, "http://lh3.ggpht.com/": 1, "http://lh6.ggpht.com/": 2, "http://twitter.com/": 1, "http://lh5.ggpht.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["Of course this chart isn’t the cause, but it did get me heated over its horrific design.   I’m becoming convinced that Nielsen doesn’t particularly care about making good design decisions, and they apparently don’t particularly value my feedback either. I can assure you, I’ve given them plenty. Here’s an alternative that I threw together in Tableau .    It’s important when creating a visualization that you design it in such a way that, amongst many other things, (1) the reader can see the whole story at a glance, and (2) they can interact for their own deeper analysis. To accomplish this I:  Started with maps (This is a global report with geographic data, which always leads me to start with a map) Made very specific color choices to emphasize the positives (blue) and the negatives (red) Added interactivity through highlighting Included a scatterplot to compare the change to the index Provided the option to filter by continent Why is all of this important? Because we need to know how consumers’ feeling are trending; a country could have a high index, but are headed down (e.g. India and China), or a country could have a low index and things are looking up (e.g., South Korea and France). Those are two very different stories. Imagine how the politicians could spin this information. Click on the USA and you’ll see (when you hover over the circle that gets highlighted) that the United States is in trouble. Their CCI is 87 and it has declined –5 points. Uh oh! I challenge you to deduce any of that from Nielsen’s fan chart."], "link": "http://vizwiz.blogspot.com/feeds/6381826883546547290/comments/default", "bloglinks": {}, "links": {"http://blog.nielsen.com/": 1, "http://www.tableausoftware.com": 1, "http://vizwiz.blogspot.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["Suppose you have two dimensions, Customer Segment and Product Sub-Category, and you are displaying sales for each in a bar chart like this:  You want to look at only the top X Product Sub-Categories within each Customer Segment based on Sales. Naturally, you click on the Sort Descending button, but, uh oh, you get this:  What happened? The bars are not sorted by Product Sub-Category within each Customer Segment. They’re actually sorted by the total of the Product Sub-Category across the entire table.  What we really want is for the Product Sub-Categories to be sorted within each Customer Segment. To do that, you need to create a set. Step 1 – Choose the two fields you want to create the set with, then right-click and choose Create Set.  Step 2 – Give the set a name if you want, rearrange them to the proper order and click ok.   NOTE: If the columns are not in the order you want, then simply drag them left and/or right. In our example, we want Customer Segment first because that is our first level dimension. Step 3 – Drag your new set into the view by placing it between the Customer Segment and Product Sub-Category dimensions on the Rows shelf.  Step 4 – Clear the sort from the Product Sub-Category dimension, then right-click on the Set on the Rows shelf and choose Sort. Set the sort order to descending by Sales.  Your chart is now sorted by Product Sub-Category within each Customer Segment.  Step 5 – Clean up the chart by right-clicking on your set in the Rows shelf and uncheck Show Header.  That still leaves some extra grid lines. To clean them up go to the menu and choose Format => Borders. Move the slider on the Row Divider level one spot to the left.  You should now have a nice clean bar chart.  But, I want to see only the top X Product Sub-Categories within each Customer Segment. Let’s continue on. Step 6 – Create a parameter to allow the user to choose between the top 1 and the top 10.  Step 7 – Create a “rank” field that will show you the rank of each Product Sub-Category within each Customer Segment.  Step 8 – Add the Rank measure to the Level of Detail shelf. Step 9 – Edit the Rank field by right-clicking on the Rank field and choosing Edit Table Calculation. Choose Advanced from the Computing using list.  In the Advanced window, move both fields into the Compute Using box and change the Order Along section to Sales descending. Click OK.  Now updated the Rank table calculation to the following:  Basically what this is saying is that the Rank field should compute for each Product Sub-Category within a Customer Segment, then it should restart counting when it gets to the next Customer Segment. Step 10 – Create a calculated field that uses the Top X parameter to filter the number of Product Sub-Categories that should be displayed within each Customer Segment.  This creates a true/false filter. Step 11 – Add the Top X ? true/false calculated field to the Filter shelf and select True. Step 12 – Show the Top X parameter control created in Step 6 and you’re done!  You can now use the Top X control to pick how many Product Sub-Categories you want to show within each Customer Segment. Download the Tableau Workbook here ."], "link": "http://vizwiz.blogspot.com/feeds/1686241275678882043/comments/default", "bloglinks": {}, "links": {"http://public.tableausoftware.com/": 1}, "blogtitle": "VizWiz"}, {"content": ["I’ve been gone for a few weeks enjoying some much needed time off before changing jobs and moving to the west coast. I’m hopping back into the blog saddle with a series of posts about different charts type, their strengths and weaknesses, when to/not to use them, etc.  The posts will include step-by-step instructions for creating the charts in Tableau . The instructions for many of these charts have been written before and I will reference the authors whenever I know about their work. I will typically use a chart I’ve found on the internet in order to provide variety of examples and also to provide a forum for discussing the strengths and weaknesses of their chosen designs. Let’s get right to it with this lollipop chart from The Washington Post (via Chart Porn ):  I like the clean design, the use of simple colors, and the excellent use of data-ink ratio of this chart, but there are few issues that immediately stand out to me. First though, what is a lollipop chart? I couldn’t find an exact definition, but I think of a lollipop chart as a combination of a bar chart and a dot plot. Lollipop charts are great for giving you a sense of both length (bars) and precision (dots).  However, it only makes sense to use the stick of the lollipop when you’re range starts at zero.  In the example above, the bars start at 60, therefore including the bars could mislead the reader into thinking the retirement age in Malta is five times lower than Austria. In this example, the bars should be removed, which turns the chart into a dot plot. Another problem with this chart is that there is no particular rationale to the sort. At first I thought it was ranked buy retirement age from youngest to oldest, but then Spain was listed before the United States. For the purpose of the rest of this blog post, we’re going to focus on the retirement age only. Taking the issues above into account, the data could be represented as a simple dot plot:  Or alternatively as a lollipop chart:  Hopefully at this point you understand when and why you would use a lollipop chart. In the end, it’s basically a bar chart with a bit more emphasis on the exact value of the bar. CAUTION: Don’t avoid a bar chart simply because a lollipop chart looks cute. I would nearly always prefer a bar chart over a lollipop chart. So now onto the instructions for how to build this chart. (Credit to Andy Cotgreave , who back in his days at The Data Studio wrote similar instructions ) Step 1 – Drag the Country dimension onto the Rows shelf and the Retirement Age measure onto the Columns shelf. The result is a bar chart. Click the sort ascending button.  Step 2 – Drag the Retirement Age measure to the Columns shelf again. The results is the same bar chart side-by-side.  Step 3 – Right-click on the 2nd Retirement Age measure on the Columns shelf and choose Dual Axis  Step 4 - Right-click on the 2nd Retirement Age measure on the Columns shelf and choose Synchronize Axis Step 5 - Right-click on the 2nd Retirement Age measure on the Columns shelf and uncheck Show Header Step 6 – Drag the right side of the chart to the left to shrink the view  Step 7 – On the Marks card, click on the triangle (a.k.a. carrot) on the upper-right and choose Multiple Mark Types  The Marks card should now show “All” at the top and there are now arrows for moving left and right through the measures on the Column shelf, e.g., the two Retirement Ages measures.  Step 8 – Click the right arrow on the Marks card once, then:  Change the format of the chart from Automatic to Bar Move the Size slider all the way to the left to make the bars as small as possible Remove the Measure Names field from the Color shelf Change the color of the bar by clicking on the colored square.   Step 9 – Click the right arrow on the Marks card again to move to the 2nd Retirement Age field, then:  Change the format of the chart from Automatic to Circle Remove the Measure Names field from the Color shelf Drag the Retirement Age measure onto the Label shelf Format the Label to the font color of your choice and set the horizontal alignment to Center to place the label in the middle of the circle Change the color of the circle by clicking on the colored square Resize the circle  Voila! You’re lollipop chart is complete. After you practice these steps a few times, you’ll be able to build it in under one minute…guaranteed!  Download the Tableau Workbook here ."], "link": "http://vizwiz.blogspot.com/feeds/4593944522572737685/comments/default", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://www.washingtonpost.com/": 1, "http://www.co.uk/blog": 1, "http://chartporn.org/": 1, "http://public.tableausoftware.com/": 1, "http://www.tableausoftware.com/": 1, "http://www.co.uk/": 1}, "blogtitle": "VizWiz"}, {"content": ["Timely that Mercer published its World Cost of Living Survey yesterday (12 June 2012) as I’ll be moving to San Francisco soon for a super cool data viz opportunity with Facebook. I thought for sure that San Francisco would be in the top 50 (we had some serious sticker shock look at houses out there!!), but it’s not. Select data was released by the Guardian . They posted this infographic (click to enlarge), but I found it a bit difficult to circumnavigate. It’s challenging to find patterns and compare the data. For me, there’s too much information in one view. It’s good for an overview and to print, but challenging for analysis. Note that the data is a subset of countries; it does not represent the top 50.   I downloaded the data and built this simple viz in Tableau .   Powered by Tableau  I wanted to be able to compare countries and two expenditures simultaneously, so I used Tableau’s parameters feature to allow you to choose the what you want to compare. I intentionally included both a map and scatterplot so that you have multiple methods for comparing the data. Click on a country on the map or a circle in the scatterplot to highlight the country. Hover over a circle for more information. The 2nd tab is a reproduction of the infographic the Guardian produced. It’s for reference only. I doubt you can glean much insight from it. There are some expenditures that I would have expected to correlate highly that don’t. Blue jeans vs. cinema is a good example of this. Or a cup of coffee and a newspaper. Don’t those two go hand in hand?"], "link": "http://vizwiz.blogspot.com/feeds/5769070461823955064/comments/default", "bloglinks": {}, "links": {"http://www.co.uk/": 1, "http://downloads.tableausoftware.com/": 1, "http://vizwiz.blogspot.com/": 1, "http://www.tableausoftware.com/": 2, "http://www.mercer.com/": 1, "http://static.co.uk/": 1}, "blogtitle": "VizWiz"}, {"content": ["Ironically enough, donut charts are basically pie charts with a hole in the middle, leaving you with even less information to fill your brain. Donut charts are used to display data in rings, where each ring represents a data series. Each ring is a distinct category. Yes, there are examples of donuts within donuts ( here is a particularly horrific example from Dundas ).  Once again, Nielsen provides another example to pick on review. At least their consistent in their ineffectiveness, right?  Pie charts can be effective, rarely, but I don’t see why you would ever use a donut chart over a pie chart. Let’s look at some alternatives to Nielsen’s infographic. Alternative 1 – Pie Chart   Grade = F  It’s a pie chart It’s a pie chart It’s a pie chart  Alternative 2 – Bar chart by Device by Category   Grade = C  Comparisons between Devices is difficult Data is sorted by frequency of using the Device, making it harder to see the winners and losers The coloring by Category is distracting  Alternative 3 – Bar chart by Category by Device   Grade = B  Easy to compare devices, which was the point of the article Labels removed since the exact values are not all that important and distract from comparing the size of the bars Devices are sorted by frequency within each Category, making it easy to see the winners and losers in each Category The colors neatly segment the data  Alternative 4 – Heat Map   Grade = A  Easy to compare all of the data at once, whether you want to look vertically, horizontally or both. A heat map makes it clear that people use their computers at home to watch video most frequently and that people watch a LOT of video, independent of the device. The colors are impactful and provide rich meaning, while not overwhelming your eyes.  Alternative 5 – Highlight Table   Grade = A+  You get all of the benefits of the heat map, but you also get the values, providing additional detail. These are only five of the many possible alternatives. Download the Tableau workbook here . Would you use any of these charts to visualize this data? Why or why not? What other alternatives would you find effective?"], "link": "http://vizwiz.blogspot.com/feeds/6363667268318677520/comments/default", "bloglinks": {}, "links": {"http://dl.dropbox.com/": 1, "http://lh4.ggpht.com/": 2, "http://lh3.ggpht.com/": 1, "http://lh5.ggpht.com/": 2, "http://blog.nielsen.com/": 1, "http://support2.dundas.com/": 2}, "blogtitle": "VizWiz"}, {"content": ["Global filters in Tableau are often one of your best friends, especially when building interactive dashboards that span multiple worksheets. However, if you have multiple data sources and multiple worksheets, global filters do not apply to all of your worksheets. Yes, you can use actions, but this can easily become confusing for the user when switching worksheets. But wouldn’t it be great to have a global filter work across all of the data sources? Use this technique and you’ll get what you always hoped for. In this example, assume you have three disparate data sources each with its own dashboard.      There is also a dimension named Location in all of the data sources. Note that this dimension does not have to be named the same in every data source for this technique to work.   At this point, if I add the Location dimension to the Sales worksheets and set it to a global filter, the filter will not get applied to the Shipping and Capacity dashboards because they are not from the same data source.  To make a “global filter” apply to all of the dashboards/worksheets, follow these steps. Step 1 – Drag the Location dimension onto the filter shelf of one worksheet for each data source and choose the Use All option.   Step 2 – Make the Location field a Global filter on each data source   Remember, you must repeat steps 1 & 2 for one sheet of each data source. Step 3 – Create a parameter named Location (or any name you’d like) with the following settings.   Of course, your list of values will need to be relevant to your data. Step 4 – Create a calculated field that will determine if the Location dimension equals the value chosen in the Location parameter.   Step 5 – Copy/Paste this formula across all of the data sources. You should now have the Location Flag calculated field in the Dimensions list of each data source. Step 6 - Drag the Location Flag dimension onto the filter shelf of one worksheet for each data source and choose True.   Step 7 – Make the Location Flag a Global filter on each data source Step 8 – Show the Location parameter in each dashboard and place it on the dashboard wherever you prefer.   The Location parameter now acts like a Compact List quick filter. Your final workbook should look like this:    Powered by Tableau  Choose a different Location, then flip to another tab. You will see the dashboard update based on the new Location. Change it back if you don’t believe me. In this example, I did not want to allow the user to pick “All” as an option in the Location parameter. Instead I wanted them to be forced to pick only one Area. You could include an All option through a few more calculated fields."], "link": "http://vizwiz.blogspot.com/feeds/4932175457502363439/comments/default", "bloglinks": {}, "links": {"http://lh4.ggpht.com/": 3, "http://vizwiz.blogspot.com/": 1, "http://www.tableausoftware.com/": 1, "http://lh6.ggpht.com/": 3, "http://lh3.ggpht.com/": 2, "http://lh5.ggpht.com/": 2}, "blogtitle": "VizWiz"}]