[{"blogurl": "http://webmaths.wordpress.com\n", "blogroll": [], "title": "Webmaths"}, {"content": ["Monday morning. A cold 5 degrees C. I greet twenty year 8 students at the door. There are some smiles and lots of chatter about the weekend. I use my standard line: “Come in if you are intelligent and keen to do some Maths”. \n Most file in, but a few jokers linger, pretending not to fall into either category. I call for attention when they are seated. The room quietens (thanks to months of building up a good working relationship with these great kids) but X and Y continue their banter. \n I introduce today’s “Learning Intention” – What is Pi ? \n My lesson plan includes some video clips and then outside with string and chalk to “draw” some circles on the asphalt. The sun is now out and the day is starting to warm up. The students are enjoying a break from the four walls of the classroom and soon lots of yellow circles start to appear on the ground. \n Students use their feet as measuring instruments. Each circle radius is recorded and doubled to make the diameter. Then carefully feet are placed end on end around the circumference. \n Back in the classroom to calculate Circumference divided by Diameter. One boy proudly brings his book up to show me he has got pi equal to 3.16 ! I get student X to staple pi to 100 decimal places on the wall of the classroom. \n I then ask the class to use their calculators to complete my prepared worksheet (shown below), which involves converting historical attempts at finding fractions equal or close to the value of pi. \n  \n To my surprise, even my best students have trouble with question 3: Which fraction is the best approximation for Pi? \n Perhaps my next lesson should be on decimals and place value???????"], "link": "http://webmaths.wordpress.com/2012/08/13/pi-and-place-value/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://en.wikipedia.org/": 1, "http://webmaths.wordpress.com/": 5}, "blogtitle": "Webmaths"}, {"content": ["Recently, Pasi Sahlberg (Director General of Education in Finland ) was interviewed by Emma Alberici on ABC’s Lateline . \n  \n Finland occupies the number one spot as far as the OECD testing standard is concerned. It’s education system differs in significant ways from Australia and I urge all teachers to watch the interview . \n Pasi covers many points including: \n 1. Equity in education v. Competition \n 2. Putting trust in schools and teachers to educate \n 3. Raising the education standard of teachers, as well as pay and status \n 4. Negative outcomes of state standardized testing \n 5. Know & Remember v. Creativity \n “This creativity aspect is very important because in Finland we believe that risk-taking, creativity and innovation are very, very important for a society like ours.  And particularly working in this global and globalized world it is more important than what you actually know and remember, it is more what you are and what you are capable of doing.”” [Pasi Sahlberg] \n 6. Less is More \n Although not specifically covered on the Lateline interview, in Finland teachers have less face to face teaching hours as do students! You can read more about this at David Trusses “Pair-a-Dimes for Your Thoughts” blog post ."], "link": "http://webmaths.wordpress.com/2012/03/02/the-keys-to-successful-education/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://abc.net.au/": 1, "http://webmaths.wordpress.com/": 2, "http://www.net.au/": 1, "http://en.wikipedia.org/": 1, "http://pairadimes.davidtruss.com/": 1}, "blogtitle": "Webmaths"}, {"content": ["Following on from my last post, here is a nice game from TES who claim to be the largest network of teachers in the world? . Top Trumps Animals Algebra Substitution uses a set of 45 cards similar to the one shown below. \n The Wikipedia entry states the rules as follows: \n All the cards are dealt among the players. There must be at least two players, and at least one card for each player. The starting player (normally the player sitting on the dealer’s left) selects a category from his or her topmost card and reads out its value. Each other player then reads out the value of the same category from their cards. The best (usually the largest) value wins the “trick”, and the winner takes all the cards of the trick and places them at the bottom of his or her pile. That player then looks at their new topmost card, and chooses the category for the next round. \n To generate the a, b & c values, dice or playing cards could be used."], "link": "http://webmaths.wordpress.com/2011/10/03/top-trumps-substitution-card-game/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://www.co.uk/": 2, "http://en.wikipedia.org/": 1, "http://webmaths.wordpress.com/": 2}, "blogtitle": "Webmaths"}, {"content": ["My most enjoyable and successful classes are those where I learn WITH the students. Hence I was pleased to stumble across Max Ray’s blog post: I know I’m doing it right when…  Max’s statements nearly all start with: “Students and Teachers … \n  \n 6) Students and Teachers solve novel problems with a variety of strategies, tools, and representations. \n I am always on the lookout for a “rich” problem to engage the students with. Personally, I also love to research and prepare lesson materials. This may simply be taking someone’s idea and “tweaking” it. \n Example: “ Algebra Target Board ” by Steve Wright on eMaths . \n  \n I wasn’t quite sure how to use this board at first. Then I thought of this: \n 1. Each students rolls a ten sided die to “choose” their a and b numbers. \n 2. The student then evaluates each expression on the Target Board. \n 3. A score is obtained by finding the sum of the 25 numbers. \n [At this stage this is simply a skills practice exercise.] \n Some areas for investigation: \n A. Which numbers will give the greatest total? \n B. What are the probability of…….? \n C. How could we use Algebra instead of Arithmetic to predict the winner? \n D. Change some of the algebraic expressions so that the outcome is less predictable. For example, I changed a – b to (a – b) cubed , which could produce some large negative answers! \n E. Ask and test “What If” questions like: “What if different dice are used?” \n I think activities like this can help achieve Max’s nine conditions."], "link": "http://webmaths.wordpress.com/2011/09/19/students-teachers-maths/", "bloglinks": {}, "links": {"http://mathforum.org/blog": 1, "http://www.co.uk/": 2, "http://feeds.wordpress.com/": 1, "http://webmaths.wordpress.com/": 2}, "blogtitle": "Webmaths"}, {"content": ["As part of my Puzzlemaths book, I have devised some puzzles of my own. One example is my Numbers Puzzle – shown below: \n I originally made this puzzle image free, but for most students this was too difficult. Every word in the puzzle now has a visual clue, which hopefully makes the puzzle more accessible. What do think of this type of puzzle? Or perhaps a more important question: “What place do puzzles and/or games have in the Mathematics classroom?”"], "link": "http://webmaths.wordpress.com/2011/09/14/numbers-puzzle/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://webmaths.wordpress.com/": 2}, "blogtitle": "Webmaths"}, {"content": ["My Year 12 Mathematics students have been working hard, having just finished the Geometry and Measurement option. On Friday we started Networks. They had a dress-up day and came to school in their PJ’s and slippers – a good way to relieve stress? Here are a few anonymous pics:"], "link": "http://webmaths.wordpress.com/2011/08/28/pyjama-party-anyone/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://webmaths.wordpress.com/": 3}, "blogtitle": "Webmaths"}, {"content": ["I have recently been investigating the use of number puzzles in the Mathematics classroom. As a puzzle solver, I find them both relaxing and motivating. To reach that final solution gives the solver a clear sense of purpose and a sense of satisfaction when the goal is achieved. \n Carefully chosen puzzles can also help students consolidate their arithmetic and problem solving skills. For example Sudoku puzzles do not require any arithmetic while Ken-Ken or Kakuro do. \n How the puzzles are used is also important. With Kakuro for example, I have scrounged some number tiles from other games to turn it in to a hands on puzzle. This makes it much more accessible to novice solvers who can use a “trial and error” approach. A partly solved Kakuro puzzle with tiles is shown in the image below: \n  \n An excellent selection of Kakuro puzzles may be downloaded in PDF format from krazydad or akidsmath . In my new compilation – PUZZLE MATH – I have included the following types of puzzle: \n \n ADDITION SQUARES \n ALFAKODO \n CALCUDOKU \n COLOUR ME \n CROSSFIGURE \n CROSSNUMBER \n FRACTION SQUARE \n JOIN THE DOTS \n KAKURO \n LOGIC PROBLEMS \n MAGIC SQUARES \n MENTAL MATHS \n MINUTE CHALLENGE \n MONEY MATHS \n NUMBERS \n NUMBER MAZES \n NUMBER PYRAMIDS \n RECTANGLES \n MIXED PUZZLES  [ click here for sample ] \n \n \n \n Do arithmetic type puzzles have a place in the Mathematics classroom? What do you think?"], "link": "http://webmaths.wordpress.com/2011/08/28/number-puzzles/", "bloglinks": {}, "links": {"http://www.scribd.com/": 1, "http://feeds.wordpress.com/": 1, "http://www.akidsmath.com/": 1, "http://www.krazydad.com/": 1, "http://webmaths.wordpress.com/": 1}, "blogtitle": "Webmaths"}, {"content": ["It has been a long time since my last post but in the famous words of Sylvester Stallone: “I’ll be back”. \n  \n You see I’ve fallen prey to new technology called the KINDLE. \n  \n Being an avid reader, I have had little time for blogging, since buying my kindle e-book reader. I even read Maths books on it. But more of that in future posts. \n I have also been busy compiling a Maths puzzle book. \n  \n There are many number puzzles that give lots of arithmetic practice (not SUDOKU). For example KAKURO. \n  \n My next post will outline how I have implemented this into my middle school classes. Stay tuned – “Webmaths” is back!!!!"], "link": "http://webmaths.wordpress.com/2011/08/08/ill-be-back/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://webmaths.wordpress.com/": 5}, "blogtitle": "Webmaths"}, {"content": ["Trying new methods in your classes is a great way to keep you and your students interested. My Google Reader now has over 100 great Math blogs. It is here that I often get inspiration to try new ideas. \n For example: Sue VanHattum at Math Mama Writes , posted on Dec 4, 2010 Math Game: Risk Your Beginning Algebra Skills . \n Here is my worksheet following the same method. My Year 10 students enjoyed the game format and when I surveyed the class, 90% wanted me to repeat the game later in the year. \n  \n The format has a number of advantages: \n 1. Students are motivated by the game format. \n 2. Champion or Most Improved (using multiplying factor) winning categories are seen as achievable by all or most students. \n 3. Students pay careful attention to solutions to see if their solution is correct and hence they can add on points. \n I introduced the rule that you must gamble a minimum of 5 points on each question. It soon became evident that some students were high risk players, others were very conservative. By question 5, one student lost all their points and begged to be allowed to borrow points from a friend! \n By question 9 excitement was building. Bruce was well in the lead, then forgot to collect like terms! His explosion had now bought other players into a winning position. Kate looked to be the likely winner until she factorized x 2 – 5x – 104 to equal (x + 13)(x – 8). Because of the impact these mistakes had, I don’t think these students are likely to make the same mistakes again. \n And so finally Matt was declared champion and Angus most improved! \n Thanks Sue for a great lesson idea!"], "link": "http://webmaths.wordpress.com/2011/03/02/risk-your-algebra-skills/", "bloglinks": {}, "links": {"http://feeds.wordpress.com/": 1, "http://mathmamawrites.blogspot.com/": 2, "http://webmaths.wordpress.com/": 3}, "blogtitle": "Webmaths"}, {"content": ["My Year 7 students enjoyed Alphabox Shapes on Friday. Some even declared it was fun! It combined together Language, Visualisation and ICT. \n The students all accessed the great Aussie Maths website: A Maths Dictionary for Kids by Jenny Eather. \n They had no trouble navigating their way around the site and loved clicking the interactive buttons for each topic. \n  \n I will certainly be using this format again for other themes later in the year."], "link": "http://webmaths.wordpress.com/2011/02/27/alphabox/", "bloglinks": {}, "links": {"http://www.amathsdictionaryforkids.com/": 1, "http://feeds.wordpress.com/": 1, "http://webmaths.wordpress.com/": 3}, "blogtitle": "Webmaths"}]