[{"blogurl": "http://wildaboutmath.com\n", "blogroll": [], "title": "Wild About Math!"}, {"content": ["The MAA recently published a book, Mathematics Galore!, of creative classroom activities by James Tanton. These activities are great explorations for high school and motivated middle school students to work through alone, or for group work in Math Circles. I got a review copy of the book and instantly fell in love with it. I've been a fan of James' for some time, and I've plugged his work a number of times . \n When \"Mathematics Galore\" was published I used the event as an opportunity to congratulate James and as an excuse to interview James for my \"Inspired by Math\" podcast series . \n If you've been as enthralled as I've been by James' Youtube videos, or as impressed as I've been with his textbooks, you'll enjoy listening to this interview and getting to know James a little bit more personally. \n \n \n About James Tanton \n Believing that mathematics really is accessible to all, James Tanton (PhD, Mathematics, Princeton 1994) is committed to sharing the delight and the beauty of the subject. In 2004 James founded the St. Mark’s Institute of Mathematics, an outreach program promoting joyful and effective mathematics education. He worked as a full-time high school teacher at St. Mark’s School in Southborough MA,(2004-2012) and he conducted, and continues to conduct, mathematics graduate courses for teachers through Northeastern University and American University. He also gives professional development workshops across the nation and Canada. \n James recently relocated to Washington D.C. and is currently a visiting scholar of the Mathematical Association of America. He also conducts the professional development program for Math For America program in D.C. \n James is the author of SOLVE THIS: MATH ACTIVITIES FOR STUDENTS AND CLUBS (MAA, 2001), THE ENCYCLOPEDIA OF MATHEMATICS (Facts on File, 2005), MATHEMATICS GALORE! (MAA, 2012) and twelve self-published texts. He is the 2005 recipient of the Beckenbach Book Prize, the 2006 recipient of the Kidder Faculty Prize at St. Mark’s School, and a 2010 recipient of a Raytheon Math Hero Award for excellence in school teaching. \n He also publishes research and expository articles, and through his extracurricular research classes for students has helped high school students pursue research projects and also publish their results. \n James Tanton's Coordinates \n Web-site: jamestanton.com \nYoutube channel: http://www.youtube.com/user/drjamestanton \nFacebook page: http://www.facebook.com/tanton.math \nTwitter feed: https://twitter.com/jamestanton \n About \"Mathematics Galore\" \n  \n Mathematics Galore! showcases some of the best activities and student outcomes of the St. Mark's Institute of Mathematics and invites you to engage in the mathematics yourself! Revel in the delight of deep intellectual play and marvel at the heights to which young scholars can rise. See some great mathematics explained and proved via natural and accessible means. \n Based on 26 essays (\"newsletters\") and eight additional pieces, Mathematics Galore! offers a large sample of mathematical tidbits and treasures, each immediately enticing, and each a gateway to layers of surprising depth and conundrum. Pick and read essays in no particular order and enjoy the mathematical stories that unfold. Be inspired for your courses, your math clubs and your math circles, or simply enjoy for yourself the bounty of research questions and intriguing puzzlers that lie within."], "link": "http://wildaboutmath.com/2012/09/23/james-tanton-inspired-by-math-11/", "bloglinks": {}, "links": {"https://twitter.com/": 1, "http://www.maa.org/": 1, "http://wildaboutmath.com/": 4, "http://www.youtube.com/": 1, "http://www.jamestanton.com/": 1, "http://www.facebook.com/": 1}, "blogtitle": "Wild About Math!"}, {"content": ["My good friends, Scott and Jen, at Imagine Education have produced an educational film, The Biggest Story Problem . I had the opportunity recently to attend a private screening of the film. The documentary does an outstanding job of identifying a number of the issues that make the American math education system seriously challenged. Many of these were new to me. More importantly, this is not a \"doom and gloom\" film. Scott and Jen offer hope for our future and not in some abstract or hypothetical way. Scott has spent years as a classroom teacher. He's engaged students in amazing ways, through exciting and sophisticated role playing games. He and Jen have taken the powerful idea of role playing to develop Ko's Journey, a rite-of-passage math education game. (I interviewed the two for my podcast series.) These two are really onto something. \n Check out this trailer for \"The Biggest Story Problem.\" \n \n If you feel as inspired as I do please contribute to the goal of getting a copy of the film into every public middle school in the U.S. Be part of spreading this important message. You can sponsor a school here . \n  \n You might also enjoy this Youtube video preview of Ko's Journey."], "link": "http://wildaboutmath.com/2012/09/03/help-get-this-film-into-every-public-middle-school/", "bloglinks": {}, "links": {"http://imagineeducation.org/": 1, "https://www.thebiggeststoryproblem.com/": 2, "http://wildaboutmath.com/": 2}, "blogtitle": "Wild About Math!"}, {"content": ["Note: The first minute or so of the audio is choppy but it's fine after that. \n About Dora Musielak \n \n Dr. Dora Musielak is a research professor, the recipient of two NASA research fellowships, and teaches science and mathematics for engineers and scientists. She is member of the American Institute of Aeronautics and Astronautics (AIAA), the Association of Women in Science (AWIS), and the Association for Women in Mathematics,(AWM). \n In addition to her research, Dr. Musielak is an enthusiastic promoter of the history of women in mathematics and gives talks to inspire young women. Musielak is also the author of Kuxan Suum: Path to the Center of the Universe, an unusual popular science book combining topics from astrophysics and astronautics. She is currently studying the history of mathematics, focusing on the 17th and 18th centuries. \n About Sophie's Diary \n Sophie’s Diary: A Mathematical Novel is a work of fiction inspired by French mathematician Sophie Germain. It chronicles the coming of age of a teenager learning mathematics on her own, growing up during the most turbulent years of the French Revolution. The fictionalized diary uses mathematics, intertwined with historically-accurate accounts of the social chaos that reigned in Paris between 1789 and 1794, to describe the learning journey of a remarkable girl that became the first and only woman in history to make a substantial contribution to the proof of Fermat’s Last Theorem. \n Sophie Germain was born in Paris in 1776. Little is known about her childhood or about her initiation into mathematics. Her first biographers wrote that, as a young woman, she assumed the name of a male student at the École Polytechnique to submit her own work to Lagrange. Yet, no biography has explained how Germain studied mathematics before that time to encourage such boldness. Sophie’s Diary is an attempt to put in perspective how a self-taught girl could have acquired the knowledge to enter the world of Lagrange’s analysis."], "link": "http://wildaboutmath.com/2012/08/19/dora-musielak-inspired-by-math-10/", "bloglinks": {}, "links": {"http://www.maa.org/": 1, "https://sites.google.com/": 1}, "blogtitle": "Wild About Math!"}, {"content": ["About the Flatland Movies \n The official website for Flatland the Movie is here . \n The Sphereland site is here . \n The facebook coordinates are here and their twitter link is here . \n About Seth Caplan - Producer \n Seth Caplan is an award winning filmmaker who has produced an acclaimed collection of feature films, animated movies, and documentary programs. He was awarded the John Cassavetes Independent Spirit Award for his film \"IN SEARCH OF A MIDNIGHT KISS\" which was released in over 100 theaters in the United States and over 20 countries internationally. Seth co-wrote and produced \"FLATLAND: The Movie\", an animated film starring the voices of Martin Sheen, Kristen Bell, and Michael York that has already been seen by over 1 million students around the world and has been licensed by the U.S. State Department and Ministries of Education in numerous countries including The Netherlands, South Korea, and Argentina. \n His movies have been featured at film festivals around the world including: The Tribeca Film Festival, SXSW, The Edinburgh Film Festival, Chicago International Film Festival, AFI Fest, Raindance, Woodstock, Istandbul, Bangkok, Krakow, Sarajevo, New Zealand and many more. In addition, his films have been televised on the Sundance Channel, IFC, PBS, Starz and NBC/Universal Sports Network. \n Seth has served on the jury for the Austin Film Festival and for the Piaget Independent Producer of the Year award. He holds degrees from the University of Texas at Austin and an M.F.A. from the American Film Institute where he was awarded a student Emmy and Academy Award nomination for his thesis film \"Duncan Removed\". \n About Dano Johnson - Writer/Director \n Dano began his career at the SESAME WORKSHOP in New York City. While there he worked in the creative development department to produce new children's educational series. He then set out to create his own educational videos such as \"Captain Can Takes on Garbage\" and \"Zowzoo and Friends\" that can be found in schools, libraries, and WIC centers across the country. \n Dano has won Telly and Emmy awards for his animated political and educational web videos. In addition, he has directed and animated comedic videos for the New York Dolls, Ray Wylie Hubbard, Hayes Carll, and economist Charlie Wheelan. His work has won awards at the Austin Film Festival, SXSW Film Festival, the Bradford Animation Festival, and the Berlin MathFilm Festival. \n Dano Johnson's proudest achievement is co-writing, directing, and animating \"FLATLAND: The Movie\", an educational adaptation of the classic novel starring Martin Sheen, Kristen Bell, and Michael York. \"Flatland: The Movie\" is now in schools around the world inspiring children about math and science."], "link": "http://wildaboutmath.com/2012/08/07/seth-caplan-dano-johnson-inspired-by-math-9/", "bloglinks": {}, "links": {"http://www.flatlandthemovie.com/": 1, "https://twitter.com/": 1, "http://www.spherelandthemovie.com/": 1, "http://wildaboutmath.com/": 2, "http://www.facebook.com/": 1}, "blogtitle": "Wild About Math!"}, {"content": ["About Vickie Kearn : (From The Princeton University Press Blog .) \"You and math – one of the greatest love/hate relationships of all time. What is it about the subject that excites us yet sends a chilling tingle down our spine at the same time? How can it be so precise, yet so fickle? We may never know the answers to these questions, but we do know that math is ubiquitous, though some of us may try to hide from it. \n We also know that there are those who thrive off the subject, who can’t get enough of it. PUP Executive Editor Vickie Kearn is one of those people. After all, since 2001, her job here at the Press has been acquiring the best titles in mathematics – and even before she came to PUP, she spent her whole life surrounded by numbers and equations. While math may sometimes cause us to cry tears of despair, it has caused Vickie to cry tears of joy. Her love of math started as a natural childhood talent, became a pleasantly surprising college benefit, and eventually grew into a career – one that she has dedicated to making the pursuit of mathematical knowledge easier and more enjoyable. \n As part of our continuing series of Q&As with our Science and Reference Editors for Princeton Global Science, we found out more about Vickie’s publishing and math background. Read her truly illuminating answers below: More .\""], "link": "http://wildaboutmath.com/2012/06/03/vickie-kearn-inspired-by-math-8/", "bloglinks": {}, "links": {"http://press.princeton.edu/blog": 2}, "blogtitle": "Wild About Math!"}, {"content": ["Here's the second part of my interview with Scott and Jen from Imagine Education . \n Watch this video first, and listen to Part 1 ."], "link": "http://wildaboutmath.com/2012/04/22/scott-laidlaw-and-jen-harris-inspired-by-math-7-part-2-of-2/", "bloglinks": {}, "links": {"http://wildaboutmath.com/": 1, "http://www.imagineeducation.org/": 1}, "blogtitle": "Wild About Math!"}, {"content": ["A mutual friend introduced me some months ago to Jen Harris and Scott Laidlaw. Jen and Scott founded Imagine Education to produce and market an amazing Math Game, Ko's Journey . I rarely promote commercial ventures but I sincerely believe in the work that these two are doing. If you think that Sal Khan is changing the world of Math education, then hopefully you'll agree that what Jen and Scott are doing is 100 times more important. Their interactive learning environment engages students in an experience of mathematics through the magic of storytelling and through the primal identification with the rite of passage experience woven into the plot of this very rich experience. \n Ko's Journey has the amazing power to change a student's relationship to Math. Not many can claim that or deliver on that bold promise. \n I could write for a long time about the importance of the work of Imagine Education but you're better off having your own sense of this powerful game. So, I invite you to watch this video. \n \n After you've watched the video, listen to Part 1 of the podcast. \n\n About Scott Laidlaw : Scott Laidlaw has a doctorate in education and brings a broad background in teaching, research, game design, and product development to his role CEO and Lead Game Designer for Imagine Education, and principal investigator for this project. An educator for 14 years at elementary, secondary and university levels, he has developed seven story-based, semester-long math games that were fully incorporated into school curriculum. He has done extensive research into human imagination and learning and as a graduate student, his meta-analysis examining the impact of study design in educational research won the Dean’s Citation for Outstanding Dissertations at the University of Northern Colorado. \n About Jen Harris : Imagine Education co-founder Jennifer Harris brings 18 years of diversified management experience in finance and operations, including 12 years with Fortune 500 companies.  Ms. Harris, who is a CPA and CMA, specializes in high tech software development companies and start-ups, structuring accounting systems, process design, and supporting the scalability of growth.  \n Ko's Journey was among the winners in the EdTech Digest 2012 awards program ."], "link": "http://wildaboutmath.com/2012/04/08/scott-laidlaw-and-jen-harris-inspired-by-math-7/", "bloglinks": {}, "links": {"http://edtechdigest.wordpress.com/": 1, "http://www.kosjourney.com/": 1, "http://www.imagineeducation.org/": 1}, "blogtitle": "Wild About Math!"}, {"content": ["Check it out!"], "link": "http://wildaboutmath.com/2012/04/05/carnival-of-math-85-packed-with-stuff/", "bloglinks": {}, "links": {"http://travels.aperiodical.com/": 1}, "blogtitle": "Wild About Math!"}, {"content": ["[Note: I created this podcast for one of my other blogs . It's not math-related but folks who are interested in the Web and in how intelligent agents can navigate the web might enjoy the audio. ] \n \n I produced this podcast because I was curious about intelligent web agents and noticed this new edition of Michael Schrenk's Webbots, Spiders, and Screen Scrapers . \n \n \n \n Why read Webbots, Spiders and Screen Scrapers? \n \n Gain a bottom-up understanding of what webbots are, how they're developed, and things to watch out for.\n \n Understand the mind set difference between traditional web development and webbot development\n \n Learn how to get ideas for great webbot projects\n \n Discover how PHP/CURL facilitates advanced file downloads, cookie management and more.\n \n Reenforce what you learn with projects and example scripts\n \n Learn how to leverage WebbotsSpidersScreenScraper_Libraries, the common set of libraries that the book uses to make writing webbots easy.\n \n Learn from the author's 11 year career of writing webbots and spiders.\n \n \n \n About the author \n Michael Schrenk has developed webbots for over 17 years, working just about everywhere from Silicon Valley to Moscow, for clients like the BBC, foreign governments, and many Fortune 500 companies. He's a frequent Defcon speaker and lives in Las Vegas, Nevada."], "link": "http://wildaboutmath.com/2012/04/02/michael-schrenk-on-webbots-spiders-and-screen-scrapers/", "bloglinks": {}, "links": {"http://federatedsearchblog.com/": 1, "http://webbotsspidersscreenscrapers.com/": 1}, "blogtitle": "Wild About Math!"}, {"content": ["In case you've never seen this classic Math movie, I think you'll enjoy this."], "link": "http://wildaboutmath.com/2012/03/23/1959-donald-duck-donald-in-mathmagic-land/", "bloglinks": {}, "links": {"http://wildaboutmath.com/": 1}, "blogtitle": "Wild About Math!"}]