[{"blogurl": "http://www.zcliu.org/blog\n", "blogroll": [], "title": "Zhicheng Liu"}, {"content": ["Recently some colleagues shared an interesting documentary video (embedded above, from 3:00 onwards) about how the Himba perceive colors, and how language plays an important role in shaping color perception. It seems intuitive to us that visual perception, especially pre-attentive processing, is hard-wired in the brain. That is, endowed with the same neurological machinery, every [...]"], "link": "http://www.zcliu.org/archives/color-perception-and-language", "bloglinks": {}, "links": {}, "blogtitle": "Zhicheng Liu"}, {"content": ["I always believed that the study of visualizations and the study of (natural) languages can mutually inform each other, so through examining the development of linguistic theory, we can learn something useful for pushing forward theoretical research on visualization.\n\nNoam Chomsky's Syntactic Structure is undoubtedly a classic piece of linguistic theory research. Continue reading..."], "link": "http://www.zcliu.org/archives/syntactic-structure", "bloglinks": {}, "links": {"http://www.zcliu.org/": 1, "http://en.wikipedia.org/": 1}, "blogtitle": "Zhicheng Liu"}, {"content": ["Supporting flexible network modeling for visual analysis of spreadsheets and databases."], "link": "http://www.zcliu.org/archives/ploceus", "bloglinks": {}, "links": {}, "blogtitle": "Zhicheng Liu"}, {"content": ["A core concept of activity theory is the irreducible triad called mediation. To understand mediation, it makes sense to focus on each consitutent part (human, visualization, goal) without losing track of a global view of the irreducible dynamics between them. To me, the concept of levels of activity is inherently about understanding human motivation, aka the [...]"], "link": "http://www.zcliu.org/archives/activity-theory-levels-of-activity", "bloglinks": {}, "links": {}, "blogtitle": "Zhicheng Liu"}, {"content": ["Activity theory, like distributed cognition, is another theoretical framework that is familiar to many of us, and has been used in HCI research. The more I read about activity theory, the more I feel it is addressing very similar issues as distributed cognition, but from a different perspective with different emphases. Distributed cognition has its [...]"], "link": "http://www.zcliu.org/archives/activity-theory-origin-and-evolution", "bloglinks": {}, "links": {}, "blogtitle": "Zhicheng Liu"}, {"content": ["Having been in a PhD program called “Human-Centered Computing” and working on visualization for more than 4 years now, I find myself keep stumbling across the question of what is human-centered design. Is it about understanding the users? Is it about designing simple, intuitive interfaces? Is it about empowering and supporting users’ needs? All these [...]"], "link": "http://www.zcliu.org/archives/the-paradox-of-human-centeredness", "bloglinks": {}, "links": {}, "blogtitle": "Zhicheng Liu"}, {"content": ["Q: All these terms, mental models, schemas, coordination, etc. they are pretty fuzzy and not definite. I believe that to understand how InfoVis works we must understand how the brain works. A: First, understanding a phenomenon often involves multiple levels of description and explanation (e.g. the famous AI researcher David Marr proposed three levels of [...]"], "link": "http://www.zcliu.org/archives/replies-to-a-fictitious-skeptic", "bloglinks": {}, "links": {}, "blogtitle": "Zhicheng Liu"}, {"content": ["I got an email inquiry asking why I chose to look at mental models instead of schemata in this year’s InfoVis paper. What are schemata? Like the term “mental model”, the meaning of “schema” as used to refer to people’s internal mental representation has also been ambiguous. To some people, mental model is just a [...]"], "link": "http://www.zcliu.org/archives/model-vs-schema", "bloglinks": {}, "links": {}, "blogtitle": "Zhicheng Liu"}, {"content": ["How can cognitive science inform InfoVis and what cognitive research work is relevant for InfoVis? Cognition is such a complex and multifaceted phenomenon that there are diverse approaches of studying it. Perhaps not every approach is relevant for InfoVis. Some, for example, look at the neurological basis of cognition, mapping different brain areas to different [...]"], "link": "http://www.zcliu.org/archives/cognitive-approaches-for-infovis", "bloglinks": {}, "links": {}, "blogtitle": "Zhicheng Liu"}, {"content": ["During this year’s VisWeek (truly great conferences, I must say), some friends expressed interests in my work on theoretical / cognitive approaches to InfoVis. They complained however that my papers were no easy read – which was a bit surprising to me. I’ve tried very hard to make the arguments understandable, and you would believe [...]"], "link": "http://www.zcliu.org/archives/475", "bloglinks": {}, "links": {}, "blogtitle": "Zhicheng Liu"}]